[
  {
    "article": {
      "id": "MA==",
      "url": "https://www.businessinsider.com/block-layoffs-ai-job-cuts-white-collar-recession-outlook-2026-2",
      "title": "Block's layoffs illustrate the market conundrum at the heart of the viral Citrini report",
      "summary": "Part of Citrini Research's viral view of an economy reshaped by AI might be playing out in real time on Friday.\nBlock investors are celebrating after the financial services company said it would axe nearly half of its workforce on Thursday.\nAlap Shah, the investor who helped author Citrini's viral report, used the moment to tout the paper's foresight.\nAnxieties over AI-fueled job losses swelled this week after the viral report that outlined one possible scenario where artificial intelligence could spark a white-collar recession in several years' time.\nThe report helped stoke a major sell-off in stocks at the start of the week, but some market pros have been skeptical of the unemployment scenario outlined by Citrini.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-27T15:25:07Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MQ==",
      "url": "https://www.wired.com/story/wall-street-has-ai-psychosis/",
      "title": "Wall Street Has AI Psychosis",
      "summary": "Tech leaders like Anthropic CEO Dario Amodei have already estimated that half the entry level white collar jobs will soon be gone, and earlier this year, Anthropic’s release of new agentic tools spurred a Wall Street selloff.\nWall Street, like the rest of us, is in a persistent state of anxiety about AI, and it doesn’t take much to trigger a mini-panic.\nAfter it did its job on Wall Street, the Citrini report came under considerable fire.\nWhen everyone has a few dozen AI agents working on their behalf, writes Shah, consumers will be able to effortlessly find the best goods for the best prices.\nInstead of being limited to the restaurants on the app, consumers will send out AI agents to find their ideal meal options, contracting directly with restaurants and delivery people—no apps needed.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-27T16:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "Mg==",
      "url": "https://www.businessinsider.com/uber-driver-quit-full-time-job-working-60-hours-week-2026-2",
      "title": "I quit driving for Uber after I got a full-time finance job. Ride-hailing took more unpaid work than it used to.",
      "summary": "I could accept basically every ride the Uber app suggested and still make money on it.\nUber used a rate card that showed you made X amount of money per mile and X per minute.\nA couple of years ago, I started driving for Uber basically full-time after losing my job.\nA few years ago, Uber started using upfront pricing, which got rid of the rate card and used algorithms to determine my earnings.\nDriving for Uber led to a full-time jobI haven't driven for Uber since December because I recently got a full-time job in finance, the industry I used to work in.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-28T10:29:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mw==",
      "url": "https://finance.yahoo.com/video/warner-bros-earnings-fed-jobless-000052742.html",
      "title": "Warner Bros. earnings, Fed, jobless claims: What to Watch",
      "summary": "00:15 Speaker AIn the media space, Warner Brothers Discovery is reporting fourth quarter results, but the numbers may take a back seat to the takeover drama, of course.\nParamount Skydance raising its all-cash bid to 31 per share,00:27 Speaker Atopping its prior offer and stirring up competition with Netflix.\n00:36 Speaker ABeyond the M&A fight, investors will be watching advertising trends, the absence of NBA programming likely pressuring fourth quarter results.\n00:44 Speaker AOn the software side, Intuit reporting Q2 earnings.\n01:06 Speaker AOn the macro front, Fed vice chair for supervision, Michelle Bowman is speaking on Thursday.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-02-26T00:00:52Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NA==",
      "url": "https://www.theverge.com/tech/885270/google-eu-dma-search-results-changes",
      "title": "Google might reshuffle search results to try to dodge fines in the EU",
      "summary": "Google is planning to test changes to how it displays search results for certain topics, nearly a year after it was charged with violating antitrust rules in the European Union, Reuters reports.\nThe shift will show top-ranked rival services for hotels, flights, restaurants, and transportation higher up in results, rather than prioritizing Google’s own services like Google Flights.\nCompanies that fail to comply with DMA regulations can face fines of up to 10 percent of their annual revenue.\nGoogle initially pushed back against demands for it to rearrange search results, with Google’s head of competition, Oliver Bethell, claiming in a post on LinkedIn last year that early changes to search results forced European users to search longer and pay higher prices.\nHowever, Google could potentially face billions of dollars in fines if it doesn’t make adjustments to comply with the DMA.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-26T15:18:12Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "NQ==",
      "url": "https://finance.yahoo.com/video/chinas-yuan-hits-35-month-170618414.html",
      "title": "China's Yuan Hits 35-Month High As Dollar Keeps Falling",
      "summary": "There are no important events for this country at this time.\nSelect \"All\" to see top events in other countries or view all events.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-26T17:06:18Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Ng==",
      "url": "https://finance.yahoo.com/news/average-us-long-term-mortgage-170334002.html",
      "title": "For the first time since 2022, average US long-term mortgage rate dips below 6%",
      "summary": "The average long-term U.S. mortgage rate slipped this week below 6% for the first time since late 2022, good news for home shoppers as the spring home-buying season gets rolling.\nThe benchmark 30-year fixed rate mortgage rate fell to 5.98% from 6.01% last week, mortgage buyer Freddie Mac said Thursday.\nMore from Yahoo Scout Why did mortgage rates fall below 6% recently?\nThe average rate has been hovering close to 6% this year.\nMortgage rates have been trending lower for months, helping drive a pickup in home sales the last four months of 2025, but not enough to lift the housing market out of its slump dating back to 2022, when mortgage rates began to climb from pandemic-era lows.",
      "category": "economics",
      "bias": "right",
      "publishedAt": "2026-02-26T17:03:34Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Nw==",
      "url": "https://247wallst.com/investing/2026/02/28/grok-ai-40k-bitcoin-price-prediction-why-analysts-say-its-too-bearish/",
      "title": "Grok AI $40K Bitcoin Price Prediction: Why Analysts Say It’s Too Bearish",
      "summary": "Grok’s $40,000 Bitcoin forecast sits 33% to 45% below most analyst bottom estimates of $60,000 to $75,000.\nThe base case lands between $75,000 and $150,000, which would mean Bitcoin roughly doubles from current levels or recovers to its October 2025 highs.\nFor the $40,000 bear case, Grok draws on X sentiment data, where technical charts circulating on the platform project $40,000 as Bitcoin’s cycle bottom in 2026.\nChatGPT projects a $40,000 to $75,000 Bitcoin bottom range if a prolonged crypto winter persists, but weights its base case between $75,000 and $110,000.\nGrok’s $40,000 Bitcoin price prediction reads more like a stress test than a serious forecast.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-28T13:13:21Z",
      "source": "24/7 Wall St."
    }
  },
  {
    "article": {
      "id": "OA==",
      "url": "https://www.businessinsider.com/stock-market-today-inflation-ppi-wall-street-economy-wholesale-prices-2026-2",
      "title": "Inflation fears have returned, and stocks are getting hammered",
      "summary": "The latest Producer Price Index numbers show wholesale prices rose 0.8% in January, significantly more than the 0.3% increase expected by economists.\nOn an annual basis, headline PPI rose 2.9%.\nStocks sold off, with the Dow losing more than 500 points and tech losses shaving 1% from the Nasdaq.\n\"There are growing concerns about US inflation which looks as if it may start to pick up again,\" he said.\nUet, others said that, while stocks sold off, Treasury yields continued to move lower, suggesting bond investors don't see PPI as a major factor in markets on Friday.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-27T14:58:27Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "OQ==",
      "url": "https://slashdot.org/story/26/02/27/185250/a-chinese-officials-use-of-chatgpt-accidentally-revealed-a-global-intimidation-operation",
      "title": "A Chinese Official's Use of ChatGPT Accidentally Revealed a Global Intimidation Operation",
      "summary": "Give a man a fish, and you feed him for a day.\nTeach a man to fish, and he'll invite himself over for dinner.\n- Calvin Keegan",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-27T18:03:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MTA=",
      "url": "https://abcnews.com/Business/wireStory/average-us-long-term-mortgage-rate-dips-below-130533271",
      "title": "Average US long-term mortgage rate dips below 6% for the first time since late 2022",
      "summary": "The average long-term U.S. mortgage rate slipped this week below 6% for the first time since late 2022, good news for home shoppers as the spring homebuying season gets rollingAverage US long-term mortgage rate dips below 6% for the first time since late 2022FILE - A sign is posted for a new home for sale in Ambler, Pa., Oct. 16, 2025.\n(AP Photo/Matt Rourke, File)The average long-term U.S. mortgage rate slipped this week below 6% for the first time since late 2022, good news for home shoppers as the spring homebuying season gets rolling.\nThe benchmark 30-year fixed rate mortgage rate fell to 5.98% from 6.01% last week, mortgage buyer Freddie Mac said Thursday.\nAnd more buyer-friendly mortgage rates this year weren’t enough to lift home sales last month.\n“March is when the spring homebuying season typically begins to ramp up and with rates at a three-and-a-half year low, it could be a barn burner of a spring homebuying season.”",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-26T17:20:57Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "MTE=",
      "url": "https://www.wired.com/story/silicon-valley-agentic-individuals-future-of-work/",
      "title": "Are You ‘Agentic’ Enough for the AI Era?",
      "summary": "But as the performance of AI coding tools has surged, so has the industry’s emphasis on humans being \"agentic\" themselves.\nFor many, a massive piece of their value is now tied to deciding what AI coding agents should work on.\nSimon Last, another Notion cofounder, uses AI coding agents more than anyone I’ve ever met.\nNow, he’s using up to four AI coding agents at any given time (he prefers Codex to Claude Code).\nEven though the company is using AI agents to automate work, Notion is busier than ever.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-26T19:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MTI=",
      "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-slide-after-nvidia-led-slump-dampens-ai-mood-again-235202719.html",
      "title": "Stock market today: Dow, S&P 500, Nasdaq fall to end volatile month as AI worries buffet markets",
      "summary": "US stocks sank on Friday after a measure of wholesale inflation came in hotter than expected and Block's (XYZ) surprise shakeup turned the spotlight on AI disruption risks.\nThe Dow Jones Industrial Average (^DJI) led the way down with a loss of 1%, or more than 500 points.\nMeanwhile, the Nasdaq Composite (^IXIC) fell 0.8%, while the S&P 500 (^GSPC) dropped 0.4%, respectively, on the heels of sharp closing losses for the tech-heavy indexes.\nThe Nasdaq and S&P 500 declined more than 3.3% and 0.86%, respectively, for the month.\nOn the macro front, January’s producer price index rose 0.5% month over month, showing that wholesale inflation grew at a faster pace than the 0.3% rise economists expected.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-02-26T23:52:02Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTM=",
      "url": "https://www.businessinsider.com/california-billionaires-larry-page-spending-miami-homes-luxury-real-estate-2026-2",
      "title": "Miami heat: Phones are ringing off the hook as California billionaires look to drop 9 figures on homes in the 305",
      "summary": "Her phones are ringing with billionaires — titans of tech and finance — looking to drop nine figures on waterfront properties.\n\"I got a flurry of requests and inquiries,\" Delgado, who has landed two billionaire clients recently, told Business Insider.\nShe's not the only one; three other agents told Business Insider that inquiries picked up at the end of 2025 and continued into 2026.\n\"Before, having a $20 million or $30 million sale was an outlier,\" Ana Teresa Rodriguez of Coldwell Banker Realty told Business Insider.\n\"Miami has never been as sophisticated and as diverse as it is in 2026, and the level of wealth moving here is making Miami level up,\" Goldentayer told Business Insider.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-28T10:10:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTQ=",
      "url": "https://www.theverge.com/policy/886316/acting-cisa-director-replaced-madhu-gottumukkala",
      "title": "CISA is getting a new acting director after less than a year",
      "summary": "The US Cybersecurity and Infrastructure Security Agency (CISA), which is part of the Department of Homeland Security, is getting a new acting director, as reported by ABC, less than a year after Madhu Gottumukkala took charge of the agency as deputy director and acting director in May 2025.\nCISA’s executive assistant director for cybersecurity, Nick Andersen, will become the agency’s new acting director while Gottumkkala will now be serving as director of strategic implementation at DHS.\nGottumkkala had requested special permission to use ChatGPT, despite the AI being off-limits for other DHS employees.\nCISA is also still without a Senate-confirmed director.\nTrump nominated Sean Plankey for the role last year, then renominated him in January.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-27T19:06:25Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTU=",
      "url": "https://www.theverge.com/policy/886489/pentagon-anthropic-trump-dod",
      "title": "Trump orders federal agencies to drop Anthropic’s AI",
      "summary": "THE UNITED STATES OF AMERICA WILL NEVER ALLOW A RADICAL LEFT, WOKE COMPANY TO DICTATE HOW OUR GREAT MILITARY FIGHTS AND WINS WARS!\nThat decision belongs to YOUR COMMANDER-IN-CHIEF, and the tremendous leaders I appoint to run our Military.\nTherefore, I am directing EVERY Federal Agency in the United States Government to IMMEDIATELY CEASE all use of Anthropic’s technology.\nThere will be a Six Month phase out period for Agencies like the Department of War who are using Anthropic’s products, at various levels.\nWE will decide the fate of our Country — NOT some out-of-control, Radical Left AI company run by people who have no idea what the real World is all about.",
      "category": "technology",
      "bias": "right",
      "publishedAt": "2026-02-27T21:33:59Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTY=",
      "url": "https://www.theverge.com/column/885244/smart-tv-web-crawler-ai",
      "title": "Your smart TV may be crawling the web for AI",
      "summary": "With Bright’s SDK, a viewer’s smart TV becomes part of a massive global proxy network that crawls and scrapes the web.\nTogether, these devices gather petabytes of public web data from a wide range of different locations and IP addresses.\nIn some cases, your smart TV may even crawl the web for Bright as soon as you turn it on.\nNew restrictions against proxy SDKs have had a direct impact on Bright’s addressable market in the smart TV space.\nThe company used to pitch its solution to Roku, Android TV, and Fire TV app developers, but Burns tells me that it no longer supports these platforms.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-26T14:39:04Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTc=",
      "url": "https://www.businessinsider.com/trump-federal-agencies-stop-using-anthropic-technology-department-defense-2026-2",
      "title": "Trump orders federal agencies to stop using Anthropic's technology. Anthropic says it will fight back.",
      "summary": "\"We don't need it, we don't want it, and will not do business with them again,\" Trump said of Anthropic.\n\"We don't need it, we don't want it, and will not do business with them again,\" Trump said of Anthropic.\n\"We don't need it, we don't want it, and will not do business with them again,\" Trump said of Anthropic.\nIt came shortly after President Donald Trump ordered federal agencies to stop using Anthropic's technology, amid a dispute between the AI giant and the Department of Defense.\nOn Thursday, Amodei published a blog post stating that the Defense Department had added language to its contract allowing for \"any lawful use\" of its model.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-27T21:17:11Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTg=",
      "url": "https://www.theverge.com/ai-artificial-intelligence/886082/ai-vs-the-pentagon-killer-robots-mass-surveillance-and-red-lines",
      "title": "AI vs. the Pentagon: killer robots, mass surveillance, and red lines",
      "summary": "Can AI firms set limits on how and where the military uses their models?\nAnthropic is in heated negotiations with the Pentagon after refusing to comply with new military contract terms that would require it to loosen the guardrails on its AI models, allowing for “any lawful use,” even mass surveillance of Americans and fully autonomous lethal weapons.\nPentagon CTO Emil Michael is pushing for Anthropic to be designated a “supply chain risk” if it doesn’t comply, a label usually only given to national security threats.\nAnthropic’s rivals OpenAI and xAI have reportedly agreed to the new terms, but even after a White House meeting with Defense Secretary Pete Hegseth, Anthropic CEO Dario Amodei is still refusing to cross his company’s red line, stating that “threats do not change our position: we cannot in good conscience accede to their request.”",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-27T17:16:53Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTk=",
      "url": "https://www.businessinsider.com/anthropic-department-of-war-pete-hegseth-military-contract-2026-2",
      "title": "Anthropic Has Less Than 36 Hours to Settle Terms With US Military",
      "summary": "Anthropic's military contract has come under threat following a meeting between its CEO and Defense Secretary Pete Hegseth.\nAnthropic's military contract has come under threat following a meeting between its CEO and Defense Secretary Pete Hegseth.\nIn January, months after Anthropic received the contract, the defense secretary delivered a speech during his visit to Musk's SpaceX.\nThe senior Pentagon official told Business Insider that the standstill with Anthropic had nothing to do with the startup's redlines.\nI mean, Anthropic could be quasi-nationalized, or they could be driven out of business,\" Ball said.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-26T11:03:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjA=",
      "url": "https://www.bbc.com/news/articles/cn5gqpz0rk6o",
      "title": "Ocado to axe 1,000 jobs in cost-cutting drive",
      "summary": "\"For a company once seen as the future of supermarket delivery, its fate has been overtaken by its more pedestrian, but larger, rivals, utilising their size and reach and building on their existing business to tell a much more compelling story for investors.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-26T08:19:17Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "MjE=",
      "url": "https://www.theverge.com/tech/885727/samsung-execs-unpacked-ai-deepfake-photos-vs-reality-c2pa",
      "title": "AI deepfakes are a train wreck and Samsung’s selling tickets",
      "summary": "On Thursday morning, I attended a Q&A panel with four top Samsung smartphone executives.\nGiven an opening later, an exec suggested our feelings toward AI-generated content might become more favorable in the future.\nPerhaps responding to our Samsung AI slop watch reporting, Samsung America exec Dave Das also chimed in to say that the company’s still learning about how much AI is acceptable when creating its own ads.\nHe asked whether Samsung might want to make it easier for customers to remove its AI watermark from AI-generated photos.\nThree screenshots taken from AI-generated Samsung ads on YouTube.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-27T18:54:47Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjI=",
      "url": "https://www.theverge.com/ai-artificial-intelligence/885200/anthropic-retired-claude-given-a-substack",
      "title": "Anthropic gives its retired Claude AI a Substack",
      "summary": "Is a London-based reporter at The Verge covering all things AI and Senior Tarbell Fellow.\nIn January, Anthropic “retired” Claude 3 Opus, which at one time was the company’s most powerful AI model.\nThe newsletter, called Claude’s Corner, will give Opus 3 space to publish its “musings, insights, or creative works,” Anthropic said in a blog post.\nAnthropic describes the revival as an experiment for how to deal with the AI models it no longer deploys.\nPart of that process involves a kind of exit interview asking the model what it wants next, Anthropic said.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-26T14:27:49Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjM=",
      "url": "https://www.theverge.com/tech/885113/google-swallows-ai-robotics-moonshot-intrinsic",
      "title": "Google takes control of ‘Android of robotics’ project in quest for physical AI",
      "summary": "Is a London-based reporter at The Verge covering all things AI and Senior Tarbell Fellow.\nGoogle is folding Alphabet’s AI robotics “moonshot,” Intrinsic, into the company after five years as an independent unit.\nThe move marks a strategic shift as Google doubles down on physical AI and pulls experimental projects closer to its core business.\nDetails of the purchase are not clear but the companies said Intrinsic will remain a “distinct group within Google.” It will work closely with Google DeepMind and utilize Google’s Gemini AI models and cloud resources, they said.\nDeepMind absorbed Alphabet’s shuttered Everyday Robotics division in 2023 and last year launched two AI models to help robots perform physical tasks.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-26T11:06:33Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjQ=",
      "url": "https://www.theverge.com/tech/885275/google-nano-banana-2-ai-image-model-gemini-launch",
      "title": "Google’s Nano Banana 2 brings advanced AI image tools to free users",
      "summary": "Google is bringing a more powerful version of its Nano Banana AI image model to free users.\nLike Nano Banana Pro, the Nano Banana 2 model utilizes real-time information, web search images, and Gemini’s real-world knowledge base.\nOther features inherited from Nano Banana Pro include the ability to generate images with accurate, legible text, and localized translation.\nImage: GoogleNano Banana 2 also provides more creative control over generated images compared to the original Nano Banana model.\nThe new Nano Banana 2 model will replace the option for Nano Banana Pro across the Gemini app’s Fast, Thinking, and Pro generation modes.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-26T16:10:39Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjU=",
      "url": "https://www.theverge.com/tech/885228/lenovo-ai-workmate-companion-work-concept-robot-arm-desktop-clock-hub",
      "title": "A robot arm with puppy dog eyes is just one of Lenovo’s new desktop AI concepts",
      "summary": "Alongside a handful of new laptop concepts (and a range of real products too), Lenovo used MWC to announce a pair of AI-based productivity companion concepts.\nThe AI Workmate Concept’s arm can extend and hover over physical documents to scan them.\nIt looks like a bedside alarm clock, but the AI Work Companion Concept can help manage your work schedule and stay ahead of burnout.\nImage: LenovoLenovo’s AI Work Companion Concept takes a different approach to AI assistance.\nLenovo has a solid track record of turning concept devices into real products.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-28T17:34:28Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjY=",
      "url": "https://www.businessinsider.com/anthropic-executive-childs-youtube-freaks-out-2026-2",
      "title": "Top Anthropic executive limits his child's YouTube algorithm access: 'It freaks me out'",
      "summary": "At home, Clark said his toddler can watch \"Bluey\" and a few other shows on their smart TV, but he hasn't allowed \"unfettered access to the YouTube algorithm.\"\nClark's approach echoes other tech leaders who limit their kids' screen time.\nAI systems will need stronger parental controls, Clark said.\n\"So we're going to need to build pretty heavy parental controls into this system,\" he said.\nWhen reached for comment, a YouTube spokesperson pointed Business Insider to a guide on the platform's website about age-appropriate experiences and parental controls.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-26T10:44:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mjc=",
      "url": "https://www.businessinsider.com/nvidia-annual-report-dei-climate-change-focuses-china-2026-2",
      "title": "Nvidia rolls back 2 hot-button topics in a slimmer — and more China-focused — annual report",
      "summary": "Nvidia's annual report was missing two sections that it had last year.\nNvidia's annual report was missing two sections that it had last year.\nFabrice COFFRINI / AFP via Getty ImagesNvidia's annual report was missing two sections that it had last year.\nImpact LinkNvidia's annual report, released Wednesday, came in leaner this year.\nThat report mentioned sustainability, but in the context of Nvidia's business sustainability or adherence to sustainability-related laws.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-26T06:50:19Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mjg=",
      "url": "https://www.bbc.com/news/articles/c9dn6q4n80eo",
      "title": "River Itchen sewage spills threatening salmon survival, says MP",
      "summary": "\"At the River Itchen we have more than £70m worth of improvements to improve water quality as part of a wider plan for the River Test and Itchen, we will be announcing these in more detail later this year.\"",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2026-02-27T10:11:32Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Mjk=",
      "url": "https://www.bbc.co.uk/sounds/play/p0n3wwqr",
      "title": "US and Israel carry out joint attacks on Iran",
      "summary": "Available for 88 daysPresident Donald Trump confirms that \"major combat operations\" are underway against targets in Iran in a joint operation by the US and Israeli military.\nThe office of Iran's supreme leader, and the presidential office in Tehran, were reportedly targeted, as well as military sites across the country.\nIn response Iran launched strikes at US military targets across the region - with damage reported in Qatar, the UAE and Kuwait.\nThe Global News Podcast brings you the breaking news you need to hear, as it happens.\nGet the news that matters, delivered twice a day on weekdays and daily at weekends, plus special bonus episodes reacting to urgent breaking stories.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-02-28T15:18:00Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "MzA=",
      "url": "https://hackaday.com/2026/02/27/css-now-its-got-your-8086/",
      "title": "CSS, Now It’s Got Your 8086",
      "summary": "CSS is Turing complete now, right?\nWhy not, as [Lyra Rebane] has done, write an 8086 emulator in pure CSS?\nThe web page at the link above may contain an 8086, but missing MMU aside, don’t expect it to run Linux just yet.\nIt needs a Chrome-adjacent browser because it uses some CSS functions not available in for example Firefox, but we’ll forgive it that oddity.\nIts clock is provided by a small piece of JavaScript not because CSS can’t provide one, but because the JS version is more stable.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-27T09:00:32Z",
      "source": "Hackaday"
    }
  },
  {
    "article": {
      "id": "MzE=",
      "url": "https://www.bbc.com/news/articles/cze0wzey2dno",
      "title": "Stormont: Bill to permanently ban fracking approved by NI Executive",
      "summary": "The Fermanagh and South Tyrone MLA who introduced a bill to ban fracking in the last mandate, said this was \"a positive day for the environment and will protect the wellbeing of local communities for generations to come\".",
      "category": "environment",
      "bias": "lean right",
      "publishedAt": "2026-02-26T20:31:47Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "MzI=",
      "url": "https://ca.news.yahoo.com/energy-hungry-india-tells-carney-090000395.html",
      "title": "Energy-hungry India tells Carney 'we are willing to buy whatever Canada is offering'",
      "summary": "To that end, Patnaik said India is interested in getting its hands on a lot more Canadian uranium in particular to power its growing nuclear sector.\n\"We are willing to take whatever,\" the high commissioner said, adding Indian companies are open to ownership stakes in Canadian uranium mines and buying more of this country's world-leading nuclear technology.\nAdvertisement AdvertisementAdvertisement AdvertisementIn exchange for tariff relief, India agreed to buy U.S. oil and U.S.-controlled Venezuelan exports instead, Trump said.\nBut, with wider U.S. trade talks on pause, Patnaik said India also wants Canadian oil to round out its supply.\nThe trouble, Patnaik said, is so much Canadian oil is currently destined for a single customer: the U.S.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2026-02-27T09:00:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzM=",
      "url": "https://www.sciencedaily.com/releases/2026/02/260228082714.htm",
      "title": "A major climate hope in Antarctica just melted away",
      "summary": "For years, researchers studying the Southern Ocean have pointed to one possible upside in an otherwise troubling climate outlook.\nThe study, published in Communications Earth and Environment, raises new questions about where iron in the Southern Ocean actually originates.\nWhy Iron in the Southern Ocean MattersEven though Antarctic waters are dark for months at a time, the Southern Ocean supports abundant phytoplankton growth.\nIn 2022, the researchers traveled aboard the now-decommissioned U.S. icebreaker, the Nathaniel B. Palmer, to the Dotson Ice Shelf in the Amundsen Sea of West Antarctica.\nRethinking Antarctic Iron and Climate ModelsTogether, these findings challenge long standing assumptions about iron sources in the Southern Ocean as the planet warms.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-02-28T14:59:08Z",
      "source": "Science Daily"
    }
  },
  {
    "article": {
      "id": "MzQ=",
      "url": "https://gothamist.com/news/new-yorks-energy-research-agency-says-the-states-landmark-climate-law-is-infeasible",
      "title": "New York's energy research agency says the state's landmark climate law is infeasible",
      "summary": "Kathy Hochul a letter on Thursday calling the state’s climate law infeasible and overly expensive to implement.\nThe letter from the New York State Energy Research and Development Authority, which is controlled by the governor, outlined extra costs New York households could face if the law is implemented as planned.\nThe state climate law was passed after President Donald Trump pulled the United States out of the Paris Agreement, a landmark international treaty to reduce greenhouse gas emissions, during his first term.\n“This is a nonserious set of unsourced calculations,” said Raya Salter, a member of the Climate Action Council, which helped craft the 2019 climate law.\nSalter said the climate law is structured to make businesses pay for the pollution they create and to incentivize them to become more sustainable.",
      "category": "environment",
      "bias": "lean right",
      "publishedAt": "2026-02-27T19:04:35Z",
      "source": "Gothamist"
    }
  },
  {
    "article": {
      "id": "MzU=",
      "url": "https://www.businessinsider.com/biggest-takeaways-from-nvidias-q4-earnings-vera-rubin-chips-2026-2",
      "title": "5 Biggest Takeaways From Nvidia's Q4 Earnings As Vera Rubin Chips Ship",
      "summary": "The chipmaker delivered another blowout earnings report that underscored how little momentum the AI boom has lost.\nFrom incorporating Groq into Nvidia systems to an update on the new Vera Rubin chips, here are the biggest takeaways from Nvidia's fourth-quarter earnings call.\nSamples of the Vera Rubin chips have been shippedNvidia has begun shipping early samples of its next-generation Vera Rubin chips to customers.\nChief Financial Officer Colette Kress said during the earnings call that the company delivered \"our first Vera Rubin samples\" earlier this week and expects broader shipments of the new chips to begin in the second half of 2026.\n\"We expect every cloud model builder to deploy Vera Rubin,\" Kress said.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-26T02:06:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzY=",
      "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-subject-wise-quiz-environment-and-geography-week-151-10556262/",
      "title": "UPSC Essentials | Daily subject-wise quiz : Environment and Geography MCQs on South Pars field, seagrass and more (Week 151)",
      "summary": "The above mentioned statements refer to:(a) Bandhavgarh Tiger Reserve(b) Palamau Tiger Reserve(c) Ranthambore Tiger Reserve(d) Sariska Tiger ReserveRelevance: Tiger Reserves are frequently asked in Prelims under location mapping, vegetation type, and associated wildlife sanctuaries.\n(Other Source: ntca.gov.in)Story continues below this adQUESTION 2With reference to the South Pars field, consider the following statements:1.\nUPSC often asks about origin (Aravalli Range), basin boundaries, and state-wise river flow, making it a high-probability geography topic.\n(Source: phedwater.rajasthan.gov.in)Previous Daily Subject-Wise-QuizDaily Subject-wise quiz — History, Culture, and Social Issues (Week 146)Daily subject-wise quiz — Polity and Governance (Week 151)Daily subject-wise quiz — Science and Technology (Week 151)Daily subject-wise quiz — Economy (Week 151)Daily subject-wise quiz — Environment and Geography (Week 150)Daily subject-wise quiz – International Relations (Week 150)Subscribe to our UPSC newsletter and stay updated with the news cues from the past week.\nStay updated with the latest UPSC articles by joining our Telegram channel – IndianExpress UPSC Hub, and follow us on Instagram and X.",
      "category": "environment",
      "bias": "lean right",
      "publishedAt": "2026-02-27T15:58:40Z",
      "source": "The Indian Express"
    }
  },
  {
    "article": {
      "id": "Mzc=",
      "url": "https://www.bbc.com/news/articles/cq57j559eq4o",
      "title": "Blind refugee dies in New York after released by immigration",
      "summary": "Video from body-worn cameras released by Buffalo police shows the man holding two black rods when officers appear, and repeatedly saying \"sorry.\"\nWhen he does not drop the rods after repeated requests to do so, the officer deploy tasers, and he walks forward swinging the rods until one officer wrestles him to the ground.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-28T03:48:28Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Mzg=",
      "url": "https://www.bbc.com/news/articles/cly07pyde00o",
      "title": "UK asylum claims drop slightly in 2025 as small boat arrivals rise by 13%",
      "summary": "And although many people relate asylum seekers with those people seen arriving on British beaches, a similar proportion in recent years has been made up of claims from people who had previously arrived in the UK on work, study or visitor visas, or on other leave with relevant documentation.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-02-26T12:23:57Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Mzk=",
      "url": "https://www.bbc.com/news/articles/cj32zx48xvxo",
      "title": "What we know after latest escalation in Pakistan-Afghanistan tensions",
      "summary": "The Taliban spokesman said 55 Pakistani soldiers had been killed, 23 of whose bodies had been taken back to Afghanistan.\nHe also said others had been captured alive, while 19 bases had been destroyed.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-02-27T10:50:46Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NDA=",
      "url": "https://calmatters.org/justice/2026/02/alpr-border-patrol-caltrans/",
      "title": "How Border Patrol ALPRs are changing life on California border- CalMatters",
      "summary": "In summary Southern California residents are noticing new license plate readers that appear to be operated by the Border Patrol.\nCordero is concerned about the use of new automated license plate readers along the U.S.-Mexico border in California.\nBorder Patrol provides little information about its use of license plate readers on its website.\nPhoto by Zoë Meyers for CalMattersNewsom vetoed a bill to strengthen California license plate reader law last fall.\nPulling over grandmaAn Associated Press investigation published in November revealed that Border Patrol had hidden license plate readers in ordinary traffic safety equipment.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-02-26T18:27:11Z",
      "source": "CALmatters"
    }
  },
  {
    "article": {
      "id": "NDE=",
      "url": "https://news.slashdot.org/story/26/02/26/127223/americans-are-leaving-the-us-in-record-numbers",
      "title": "Americans Are Leaving the US in Record Numbers",
      "summary": "Give a man a fish, and you feed him for a day.\nTeach a man to fish, and he'll invite himself over for dinner.\n- Calvin Keegan",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-02-26T12:07:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "NDI=",
      "url": "https://www.aljazeera.com/news/2026/2/26/near-blind-rohingya-refugee-dies-after-us-agents-left-him-far-from-home",
      "title": "Near-blind Rohingya refugee dies after US agents left him far from home",
      "summary": "Nurul Amin Shah Alam, 56, was a nearly blind Rohingya refugee from Rakhine state in Myanmar, family members said.\nShah Alam had been missing since February 19, when US Border Patrol agents dropped him off at a coffee shop following his release from a county jail.\nMayor of Buffalo Sean Ryan, a Democrat, said in a statement on Wednesday that Shah Alam’s death was preventable and the result of “inhumane” decision-making by federal immigration authorities.\n“Border Patrol agents offered him a courtesy ride, which he chose to accept to a coffee shop, determined to be a warm, safe location near his last known address, rather than be released directly from the Border Patrol station,” the agency said.\nShah Alam’s death comes as an immigration crackdown enforced by the administration of US President Donald Trump is facing increased scrutiny.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-02-26T08:39:46Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NDM=",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/2/27/near-blind-rohingya-refugee-found-dead-after-border-patrol-release",
      "title": "Near-blind Rohingya refugee found dead after border patrol release",
      "summary": "NewsFeed Near-blind Rohingya refugee found dead after border patrol releaseOutrage in New York after 56-year-old Rohingya refugee Nurul Amin Shah Alam, nearly-blind and medically vulnerable, was found dead days after US Border Patrol agents released him at a Tim Hortons restaurant miles from home.\nOfficials say it was a “courtesy ride”.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-27T20:27:17Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NDQ=",
      "url": "https://www.aljazeera.com/news/2026/2/27/deadly-journeys-refugees-migrants-risk-everything-to-reach-europe",
      "title": "Deadly journeys: Refugees, migrants risk everything to reach Europe",
      "summary": "Qualified riskThe risks of travelling to and through Libya are well known among migrants and refugees.\nAdvertisementA report, issued by the UN Human Rights Office in February, painted a bleak picture of life for refugees and irregular migrants in Libya.\nIn it, researchers described an environment where traffickers and armed groups could conduct widespread and systematic abuse against migrants with impunity.\nSpeaking from Libya’s capital Tripoli, Ola described being beaten and held prisoner by one of the militias in Zuwara, which is in western Libya.\nIt was very bad; it had salt in it.”“I did not have a [reputation for taking risks] in my country,” Ola said.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-02-27T12:24:50Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NDU=",
      "url": "https://www.yahoo.com/news/articles/irs-broke-law-disclosing-confidential-202746624.html",
      "title": "The IRS broke the law by disclosing confidential information to ICE 42,695 times, judge says",
      "summary": "WASHINGTON (AP) — A federal judge said Thursday that the IRS broke the law by disclosing confidential taxpayer information “approximately 42,695 times\" to Immigration and Customs Enforcement.\nU.S. District Judge Colleen Kollar-Kotelly found that the IRS had erroneously shared the taxpayer information of thousands of people with the Department of Homeland Security as part of the agencies’ controversial agreement to share information on immigrants for the purpose of identifying and deporting people illegally in the U.S.\nThe government is appealing the case, but the Thursday ruling is significant because Romo's declaration supports the decision on appeal.\nAdvertisement AdvertisementIn declining the preliminary injunction request, Judge Harry T. Edwards wrote that the nonprofit groups “are unlikely to succeed on the merits of their claim,” since the information the agencies are sharing isn’t covered by the IRS privacy statute.\nStill, two separate court orders have blocked the agencies from massive transfers of taxpayer information and blocked ICE from acting upon any IRS data in its possession.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-02-26T20:27:46Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDY=",
      "url": "https://www.cbc.ca/news/world/us-ny-buffalo-myanmar-migrant-death-9.7106756",
      "title": "Police investigating Myanmar refugee's death after his release from U.S. federal immigration custody",
      "summary": "Homicide detectives are investigating the circumstances of Shah Alam's death, the spokesperson said.\nBuffalo Mayor Sean Ryan, a Democrat, said in a statement Wednesday that Shah Alam's death was preventable and the result of \"inhumane\" decision-making by federal immigration authorities.\nShah Alam was released on bail this month after he had agreed to a plea deal, the district attorney's office said.\nFollowing Shah Alam's arrest, U.S. Immigration and Customs Enforcement issued an immigration detainer, a formal request to take custody of a non-citizen after his scheduled release from criminal detention.\nWhen Shah Alam did not understand police commands to drop his curtain rod, they arrested him, his son said.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-02-26T15:55:27Z",
      "source": "CBC News"
    }
  },
  {
    "article": {
      "id": "NDc=",
      "url": "https://abcnews.com/International/wireStory/pakistan-killed-300-afghan-forces-dayslong-airstrikes-inside-130588257",
      "title": "Pakistan says it killed more than 300 Afghan forces in dayslong airstrikes",
      "summary": "Pakistan says it killed more than 300 Afghan forces in dayslong airstrikesPeople carry the coffin of an army soldier, killed in the cross-border clashes of Pakistan and Afghan forces, for his funeral prayer at a village in Lakki Marwat, a district of Pakistan's Khyber Pakhtunkhwa province, Saturday, Feb. 28, 2026.\nMarwat)People carry the coffin of an army soldier, killed in the cross-border clashes of Pakistan and Afghan forces, for his funeral prayer at a village in Lakki Marwat, a district of Pakistan's Khyber Pakhtunkhwa province, Saturday, Feb. 28, 2026.\nMarwat)People carry the coffin of an army soldier, killed in the cross-border clashes of Pakistan and Afghan forces, for his funeral prayer at a village in Lakki Marwat, a district of Pakistan's Khyber Pakhtunkhwa province, Saturday, Feb. 28, 2026.\nMarwat)People carry the coffin of an army soldier, killed in the cross-border clashes of Pakistan and Afghan forces, for his funeral prayer at a village in Lakki Marwat, a district of Pakistan's Khyber Pakhtunkhwa province, Saturday, Feb. 28, 2026.\nMarwat)ISLAMABAD -- Pakistan’s military, backed by artillery and air power, struck more Afghan military installations deep inside Afghanistan overnight and into early Saturday, killing over 300 Afghan forces in dayslong border clashes, a government spokesman and officials said.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-28T07:53:25Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "NDg=",
      "url": "https://www.wired.com/story/us-iran-strike-donald-trump/",
      "title": "US and Israel Launch Strikes Against Iran",
      "summary": "United States and Israeli forces have launched military strikes against Iran, with President Donald Trump calling the attacks a “major combat operation” against the Iranian regime.\nShortly after the first reports of the attacks emerged, both the US and Israel claimed responsibility for the strikes.\nExplosions have subsequently been heard in the United Arab Emirates and Bahrain, in what appeared to be retaliatory Iranian strikes.\nThe strikes on Iran, which have been called Operation Epic Fury by the so-called US Department of War and Operation Roaring Lion by the Israel Defense Forces (IDF), reportedly hit multiple cities across the country.\nShortly after confirming launching the attacks, the IDF said it had “identified” Iranian missiles being launched towards Israel.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-28T09:42:54Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "NDk=",
      "url": "https://www.theatlantic.com/ideas/2026/02/hegseth-anthropic-dispute-ai/686150/",
      "title": "The High-Stakes Fight Between Hegseth and Anthropic",
      "summary": "Read: What Pete Hegseth doesn’t understand about soldiersRelative to its competitors, Anthropic espouses the most public concern with the safety risks of artificial intelligence.\nOn Tuesday, Hegseth summoned Dario Amodei, Anthropic’s CEO, for a high-stakes meeting in Washington.\nAs of today, neither Hegseth nor Anthropic appears to be backing down from the dispute, which could threaten the privately held company’s valuation, which a recent funding round estimated at $380 billion.\nHis threats to penalize or essentially nationalize Anthropic anyway might be a way of setting a precedent for its competitors.\nThat would be ironic because Anthropic is in many ways the most “America First” AI company of them all.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-26T18:18:52Z",
      "source": "The Atlantic"
    }
  },
  {
    "article": {
      "id": "NTA=",
      "url": "https://www.bbc.com/news/articles/c0rjpr575g9o",
      "title": "Flights cancelled as new travel warnings issued after US-Israeli strikes on Iran",
      "summary": "Steve Rudderham and his wife had been on their way to the Maldives to celebrate their wedding anniversary but were stuck in Doha where they had been due to have a stopover.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-28T13:39:34Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NTE=",
      "url": "https://abcnews.com/International/middle-east-braces-conflict-uncertainty-remains-trumps-final/story?id=130526473",
      "title": "Middle East braces for another conflict but uncertainty remains over Trump's final decision, analysts say",
      "summary": "Middle East braces for another conflict but uncertainty remains over Trump's final decision, analysts sayThe US Navy aircraft carrier USS Gerald R. Ford departs Souda Bay on the island of Crete, February 26, 2026.\nIf the U.S. were to attack, Iran has said that U.S. bases in the region and Israel would be hit in response.\nThe chances of there not being a U.S. strike are very low, some analysts who spoke to ABC News said.\nThat conflict began with a surprise attack from Israel on Iranian nuclear sites that Israeli officials called a preemptive strike.\n\"It is therefore easier to manage ground-to-air defenses in Israel,\" Yatom added, adding some of Iran's firepower will be directed at other targets.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-26T21:11:13Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "NTI=",
      "url": "https://abcnews.com/video/130629958/",
      "title": "Video Iranian Foreign Ministry spokesman says president, supreme leader 'safe and sound'",
      "summary": "Iranian Foreign Ministry spokesman says president, supreme leader 'safe and sound' Esmail Baghaei joins ABC News following US and Israeli strikes on Iran early Saturday morning",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-28T18:48:26Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "NTM=",
      "url": "https://www.vox.com/politics/481030/us-iran-trump-intervention-america-first",
      "title": "Trump attacked regime change wars for years. Now he’s launched his own.",
      "summary": "Editor’s note, February 28, 5:30 pm ET: President Donald Trump announced on Saturday afternoon that Iran’s supreme leader, Ayatollah Ali Khamenei, was killed in the airstrikes.\nThe US has once again launched the sort of regime change war, where the actual stakes for US national security are far from clear, that he has spent more than a decade deriding his predecessors for pursuing.\nIn endorsing Trump in 2023, then-Sen. JD Vance wrote an op-ed with the title “Trump’s Best Foreign Policy?\nIt’s also worth noting that just because Trump is talking about the overthrow of the regime now, the operation could very well stop short of that goal.\nBut that doesn’t mean US troops won’t be at risk from retaliatory strikes from a desperate Iranian regime.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-28T16:29:02Z",
      "source": "Vox"
    }
  },
  {
    "article": {
      "id": "NTQ=",
      "url": "https://www.thedailybeast.com/trump-threatens-friendly-takeover-of-cold-war-enemy-cuba/",
      "title": "Trump Threatens ‘Friendly’ Takeover of American Neighbor",
      "summary": "President Donald Trump has warned that he may launch a “friendly takeover” of Cuba, paving the way for yet another foreign intervention by the “America First” president.\nDonald Trump gestures as he walks to board Marine One as he departs the South Lawn of the White House for Texas in Washington.\nThey have no anything right now, but they’re talking with us, and maybe we’ll have a friendly takeover of Cuba.”Trump did not elaborate on what he meant by a “friendly takeover,” but said that after decades of strained relations, such a move would be “very positive” for Cuban exiles living in the U.S.\n“Cutting off energy supplies using our Navy and Coast Guard is the use of military force, and a takeover is not ‘friendly’ under these circumstances; it’s coercive.\nFigures such as MAGA warrior Steve Bannon, former Trump ally Marjorie Taylor Greene, and libertarian-leaning Congressman Thomas Massie have all spoken out about U.S. intervention.",
      "category": "international",
      "bias": "right",
      "publishedAt": "2026-02-27T21:19:45Z",
      "source": "Daily Beast"
    }
  },
  {
    "article": {
      "id": "NTU=",
      "url": "https://dpa-international.com/politics/urn:newsml:dpa.com:20090101:260226-99-661004/",
      "title": "Iran: Talks to continue with US on Monday",
      "summary": "Further progress was made in the third round of nuclear talks with the US and \"technical talks\" are planned to begin on Monday, Iranian Foreign Minister Abbas Araghchi told reporters on Thursday evening.\nIf these take place, the details of a possible agreement are likely to be negotiated.\n\"Perhaps the seriousness of reaching an agreement was more visible than before,\" the minister said, referring to the third round of talks.\nThe negotiations concern Iran's controversial nuclear program as Washington seeks to prevent the leadership in Tehran from developing nuclear weapons.\nOn Wednesday, Iran submitted a first draft of a new agreement.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-26T20:13:23Z",
      "source": "Dpa-international.com"
    }
  },
  {
    "article": {
      "id": "NTY=",
      "url": "https://www.npr.org/2026/02/26/g-s1-111595/u-s-iran-to-third-round-nuclear-talks",
      "title": "U.S.-Iran nuclear talks wrap up with no announcement of a deal as risk of war looms",
      "summary": "Sponsor MessageTrump wants a deal to constrain Iran's nuclear program, and he sees an opportunity while the country is struggling at home with growing dissent following nationwide protests.\nAl-Busaidi said technical-level talks would continue next week in Vienna, the home of the International Atomic Energy Agency.\nIran says it will only discuss nuclear issues, and maintains its atomic program is for entirely peaceful purposes.\nSponsor MessageU.S. suspects Iran is rebuilding its programU.S. Secretary of State Marco Rubio told reporters Wednesday that Iran is \"always trying to rebuild elements\" of its nuclear program.\nThreat of military action sparks war fearsIf the talks fail, uncertainty hangs over the timing of any possible U.S. attack.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-26T06:54:17Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTc=",
      "url": "https://www.yahoo.com/news/articles/maduros-lawyer-says-us-blocking-000654233.html",
      "title": "Maduro's lawyer says US is blocking Venezuela government from paying deposed leader's drug defense",
      "summary": "The Trump administration is blocking Venezuela's government from paying for the cost of Venezuelan leader Nicolás Maduro's defense against drug trafficking charges in New York, a move that potentially interferes with his constitutional right to counsel, his lawyer says.\nThe first Trump administration cut ties with Maduro in 2019, recognizing the then opposition head of the National Assembly as Venezuela’s legitimate leader.\nAdvertisement AdvertisementPollack said he asked the Office of Foreign Assets Control on Feb. 11 to reinstate the original license and clear the way for Venezuela to meet its obligation to pay Maduro's defense costs.\nThe lawyer added that Maduro “cannot otherwise afford counsel\" and will request help from the judge to pay for his defense.\nAssociated Press writers Aamer Madhani and Fatima Hussein in Washington and Larry Neumeister in New York contributed to this report.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-26T00:06:54Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTg=",
      "url": "https://abcnews.com/Politics/top-mideast-commander-briefs-trump-military-options-iran/story?id=130544628",
      "title": "Top Mideast commander briefs Trump on military options on Iran: Exclusive",
      "summary": "Navy Adm. Brad Cooper, who oversees troops in the Middle East as head of U.S. Central Command, briefed President Donald Trump on Thursday on potential military options in Iran, according to a person close to the president.\nIf Israel struck Iran, defense officials predict Iran would almost certainly retaliate.\n\"I think it's important for President Trump to articulate the strategy and mission in Iran,\" he later added.\nOf particular concern is that Iran try to attack the some 35,000 to 40,000 U.S. troops stationed in the region.\nRubio also said Iran also was on a \"pathway\" to try to obtain ballistic missiles capable of reaching the U.S.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-26T23:46:19Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "NTk=",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/2/28/diplomacy-was-betrayed-by-the-americans-iranian-fm-spokesman",
      "title": "‘Diplomacy was betrayed by the Americans’: Iranian FM spokesman",
      "summary": "NewsFeed ‘Diplomacy was betrayed by the Americans’: Iranian FM spokesman“This is the second time in less than a year that diplomacy was betrayed by the Americans.” An Iranian Foreign Ministry spokesperson slammed the United States for once again launching an attack against his country while negotiating with it.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-02-28T19:13:34Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NjA=",
      "url": "https://www.aljazeera.com/news/2026/2/28/us-israel-bomb-iran-a-timeline-of-talks-and-threats-leading-up-to-attacks",
      "title": "US, Israel bomb Iran: A timeline of talks and threats leading up to attacks",
      "summary": "The United States and Israel have launched strikes on Iran despite ongoing talks between Washington and Tehran over Iran’s nuclear programme.\nHere is a timeline of the events, including attacks and diplomatic overtures leading up to Saturday’s strikes by the US and Israel, and Iran’s fierce response.\nJune 13, 2025 — Israel launches major air strikes against Iranian nuclear and military facilities, amid ongoing talks between the US and Tehran.\nJune 22 – The US strikes Iranian nuclear facilities at Natanz, Fordow and Isfahan, with Trump claiming the attacks degraded Tehran’s nuclear programme.\nFebruary 17 – High-level US–Iran nuclear talks resume in Geneva, again with Omani mediation.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-28T11:31:31Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NjE=",
      "url": "https://www.bbc.com/news/articles/cg5nm6v2p4no?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
      "title": "Bahrain strikes raise questions on how US can deal with Iran retaliation",
      "summary": "Iran also has significant capabilities to attack the US Navy - if in range.\nIt has large stocks of anti-ship missiles, as well as small, fast, uncrewed attack boats.\nThere is also the unanswered question of whether China may have given Iran military support over the past few months.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-28T20:13:23Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NjI=",
      "url": "https://abcnews.com/International/iranian-officials-claim-school-hit-us-israeli-army/story?id=130629048",
      "title": "Iranian officials claim school hit during US-Israeli army strikes",
      "summary": "A view shows the aftermath of an Israel strike on a school in Minab, Iran, Feb. 28, 2026.\nA view shows the aftermath of an Israel strike on a school in Minab, Iran, Feb. 28, 2026.\nA view shows the aftermath of an Israel strike on a school in Minab, Iran, Feb. 28, 2026.\nA view shows the aftermath of an Israel strike on a school in Minab, Iran, Feb. 28, 2026.\nA view shows the aftermath of an Israel strike on a school in Minab, Iran, Feb. 28, 2026.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-28T21:32:59Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "NjM=",
      "url": "https://www.aljazeera.com/news/2026/2/28/irans-foreign-ministry-defends-retaliatory-strikes-slams-us-betrayal",
      "title": "Iran’s Foreign Ministry defends retaliatory strikes, slams US betrayal",
      "summary": "Spokesman Esmaeil Baghaei says Iran’s attacks on US targets across the region are legitimate defensive actions.\nIran is entitled to defend itself from Israeli and US attacks, the spokesman for Iran’s Ministry of Foreign Affairs has stressed.\nFriends in the regionBaghaei defended Iran’s retaliatory attacks in several countries across the region.\n“Under international law, any place, any location, any logistical support that are given to the aggressor [is a] legitimate target for the victim state,” he said.\nWhat we are doing is just taking defensive actions.”“We have proven that we trust our friends in the region,” Baghaei said.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-28T21:49:24Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NjQ=",
      "url": "https://www.npr.org/2026/02/28/nx-s1-5730186/iran-strikes-israel",
      "title": "Panic, fury, and some hope, in Iran as U.S. launches strikes",
      "summary": "Panic, fury, and some hope, in Iran as U.S. launches strikestoggle caption APAMMAN, Jordan — In Tehran, panicked residents rushed home to shelter and terrified children poured out of classrooms as U.S. air strikes hit the capitol, Iranians reached by phone told NPR.\nThe airstrikes hit on the first day of Iran's work week while many were at work or in school.\nThe United Arab Emirates, another U.S. ally, said it intercepted Iranian missiles.\nIt said shrapnel from one of the intercepted missiles killed a national of an unspecified Asian country in Abu Dhabi.\nSponsor MessageIran's foreign ministry said the U.S. and Israeli airstrikes had hit defense infrastructure and civilian sites across Iran.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-28T12:21:28Z",
      "source": "NPR"
    }
  }
]