[
  {
    "article": {
      "id": "MA==",
      "url": "https://www.businessinsider.com/inflation-december-cpi-consumer-price-index-federal-reserve-interest-rates-2026-1",
      "title": "Inflation in December Held Steady: CPI Increased 2.7%",
      "summary": "The year-over-year inflation rate was 2.7% in December, the same as the forecast and November's increase, and down from the 2.9% a year ago.\nThe Federal Reserve will be able to use these economic reports to make its interest rate decision.\nCME FedWatch indicated a 95% chance after the CPI report that the Fed would hold interest rates steady.\nJerome Powell's term as Federal Reserve Chair ends in May, and his term on the Board of Governors ends in 2028.\n\"I have served at the Federal Reserve under four administrations, Republicans and Democrats alike,\" Powell said in a video statement.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-13T13:33:48Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MQ==",
      "url": "https://finance.yahoo.com/news/billionaire-warren-buffett-said-were-210108567.html",
      "title": "Billionaire Warren Buffett Said If He Were A Handy Guy, He'd 'Short the Dollar' By Buying Distressed Homes With A 30-Year Mortgage And Rent Them Out",
      "summary": "Buffett was spelling out a playbook: use low-interest 30-year fixed-rate debt, buy income-producing assets, and let inflation work in your favor.\nThen came the line that summed it all up: \"It's a way, in effect, to short the dollar.\"\nBuffett was asked what advice he'd give to a young investor choosing between buying their first home or investing in stocks.\nThe distressed deals Buffett referenced are harder to find, and for most buyers, the \"cheap asset\" moment has long passed.\nBuffett wasn't urging people to flip houses.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-12T21:01:08Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mg==",
      "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-fall-as-markets-react-to-doj-investigation-into-powell-001621567.html",
      "title": "Stock market today: Dow, S&P 500 eke out records, gold soars after Trump amps up fight with Fed, Powell",
      "summary": "Other pockets of markets showed more effects from the Fed fight, with gold (GC=F) and silver (SI=F) surging to records as investors flocked to safer havens.\nRattled markets took in the drama as Powell said the Justice Department has subpoenaed the Fed, threatening criminal charges over his testimony on building renovations.\nIn a strongly worded statement, Powell said the action is an escalation of President Trump's campaign to pressure the Fed into cutting interest rates.\nIn corporates, bank and other financial services stocks slumped thanks to a warning to credit card issuers from Trump.\nLenders will be \"in violation of the law\" if they don't cap interest rates at 10%, he told reporters on Sunday.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-01-12T00:16:21Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mw==",
      "url": "https://finance.yahoo.com/news/godfather-ai-says-technology-create-184754671.html",
      "title": "‘Godfather of AI’ says the technology will create massive unemployment and send profits soaring — ‘that is the capitalist system’",
      "summary": "Pioneering computer scientist Geoffrey Hinton, whose work has earned him a Nobel Prize and the moniker “godfather of AI,” said artificial intelligence will spark a surge in unemployment and profits.\n“What’s actually going to happen is rich people are going to use AI to replace workers,” Hinton said in September.\n“It’s going to create massive unemployment and a huge rise in profits.\nHinton said earlier healthcare is the one industry that will be safe from the potential jobs armageddon.\nHinton has long warned about the dangers of AI without guardrails, estimating a 10% to 20% chance of the technology wiping out humans after the development of superintelligence.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-12T18:47:54Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NA==",
      "url": "https://slashdot.org/story/26/01/12/2324253/european-firms-hit-hiring-brakes-over-ai-and-slowing-growth",
      "title": "European Firms Hit Hiring Brakes Over AI and Slowing Growth",
      "summary": "The nicest thing about the Alto is that it doesn't run faster at night.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-13T02:10:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "NQ==",
      "url": "https://www.businessinsider.com/creator-economy-mergers-acquisition-buyers-publicis-talent-influencer-marketing-2026-1",
      "title": "Creator economy M&A is 'back, baby.' Here's where an advisor thinks the deal heat will be in 2026.",
      "summary": "Impact LinkIs the creator economy in the midst of a comeback era?\nAnother year of increased M&A deal volume is a signal that the sector is in good health, according to James Creech, who advises creator economy companies via his M&A advisory firm, Quartermast Advisors.\nPublicis Groupe , the French advertising giant, acquired influencer-marketing platform Captiv8 and Brazilian influencer-marketing company BR Media Group .\n, the French advertising giant, acquired influencer-marketing platform and Brazilian influencer-marketing company .\n\"That's a sign that the creator economy is entering a new age of maturity and growth,\" Creech said.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-12T16:01:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Ng==",
      "url": "https://www.yahoo.com/news/articles/irans-traders-frustrated-economic-losses-160902483.html",
      "title": "Iran's traders, frustrated by economic losses, turn against clerics",
      "summary": "They only think about their own benefits,\" said a trader at Tehran’s centuries-old Grand Bazaar, speaking ‌on condition of anonymity.\nIran’s rulers, while acknowledging economic difficulties, have blamed their longtime foes the U.S. and Israel for fomenting the unrest.\nAdvertisement AdvertisementAdvertisement AdvertisementA combination of international sanctions and the Guards' sprawling economic empire has limited the government's ability to ease the dire economic situation.\nAdvertisement AdvertisementAdvertisement AdvertisementThe Guards now control vast sectors of the economy, from oil to transportation, communications, and construction.\nAnother trader said the crisis was not over, as the Guards have long proved adept at defending their economic interests.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-12T16:13:11Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Nw==",
      "url": "https://www.mentalfloss.com/culture/jobs/best-cities-to-find-job-2026",
      "title": "Looking for a Job? These Cities Are Leading the Way in 2026",
      "summary": "MORE THAN A PAYCHECKWalletHubThere are two key drivers when it comes to uncovering the cities with the best job opportunities in 2026: market and socioeconomic factors.\nAccording to WalletHub, job market factors to consider when searching for your next best role include employment growth, average monthly salary, unemployment rates, job security, job satisfaction, and access to benefits and retirement options.\nColumbia, Maryland, quietly dominates with promising employment growth, affordable rent and housing, and exceptional job security.\nDown South, Orlando, Florida, is not just tourists and theme parks; it's a thriving job market paired with no state income tax, which is always a plus.\nThis metropolis reported robust job growth from 2024 to 2026 across multiple specialties and annual median wages that align with the rising cost of living.",
      "category": "economics",
      "bias": "right",
      "publishedAt": "2026-01-11T15:00:00Z",
      "source": "Mental Floss"
    }
  },
  {
    "article": {
      "id": "OA==",
      "url": "https://www.npr.org/2026/01/11/nx-s1-5674034/fed-powell-subpoena-doj-building-renovation",
      "title": "DOJ subpoenas the Federal Reserve in an escalating pressure campaign",
      "summary": "DOJ subpoenas the Federal Reserve in an escalating pressure campaigntoggle caption Andre Caballero-Reynolds/AFPThe Justice Department has subpoenaed the Federal Reserve for information on the central bank's headquarters renovation, according to a video statement released by Fed Chairman Jerome Powell on Sunday.\nIt's the latest escalation in the administration's pressure campaign to force the central bank to make bigger cuts in interest rates.\n\"This new threat is not about my testimony last June or about the renovation of the Federal Reserve buildings,\" Powell said.\n\"No one — certainly not the chair of the Federal Reserve — is above the law,\" Powell said.\nTrump, who wants much lower interest rates to goose the economy, has insisted he should have greater say in monetary policy.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-12T02:01:26Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "OQ==",
      "url": "https://www.yahoo.com/news/articles/400-000-payout-maduros-capture-141046047.html",
      "title": "A $400,000 payout after Maduro's capture is putting prediction markets in the spotlight",
      "summary": "Prediction markets let people wager on anything from a basketball game to the outcome of a presidential election — and recently, the downfall of former Venezuelan President Nicolás Maduro.\nHere's what we know:How prediction markets workThe scope of topics involved in prediction markets can range immensely — from escalation in geopolitical conflicts, to pop culture moments and even the fate of conspiracy theories.\nProponents of prediction markets argue putting money on the line leads to better forecasts.\nStill, it's never a “crystal ball,” he noted, and prediction markets can be wrong, too.\nLoose regulationBecause they’re positioned as selling event contracts, prediction markets are regulated by the CFTC.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-11T14:10:46Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTA=",
      "url": "https://abcnews.go.com/Business/inflation-expected-held-firm-posing-challenge-amid-doj/story?id=129127426",
      "title": "Inflation held firm in December, testing Fed amid DOJ probe into Powell",
      "summary": "To address pressure on both of its goals, the Fed primarily holds a single tool: interest rates.\nThe Fed cut interest rates at three consecutive meetings late last year in an effort to boost the flagging labor market.\nThe reduction of interest rates, however, risks spurring demand and hiking inflation.\nIn the event a central bank lacks independence, policymakers tend to favor lower interest rates as a means of boosting short-term economic activity, analysts previously told ABC News.\nStocks closed higher on Monday, shrugging off a dip earlier in the day after reports of the DOJ probe into Powell.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-01-13T13:44:52Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "MTE=",
      "url": "https://finance.yahoo.com/news/morning-bid-inflation-test-focuses-115830725.html",
      "title": "Morning Bid: Inflation test focuses Fed row",
      "summary": "Inflation and corporate earnings updates are coming down the pike on Tuesday.\nAnd listen to the latest ‌episode of the Morning Bid daily podcast.\nSubscribe to hear Reuters journalists discuss the biggest news in markets and finance seven days a week.\nBut ROI Finance Columnist Jamie McGeever asks how long Wall Street can keep looking the other way.\nInflation test focuses Fed rowA relatively modest market reaction to new threats on Federal Reserve independence this week owes much to the torrent ⁠of additional information hitting investors, with inflation and corporate earnings updates coming down the pike on Tuesday.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-13T11:58:30Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTI=",
      "url": "https://abcnews.go.com/Politics/doj-probe-powell-sparks-backlash-republicans-former-fed/story?id=129134680",
      "title": "Pirro defends investigation into Fed Chair Jerome Powell amid backlash",
      "summary": "Federal Reserve Chair Jerome Powell holds a press conference following a two-day meeting of the Federal Open Market Committee at the U.S. Federal Reserve in Washington, December 10, 2025.\nFederal Reserve Chair Jerome Powell holds a press conference following a two-day meeting of the Federal Open Market Committee at the U.S. Federal Reserve in Washington, December 10, 2025.\nFederal Reserve Chair Jerome Powell holds a press conference following a two-day meeting of the Federal Open Market Committee at the U.S. Federal Reserve in Washington, December 10, 2025.\nFederal Reserve Chair Jerome Powell holds a press conference following a two-day meeting of the Federal Open Market Committee at the U.S. Federal Reserve in Washington, December 10, 2025.\n\"After speaking with Chair Powell this morning, it's clear the administration’s investigation is nothing more than an attempt at coercion.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-12T19:15:13Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "MTM=",
      "url": "https://www.theverge.com/ai-artificial-intelligence/860989/apple-google-gemini-siri-ai-deal-what-it-means",
      "title": "What Apple and Google’s Gemini deal means for both companies",
      "summary": "For years, Apple and Google have had a will-they-won’t-they type of relationship, as far as which AI company Apple would pick to underpin its Siri virtual assistant and give it new AI-fueled personalization and agentic capabilities.\nApple has spent the last year or two playing the field, reportedly considering working with OpenAI or Anthropic to support the new Siri.\n“After careful evaluation, Apple determined that Google’s Al technology provides the most capable foundation for Apple Foundation Models and is excited about the innovative new experiences it will unlock for Apple users,” Google and Apple wrote in a joint statement.\nOn the surface, Apple and Google might appear to be rival tech giants, but the two companies have had a close, complex relationship for more than a decade.\nApple’s initial statement indicates that they will use Google’s technology as more of a white-labeled technology stack that they will customize and deploy as an Apple service.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-13T14:33:06Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTQ=",
      "url": "https://www.macrumors.com/2026/01/13/apple-patents-declined-in-2025/",
      "title": "Apple's Patent Grants Declined in 2025 as Innovation Slows",
      "summary": "Apple's U.S. patent activity declined sharply in 2025 amid a broader slowdown in patent filings, according to newly released data from IFI CLAIMS Patent Services.\nTotal U.S. patent grants in 2025 fell to 323,272, a decline of less than 1% from the previous year, while U.S. patent applications dropped more steeply, falling 9% to 393,344.\nApple's decline occurred as several competitors either held steady or increased their patent output.\nSamsung retained the top position for the fourth consecutive year with 7,054 U.S. patent grants, accounting for more than 2% of all patents issued in the United States in 2025.\nApple chip supplier Taiwan Semiconductor Manufacturing Company (TSMC) ranked second with 4,194 grants, followed by Qualcomm in third place with 3,749.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-13T10:00:00Z",
      "source": "MacRumors"
    }
  },
  {
    "article": {
      "id": "MTU=",
      "url": "https://www.theverge.com/podcast/861148/lego-smart-brick-claude-code-vergecast",
      "title": "How Lego’s Smart Brick works",
      "summary": "The most interesting story at this year’s CES was just a little tiny bundle of technology.\nOne way to look at Lego’s new Smart Brick is as something like a Raspberry Pi, an endlessly remixable gizmo with infinite hacking potential — it can be anything, in the best possible way.\nOn this episode of The Vergecast, The Verge’s Sean Hollister explains how the Smart Brick works and why this tiny square feels so complicated.\nHe explains why Lego might want to make the Smart Brick an open platform and all the reasons it might not to do so.\nIf you want to know more about everything we discuss in this episode, here are some links to get you started:",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-01-13T14:06:13Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTY=",
      "url": "https://www.theverge.com/news/860446/google-ai-shopping-standard-buy-button-gemini",
      "title": "Google brings buy buttons to Gemini and AI search",
      "summary": "In other words, it sets up a common language for agents — AI tools capable of acting independently — and online shopping systems.\nUCP is open-source, meaning companies can freely use it rather than having to develop their own tools to deal with AI agents.\nMany of these partners are likely to — or already — partner with other AI companies as well.\nShopify merchants, for example, can sell in AI modes on Gemini, ChatGPT, and Microsoft Copilot, and PayPal has also partnered with OpenAI.\nAs well as the buy button on Gemini and the UCP standard, Google also said it is launching a business agent on Monday that will allow shoppers to chat with brands directly on Search.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-12T12:44:24Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTc=",
      "url": "https://www.androidcentral.com/phones/google-pixel/apple-chooses-googles-gemini-to-transform-siri-starting-this-year",
      "title": "Apple partners with Google for Gemini: What this means for users",
      "summary": "What you need to knowApple and Google collaborate to integrate Gemini into Apple's next-gen devices for enhanced AI features.\nApple retains user privacy while leveraging Google’s AI technology for innovative advancements.\nAfter what is described as \"careful evaluation,\" Apple decided that \"Google's AI technology provides the most capable foundation, and is excited about the innovative new experiences it will unlock for Apple users.\"\nThat partnership gave Apple a fast way to catch up with GenAI; however, ChatGPT didn't become the foundation of Apple's devices.\nThings look different for Gemini as it now sits at the very core of Apple's AI strategy.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-12T17:22:38Z",
      "source": "Android Central"
    }
  },
  {
    "article": {
      "id": "MTg=",
      "url": "https://www.businessinsider.com/sandstone-raises-seed-funding-sequoia-legal-ai-2026-1",
      "title": "Ex-McKinsey Founder Wins Sequoia Funds for Legal AI Startup, Sandstone",
      "summary": "His startup, Sandstone, is aimed squarely at in-house legal teams instead of law firms, and Sequoia Capital is backing the idea.\nThe Brooklyn-based startup has raised $10 million in a seed funding round led by Sequoia Capital, Business Insider has learned.\nSandstone uses AI to help lawyers inside companies draft and review contracts based on how they've handled similar agreements in the past.\nHe landed on a team advising major law firms and worked closely with QuantumBlack, the firm's AI unit, including on a project with the American Arbitration Association to develop an \"AI arbitrator\" for construction disputes.\nHarvey got its start selling tools to elite law firms and has since expanded into large enterprises.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-13T10:00:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTk=",
      "url": "https://www.businessinsider.com/anthropic-chases-openai-ai-heath-claude-2026-1",
      "title": "Anthropic expands into healthcare a week after OpenAI launched a similar product",
      "summary": "The company on Sunday announced Claude for Healthcare, a product that allows healthcare providers, insurers, and consumers to use Claude for medical purposes through HIPAA-ready infrastructure.\nThe move also underscores intensifying competition in healthcare AI.\nOpenAI recently unveiled a rival product, and startups including Abridge and Sword Health have attracted multibillion-dollar valuations as investors pour money into AI tools for medicine.\nAnthropic said Claude for Healthcare is designed to reduce administrative work and help both clinicians and patients better understand medical information.\nAnthropic said data accessed through these integrations isn't stored in Claude's memory or used to train its models.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-11T22:00:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjA=",
      "url": "https://www.theverge.com/news/861080/microsoft-ai-data-center-infrastructure-electricity-rates",
      "title": "Microsoft scrambles to quell fury around its new AI data centers",
      "summary": "It looks like the wave of campaigns against data centers are getting under big tech companies’ skin — and Microsoft is the latest giant to promise to address frustrations on the ground in communities around their data centers.\nThe company is also promising more transparency around where it plans to build data centers and how much energy it’s using.\nMeta similarly reiterated a pledge in December to restore water sources in places where it has data centers.\nAmazon commissioned a study late last year that says the company’s data centers generate more in revenue for utilities than it costs for utilities to serve those facilities.\nIn a Truth Social post yesterday, he says his team has been “working with” Microsoft and other tech companies to make sure Americans don’t “pick up the tab” for data center power consumption.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-13T15:33:41Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjE=",
      "url": "https://thenextweb.com/news/ai-skills",
      "title": "AI Skills",
      "summary": "If models represent intelligence and agents represent coordination, Skills are where AI becomes operational and valuable in the real world.\nWhat they experience are Skills, because Skills are the part of AI that delivers outcomes.\nThe AI Stack: Where Skills FitTo understand why Skills matter, it helps to look at the modern AI stack.\nOne of the most important distinctions is that Skills encode procedural knowledge rather than descriptive knowledge.\nSkills Are Products, Not Just TechnologyAnother critical point is that Skills are products, not just technology.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-12T19:55:05Z",
      "source": "The Next Web"
    }
  },
  {
    "article": {
      "id": "MjI=",
      "url": "https://www.businessinsider.com/snowflake-ceo-explains-what-people-get-wrong-about-ai-2026-1",
      "title": "Snowflake's CEO says people often fall into 2 camps when it comes to AI — and both are wrong",
      "summary": "The CEO said that the other extreme includes those who believe AI will lead to a doomsday scenario.\n\"The biggest misconception would be that of thinking about AI as an all or nothing,\" Ramaswamy said.\nRamaswamy added that his advice to customers is to \"be very incremental\" with AI adoption.\n\"I want them to tell me which direction they are headed, but very much be in this mode of iterating, because this is a world of rapid change,\" Ramaswamy said.\n\"I worry a lot about making sure that we are state-of-the-art, especially in the critical areas with regards to how we utilize AI,\" Ramaswamy said.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-11T10:38:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjM=",
      "url": "https://www.bbc.com/news/articles/clyg63e3mq4o",
      "title": "Is this the year domestic robots come in our homes?",
      "summary": "Eggie, Neo, Isaac and Memo are domestic robots.\nBut now, thanks to AI, it's genuinely happening and this year the first truly multi-purpose domestic bots will start to enter homes.\nSo I went to meet Eggie, NEO, Isaac and Memo.\nIn Noe Valley in San Francisco, another domestic robot company has already deployed its stationary bot to gather real world data, albeit in the narrow task of folding laundry.\nThe last company we visited has a completely different angle on how to make the domestic robot a reality.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-01-12T00:07:23Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "MjQ=",
      "url": "https://www.businessinsider.com/mckinsey-consultant-ai-startup-founder-isaac-health-julius-bruch-2026-1",
      "title": "After 7 years at McKinsey, I left to build an AI healthtech startup. I had to unlearn the pursuit of perfection.",
      "summary": "Julius Bruch, a former McKinsey consultant, explains why he left to build an AI healthtech startup —and how consulting prepared him for the leap.\nJulius Bruch, a former McKinsey consultant, explains why he left to build an AI healthtech startup —and how consulting prepared him for the leap.\nJulius BruchJulius Bruch, a former McKinsey consultant, explains why he left to build an AI healthtech startup —and how consulting prepared him for the leap.\nJulius BruchThis as-told-to essay is based on a conversation with Julius Bruch, the 39-year-old cofounder and CEO of AI healthtech startup Isaac Health.\nHow consulting prepared me to be a startup founderConsulting was a fantastic training opportunity.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-01-12T00:00:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjU=",
      "url": "https://www.businessinsider.com/4-signals-to-watch-jpmorgan-goldman-sachs-report-earnings-2026-1",
      "title": "Here are 4 things to watch as big US banks report earnings",
      "summary": "As Wall Street's biggest banks prepare to report fourth-quarter earnings next week, competition is intensifying across nearly every part of the business — from dealmaking and talent to technology.\nJPMorgan Chase kicks things off Tuesday, followed by Bank of America and Citi reporting on Wednesday, and Goldman Sachs and Morgan Stanley on Thursday.\nInvestment banking advisory bonuses, he added, are tracking higher than he predicted, up as much as 20% from the year prior.\nAs earnings season gets underway, experts say there are four key things to watch.\nMayo pointed to Goldman Sachs 3.0 as one of the most interesting new data points this earnings season.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-12T10:15:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjY=",
      "url": "https://www.businessinsider.com/apple-google-gemini-to-power-siri-ai-capabilities-2026-1",
      "title": "Your Siri is about to be powered by Google's AI",
      "summary": "Lighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nImpact LinkSiri is about to get a little AI help from a twin.\nApple had a head start in the AI assistant race when it launched Siri on its iOS devices in 2011.\nApple has delayed several upgrades to Siri , and Apple shook up its AI division late last year.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-12T16:32:48Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mjc=",
      "url": "https://www.theverge.com/tech/860616/insta360-link-2-2c-pro-face-tracking-webcam",
      "title": "Insta360’s face-tracking webcams get bigger sensors and more expensive",
      "summary": "Insta360 has announced new Pro versions of its Link 2 and Link 2C webcams that first launched in September 2024.\nBoth webcams are now available worldwide through Insta360’s online store and Amazon, but are slightly more expensive than the $199 Link 2 and $149 Link 2C.\nVideo resolutions stay the same, however, with both the Link 2 Pro and Link 2C Pro maxing out at 4K/30fps, or up to 60fps at 1080p.\nThe Insta360 Link 2C Pro is smaller than the Link 2 Pro but doesn’t have a two-axis gimbal to physically move its camera while tracking.\nThe Stream Deck support will also be coming to the Link 2 and Link 2C webcams.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-13T03:13:10Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "Mjg=",
      "url": "https://www.yahoo.com/news/articles/california-wants-mix-hydrogen-gas-140733038.html",
      "title": "California wants to mix hydrogen with gas to cut climate pollution. Critics say that poses risks",
      "summary": "“I don't want to be anyone's experiment,\" said Figueroa, 60, a resident of Orange Cove in California's Central Valley.\nIt's part of a statewide effort to create safety rules for hydrogen blending.\nWhat is hydrogen blending?\n“I think the only reason they are wanting Orange Cove is because they don’t think there’s going to be pushback,” she said.\nOrange Cove resident Francisco Gonzalez has friends with asthma and siblings with respiratory issues, so he worries about the health risks.",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2026-01-12T14:07:33Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mjk=",
      "url": "https://www.slashgear.com/2071415/china-wind-farm-ecosystem-study/",
      "title": "China's Wind Farms Are Doing A Lot More Than Generating Electricity",
      "summary": "One significant change that's taking place is shifting how some energy is produced.\nIn October 2025, the BBC reported that an Ember study revealed renewable resources had overtaken coal as the planet's most significant source of electricity.\nChina was an enormous part of this push: The outlet notes that, during the first half of 2025, its growth in wind and solar energy outpaced every other country in the world combined.\nChina has previously found that its enormous solar farm was doing a lot more than just producing energy, and this has also proven to be the case for its expansive efforts in wind.\nA December 2025 study titled \"Offshore wind farms can enhance the structural composition and functional dynamics of coastal waters,\" concluded that the wind farms in Chinese waters are making a positive change to the biodiversity of the regions where they were installed.",
      "category": "environment",
      "bias": "lean right",
      "publishedAt": "2026-01-13T13:15:00Z",
      "source": "SlashGear"
    }
  },
  {
    "article": {
      "id": "MzA=",
      "url": "https://www.yahoo.com/news/articles/aerial-photos-reveal-chinas-carpet-001500762.html",
      "title": "Aerial photos reveal China's 'carpet-like' project blanketing vast desert: 'Sandy and mostly devoid of life'",
      "summary": "A massive solar panel array in China is expected to crack 7,000 megawatts of power generation in 2026, according to EnergiesMedia.\nThe Three Gorges Kubuqi Solar Park has been under construction since 2022, blanketing an Inner Mongolian desert in panels.\n\"Sandy and mostly devoid of life, the Kubuqi Desert in Inner Mongolia once had a reputation for being a 'sea of death.'\n\"The construction is part of China's multiyear plan to build a 'solar great wall' designed to generate enough energy to power Beijing.\"\nThe Three Gorges Kubuqi Solar Park, due to be completed in 2030, will be 250 miles long, three miles wide, and will be able to generate 100 gigawatts of clean energy.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2026-01-11T00:15:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzE=",
      "url": "https://www.yahoo.com/news/videos/hungarys-lake-balaton-freezes-first-113040341.html",
      "title": "Hungary's Lake Balaton freezes for the first time in years",
      "summary": "The best sales of the week: Shop major discounts from Amazon, Kate Spade Outlet and othersStart 2026 off right with super savings on big brands like Ugg, Michael Kors, Shark, Hoka and so much more up to 75% off.",
      "category": "environment",
      "bias": "lean right",
      "publishedAt": "2026-01-13T11:30:40Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzI=",
      "url": "https://www.businessinsider.com/microsoft-energy-prices-data-centers-ai-trump-water-2026-1",
      "title": "Microsoft explains how it plans to keep energy prices down for Americans from its data center buildout",
      "summary": "Lighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nMicrosoft's AI data centers need a lot of energy — and it doesn't want Americans to foot the bill.\nData centers are essential for powering AI models, but they have been increasingly putting a strain on US infrastructure.\nHe added that Microsoft would be \"first up,\" suggesting that announcements from other tech companies may follow.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-01-13T14:17:23Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzM=",
      "url": "https://www.wired.com/story/minnesota-sues-to-stop-ice-invasion/",
      "title": "Minnesota Sues to Stop ICE ‘Invasion’",
      "summary": "The 80-page complaint, filed in US district court in Minnesota, targets the US Department of Homeland Security and senior federal officials, including DHS secretary Kristi Noem.\nAt a press conference Monday afternoon, Minnesota attorney general Keith Ellison said the lawsuit is intended to stop what he described as an unlawful federal escalation.\nEllison said that the killing, along with subsequent federal rhetoric, left families and entire communities feeling unsafe in public spaces.\nShe was fatally shot by an ICE officer during a Minneapolis enforcement operation on January 7.\nPlaintiffs argue the federal operation violates the Tenth Amendment, federal administrative law, and long-standing limits on immigration enforcement.",
      "category": "immigration",
      "bias": "right",
      "publishedAt": "2026-01-12T22:42:45Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MzQ=",
      "url": "https://www.npr.org/2026/01/12/nx-s1-5675315/minnesota-sues-to-block-trump-immigration-crackdown",
      "title": "Minnesota officials sue to block Trump's immigration crackdown as enforcement intensifies",
      "summary": "Minnesota officials sue to block Trump's immigration crackdown as enforcement intensifiestoggle caption John Locher/APMINNEAPOLIS — State officials are suing the Trump administration over the widespread immigration operation taking place across the Minneapolis region.\nMore than 2,000 federal immigration agents are in Minnesota, and that number is expected to increase.\nSponsor MessageThose were some of the questions federal immigration agents asked Joel Keleekai as he was charging his Tesla in a parking lot.\nBut the Trump administration has appeared to have shifted its tactics and, in Minnesota, become even more aggressive with its immigration crackdown.\nIllinois and the city of Chicago also took legal action Monday against the Trump administration over its immigration enforcement actions.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-12T23:51:04Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "MzU=",
      "url": "https://www.yahoo.com/news/articles/opinion-immigration-policy-collides-schools-184542249.html",
      "title": "Opinion: When Immigration Policy Collides With Schools, Students and the Community Suffer",
      "summary": "The answer, according to new research, is that the fear is already everywhere — even in schools where no enforcement actions have occurred.\nThe results are staggering: 70% report that students from immigrant families are expressing fear about their safety and their families’ well-being.\nNearly two-thirds report students missing school due to immigration policies and rhetoric.\nMinneapolis just demonstrated what happens when immigration policy collides with the school day: canceled classes, traumatized students and staff, a community in crisis.\nWhat is America going to do to keep young people safe — and build schools into the communities of belonging that every student deserves?",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-01-12T18:45:42Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzY=",
      "url": "https://www.npr.org/2026/01/11/nx-s1-5666843/venezuelas-exiles-in-chile-caught-between-hope-and-uncertainty",
      "title": "Venezuela's exiles in Chile caught between hope and uncertainty",
      "summary": "Venezuela's exiles in Chile caught between hope and uncertaintytoggle caption JAVIER TORRES/AFP via Getty ImagesSANTIAGO, Chile — Early last Saturday morning, Chile's capital awoke to the sound of jubilant cheers echoing between the tower blocks.\nNews had filtered through from Caracas of the U.S. operation to seize President Nicolás Maduro, and Chile's sizable Venezuelan diaspora could barely contain its joy.\n\"When they report crimes on the news, they only say the nationality of the perpetrator if they're foreign, installing a negative perception around Venezuelan migration,\" said Montesinos.\nKast has mooted detention facilities, border walls and ditches to halt illegal migration; and aggressive policies to pursue, detain and deport illegal migrants.\nSponsor MessageBut while uncertainty remains for many, nostalgia for Venezuela has got many in the diaspora in Chile dreaming of a return home.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-11T11:00:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "Mzc=",
      "url": "https://abcnews.go.com/US/driver-shot-portland-immigration-operation-charged-assault-doj/story?id=129135791",
      "title": "Driver shot during Portland immigration operation charged with assault: DOJ",
      "summary": "A photo posted to X by Attorney General Pamela Bondi, Jan. 12, 2025, with a caption stating that it is a damaged Border Patrol vehicle.\nA photo posted to X by Attorney General Pamela Bondi, Jan. 12, 2025, with a caption stating that it is a damaged Border Patrol vehicle.\nA photo posted to X by Attorney General Pamela Bondi, Jan. 12, 2025, with a caption stating that it is a damaged Border Patrol vehicle.\nA photo posted to X by Attorney General Pamela Bondi, Jan. 12, 2025, with a caption stating that it is a damaged Border Patrol vehicle.\nA Border Patrol agent then fired their service weapon twice at the driver of the truck, according to statements from Border Patrol agents, the complaint said.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-12T18:51:08Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "Mzg=",
      "url": "https://www.yahoo.com/news/articles/know-warrants-most-immigration-agents-001021882.html",
      "title": "What to know about the warrants most immigration agents use to make arrests",
      "summary": "At the heart of the debate is a legal distinction largely unfamiliar to the public but central to immigration enforcement.\nHere is what to know about the limitations on the warrants that authorize most immigration related arrests.\nTypically, arrests carried out by Department of Homeland Security agencies are authorized by administrative warrants — sometimes known as immigration warrants — not judicial warrants.\nThat means people can legally refuse federal immigration agents entry into private property if the agents only have an administrative warrant.\nThe trainings also typically emphasize that an immigrant can refuse to open the door if law enforcement only has an administrative warrant.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-01-13T00:10:21Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mzk=",
      "url": "https://www.npr.org/2026/01/10/nx-s1-5673229/ice-protests-minneapolis-portland",
      "title": "Nationwide anti-ICE protests call for accountability after Renee Good's death",
      "summary": "Nationwide anti-ICE protests call for accountability after Renee Good's deathtoggle caption Spencer Platt/Getty ImagesPeople took to the streets in cities across the country this weekend to protest the Trump administration's immigration enforcement tactics following the death of Renee Good in Minneapolis, a 37-year-old woman who was shot and killed by a U.S. Immigration and Customs Enforcement (ICE) officer last week.\nSponsor MessagePeople demonstrated outside of hotels where ICE agents were believed to be staying.\nHomeland Security Secretary Kristi Noem on Sunday said the agency was sending \"hundreds more\" federal agents to Minneapolis Sunday and Monday to protect ICE agents.\nGood was killed the day after DHS launched a large-scale immigration enforcement operation in Minnesota set to deploy 2,000 immigration officers to the state.\nThere were no arrests during the protests, a spokesperson for the Metropolitan Police Department told NPR on Sunday.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-11T03:07:01Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDA=",
      "url": "https://www.bbc.com/news/articles/cly9n3r2p7zo",
      "title": "Hungary grants asylum to Polish ex-justice minister Zbigniew Ziobro",
      "summary": "Hungary grants asylum to Polish ex-justice minister2 days ago Share Save Adam Easton BBC News Warsaw correspondent Share SaveReuters Zbigniew Ziobro says he is a victim of political persecutionHungary has granted political asylum to Poland's former Justice Minister Zbigniew Ziobro who is facing charges of embezzlement.\nZiobro was justice minister between 2015 and 2023 under the previous right-wing PiS-led government, which is politically aligned to Hungarian Prime Minister Viktor Orban.\nWriting on X, Ziobro said: \"I have decided to accept the asylum granted to me by the government of Hungary due to the political persecution in Poland.\"\nI stand in opposition to a creeping dictatorship,\" Ziobro added, accusing Prime Minister Donald Tusk of waging a \"vendetta\" against him.\nZiobro is also accused of awarding Justice Fund grants to fire stations and women's associations without proper competition to bolster support for the government.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-12T13:57:56Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NDE=",
      "url": "https://www.yahoo.com/news/articles/minnesota-democrats-demanding-broader-investigation-171516735.html",
      "title": "Video captures Minneapolis immigration arrest in a city on edge after shooting of Renee Good",
      "summary": "In a dramatic scene similar to those playing out across Minneapolis, agents captured a man in the home just minutes after pepper spraying protesters outside who had confronted the heavily armed federal agents.\nVideo of the clash taken by The Associated Press showed some agents pushing back protesters while a distraught woman later emerged from the house with a document that federal agents presented to arrest the man.\nSigned by an immigration officer, the document — unlike a warrant signed by a judge — does not authorize forced entry into a private residence.\nA warrant signed by an immigration officer only authorizes arrest in a public area.\n“We’re seeing a lot of immigration enforcement across Minneapolis and across the state, federal agents just swarming around our neighborhoods,” said Jason Chavez, a Minneapolis city councilmember.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-01-11T17:15:16Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDI=",
      "url": "https://www.wired.com/story/what-to-do-if-ice-invades-your-neighborhood/",
      "title": "What to Do if ICE Invades Your Neighborhood",
      "summary": "If federal immigration agents are coming to your area—or have already arrived—you may be frantically making plans to lay low at home, or perhaps grabbing your whistle and lacing up your sneakers to join a neighborhood watch.\nOn Wednesday, a federal agent shot and killed 37-year-old Minneapolis resident and US citizen Renee Nicole Good in her car during an Immigration and Customs Enforcement (ICE) operation.\n\"There are now more ICE agents in Minnesota than there are combined in Minneapolis police force and St. Paul police force,” Minnesota Senator Amy Klobuchar said on Friday.\nNumerous sources told WIRED that their trainings and materials about interacting with federal immigration agents are actively evolving to reflect the current moment.\nBut this type of information, while still accurate, does not fully account for the chaotic intensity of current US immigration enforcement.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-01-13T10:30:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "NDM=",
      "url": "https://www.npr.org/sections/the-picture-show/2026/01/12/g-s1-105725/in-photos-a-week-of-protests-against-ice",
      "title": "In photos: A week of protests against ICE",
      "summary": "In photos: A week of protests against ICEtoggle caption Ben Hovland/MPRFollowing last week's fatal shooting of Renee Macklin Good, a 37-year-old woman in Minneapolis by an Immigration and Customs Enforcement officer, protests have continued to grow across the United States.\nNPR station photographers and freelance photographer Evan Frost have been on the ground over the past week documenting actions in Minneapolis, as well as Washington, D.C., Texas, Connecticut, and Massachusetts.\ntoggle caption Ben Hovland/MPRtoggle caption Evan Frost for NPRtoggle caption Evan Frost for NPRtoggle caption Tyrone Turner/WAMUtoggle caption Tyrone Turner/ WAMUtoggle caption Tyrone Turner/WAMUtoggle caption Ben Hovland/MPRtoggle caption Ben Hovland/MPRtoggle caption Mark Mirko/Connecticut Publictoggle caption Mark Mirko/Connecticut Publictoggle caption Mark Mirko/Connecticut Publictoggle caption Mark Mirko/Connecticut Publictoggle caption Lorianne Willett/KUT Newstoggle caption Lorianne Willett/KUT Newstoggle caption Lorianne Willett/KUT Newstoggle caption Robin Lubbock/WBURtoggle caption Evan Frost for NPR",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-12T23:45:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDQ=",
      "url": "https://abcnews.go.com/US/mamdani-outraged-after-new-york-city-council-employee/story?id=129149275",
      "title": "Mamdani 'outraged' after New York City Council employee detained by ICE",
      "summary": "New York City Mayor Zohran Mamdani speaks during a press conference at Grand Army Plaza in the Brooklyn borough of New York, on Jan. 2, 2026.\nNew York City Mayor Zohran Mamdani speaks during a press conference at Grand Army Plaza in the Brooklyn borough of New York, on Jan. 2, 2026.\nNew York City Mayor Zohran Mamdani speaks during a press conference at Grand Army Plaza in the Brooklyn borough of New York, on Jan. 2, 2026.\nNew York City Mayor Zohran Mamdani speaks during a press conference at Grand Army Plaza in the Brooklyn borough of New York, on Jan. 2, 2026.\nA New York City Council employee was detained during a \"routine\" immigration appointment on Long Island on Monday, according to city officials, who called the incident an \"egregious government overreach.\"",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-01-13T01:01:26Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NDU=",
      "url": "https://www.usatoday.com/story/news/nation/2026/01/13/michigan-ceo-resigns-minneapolis-anti-ice-protest/88155675007/",
      "title": "Michigan CEO resigns after remarks at Minneapolis anti-ICE protest",
      "summary": "ETA video circulating online shows a Michigan man shouting, “We executed one of you yesterday” at an anti-ICE protest in Minneapolis — the day after a mother of three was fatally shot in the head by an immigration agent in Minnesota.\nWe need the backup.”\"All you liberal, commie mother (expletive), keep your hands to yourself or you're going to get hurt today, alright?\nOn Jan. 10, Scott announced on LinkedIn that he had resigned as CEO and founder of Harmony Investment Group, a Troy-based private health care investment firm and search fund platform.\nThe footage of Scott’s remarks has drawn criticism online, with many users posting disapproval and negative comments on his social media accounts and LinkedIn.\nThe Detroit Free Press reached out to Scott, Harmony Investment Group and Scott’s former business partner for comment, but had not received responses as of publication.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-01-13T11:33:26Z",
      "source": "USA Today"
    }
  },
  {
    "article": {
      "id": "NDY=",
      "url": "https://abcnews.go.com/US/live-updates/minneapolis-ice-shooting-live-updates/?id=129124338",
      "title": "Minneapolis ICE shooting live updates: 'No basis' for civil rights probe, DOJ says",
      "summary": "Joe Thompson, first assistant to the U.S. attorney speaks at a press conference, December 18, 2025 in Minneapolis, Minnesota.\nJoe Thompson, first assistant to the U.S. attorney speaks at a press conference, December 18, 2025 in Minneapolis, Minnesota.\nJoe Thompson, first assistant to the U.S. attorney speaks at a press conference, December 18, 2025 in Minneapolis, Minnesota.\nJoe Thompson, first assistant to the U.S. attorney speaks at a press conference, December 18, 2025 in Minneapolis, Minnesota.\nProtesters in Minneapolis continue to hit the streets and demand justice as ICE continues its operations.",
      "category": "immigration",
      "bias": "lean right",
      "publishedAt": "2026-01-12T12:26:48Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NDc=",
      "url": "https://ca.news.yahoo.com/turkey-cautions-against-foreign-intervention-151432842.html",
      "title": "Turkey cautions against foreign intervention in Iran",
      "summary": "ANKARA, Jan 12 (Reuters) - Turkey said on Monday that any foreign intervention in neighbouring Iran would lead to greater crises in the country ​and the region, and it called for U.S. and Iranian negotiations ‌to resolve existing problems.\nIran is facing its biggest demonstrations since 2022 and U.S. President Donald Trump has ‌threatened to get involved if force is used against protesters.\nNATO member Turkey does not wish to see chaos in Iran despite \"certain problems within Iranian society and government\", Omer Celik, spokesperson for Turkey's ruling AK Party, said.\n\"We believe that foreign intervention will lead to even worse consequences, and that intervention provoked by Israel in particular will lead to even greater crises.\"\nTrump and Turkish President Tayyip Erdogan have close personal ties.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-12T15:24:18Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDg=",
      "url": "https://www.yahoo.com/news/articles/iranian-mp-warns-greater-unrest-094734513.html",
      "title": "Trump urges Iranians to keep protesting, says 'help is on its way'",
      "summary": "By Susan Heavey and Elwely ElwellyWASHINGTON, Jan 13 (Reuters) - U.S. President Donald Trump urged Iranians on Tuesday to keep protesting and said help was on the way, without giving details, as Iran's clerical establishment pressed its crackdown against the biggest demonstrations in years.\nHELP IS ON ITS WAY,\" Trump said ​in a post on Truth Social, adding he had canceled all meetings with Iranian officials until the \"senseless killing\" of protesters stopped.\nAdvertisement AdvertisementAdvertisement AdvertisementOn Monday evening, Trump announced 25% import tariffs on products from any country doing business with Iran - a major oil exporter.\nTrump has also said ⁠more military action is among options he is weighing to punish ‌Iran over the crackdown.\nIran's authorities have taken a dual approach, cracking down while also calling protests over ​economic problems legitimate.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-13T09:51:42Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDk=",
      "url": "https://ca.finance.yahoo.com/news/trading-houses-beat-us-majors-115729637.html",
      "title": "Trading houses beat US majors to first deals for Venezuelan oil",
      "summary": "Trump met top oil executives at the White House on Friday as his administration outlines a long-term plan to raise $100 billion to boost Venezuelan oil output.\nThe U.S. government tapped the giant merchant houses because they were better suited to quickly get Venezuelan oil exports flowing again, four industry sources familiar with the negotiations said.\n\"Securing and marketing the initial barrels of Venezuelan crude oil was done at record speed to benefit both the American and Venezuelan people,\" a White House official told Reuters.\nGLOBAL NETWORK ADDED TO TRADERS' APPEALThe trading houses competed with Chevron to secure the supply deals.\nChevron is the only U.S. oil major that operates in Venezuela, as a minority partner in joint ventures with Venezuelan state oil firm PDVSA.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-12T11:57:29Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTA=",
      "url": "https://abcnews.go.com/International/iran-protests-646-killed-activists-trump-weighs-military/story?id=129156635",
      "title": "Iran protests: Trump suggests Americans should leave; over 2,400 killed, group says",
      "summary": "Trump said he thinks \"it's a good idea\" for Americans to evacuate from Iran.\nLater Tuesday, he told reporters that he will be receiving \"accurate numbers\" on how many protesters have been killed in Iran soon and \"we'll act accordingly.\"\nCiting \"escalating\" protests and increased security measures, the State Department also urged Americans to leave Iran.\nFILE - Protesters march on a bridge in Tehran, Iran, on Dec. 29, 2025.\nSecurity forces monitor a pro-government rally, Jan. 12, 2026, in Tehran, Iran.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-13T11:04:08Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NTE=",
      "url": "https://www.aljazeera.com/video/the-bottom-line/2026/1/11/after-maduro-is-the-us-driving-global-instability",
      "title": "After Maduro: Is the US driving global instability?",
      "summary": "America First foreign policy means that the United States is becoming a country that opposes the rule of law, free trade and collective security, argues Ian Bremmer, president of the risk analysis firm Eurasia Group.\nBremmer tells host Steve Clemons that the international system built by the US over decades “was going to reach a geopolitical bust” regardless of the advent of President Donald Trump.\nWashington’s decision to project power in Venezuela, coupled with rhetoric threatening Greenland, “makes the US more unreliable for its allies”, according to Bremmer, “and a much bigger driver of geopolitical risk on the global stage”.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-01-11T19:18:04Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTI=",
      "url": "https://abcnews.go.com/Politics/military-options-trump-iran-after-warning-big-trouble/story?id=129142628",
      "title": "Some of the military options Trump could consider against Iran after warning about protests",
      "summary": "White House press secretary Karoline Leavitt listens as President Donald Trump speaks to reporters while in flight on Air Force One to Joint Base Andrews, Md., Jan. 11, 2026.\nAt the same time, Leavitt said the Iran regime’s public messaging is different from the private messaging being communicated to the White House.\nHowever, with that said, the president has shown he's unafraid to use military options if and when he deems necessary,\" Leavitt added.\nBrendan Smialowski/AFP via Getty ImagesThe State Department has been posting in Farsi in recent days on X, including one post warning Tehran: \"Don't play games with President Trump.\"\nBut another major military operation in Iran is considered by experts to be less likely by Trump than other options because of the risks involved.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-12T23:47:39Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NTM=",
      "url": "https://www.bbc.com/news/articles/c4g3kw5ezepo",
      "title": "Greenland chooses Denmark over US, island's PM Jens-Frederik Nielsen says",
      "summary": "Denmark is a fellow Nato member and Prime Minister Mette Frederiksen has warned that military force would spell the end of the trans-Atlantic defence alliance.\nUnder existing agreements with Denmark, the US has the power to bring as many troops as it wants to Greenland.\nThe Greenlandic prime minister said they were \"facing a geopolitical crisis\", but the island's position was clear: \"If we have to choose between the United States and Denmark here and now, we choose Denmark,\" he said.\nGreenland does not want to be owned by the United States.\nGreenland does not want to be governed by the United States.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-13T15:31:16Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NTQ=",
      "url": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/13/eu-mercosur-trade-pact-signals-limits-of-trump-s-hardball-diplomacy-in-latin-america",
      "title": "EU-Mercosur trade pact signals limits of Trump’s hardball diplomacy in Latin America",
      "summary": "Gli elettori hanno sostenuto la scelta di Trump in entrambe le elezioni.\n“Il ritorno della preminenza dell’America nell’emisfero occidentale, guidata dal presidente Trump, è indiscutibile”, ha dichiarato Anna Kelly, portavoce della Casa Bianca, in un comunicato.\n“Tutte le azioni di politica estera del Presidente hanno ripristinato la forza americana dopo quattro anni di debolezza sotto la guida di Joe Biden”.\n“In un momento in cui gli Stati Uniti stanno rompendo lo status quo, alcune parti dell’America Latina sembrano sostenerlo”, ha detto.\n“È un campanello d’allarme per gli Stati Uniti”.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-13T10:06:31Z",
      "source": "Internazionale.it"
    }
  }
]