[
  {
    "article": {
      "id": "MA==",
      "url": "https://www.businessinsider.com/ai-economy-jobs-unemployment-citrini-disruption-openai-anthropic-2026-02",
      "title": "Investors Face Harsh Reality: If AI Hype Is Real, so Are the Layoffs",
      "summary": "Thomas Fuller/NurPhoto via Getty ImagesYou know all that money and effort everyone's putting into AI because they're convinced it's a technology that will change everything?\nAnd now the blowback: AI boosters are calling the Citrini post \"AI doomerism\" and are poking at some of its doomsday scenarios.\nIt's what accounts for the enormous investments tech companies are making in AI, and the crazy valuations we're seeing for the likes of Anthropic ($380 billion) and OpenAI ($850 billion).\nBut a lot of the value will come from the fact that AI will let computers do lots of work humans do now.\nNor do you have to be an AI \"doomer\" to think this way — it's baked into the pitch of the biggest AI companies.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-02-24T19:02:50Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MQ==",
      "url": "https://www.businessinsider.com/supreme-court-trump-tariffs-ruling-impact-consumer-prices-goldman-sachs-2026-2",
      "title": "Sorry, shoppers: prices aren't coming down post-tariffs ruling, Goldman Sachs says",
      "summary": "Retail prices are unlikely to fall even after the Supreme Court struck down Trump's tariffs, Goldman Sachs says.\nRetail prices are unlikely to fall even after the Supreme Court struck down Trump's tariffs, Goldman Sachs says.\nMyung J Chun/Los Angeles Times/Getty ImagesRetail prices are unlikely to fall even after the Supreme Court struck down Trump's tariffs, Goldman Sachs says.\nImpact LinkDon't expect prices at the store to fall just because the Supreme Court struck down President Donald Trump's tariffs.\nBut they're unlikely to cut prices outright, economists at Goldman Sachs wrote in a note published Sunday.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-02-23T06:07:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mg==",
      "url": "https://www.businessinsider.com/economists-business-leaderss-react-citrini-report-ai-recession-stock-crash-2026-2",
      "title": "What smart people in economics and business are saying about a viral report warning of an AI-driven recession and stock crash",
      "summary": "A Wall Street trader works on the floor at the New York Stock Exchange.\nA Wall Street trader works on the floor at the New York Stock Exchange.\nBrendan McDermid/ReutersA Wall Street trader works on the floor at the New York Stock Exchange.\nBrendan McDermid/Reuterslighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-24T12:47:21Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mw==",
      "url": "https://www.businessinsider.com/trump-state-of-union-speech-economy-taxes-inflation-fed-housing-2026-2",
      "title": "Trump touted his economic agenda on prices, taxes, and healthcare in his State of the Union",
      "summary": "President Donald Trump gave his annual State of the Union speech before Congress.\nPresident Donald Trump gave his annual State of the Union speech before Congress.\nHe opened the event focused on his administration's economic agenda, especially inflation rates and consumer prices.\nThe Trump administration officially launched TrumpRx a few weeks ago, a direct-to-consumer prescription platform.\nEconomic outlookThroughout his second term, the Trump administration has leaned into affordability issues, especially high prices on consumer goods.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-25T02:35:31Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NA==",
      "url": "https://www.bbc.com/news/videos/crrx2y0jwpvo",
      "title": "Analysis: Trump's main themes and who he hoped to win over",
      "summary": "US President Donald Trump delivered his State of the Union address at the US Capitol, outlining his administration's accomplishments and his vision for the year ahead.\nDuring his wide-ranging speech, which lasted 1 hour and 48 minutes, Trump made the case that America had improved under his watch.\nThe BBC's Daniel Bush takes a closer look at Trump's main themes of immigration and the economy - and who he was looking to appeal to with his address.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-25T08:08:52Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NQ==",
      "url": "https://slashdot.org/story/26/02/23/2338242/viral-doomsday-report-lays-bare-wall-streets-deep-anxiety-about-ai-future",
      "title": "Viral Doomsday Report Lays Bare Wall Street's Deep Anxiety About AI Future",
      "summary": "Man will never fly.\nSpace travel is merely a dream.\nAll aspirin is alike.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-24T00:45:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "Ng==",
      "url": "https://www.businessinsider.com/zachary-squire-tekmerion-capital-brevan-howard-spinout-hedge-fund-2026-2",
      "title": "Meet Tekmerion: The classics-obsessed macro investor spinning out of Brevan Howard with $1 billion",
      "summary": "Even in the eccentric world of macro investors, though, Squire stands out.\n\"We want investors who understand what macro is, we want investors who understand hedge funds,\" he added.\nAdding to his macro toolkit, Squire spent the next three years in London for credit investor HBK, focused on emerging markets.\nThe manager caught the eye of billionaire Brevan Howard cofounder Alan Howard, who personally backed the young fund.\nBecause of the slow frequency of many macro datasets, the firm typically holds positions for weeks at a time, Morrissey said.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-25T10:57:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Nw==",
      "url": "https://www.theverge.com/ai-artificial-intelligence/883707/anthropic-claude-cowork-updates",
      "title": "Anthropic’s Claude Cowork is plugging AI into more boring enterprise stuff",
      "summary": "On Tuesday, Anthropic announced updates to its Claude Cowork platform that allow the AI to help with a wider range of office tasks.\nClaude Cowork can now connect with several popular office apps, including Google Workspace, Docusign, and WordPress.\nNew pre-built plug-ins can also automate tasks in a range of fields, including HR, design, engineering, and finance.\nAdditionally, according to Anthropic, “Claude can now also handle multi-step tasks end-to-end across Excel and PowerPoint,” passing context between the two apps.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-24T16:50:31Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "OA==",
      "url": "https://abcnews.com/Politics/fact-checking-trumps-state-union-address/story?id=130459365",
      "title": "Fact-checking Trump's State of the Union address",
      "summary": "President Donald Trump delivers the State of the Union address in the House Chamber of the US Capitol in Washington, February 24, 2026.\nPresident Donald Trump delivers the State of the Union address in the House Chamber of the US Capitol in Washington, February 24, 2026.\nPresident Donald Trump delivers the State of the Union address in the House Chamber of the US Capitol in Washington, February 24, 2026.\nPresident Donald Trump delivers the State of the Union address in the House Chamber of the US Capitol in Washington, February 24, 2026.\n\"Every branch of our armed forces is setting records for recruitment,\" Trump said during the State of the Union address.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-25T02:32:33Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "OQ==",
      "url": "https://www.businessinsider.com/spirit-budget-carrier-with-premium-seats-beat-bankruptcy-2026-2",
      "title": "Spirit Expands Premiums Seats, Loyalty Rewards to Beat Bankruptcy",
      "summary": "Its debts and costs will be reduced, allowing the airline to keep fares low while doubling down on two of the industry's biggest moneymakers: premium seats and loyalty programs.\nThis includes new Spirit First loungers in the first few rows, extra-legroom premium economy seats, and expanded loyalty perks, giving travelers more choices while generating additional revenue.\nAmerican, Delta, and United have led this trend by doubling down on expanding and revamping their own high-dollar premium seats.\nThis push toward premium isn't newSpirit first began experimenting with higher-end offerings in 2024, as travelers showed a willingness to pay extra for premium perks.\nThe barebones seats on Spirit don't recline, have screens, or have a proper seatback pocket.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-25T10:01:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTA=",
      "url": "https://www.businessinsider.com/trump-calls-scotus-tariff-ruling-unfortunate-state-of-the-union2026-2",
      "title": "Trump Calls the SCOTUS Tariff Ruling 'Unfortunate' in National Address",
      "summary": "President Donald Trump called the Supreme Court's decision that overturned his signature tariffs \"unfortunate\" during his State of the Union address.\nTrump addressed the nation several days after the Supreme Court ruled against most of his 2025 tariffs that were enacted under the International Emergency Economic Powers Act.\nImmediately after the SCOTUS ruling, Trump signed an executive order to impose a 10% \"global tariff\" under Section 122 of the Trade Act of 1974.\nCongressional action will not be necessary,\" said Trump of his new 10% \"global tariffs\" at the State of the Union.\nThe landmark SCOTUS ruling was made at a time when concerns about affordability and economic health were widespread.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-02-25T03:32:34Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTE=",
      "url": "https://finance.yahoo.com/news/stocks-sell-off-traders-wake-111342816.html",
      "title": "Stocks sell off as traders wake up to the realization that Trump has ‘highly punitive’ options for new trade tariffs",
      "summary": "Goldman Sachs also reported that its in-house “Risk Appetite Indicator” had sunk back from its recent peak.\nAt first glance, ending the tariffs looked broadly good for stocks because it makes international trade easier and cheaper for companies.\nAs UBS’s Paul Donovan put it, “Welcome back uncertainty.”BNP analyst William Bratton published a research note summarizing Trump’s options.\nIt is not applicable to agricultural products, metals, minerals, chemicals, oil, gas, pharmaceuticals, aircraft, some electronics, and various automobiles.\nSection 232 tariffs also “have no upper limit and can be expanded in scope once implemented.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-23T11:13:42Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTI=",
      "url": "https://abcnews.com/Politics/state-union-trump-expected-tout-achievements-ahead-midterms/story?id=130387697",
      "title": "State of the Union: Trump expected to tout achievements ahead of midterms",
      "summary": "Earlier, she posted on X that “In one year, President Trump has turned our country around from the brink of disaster, and he will rightly declare the State of Our Union is strong, prosperous and respected.\"\nPresident Donald Trump speaks during a press briefing at the White House, Friday, Feb. 20, 2026, in Washington.\nPresident Donald Trump visits Coosa Steel Corporation in Rome, Ga., Thursday, Feb. 19, 2026.\nDonald Trump delivers remarks during a working breakfast with governors in the State Dining Room at the White House on February 20, 2026 in Washington, DC.\nPresident Donald Trump during an event to proclaim \"Angel Family Day\" in the East Room of the White House, February 23, 2026, in Washington.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-24T11:19:45Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "MTM=",
      "url": "https://www.theverge.com/tech/883307/google-producerai-deal-music",
      "title": "This Chainsmokers-approved AI music producer is joining Google",
      "summary": "ProducerAI, an AI-powered music-making platform, is joining Google.\nAs part of the deal, Google will fold ProducerAI under the Labs umbrella and power the tool with a preview version of its new Lyria 3 music-making AI model.\nProducerAI is a music-making platform that allows users to work with an AI agent to generate sounds, workshop lyrics, remix songs, and even create new instruments based on a prompt.\nThe platform launched in July 2025 as a successor to the AI music-making tool Riffusion, and initially used the startup’s own AI model to help you generate songs and tweak existing ones.\nProducerAI will remain a standalone service after joining Labs, adding yet another platform to Google’s growing AI toolset.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-23T23:36:06Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTQ=",
      "url": "https://www.theverge.com/tech/883661/adt-smart-home-security-origin-wireless-ai-wi-fi-motion-presence-sensing",
      "title": "ADT just bought the company that invented Wi-Fi motion sensing",
      "summary": "ADT, the 150-year-old company best known for home security, has acquired Origin Wireless in a $170 million deal to expand the capabilities of its security and smart home offerings.\nOrigin Wireless developed algorithms that analyze how wireless RF signals bounce around a space to detect the presence and movements of people and objects without the need for additional sensors.\nADT plans to integrate Original Wireless’ technology into its smart home and security systems to add more context when security alarms are triggered, and potentially reduce false alarms.\nBy leveraging existing technologies like Wi-Fi, future ADT systems may also require fewer sensors around a home, streamlining installation.\nADT said it will continue to license Origin Wireless’ technology to Verisure, a security system provider in Europe and South America, and other existing partners, while also evaluating new ones.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-24T15:20:07Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTU=",
      "url": "https://www.businessinsider.com/cybersecurity-ai-astelia-ceo-interview-vc-seed-funding-advice-2",
      "title": "Cybersecurity Firm Astelia Raises $35M, Founder Says AI Changed the Game",
      "summary": "Noy is the CEO and cofounder of Astelia, a cybersecurity startup that uses AI to analyze an enterprise's systems, identify the tiny fraction of vulnerabilities that attackers can exploit, and help plug those holes in its defenses.\nNoy's cofounders, Nadav Ostrovsky and Roy Rajwan, also worked on Israel's National Red Team, mimicking attackers to test the country's critical infrastructure defenses.\nAstelia combines AI agents with network and environment analysis of a customer's systems to pinpoint the 1% or 2% of vulnerabilities that are genuinely risky, he said.\n\"Astelia cuts through vulnerability noise by grounding decisions in real exposure, and we believe this team is redefining how enterprises operationalize security,\" he added.\nHe also offered advice to young people worried about an affordability crisis and AI replacing humans in many jobs.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-24T14:00:16Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTY=",
      "url": "https://www.businessinsider.com/jpmorgan-tech-budget-ai-20-billion-jamie-dimon-2026-2",
      "title": "JPMorgan will spend almost $20 billion on technology this year",
      "summary": "JPMorgan plans to boost its technology budget by almost $2 billion this year, to $19.8 billion — a roughly 10% increase compared to 2025.\nAnswering a question from Wells Fargo analyst Mike Mayo, who pressed him on the bank's technology spend on a recent earnings call, Dimon said that time saved is often \"too vague\" to measure concretely.\nA slide from the company update presentation breaks down technology spending.\nJPMorgan isn't the only bank spending big on technology.\nBank of America said it plans to spend around $14 billion on technology this year.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-24T00:04:03Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTc=",
      "url": "https://www.businessinsider.com/evident-ai-ranking-payments-index-visa-mastercard-paypal-2026-2",
      "title": "Visa is winning the AI race in payments, but the question is whether it will pay off",
      "summary": "Visa is winning the AI race in the payments industry, according to a brand new ranking — but no company is revealing quite how much the technology is paying off.\n1 among 12 global payments companies.\nThat 6.5% figure, she added, is the highest concentration of AI talent Evident has found across the sectors it tracks.\nPayPal alone accounts for 18% of the AI talent among the indexed companies and employs more than 4,000 AI workers.\nPayments companies aren't alone, of course, in focusing on AI talent — technologists specializing in AI are among the most in-demand jobs in the broader financial sector.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-25T08:00:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTg=",
      "url": "https://www.businessinsider.com/anthropic-ai-software-claude-microsoft-powerpoint-excel-slack-2026-2",
      "title": "Anthropic pushes Claude into Excel and PowerPoint, escalating AI battle with Microsoft and OpenAI",
      "summary": "Anthropic is pushing deeper into the enterprise, embedding its AI model Claude directly into the workplace software employees use every day.\nOn Tuesday, the AI startup unveiled \"Cowork & Plugins for the Enterprise,\" a package of AI tools that get Claude operating inside popular work applications, such as Microsoft Excel and PowerPoint.\n\"Until now, enterprise AI has followed a persistent pattern: you go to the AI, get an answer, then go back to your actual tools to do the work,\" Anthropic wrote in its announcement on Tuesday.\nThe launch signals Anthropic's clearest attempt yet to challenge Microsoft and OpenAI for control of the digital workplace in the era of AI.\nWith this launch, Anthropic is making clear that it no longer wants to be known primarily as a tool for developers.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-24T14:30:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTk=",
      "url": "https://www.businessinsider.com/gucci-ai-ads-backlash-branding-experts-culturally-relevant-2026-2",
      "title": "Gucci's new AI-generated ads have hit a nerve online",
      "summary": "For luxury fashion houses like Gucci, experts say the challenge is balancing craftsmanship and staying relevant.\nJeremy Moeller/Getty ImagesFor luxury fashion houses like Gucci, experts say the challenge is balancing craftsmanship and staying relevant.\nImpact LinkGucci's new AI-generated ads have hit a nerve online.\nPRIMAVERAFebruary 272 p.m. CETCreated with AI pic.twitter.com/sNbcFrpTX9 — gucci (@gucci) February 23, 2026This isn't the first time the Italian luxury fashion house has dipped its toes into AI.\nMichele served as Gucci's creative director from 2015 to 2022.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-25T11:54:50Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjA=",
      "url": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-nvidia-151600066.html",
      "title": "The Zacks Analyst Blog Highlights NVIDIA, Taiwan Semiconductor, Micron Technology and Super Micro Computer",
      "summary": "For Immediate ReleaseChicago, IL – February 24, 2026 – Zacks.com announces the list of stocks featured in the Analyst Blog.\nStocks recently featured in the blog include: NVIDIA Corp. NVDA, Taiwan Semiconductor Manufacturing Company Ltd. TSM, or TSMC, Micron Technology, Inc. MU and Super Micro Computer, Inc. SMCI.\nHere are highlights from Monday’s Analyst Blog:3 AI Stocks Outperforming NVIDIA in 2026NVIDIA Corp.has consistently posted strong quarter-over-quarter earnings, and its fiscal 2026 fourth quarter looks no different.\nRelentless demand for its Blackwell chips, expanding artificial intelligence (AI)-driven partnerships, and an increase in data center investment all signal continued long-term growth.\nOn the other hand, other AI heavyweights, including Taiwan Semiconductor Manufacturing Company Ltd., or TSMC, Micron Technology, Inc. and Super Micro Computer, Inc., have significantly outperformed, climbing 21.9%, 50%, and 10.8%, respectively.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-24T15:16:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MjE=",
      "url": "https://www.theverge.com/ai-artificial-intelligence/883243/anthropic-claude-deepseek-china-ai-distillation",
      "title": "Anthropic accuses DeepSeek and other Chinese firms of using Claude to train their AI",
      "summary": "Anthropic claims DeepSeek and two other Chinese AI companies misused its Claude AI model in an attempt to improve their own products.\nIn an announcement on Monday, Anthropic says the “industrial-scale campaigns” involved the creation of around 24,000 fraudulent accounts and more than 16 million exchanges with Claude, as reported earlier by The Wall Street Journal.\nThe three companies — DeepSeek, MiniMax, and Moonshot — are accused of “distilling” Claude, or training a smaller AI model based on a more advanced one.\nDeepSeek, which caused a stir in the AI industry for its powerful but more efficient models, held over 150,000 exchanges with Claude and targeted its reasoning capabilities, according to Anthropic.\nAnthropic is calling on other members in the AI industry, cloud providers, and lawmakers to address distillation, adding that “restricted chip access” could limit model training and “the scale of illicit distillation.”",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-23T20:22:55Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjI=",
      "url": "https://www.theverge.com/ai-artificial-intelligence/882891/ai-pdf-parsing-failure",
      "title": "Why is AI so bad at reading PDFs?",
      "summary": "In a half-joking timeline of AI development, the researcher Pierre-Carl Langlais placed “PDF parsing is solved!” shortly before AGI.\nThis has begun to change, partly because AI developers are increasingly desperate for high-quality data, and PDFs contain a disproportionate amount of it.\nA PDF reading AI doesn’t capture the spotlight like those models, Soldaini said, but people are actually using it.\nAbraham cofounded the company as a service that managed customers’ long-term histories with language models, similar to the “memory” feature that is now standard in chatbots.\nA vision language model then takes a pass on the output to correct errors.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-23T11:04:40Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjM=",
      "url": "https://www.theverge.com/tech/883015/microsoft-xbox-new-ceo-shakeup-notepad",
      "title": "Inside Microsoft’s big Xbox leadership shake-up",
      "summary": "Phil Spencer, Microsoft’s long-term Xbox chief, made the decision to resign from Microsoft last year after a tough few years for Xbox.\nSix months after Bond’s promotion, Xbox executive Kareem Choudhry, who reported directly to Bond, departed Microsoft and triggered another shake-up of some teams inside Xbox.\nThe message was that “you don’t need an Xbox to play Xbox,” because games were available through Xbox Cloud Gaming on TVs.\nPhil Spencer’s retirement has seemed inevitable to Xbox employees, particularly over the past year.\nSome Xbox employees worry she’ll force AI into everything Xbox does, but Sharma was clearly ready for that reaction.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-23T15:06:05Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjQ=",
      "url": "https://www.theverge.com/ai-artificial-intelligence/883615/seedance-bytedance-tom-cruise-brad-pitt-jia-zhangke",
      "title": "Seedance 2.0 might be gen AI video’s next big hope, but it’s still slop",
      "summary": "When Irish filmmaker Ruairi Robinson began uploading a series of short clips created with Seedance 2.0 — TikTok developer ByteDance’s newest video generation model — it was hard to deny that the footage was much more impressive than what we’ve seen from other gen AI outfits.\nBut the fact that churning out very polished ripoffs is the new model’s main claim to fame makes Seedance 2.0 just another slop generator — albeit a more fancy one.\nWhen we refer to gen AI video as “slop,” we are usually commenting on aesthetics and presentation.\nJia Zhangke’s Dance is a shining example of how filmmakers can make passable things with gen AI provided that they’re skilled enough to know how to work around the technology’s limitations.\nBut until we start seeing quality work coming out of this new wave of AI programs, it’s going to be slop all the way down.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-24T18:28:51Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjU=",
      "url": "https://www.yahoo.com/news/articles/sam-altman-defends-ai-energy-163832426.html",
      "title": "Sam Altman defends AI’s energy toll by saying it also takes a lot to ‘train a human’",
      "summary": "The OpenAI boss, Sam Altman, has tried to ease concerns about how much power is used by artificial intelligence models by comparing it to the amount of energy required by human development.\n“People talk about how much energy it takes to train an AI model – but it also takes a lot of energy to train a human,” Altman told the Indian Express recently while in India for the AI Impact summit.\nDatacenters accounted for about 1.5% of global electricity consumption in 2024, according to the International Energy Agency.\nAt the AI conference, Altman also downplayed concerns about the water datacenters require.\nWe used to do evaporative cooling in datacenters, but now … we don’t do that,” Altman said.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-23T17:40:08Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MjY=",
      "url": "https://www.bbc.com/news/articles/cqj9y9xw5v8o",
      "title": "Government relaunches green payment scheme for farmers after sudden closures",
      "summary": "Reynolds said the illegal dumping of waste - described by one farmer as \"a travesty of justice that surely must be righted\" - was an issue that had been \"seized\" by the prime minister, with more resources being given to the Environment Agency.",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2026-02-24T17:59:27Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Mjc=",
      "url": "https://www.businessinsider.com/sam-altman-ai-energy-use-training-human-water-chatgpt-2026-2",
      "title": "Sam Altman says concerns of ChatGPT's energy use are overblown: 'It also takes a lot of energy to train a human'",
      "summary": "OpenAI CEO Sam Altman said it's unfair to compare the energy AI uses to that of humans unless you account for someone's entire early life.\nOpenAI CEO Sam Altman said it's unfair to compare the energy AI uses to that of humans unless you account for someone's entire early life.\nMandel Ngan/AFP/Getty ImagesOpenAI CEO Sam Altman said it's unfair to compare the energy AI uses to that of humans unless you account for someone's entire early life.\n\"But it also takes a lot of energy to train a human.\"\n\"It takes a lot of energy to train a human,\" he said, prompting some laughter in the crowd.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-23T18:02:00Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mjg=",
      "url": "https://www.bbc.com/news/articles/c875edj1qeno",
      "title": "Reform vows to overhaul pension schemes for new local government workers",
      "summary": "Reform plans to bar any new entrants to the current schemes and, like most of the private sector, enrol new employees into defined contribution schemes.\nIn those schemes payout is not guaranteed, but instead depends on contributions made by the employee and employer, and gains (or losses) from market investments.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-02-23T22:14:36Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Mjk=",
      "url": "https://www.nature.com/articles/d41586-026-00560-6",
      "title": "EU leaders should not rush to revamp green-hydrogen rules",
      "summary": "But before EU leaders rush to change the rules, they need to know more about the reasons for the delays.\nBut necessary detail— such as the relative impact of different factors — is lacking, and EU leaders need that information before they act.\nEU rules say that proposed green-hydrogen plants need to be powered by new sources of renewable energy, to incentivize the development of more renewable-energy facilities.\nAs a next step, researchers could ask the same question, but model only renewable energy as the green-hydrogen power source — as required under the existing EU rules.\nResearchers can help by devising ways to ensure that green hydrogen is produced sustainably, while not unduly hampering the technology’s adoption.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2026-02-25T00:00:00Z",
      "source": "Nature.com"
    }
  },
  {
    "article": {
      "id": "MzA=",
      "url": "https://hackaday.com/2026/02/23/a-candle-powered-light/",
      "title": "A Candle-Powered Light",
      "summary": "For a little over two thousand years, the primary light sources after the sun had set were oil lamps and candles.\nThis was well before the age of fossil fuels, so these oil lamps were often fueled with a labor-intensive agricultural product like olive oil.\nLabor and materials costs aside, though, there’s a surprising amount of energy in these fuels and [Maciej Nowak Projects] has a generator that help these ancient light sources generate some electricity on the side.\nThe generator is based around a piece of technology called a thermoelectric generator (TEG), which produces a voltage potential when placed in a temperature gradient.\nIt would make a fitting addition to anyone’s emergency power outage kit as it really increases the amount of available light produced from any given candle.",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2026-02-23T09:00:52Z",
      "source": "Hackaday"
    }
  },
  {
    "article": {
      "id": "MzE=",
      "url": "https://slashdot.org/story/26/02/23/1430235/sam-altman-would-like-to-remind-you-that-humans-use-a-lot-of-energy-too",
      "title": "Sam Altman Would Like To Remind You That Humans Use a Lot of Energy, Too",
      "summary": "Catch up on stories from the past week (and beyond) at the Slashdot story archive",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-23T14:40:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MzI=",
      "url": "https://www.theverge.com/tech/883006/kohler-anthem-evocycle-smart-shower-system-water-recirculate-filter-recycle",
      "title": "Kohler’s new shower reuses dirty water to get you clean",
      "summary": "Kohler claims its new Anthem EvoCycle smart shower system can deliver “up to 80% water savings” without the use of showerheads that limit flow or pressure.\nPricing starts at $7,500, or $5,625 with discounts, but you’ll need to buy fixtures and the $825 water tank base separately.\nSwitching to “Cycle Mode” mixes a half gallon of that fresh water with dirty used water that’s sent through a closed loop filtration system before being pumped up to the showerhead.\nThe system not only reduces water usage, but it can also potentially reduce energy usage by using the hot water heater less.\nThe EvoCycle smart shower connects to Kohler’s mobile app so you can track water savings and activate a self-cleaning mode.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2026-02-23T16:17:26Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MzM=",
      "url": "https://www.yahoo.com/news/articles/putin-tells-fsb-better-protect-140100982.html",
      "title": "Putin tells FSB to better protect energy sector, warns foes against pushing Moscow too far",
      "summary": "MOSCOW, Feb 24 (Reuters) - President Vladimir Putin on Tuesday ordered the FSB security service to step ‌up protection of Russia's energy and transport infrastructure in ‌response to Ukrainian attacks that he said were conducted with the ​help of Western intelligence.\nPutin, speaking on the fourth anniversary of the war, said Russia's enemies would regret it if they pushed Moscow too far.\nUkraine has repeatedly attacked Russian oil depots, refineries and ports in the course of the ‌war, and Moscow blames it for ​a series of assassinations of ​senior military figures.\nPutin, in ​televised remarks, suggested that Russian energy pipelines ‌under the Black Sea could ​be targeted.\nHe issued ​an order to \"strengthen the anti-terrorist protection of energy and transport infrastructure and public gathering places, provide maximum ​coverage for critical ‌facilities, and, if necessary, equip them with additional ​security measures.\"",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-24T14:01:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzQ=",
      "url": "https://9to5mac.com/2026/02/24/apple-vision-pro-team-talks-process-behind-designing-newest-visionos-26-environment/",
      "title": "Apple Vision Pro team talks process behind designing newest visionOS 26 Environment",
      "summary": "Apple Vision Pro has the power to transport users from their physical surroundings into a variety of immersive Environments, whether it’s the shores of Mount Hood or the surface of the Moon looking back at Earth.\nWith visionOS 26, Apple expanded its library with another planetary view that takes the immersive experience even further.\nNow, two of the people behind the work are revealing new details about the intricate design process required to bring these virtual spaces to life.\nTo ensure the scale and “feel” were correct, they designed the environments while wearing the Vision Pro itself.\n“The composition of what you’re seeing here was all done through me guiding an artist while inside headset,” Dessero explains.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-24T18:57:31Z",
      "source": "9to5Mac"
    }
  },
  {
    "article": {
      "id": "MzU=",
      "url": "https://www.businessinsider.com/what-country-richest-people-moving-2026-2",
      "title": "The mega-rich are moving. Here's where they're going.",
      "summary": "In 2018, only 108,000 extremely wealthy individuals emigrated to a new country.\nSwitzerland, for example, has a lump-sum tax scheme that uses a taxpayer's lifestyle expenses as a surrogate tax base, rather than taxing global income and assets.\nThe UAE doesn't levy income tax; instead, it relies on a 5% value-added tax.\nMany of the global wealthy are relocating to cities that offer entrepreneurial freedom, often lacking in more bureaucratic regions.\nWith growing restrictions on travel to many countries, wealthy individuals are applying for second residencies or even multiple citizenships as a safeguard.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-23T08:33:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzY=",
      "url": "https://www.futurity.org/lab-made-algae-microplastics-water-3323412/",
      "title": "Lab-made algae gets microplastics out of water",
      "summary": "University University of MissouriResearchers are pioneering an innovative solution to remove tiny bits of plastic pollution from our water.\nThe University of Missouri’s Susie Dai recently applied a revolutionary strain of algae toward capturing and removing harmful microplastics from polluted water.\nThe specially engineered algae can grow in wastewater, feeding on excess nutrients and cleaning the water as it grows.\n“By removing the microplastics, cleaning the wastewater and eventually using the removed microplastics to create bioplastic products for good, we can tackle three issues with one approach,” Dai says.\nDai hopes to build bigger versions of Shrek going forward that could be adapted for wastewater treatment and other pollutant removal purposes.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-02-24T16:31:06Z",
      "source": "Futurity: Research News"
    }
  },
  {
    "article": {
      "id": "Mzc=",
      "url": "https://www.npr.org/2026/02/23/nx-s1-5719485/italy-migrants-milan",
      "title": "In the shadow of the Olympics, migrants search for a welcome in Milan",
      "summary": "In the shadow of the Olympics, migrants search for a welcome in Milantoggle caption Valerio Muscella for NPRMILAN — Three Afghan men stand together in the freezing fog outside of Milan's central train station on a recent night — their first moments in Italy.\ntoggle caption Valerio Muscella for NPR\"Milan is and wants to be an open city — open to the world and to change,\" says Lamberto Bertolé, Milan's commissioner for health and welfare.\ntoggle caption Valerio Muscella for NPRThese efforts have reduced the number of people arriving in Italy by sea compared to 2023.\ntoggle caption Valerio Muscella for NPRFor some in the room this is a second attempt at settling in a European country.\ntoggle caption Valerio Muscella for NPRtoggle caption Valerio Muscella for NPRtoggle caption Valerio Muscella for NPR\"Imagine, after taking a very long time to get to your dream country and, to be told that you will be deported back to your home country after fighting for years to get here,\" she says.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-23T13:25:36Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "Mzg=",
      "url": "https://www.bbc.com/news/articles/c4gj20xzw39o",
      "title": "Four years into its full-scale war in Ukraine, Russia is feeling the effects",
      "summary": "The Russian authorities do not release casualty figures for the so-called \"special military operation\".\nBut Russia is known to have suffered huge battlefield losses.\nSo many of the towns and villages I've visited in the last two years have had museums and monuments dedicated to soldiers killed in Ukraine, as well as separate sections for recent war dead at local cemeteries.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-23T06:01:59Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Mzk=",
      "url": "https://www.npr.org/2026/02/25/nx-s1-5717096/trump-congress-state-union-highlights",
      "title": "5 takeaways from Trump's State of the Union address",
      "summary": "5 takeaways from Trump's State of the Union addresstoggle caption Chip Somodevilla/Getty ImagesStay up to date with our Politics newsletter, sent weekly.\nOnly one president in U.S. history has gone before Congress during a State of the Union address and said that the state of the union was \"not good.\"\nIt wasn't President Trump on Tuesday.\nState of the Union addresses can sometimes descend into laundry lists of things the president wants Congress to accomplish.\nThere were only about half a dozen specific things Trump asked Congress to do:\"Codify\" Trump's attempts to lower drug prices , though it's unclear how.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-25T09:08:29Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDA=",
      "url": "https://www.businessinsider.com/biggest-moments-from-donald-trumps-state-of-the-union-2026-2",
      "title": "Biggest moments from Trump's State of the Union",
      "summary": "Share icon An curved arrow pointing right.\nLinkedIn Copy LinkDescription Angle down icon An icon in the shape of an angle pointing down.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-25T05:37:10Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NDE=",
      "url": "https://www.npr.org/2026/02/24/nx-s1-5723914/ice-iran-deporatation-adoption-adoptee-veteran",
      "title": "A U.S. veteran adopted an orphan from Iran. Decades later, ICE is trying to deport her",
      "summary": "Decades later, ICE is trying to deport hertoggle caption Stella Kalinina for NPRAdopted from Iran at age two, she takes great pride in her quintessential American upbringing.\ntoggle caption Stella Kalinina for NPRShe's terrified to be deported to Iran given her father's military service and her Christian faith.\nIt's unclear exactly how many adoptees are in the same vulnerable position as the California woman.\ntoggle caption Stella Kalinina for NPRAdoptees have been deported in the past, often because a crime triggered their removal.\nThe California woman firmly believes that her parents took the necessary steps to naturalize her.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-24T11:00:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDI=",
      "url": "https://www.aljazeera.com/features/2026/2/24/yemens-mogadishu-somali-refugees-face-poverty-instability-in-aden",
      "title": "Yemen’s ‘Mogadishu’: Somali refugees face poverty, instability in Aden",
      "summary": "Aden, Yemen – Lying on the outskirts of Yemen’s interim capital, Aden, al-Basateen district starts where the paved roads end, stretching into narrow, sandy alleyways.\nIt reveals a decades-old refugee story in which Arabic blends with Somali and the faces harbour memories of a different place, across the sea.\nToday, local sources estimate the district’s population at more than 40,000, with people of Somali origin making up the majority.\nSome arrived as children holding the hands of relatives, while others were born in Aden and have known no other home.\nA mother of four, she was born in Aden to Somali parents.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-24T19:12:47Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NDM=",
      "url": "https://abcnews.com/US/maryland-sues-trump-administration-stop-construction-ice-detention/story?id=130426708",
      "title": "Maryland sues Trump administration to stop construction of ICE detention facility",
      "summary": "Maryland is suing the Trump administration to stop the construction of an immigration detention facility in the state, according to a complaint filed Monday.\n\"The Trump Administration will stop at nothing to pursue its extreme immigration agenda -- including breaking the law,\" Brown said in a statement.\nThe lawsuit says the purchase is part of a broader \"mass immigration detention scheme\" to convert warehouses across the country into detention centers as part of the administration's immigration crackdown.\n\"Defendants are purchasing warehouses across the country and seeking to retrofit them into immigration detention and processing centers that can hold tens of thousands of immigrants,\" the lawsuit states.\n“These will not be warehouses -- they will be very well-structured detention facilities meeting our regular detention standards,\" the statement said.",
      "category": "immigration",
      "bias": "right",
      "publishedAt": "2026-02-24T01:16:57Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "NDQ=",
      "url": "https://www.yahoo.com/news/articles/maryland-sues-trump-administration-halt-212045952.html",
      "title": "Maryland sues Trump administration to halt construction of ICE facility",
      "summary": "By Jasper WardWASHINGTON, Feb 23 (Reuters) - Maryland Attorney General Anthony Brown said on Monday that the state had filed a lawsuit against the ‌Trump administration to halt construction of a new federal immigration detention center ‌in the state.\nAdvertisement AdvertisementThe Trump administration, according to Maryland's attorney general and government, purchased the property without conducting an environmental ‌review or receiving public input.\nThis would ​increase Immigration and Customs Enforcement's (ICE) total bed capacity ​to 92,600 at its detention ​centers.\nThere are currently more than 200 federal immigration detention centers in ‌the United States.\nThe move to increase ​detention centers in states ​across the U.S. states has been met with some bipartisan criticism.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-02-23T21:20:45Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDU=",
      "url": "https://www.aljazeera.com/news/2026/2/23/chad-shuts-border-with-sudan-after-clashes-from-conflict-kills-five-troops",
      "title": "Chad shuts border with Sudan after cross-border incursion kills soldiers",
      "summary": "Chad’s government says the border will remain ​closed until further ⁠notice, citing repeated violations by Sudan’s warring parties.\nChad has closed its eastern border with Sudan, the government says, after several Chadian soldiers and civilians were killed in recent days in clashes linked to the Sudanese civil war.\nTwo sources told Reuters that more Chadian soldiers were being deployed to the area.\nLast year, a drone attack killed two Chadian soldiers, according to local authorities and a security source, although it was unclear who carried out the attack.\nChad has reportedly served as a transit route for supplies, including weapons and drones, to the RSF although the Chadian government denies involvement.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-02-23T13:15:07Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NDY=",
      "url": "https://www.npr.org/2026/02/24/nx-s1-5711346/china-trump-us-foreign-aid-withdrawal",
      "title": "China and the U.S. alter foreign aid strategies",
      "summary": "In those days, China itself was receiving aid from the Soviet Union, says Carrie Dolan, an expert on Chinese health aid at the College of William and Mary.\nChina framed its foreign aid as mutually beneficial with countries in the global south, promoting economic cooperation and increasing trade.\nU.S. foreign aid grants, Brazys says, also tended to focus on long-term solutions and came with conditions for governments, such as improving human rights, democracy and corruption.\nStill, China spent about the same overall on foreign aid in 2025 as it did in previous years, says Bryan Burgess , who tracks China's aid spending at the College of William and Mary.\nHowever, it's clear that China will try to increase its influence through foreign aid, as the U.S presence appears to wane, she says.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-24T20:50:39Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDc=",
      "url": "https://abcnews.com/Politics/iran-looms-large-trumps-state-union-address-analysis/story?id=130387861",
      "title": "Iran looms large over Trump's State of the Union address: ANALYSIS",
      "summary": "\"Everything that has been written about a potential War with Iran has been written incorrectly, and purposefully so,\" Trump continued.\n\"I think Iran is harder to do.\"\nPresident Donald Trump delivers his State of the Union address to a joint session of Congress on Capitol Hill in Washington, Jan. 30, 2018.\nAmbiguity on exactly what he wants out of any military action in Iran could play to his favor, O’Hanlon says.\n\"I don't think he's going to get caught up in just the Iran specifics,\" O’Hanlon said.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-24T19:50:36Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "NDg=",
      "url": "https://www.yahoo.com/news/articles/canada-prepares-aid-package-cuba-174726102.html",
      "title": "Canada prepares aid package for Cuba as it faces fuel shortages worsened by US oil embargo",
      "summary": "TORONTO (AP) — Canada announced Monday that it is working on an aid package for Cuba as it faces blackouts and severe fuel shortages worsened by a U.S oil embargo.\nAdvertisement AdvertisementAir Canada and other airlines have canceled flights to the Caribbean island because of a shortage of aviation fuel on the island.\nGlobal Affairs Canada, a governmental office, has said Canada is Cuba’s second-largest source of direct investment to the island, particularly in the mining and tourism sectors.\nAdvertisement AdvertisementThe economic crisis gripping Cuba since 2020 has been compounded by intensified U.S. sanctions aimed at forcing a change in the island’s political model.\nBecause Cuba produces only 40% of its required fuel, it remains highly vulnerable to external blockades.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-23T17:47:26Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDk=",
      "url": "https://www.yahoo.com/news/articles/trump-state-union-address-sell-050314428.html",
      "title": "How Trump will use his State of the Union address to sell skeptical midterm voters on his plans",
      "summary": "WASHINGTON (AP) — President Donald Trump's State of the Union address on Tuesday is likely to be a test run of the message Republicans will give to voters in November's elections for control of the House and the Senate.\nHe might even minimize foreign policy in his State of the Union despite his belief that it's been a major success.\nTrump has made the State of the Union his ownThe State of the Union used to be about recapping accomplishments and seeking to unite the country, but it increasingly reflects divisions in society.\nWhen Trump delivered his 2020 State of the Union, then-House Speaker Nancy Pelosi theatrically ripped up a copy of the speech afterward, overshadowing much of what Trump said.\nState of the Unions have short shelf livesWhile some presidential phrases endure, much of the rhetoric in State of the Unions is forgettable.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-23T05:03:14Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTA=",
      "url": "https://www.aljazeera.com/news/2026/2/25/irans-fm-says-deal-with-us-within-reach-if-diplomacy-given-priority",
      "title": "Iran’s FM says deal with US ‘within reach’; Trump says he prefers diplomacy",
      "summary": "Foreign Minister Abbas Araghchi’s remarks in advance of Geneva talks come as a second US aircraft carrier heads towards the Middle East.\nWhile saying that he preferred diplomacy, he accused Iran of developing missiles that could “soon reach the United States of America”.\nBut one thing is certain, I will never allow the world’s number one sponsor of terror, which they are, by far, to have a nuclear weapon.\nTrump said that after the US attack on Iran’s nuclear sites in June 2025, “they were warned to make no future attempts to rebuild their weapons programme, in particular, nuclear weapons – yet they continue”.\nThey want to make a deal, but we haven’t heard those secret words: ‘We will never have a nuclear weapon’,” he added.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-25T03:39:03Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTE=",
      "url": "https://www.npr.org/2026/02/24/g-s1-111302/france-ups-the-ante-in-the-spat-with-us-ambassador-says-ministers-will-no-longer-meet-him",
      "title": "U.S. ambassador to France tries to defuse spat after being barred from government",
      "summary": "U.S. ambassador to France tries to defuse spat after being barred from governmenttoggle caption Christophe Ena/APPARIS — The U.S. ambassador to France sought Tuesday to smooth over a diplomatic spat with Paris, calling up the French foreign minister who had said earlier in the day that the U.S. diplomat would lose access to French government officials after he skipped a meeting.\nFrench authorities had summoned Ambassador Charles Kushner — the father of U.S. President Donald Trump 's son-in-law and adviser Jared Kushner — over comments from the Trump administration that France objected to.\nSponsor MessageBarrot reiterated to the ambassador that France cannot accept foreign interference, the minister's office said.\n\"When these explanations have taken place, then the U.S. ambassador in France will, naturally, regain access to members of the French government.\"\nLast August, Paris also summoned Kushner over a letter he wrote to French President Emmanuel Macron alleging that France did not do enough to combat antisemitism.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-24T06:29:28Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTI=",
      "url": "https://abcnews.com/Politics/trump-continues-lash-supreme-court-after-tariff-ruling/story?id=130407379",
      "title": "Trump continues to lash out at Supreme Court after tariff ruling",
      "summary": "Trump continues to lash out at Supreme Court after tariff rulingPresident Donald Trump arrives for an event to proclaim \"Angel Family Day\" in the East Room of the White House, Feb. 23, 2026.\n\"The supreme court (will be using lower case letters for a while based on a complete lack of respect!)\nTrump will face some of the Supreme Court justices in person on Tuesday night when he delivers his State of the Union address.\nThe Supreme Court will hear an expedited appeal of Trump's case seeking to effectively end birthright citizenship by executive order.\n\"But this supreme court will find a way to come to the wrong conclusion, one that again will make China, and various other Nations, happy and rich.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-23T17:20:21Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "NTM=",
      "url": "https://www.npr.org/2026/02/25/nx-s1-5724002/trump-tariffs-consumer-prices",
      "title": "Why prices won't drop after the Trump tariff ruling, according to economists",
      "summary": "Why prices won't drop after the Trump tariff ruling, according to economiststoggle caption Timothy A. Clary/AFP via Getty ImagesConsumers likely won't see cheaper prices at the grocery store or shopping mall, economists say, despite the Supreme Court striking down many of President Trump's tariffs.\nWithin hours of the ruling, Trump said he was using a different law to reimpose taxes on global imports.\nBy Saturday, Trump said he was using Section 122 of the Trade Act of 1974 to implement worldwide tariffs of 15%, after initially saying he would impose them at 10%.\nThere's also Section 338 of the Tariff Act of 1930, a never-used authority to use tariffs to retaliate against foreign discrimination against American goods.\nBut in this case, tariffs have led to higher prices for consumers, and they could stay that way.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-25T10:00:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTQ=",
      "url": "https://www.aljazeera.com/news/2026/2/25/trumps-state-of-the-union-touts-economic-turnaround-as-approval-slumps",
      "title": "Key takeaways from Trump’s State of the Union speech",
      "summary": "Trump’s hardline stance on Iran and nuclear weapons, alongside foreign policy moves, dominate key moments of his speech.\n“Our nation is back: bigger, better, richer and stronger than ever before,” Trump said, at the start of his speech.\nDemocrats protest Trump’s immigration policiesTrump focused heavily on his hardline immigration policies, particularly when it came to his closure of the US border.\nBeyond the policy arguments on the economy and immigration, Trump leaned into a highly partisan appeal for Republican control of Congress.\nSpanberger said US businesses suffer under Trump’s tariffs, communities live under his mass deportation drive and residents remain dogged by affordability issues.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-25T06:30:20Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTU=",
      "url": "https://www.aljazeera.com/video/the-take-2/2026/2/24/what-to-expect-from-trumps-state-of-the-union-address-2",
      "title": "What to expect from Trump’s State of the Union address",
      "summary": "Trump’s State of the Union preview: foreign policy, immigration, tariffs, and the influence of Project 2025.\nAs US President Donald Trump prepares to deliver his State of the Union address, we look at what he’s expected to outline, from foreign policy tensions and sweeping tariffs to immigration crackdowns, and the influence of the conservative blueprint known as Project 2025 on his agenda.\nIn this episode:Amanda Becker, JournalistEpisode credits:This episode was produced by Marcos Bartolome and Melanie Marich, with Spencer Cline, Tamara Khandaker, Tuleen Barakat, Maya Hamadeh and our host, Malika Bilal.\nOur video editors are Hisham Abu Salah and Mohannad al-Melhemm.\nConnect with us:@AJEPodcasts on Twitter, Instagram, Facebook",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-24T20:47:13Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTY=",
      "url": "https://www.cbc.ca/news/world/australia-families-diplomats-israel-lebanon-9.7105056",
      "title": "Australia tells diplomats' families to leave Israel, Lebanon amid regional tensions",
      "summary": "The Australian government has told dependants of Australian diplomats in Israel and Lebanon to leave the two Middle East countries, the foreign ministry said on Wednesday, amid rising fears of military conflict between the United States and Iran.\nIran and the United States held indirect talks this month as Washington builds up military capability in the Middle East.\nThere are tens of thousands of Australians estimated to be living in the Middle East, many of them in the UAE, Israel and Lebanon.\nCanberra did not announce the closure of any of its Middle East embassies or consulates.\nThe Australian government closed its embassy in Tehran last year after expelling Iranian diplomats in June 2025, accusing the Iranian government of directing antisemitic attacks against Australian Jews.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-25T13:51:28Z",
      "source": "CBC News"
    }
  },
  {
    "article": {
      "id": "NTc=",
      "url": "https://abcnews.com/US/wireStory/us-military-boards-oil-tanker-indian-ocean-after-130441949",
      "title": "US military boards third oil tanker in Indian Ocean after tracking it from Caribbean",
      "summary": "U.S. Southern Command said in a post on X that U.S. forces boarded the Bertha overnight, conducting “a right-of-visit, maritime interdiction and boarding.\"\n“The vessel was operating in defiance of President Trump’s established quarantine of sanctioned vessels in the Caribbean and attempted to evade,” the post said.\n“From the Caribbean to the Indian Ocean, we tracked it and stopped it.”Venezuela had faced U.S. sanctions on its oil for several years, relying on a shadow fleet of falsely flagged tankers to smuggle crude into global supply chains.\nVideo posted by the Pentagon shows U.S. military helicopters flying toward the tanker.\nTrump's Republican administration has been seizing tankers as part of its broader efforts to take control of Venezuela's oil.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-24T13:10:28Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "NTg=",
      "url": "https://alltoc.com/world/how-has-the-ukraine-war-reshaped-global-security",
      "title": "How has the Ukraine war reshaped global security?",
      "summary": "Four years in: how the conflict changed warfare and alliancesThe full‑scale invasion launched by Russia has entered its fifth year and, in that time, the war has produced deep and lasting shifts in military practice, alliance politics and global security thinking.\nTactical and technological changesWidespread use of drones: Both sides have deployed drones for reconnaissance, strike missions and improvisational air defenses.\nStrategic and geopolitical effectsNATO and European defense: The war renewed political will in Europe for higher defense spending, more integrated deterrence, and questions about deeper European security arrangements.\nHuman and economic toll: Population displacement, demographic impacts and the destruction of infrastructure pose long‑term reconstruction and economic challenges for Ukraine, while sanctions and disrupted trade have lasting global economic effects.\nWhy it matters nowThe war has altered how states prepare for and prosecute conflict in the 21st century.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-24T09:13:44Z",
      "source": "Alltoc.com"
    }
  }
]