[
  {
    "article": {
      "id": "MA==",
      "url": "https://www.theverge.com/news/867244/microsoft-bitlocker-privacy-fbi",
      "title": "Microsoft handed the government encryption keys for customer data",
      "summary": "The FBI went to Microsoft last year with a warrant, asking them to hand over keys to unlock encrypted data stored on three laptops as part of an investigation into potential fraud involving the COVID unemployment assistance program in Guam — and Microsoft complied.\nTypically, companies resist handing over encryption keys to authorities.\nChamberlayne ellaborated saying, “customers can choose to store their encryption keys locally, in a location inaccessible to Microsoft, or in Microsoft’s cloud.\nThe current administration and ICE have shown little respect for data security or the rule of law.\nAnd beyond American borders, Jennifer Granick, surveillance and cybersecurity counsel at the ACLU, told Forbes that “foreign governments with questionable human rights records” may also expect Microsoft to hand over keys to customer data.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-24T22:39:57Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MQ==",
      "url": "https://www.businessinsider.com/gold-rush-silver-price-record-rally-sell-america-retail-investors-2026-1",
      "title": "'Sell America' has sparked a FOMO-fueled rush to gold and silver among everyday investors",
      "summary": "Dhalech said he had around $10,000 in physical gold and silver and $11,000 invested in gold ETFs.\nHe finally began purchasing metals during the pandemic, after his client, a CEO of a precious metals firm, encouraged him to do so.\nHe told Business Insider he had around $20,000 in physical gold and silver and around $15,000 invested in gold and silver ETFs as of last week.\nHe sees gold and silver as a form of \"wealth preservation\" and acknowledges that \"Sell America\" is one reason so many investors jumped into metals.\nSell America and FOMOCHAIDEER MAHYUDDIN / AFP via Getty ImagesThe craze for metals comes in two flavors.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-24T10:15:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mg==",
      "url": "https://finance.yahoo.com/video/inflation-rises-expected-november-pce-152440958.html",
      "title": "Inflation rises as expected in November: PCE data",
      "summary": "Let's send it over to Yahoo Finance's Fed correspondent Jennifer Schonberger to break down the Fed's preferred inflation gauge.\nPersonal consumption expenditures index on a core basis, clocking in year-over-year at 2.8%, month over month up two-10ths of a percent.\n00:51 Jennifer SchonbergerSo, we should probably take this with a little bit of a grain of salt as we did for other data measures for October and November previously.\nHaving said that, 2.8%, it's uh closer to 3% than the Fed's 2% inflation goal and sitting right where it was at the beginning of the fall in September.\n01:10 Jennifer SchonbergerSo, this certainly doesn't change the course for the Fed's meeting next Wednesday.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-01-22T15:24:40Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mw==",
      "url": "https://uk.finance.yahoo.com/news/gold-prices-trump-greenland-russia-ukraine-oil-pound-latest-094355200.html",
      "title": "Gold price nears $5,000 as geopolitical worries linger",
      "summary": "Gold prices rose on Friday morning, advancing closer to the $5,000 mark, as geopolitical concerns remained in focus for investors.\nGold futures (GC=F) were up 0.6% to $4,940.20 per ounce at the time of writing, while spot gold climbed 0.5% at $4,911.19.\nOil prices rose on Friday morning, as Trump's latest comments on Iran fuelled concerns about the potential of tighter supply.\nThe president said that the US was moving ships toward Iran “just in case” he wants to take action.\nThat move was reinforced by Saudi Aramco pushing back against fears of a global oil glut, pointing to strong demand.\"",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-23T09:43:55Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NA==",
      "url": "https://www.androidcentral.com/apps-software/spotify/spotifys-prompted-playlists-beta-grooves-into-premium-in-the-us-more-markets",
      "title": "Spotify's 'Prompted Playlists' beta grooves into Premium in the US, more markets",
      "summary": "What you need to knowSpotify announces that its Prompted Playlists beta will open for more users in markets like the U.S. and Canada by the end of January.\nPrompted Playlists leverages a user's description of the type of music they want, taking into account vibes, account history, cultural influences, and more.\nSpotify's looking at you to tell its software what you're interested in listening to, which is why Prompted Playlists are headed to more places.\nSpotify's Prompted Playlist will generate its results based on your description.\nWith this expanded beta, Spotify is continuing its interest in listening to users to improve Prompted Playlists as much as possible before launching it fully.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-22T14:00:00Z",
      "source": "Android Central"
    }
  },
  {
    "article": {
      "id": "NQ==",
      "url": "https://news.slashdot.org/story/26/01/23/2328228/campaigner-launches-2-billion-legal-action-in-uk-against-apple-over-wallets-hidden-fees",
      "title": "Campaigner Launches $2 Billion Legal Action In UK Against Apple Over Wallet's 'Hidden Fees'",
      "summary": "The confusion of a staff member is measured by the length of his memos.\n-- New York Times, Jan. 20, 1981",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-24T01:25:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "Ng==",
      "url": "https://www.npr.org/2026/01/23/nx-s1-5686526/trump-davos-world-order",
      "title": "At Davos, U.S. allies question a fraying world order",
      "summary": "The diplomatic whiplash was on full display in the Swiss ski resort of Davos, where the annual World Economic Forum unfolded against the backdrop of growing uncertainty about America's role as a global leader among Western democracies.\nA candid speech from CanadaThat unease was then voiced openly by several leaders in Davos.\nIt was a characterization that, two years ago, Macron would have intended for leaders like Presidents Xi Jinping and Vladimir Putin — but for many in the audience it seemed, this week, to target President Trump too.\nIn the same speech, Trump did appear to definitively rule out a U.S. invasion of Greenland, which is a semiautonomous territory of Denmark, a NATO ally.\nThe week in Davos began with sharp market reactions and diplomatic shocks, and ended without clear resolution.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-23T19:27:42Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "Nw==",
      "url": "https://slashdot.org/story/26/01/23/0925259/the-great-graduate-job-drought",
      "title": "The Great Graduate Job Drought",
      "summary": "Want to read Slashdot from your mobile device?\nPoint it at m.slashdot.org and keep reading!",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-01-23T20:41:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "OA==",
      "url": "https://nitishastra.substack.com/p/how-debt-bankrupted-the-british-empire",
      "title": "How Debt Bankrupted the British Empire — And Why America, the Second Rome, Is Walking the Same Path",
      "summary": "When viewed alongside the deeper historical pattern of Rome’s decline, the trajectory of the United States becomes less exceptional and more familiar.\nThe United States rejected it.\nThe United States now shows early but unmistakable signs of the same trajectory.\nThe episode did lasting damage because it confirmed what allies already fear: deals with the United States under Trump carry no permanence.\nAs with late Rome, power remains immense, but it is constrained by financial reality.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-01-24T08:21:36Z",
      "source": "Substack.com"
    }
  },
  {
    "article": {
      "id": "OQ==",
      "url": "https://it.slashdot.org/story/26/01/23/1910235/microsoft-gave-fbi-a-set-of-bitlocker-encryption-keys-to-unlock-suspects-laptops",
      "title": "Microsoft Gave FBI a Set of BitLocker Encryption Keys To Unlock Suspects' Laptops",
      "summary": "The confusion of a staff member is measured by the length of his memos.\n-- New York Times, Jan. 20, 1981",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-23T22:02:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MTA=",
      "url": "https://www.businessinsider.com/elon-musk-says-aging-is-a-solvable-problem-at-davos-2026-1",
      "title": "Elon Musk says it's 'highly likely' humans figure out how to reverse aging — but there's 'some benefit to death'",
      "summary": "The world's richest man said getting older was a \"very solvable problem\" during a conversation with BlackRock CEO Larry Fink at the World Economic Forum on Thursday.\nIt's not a subtle thing,\" Musk said.\nThere's a reason why we don't actually have a longer lifespan, because if people do live for a very long time, I think there's some risk of an ossification of society.\nMusk's surprise appearance was his first time onstage at the World Economic Forum, which he'd previously called \"boring af.\"\nDozens of political and business leaders from across the globe gathered in Davos, Switzerland, this week to attend the World Economic Forum.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-22T18:26:53Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTE=",
      "url": "https://www.ms.now/rachel-maddow-show/maddowblog/jd-vance-comes-up-with-a-new-metaphor-for-the-trump-led-economy-the-titanic",
      "title": "JD Vance comes up with a new metaphor for the Trump-led economy: The Titanic",
      "summary": "“The ship of state is an ocean liner, it’s not a speed boat,” the president said.\nSeventeen years later, JD Vance embraced an almost identical metaphor, except the vice president didn’t refer to just any generic ocean liner — the Ohio Republican had a specific ocean liner in mind.\nVance on the economy:\"You don't turn the Titanic around overnight\" — FactPost (@factpostnews.bsky.social) 2026-01-22T15:15:28.625879841Z“The Democrats talk a lot about the affordability crisis in the United States of America.\nFirst, as Vance sees it, the United States as led by Donald Trump is the Titanic — a ship once thought to be unsinkable, before those at its helm made catastrophic misjudgments.\n(I don’t want to spoil the story for the vice president, but things didn’t work out well for the boat after an unfortunate confrontation with an iceberg.)",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-01-23T19:07:39Z",
      "source": "Ms.now"
    }
  },
  {
    "article": {
      "id": "MTI=",
      "url": "https://www.yahoo.com/news/articles/frances-navy-intercepts-oil-tanker-142647802.html",
      "title": "France's navy intercepts an oil tanker in the Mediterranean sailing from Russia",
      "summary": "PARIS (AP) — France’s navy, working with intelligence provided by the United Kingdom, on Thursday intercepted an oil tanker in the Mediterranean Sea that traveled from Russia, in a mission targeting the sanctioned Russian shadow fleet, officials said.\nAdvertisement AdvertisementAdvertisement AdvertisementFrance and other countries have vowed to crack down on the sanction-busting shadow fleet of oil tankers which experts estimate numbers over 400 ships.\nRussia is using what is described as a “shadow fleet” to evade sanctions over its war on Ukraine.\n“The activities of the ‘shadow fleet’ contribute to financing the war of aggression against Ukraine,” Macron added.\nLast September, French naval forces boarded another oil tanker off the French Atlantic coas t that Macron also linked to the shadow fleet.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-22T14:26:47Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTM=",
      "url": "https://www.npr.org/2026/01/22/g-s1-106787/up-first-newsletter-eu-emergency-meeting-trump-greenland-canada-scotus-fed",
      "title": "World leaders to hold emergency summit on Greenland. And, SCOTUS weighs Fed case",
      "summary": "World leaders to hold emergency summit on Greenland.\nToday's top storiesEuropean leaders will meet for an emergency summit tonight in response to President Trump's statements on Greenland.\nYesterday, after a meeting with NATO, Trump announced that a long-term agreement on Greenland had been reached.\nEven though Trump has called off the tariffs, the emergency summit will still be held with much less pressure than expected.\nSchultz says the leaders will most likely now discuss contingency plans in case the Greenland deal falls apart and the threats start again.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-22T12:06:59Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "MTQ=",
      "url": "https://www.bbc.com/news/articles/c62vke5dly2o",
      "title": "Captain of suspected Russian shadow tanker into French custody",
      "summary": "Captain of suspected Russian shadow tanker in French custody10 hours ago Share Save Thomas Mackintosh Share SaveReuters The Grinch was intercepted by the French navy on ThursdayFrench officials have taken the Indian captain of a suspected Russian shadow fleet tanker into custody days after the oil tanker was seized.\nOn Thursday, the French navy intercepted the tanker - named the Grinch - which President Emmanuel Macron said was \"subject to international sanctions and suspected of flying a false flag\".\nThe Grinch had been travelling through the Mediterranean Sea from the Russian Arctic port of Murmansk.\n\"The investigation aims to verify the validity of the flag used by the tanker,\" prosecutors said.\nMany Western countries imposed sanctions on Russian energy following Russia's full-scale invasion of Ukraine in 2022.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-25T15:25:52Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "MTU=",
      "url": "https://www.theverge.com/transportation/865145/waymo-miami-public-riders-waitlist",
      "title": "Waymo is accepting public riders in Miami",
      "summary": "Waymo is kicking off the new year with a new city: Miami.\nThe map will also grow over time to include more neighborhoods and prime locations, like Miami International Airport.\nWaymo has been testing its autonomous vehicles in the Florida city on-and-off since at least 2019.\nIn its announcement about Miami, Waymo touted its safety record — a tenfold reduction in serious injury crashes compared to human drivers in the cities where it operates — and its growing demand.\nAt the end of 2025, Waymo said it was doing about 450,000 paid driverless trips each week.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-22T14:04:44Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTY=",
      "url": "https://finance.yahoo.com/news/china-keeps-low-profile-davos-190222962.html",
      "title": "China keeps low profile in Davos in pursuit of Western investment",
      "summary": "China is seen \"controlling the dynamic through stillness\", a senior global business leader told Reuters, a reference to a move from The Art of War, where you wait patiently for your enemy to exhaust themselves on the battlefield.\n\"(It will) just watch all the chaos happening all over the world, and steer its own course, China will win,\" a global business founder told Reuters this week in Davos.\nCanadian Prime Minister Mark Carney called the world's second largest economy a \"reliable and predictable partner\" during his recent visit and in Davos encouraged EU leaders to seek investment from China.\nBritain and China ⁠are working towards reviving the 'Golden Era' business dialogue during British ​Prime Minister Keir Starmer's visit next week, Reuters reported, citing ​sources.\nFinnish Prime Minister Petteri Orpo is also scheduled to visit China, with a business delegation spanning resources, manufacturing, resources and the food sector.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-23T19:02:22Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTc=",
      "url": "https://slashdot.org/story/26/01/22/2317238/intel-struggles-to-meet-ai-data-center-demand",
      "title": "Intel Struggles To Meet AI Data Center Demand",
      "summary": "The confusion of a staff member is measured by the length of his memos.\n-- New York Times, Jan. 20, 1981",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-23T02:02:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MTg=",
      "url": "https://www.wired.com/story/ai-agents-math-doesnt-add-up/",
      "title": "The Math on AI Agents Doesn’t Add Up",
      "summary": "The big AI companies promised us that 2025 would be “the year of the AI agents.” It turned out to be the year of talking about AI agents, and kicking the can for that transformational moment to 2026 or maybe later.\n“So we should forget about AI agents running nuclear power plants?” I ask.\nA startup called Harmonic is reporting a breakthrough in AI coding that also hinges on mathematics—and tops benchmarks on reliability.\n“Are we doomed to be in a world where AI just generates slop and humans can't really check it?\nIn a blog about the paper, OpenAI glumly stated that in AI models, “accuracy will never reach 100 percent.”",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-23T16:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MTk=",
      "url": "https://www.wired.com/story/wikipedia-group-made-guide-to-detect-ai-writing-now-a-plug-in-uses-it-to-humanize-chatbots/",
      "title": "A Wikipedia Group Made a Guide to Detect AI Writing. Now a Plug-In Uses It to ‘Humanize’ Chatbots",
      "summary": "On Saturday, tech entrepreneur Siqi Chen released an open source plug-in for Anthropic’s Claude Code AI assistant that instructs the AI model to stop writing like an AI model.\n“It’s really handy that Wikipedia went and collated a detailed list of ‘signs of AI writing,’” Chen wrote on X.\nSpotting the PatternsSo what does AI writing look like?\nWhy AI Writing Detection FailsEven with such a confident set of rules crafted by Wikipedia editors, we’ve previously written about why AI writing detectors don’t work reliably: There is nothing inherently unique about human writing that reliably differentiates it from LLM writing.\nOne reason is that even though most AI language models tend toward certain types of language, they can also be prompted to avoid them, as with the Humanizer skill.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-22T12:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MjA=",
      "url": "https://www.theverge.com/tech/866437/tiktok-usds-bytedance-sale-oracle-mgx",
      "title": "The TikTok deal is done, finally",
      "summary": "TikTok USDS Joint Venture’s mandate is to secure U.S. user data, apps and the algorithm through comprehensive data privacy and cybersecurity measures.\nData Protection: U.S. user data will be protected by USDS Joint Venture in Oracle’s secure U.S. cloud environment.\nAlgorithm Security: The Joint Venture will retrain, test, and update the content recommendation algorithm on U.S. user data.\nTikTok USDS Joint Venture has three managing investors, Silver Lake, Oracle and MGX, each holding 15%.\nByteDance retains 19.9% of the Joint Venture.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-23T01:05:20Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjE=",
      "url": "https://www.wired.com/story/gear-news-of-the-week-apples-ai-wearable-and-a-phone-that-can-boot-android-linux-and-windows/",
      "title": "Gear News of the Week: Apple’s AI Wearable and a Phone That Can Boot Android, Linux, and Windows",
      "summary": "Accompanying the revamped Siri could be a new AI-powered wearable the size of an AirTag, according to fresh rumors this week from The Information.\nThis smartphone can run three operating systems: Android, Linux, and Windows.\nWhen you boot Android, you can use it as a normal Android phone, and you can enable Android's native desktop mode in Android 16.\nIf you launch the NexPhone with Windows, the company has a custom mobile user interface of Microsoft's operating system (very reminiscent of Windows Phone Metro UI) to make it easy to use on a phone display.\nAnd when plugged into an external monitor, you can enjoy the full Windows 11 desktop experience.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-24T11:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MjI=",
      "url": "https://www.cnet.com/tech/services-and-software/surfshark-vpn-now-offers-post-quantum-protection-cybersecurity-is-behind-the-move/",
      "title": "Surfshark VPN Now Offers 'Post-Quantum' Protection. Cybersecurity Is Behind the Move",
      "summary": "Tyler Lacoma Editor / Home SecurityFor more than 10 years Tyler has used his experience in smart home tech to craft how-to guides, explainers, and recommendations for technology of all kinds.\nFrom using his home in beautiful Bend, OR as a testing zone for the latest security products to digging into the nuts and bolts of the best data privacy guidelines, Tyler has experience in all aspects of protecting your home and belongings.\nWith a BA in Writing from George Fox and certification in Technical Writing from Oregon State University, he's ready to get you the details you need to make the best decisions for your home.\nOn off hours, you can find Tyler exploring the Cascade trails, finding the latest brew in town with some friends, or trying a new recipe in the kitchen!",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-01-22T21:16:09Z",
      "source": "CNET"
    }
  },
  {
    "article": {
      "id": "MjM=",
      "url": "https://www.theverge.com/news/865627/wikipedia-ai-slop-guide-anthropic-claude-skill",
      "title": "This plugin uses Wikipedia’s AI-spotting guide to make AI writing sound more human",
      "summary": "Is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more.\nPreviously, she was a writer and editor at MUO.\nPosts from this author will be added to your daily email digest and your homepage feed.\nA new tool aims to help AI chatbots generate more human-sounding text — with the help of Wikipedia’s guide for detecting AI, as reported by Ars Technica.\nIt’s only a matter of time before the AI companies themselves start adjusting their chatbots against some of these tells, too, as OpenAI has already addressed ChatGPT’s overuse of em dashes, which has become an indicator of AI content.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-22T14:48:15Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjQ=",
      "url": "https://www.businessinsider.com/openai-1-billion-a-month-api-business-chatgpt-sam-altman-2026-1",
      "title": "OpenAI is generating over $1 billion from something that has nothing to do with ChatGPT",
      "summary": "Sam Altman says OpenAI's API business pulled in more than $1 billion in annual recurring revenue in the past month.\nSam Altman says OpenAI's API business pulled in more than $1 billion in annual recurring revenue in the past month.\nKyle Grillot/Bloomberg—Getty Images/ReutersSam Altman says OpenAI's API business pulled in more than $1 billion in annual recurring revenue in the past month.\nSam Altman said in a post on X on Thursday that OpenAI added more than $1 billion in annual recurring revenue in the past month \"just from our API business.\"\nHarvey, one of the fastest-growing legal tech startups, is built on OpenAI's models to assist lawyers with research and drafting.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-23T05:01:03Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjU=",
      "url": "https://www.theverge.com/ai-artificial-intelligence/865077/adobe-firefly-foundry-ip-sage-genai-models",
      "title": "Adobe is developing ‘IP-safe’ gen AI models for the entertainment industry",
      "summary": "As Hollywood continues to embrace generative AI, Adobe is taking steps to make its Firefly suite of creative tools the go-to for studios’ entertainment production needs.\nAdobe says that this ensures Firefly Foundry models enable “responsible AI adoption across every stage of production” from pre-visualization to final stage edits.\nThose limitations were rooted in the fact that Adobe’s more basic gen AI models were trained solely on inputs that Adobe had bought the rights to use.\nBut that wasn’t quite enough to create the kinds of assets Adobe’s clients wanted going forward.\nThat’s where Firefly Foundry comes in.”To hype Firefly Foundry up, Adobe is already collaborating with talent agencies, including Creative Artists Agency, United Talent Agency, and William Morris Endeavor.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-22T14:01:06Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjY=",
      "url": "https://news.aibase.com/news/24859",
      "title": "OpenAI to Take a Percentage from Customer AI-Assisted R&D Outcomes, Further Upgrading Its Commercial Model and Triggering Industry Attention",
      "summary": "In the ongoing exploration of sustainable profit paths, OpenAI is酝酿 a more disruptive business model: taking a share from \"AI-Aided Discoveries\" achieved by customers using its AI systems.\nAccording to insiders, this plan is still under internal discussion but has already attracted widespread attention in high-value R&D fields such as technology, pharmaceuticals, and materials science.\nThey refer to innovative outputs accelerated by enterprises or research institutions using OpenAI's large models (such as GPT, Operator agents, etc.\nThis differs from traditional API usage billing, as it upgrades the charging model from \"usage volume\" to \"value creation,\" aiming to deeply bind AI with customer success.\nBetween its AGI vision and practical profitability, OpenAI is taking a bold step—but this path is destined to face three major challenges: legal, ethical, and commercial ones.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-23T23:15:12Z",
      "source": "Aibase.com"
    }
  },
  {
    "article": {
      "id": "Mjc=",
      "url": "https://www.wired.com/story/ai-powered-disinformation-swarms-are-coming-for-democracy/",
      "title": "AI-Powered Disinformation Swarms Are Coming for Democracy",
      "summary": "When the scheme was finally uncovered, there was widespread media coverage and Senate hearings, and social media platforms made changes in the way they verified users.\nA decade on, while the IRA is no more, disinformation campaigns have continued to evolve, including the use of AI technology to create fake websites and deepfake videos.\nA new paper, published in Science on Thursday, predicts an imminent step-change in how disinformation campaigns will be conducted.\nThese AI swarms, the researchers believe, could deliver society-wide shifts in viewpoint that not only sway elections but ultimately bring about the end of democracy—unless steps are taken now to prevent it.\nThese systems would also be able to adapt in real time to respond to signals shared by the social media platforms and in conversation with real humans.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-22T19:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "Mjg=",
      "url": "https://www.theverge.com/news/866906/meta-teens-ai-characters-stop-block-new-version",
      "title": "Meta is stopping teens from chatting with its AI characters",
      "summary": "The change blocking teens from accessing the characters will go into effect “starting in the coming weeks.””Since we announced our plans to build parental controls for AI characters in October, we started developing a new iteration of AI characters generally (i.e.\n“Rather than building the parental controls twice (for the current AI characters and the new iteration of AI characters) we’re pausing teen access to the current version while we focus on the new iteration.\nWhen that new iteration is available for teens, it will come with parental controls.”According to TechCrunch, “Meta said that it heard from parents that they wanted more insights and control over their teens’ interactions with AI characters, which is why it decided to make these changes.”In October, Meta announced that parents would be able to block their teens’ access to one-on-one conversations with its AI characters, block their teens from talking with specific AI characters, and share insights with parents on the topics their teens discuss with Meta’s AI characters and its AI assistant.\nHowever, in Friday’s announcement, Meta says it is still working on how to share insights with parents about the conversations their teens are having with Meta’s AI assistant.\nCorrection, January 23rd: Clarified that Meta is still working on how to share insights with parents about the conversations their teens are having with Meta’s AI assistant.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-23T19:50:59Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "Mjk=",
      "url": "https://www.theverge.com/news/866524/microsoft-paint-notepad-ai-coloring-book",
      "title": "Microsoft Paint can now make AI coloring books",
      "summary": "Microsoft is giving its Paint and Notepad apps on Windows new AI capabilities for editing text and making digital illustrations.\nThe latter feature is aptly called “Coloring book,” and lets you make blank coloring templates in version 11.2512.191.0 of Paint based on a text prompt.\nFrom there, you can presumably use Paint itself to color the image, or print it out to use traditional art materials.\nIt’s such an oddly specific tool that I have to wonder if this is something that coloring book consumers (parents and stressed-out millennials) actually use Paint for.\nThe Coloring book feature is notably only available on Copilot Plus PCs, so it’s more likely that Microsoft is exploring novel ways to make its AI-infused Windows 11 devices more marketable.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-01-23T11:06:39Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MzA=",
      "url": "https://www.theverge.com/tech/865168/google-says-ai-news-headlines-are-feature-not-experiment",
      "title": "Google won’t stop replacing our news headlines with terrible AI",
      "summary": "In early December, I brought you the news that Google has begun replacing Verge headlines, and those of our competitors, with AI clickbait nonsense in its content feed.\nFor example, Google’s AI claimed last week that “US reverses foreign drone ban,” citing and linking to this PCMag story for the news.\nTwo of Google’s AI headlines.\nOne headline that Google’s AI didn’t overwrite was “Star Wars Outlaws Free Download Available For Less Than 24 Hours” by Screen Rant.\nI don’t know how broadly Google is showing these “trending topics” AI headlines yet, but it seems the company is testing them beyond the Google Discover news feed, too.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-23T03:07:16Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MzE=",
      "url": "https://www.businessinsider.com/legal-tech-mergers-acquisitions-consolidation-clio-harvey-filevine-2026-1",
      "title": "Too Many Legal Tech Tools Give Way to Consolidation",
      "summary": "Legal tech is entering its consolidation era.\nThis week, Harvey, an $8 billion legal software giant, acquired Hexus, a sales tech startup built by former Google and Twitter (now X) engineers.\nAnd earlier this month, Microsoft quietly absorbed 18 employees from the legal software startup Robin AI after it filed for bankruptcy.\nEarly winners of the legal tech boom are expected to buy smaller companies to extend their leads and add new features to their software.\nThat pressure is now driving a \"shakeout of point solutions,\" said Omar Haroun, cofounder and chief executive of the legal tech company Eudia.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-23T10:00:02Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzI=",
      "url": "https://www.businessinsider.com/amplitude-ai-native-push-2026-1",
      "title": "5 acquisitions, winning over skeptical engineers, and spending tens of millions: Inside a public company's 'AI native' push",
      "summary": "It got Cursor and GitHub Copilot licenses for employees, and ran a heads-down AI week.\nWade Chambers led Amplitude's AI week, which took the entire engineering team offline.\nAmplitudeSoon after joining, Chambers began planning an \"AI week\" for the first week of June.\nThat figure peaked in the first week of December — after AI week but before the holiday vacation cycle — at 174 employees.\nAmplitude shared the growth in usage of its AI tools.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-25T09:30:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzM=",
      "url": "https://www.theverge.com/tech/865689/microsoft-claude-code-anthropic-partnership-notepad",
      "title": "Claude Code is suddenly everywhere inside Microsoft",
      "summary": "This division is responsible for Windows, Microsoft 365, Outlook, Microsoft Teams, Bing, Edge, Surface, and more.\nMicrosoft has also approved the use of Claude Code across all of its code and repositories for its Business and Industry Copilot teams.\nSoftware engineers at Microsoft are now expected to use both Claude Code and GitHub Copilot and give feedback comparing the two, I’m told.\nMicrosoft and Anthropic signed a deal in November that allows Microsoft Foundry customers to get access to Claude Sonnet 4.5, Claude Opus 4.1, and Claude Haiku 4.5.\nThe big question here is, what does the increased use of Claude Code at Microsoft mean for its more than 100,000 code repositories?",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-22T16:24:34Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MzQ=",
      "url": "https://www.theverge.com/news/866441/ring-verify-security-camera-ai-fakes-video-verification",
      "title": "Ring can verify videos now, but that might not help you with most AI fakes",
      "summary": "Ring has launched a new Ring Verify tool that the company says can “verify that Ring videos you receive haven’t been edited or changed.” But since Ring won’t verify videos that have been altered in any way, it probably won’t be able to verify those videos you see on TikTok that look like they’re from security camera footage but are actually made with AI.\nAll videos downloaded from Ring’s cloud now include a “digital security seal,” Ring says.\nWhen Ring Verify says a video is “verified,” that means “the video hasn’t been changed in any way since it was downloaded from Ring.” (Ring Verify is built on C2PA standards, according to spokesperson Kaleigh Bueckert-Orme.)\nIf Ring can’t verify the video as authentic, it also can’t tell you exactly what was changed about it.\nIf you want an original version of a video, Ring suggests asking the person who shared it with you to share a link from the Ring app.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-23T00:57:41Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MzU=",
      "url": "https://news.slashdot.org/story/26/01/22/0054237/half-of-fossil-fuel-carbon-emissions-in-2024-came-from-32-companies",
      "title": "Half of Fossil Fuel Carbon Emissions In 2024 Came From 32 Companies",
      "summary": "An anonymous reader quotes a report from Inside Climate News:\"Each year, global emissions become increasingly concentrated among a shrinking group of high-emitting producers, while overall production continues to grow.\nSimultaneously, these heavy emitters continue to use lobbying to obstruct a transition that the scientific community has known for decades is essential,\" said Emmett Connaire, senior analyst at InfluenceMap.\nThe findings of the new analysis, he added, \"underscore the growing importance of this kind of rigorous evidence in efforts to determine accountability for climate-related losses.\"",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2026-01-22T13:00:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MzY=",
      "url": "https://www.npr.org/2026/01/23/nx-s1-5684971/winter-storm-ice-texas-new-england-climate-science",
      "title": "How cuts to federal climate funds could threaten polar vortex research",
      "summary": "How cuts to federal climate funds could threaten polar vortex researchtoggle caption George Walker IV/APA major snow and ice storm is expected to affect tens of millions of people from Texas to New England over the weekend.\nBut winter weather patterns are shifting as the global climate warms, and scientists are working to understand those changes.\nCuts made by the Trump administration to federal climate research could threaten that work.\nPredicting jet stream changes is also important for weather forecasts more broadly, because weather systems move with the jet stream.\nFederal science cuts threaten research on the jet stream and polar vortexMany of the scientists who study the jet stream are employed directly by federal agencies, including NASA and the National Oceanic and Atmospheric Administration (NOAA).",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-01-23T10:12:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "Mzc=",
      "url": "https://www.npr.org/2026/01/23/g-s1-106993/vietnam-leader-to-lam-consolidates-power-as-country-targets-10-growth",
      "title": "Vietnam leader To Lam consolidates power as country targets 10% growth",
      "summary": "Lam, 68, pledged to accelerate economic growth and was reappointed unanimously by the 180-member Central Committee at the conclusion of the National Party Congress that ran from Monday through Friday.\nParty leaders say this will require moving beyond cheap labor and export-led growth toward productivity, technology and a stronger private sector.\n\"We must achieve double-digit growth to reach the set goals,\" Lam said.\nHiep, the analyst, said Lam's continued leadership would preserve Vietnam's political stability and signal economic and foreign policy continuity.\n\"If Vietnam isn't careful, the country may face significant economic problems within the next few years,\" he said.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-23T14:40:47Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "Mzg=",
      "url": "https://www.yahoo.com/news/articles/ukraines-grid-operator-says-energy-143425853.html",
      "title": "Ukraine's grid operator says energy situation has 'significantly' worsened",
      "summary": "KYIV, Jan 23 (Reuters) - Ukraine's energy situation \"significantly\" worsened on Friday after recent Russian air attacks, triggering emergency power outages in most regions, Kyiv's grid operator said.\nThe grim assessment followed a remark by ​Energy Minister Denys Shmyhal on Thursday that Ukraine's energy system had endured its most difficult day ‌since a widespread blackout in November 2022, when Russia began bombing the power grid.\nIn new comments on Friday, Shmyhal said the situation with ‌the grid remained difficult, but he expected things to stabilise somewhat.\nSeveral power generation facilities are undergoing emergency repairs as a result of the combined drone and missile attacks, Ukrenergo said on the ⁠Telegram messaging app.\nUkraine's energy grid relies almost entirely on electricity produced by nuclear power plants, and has already lost half ‌of its generating capacity.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2026-01-23T22:02:16Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mzk=",
      "url": "https://www.dezeen.com/2026/01/22/jpmorganchase-hq-trading-floors-interiors-som/",
      "title": "SOM unveils NYC's \"most advanced trading environment\" inside JPMorganChase skyscraper",
      "summary": "American architecture studio SOM has revealed the interiors of the trading floors inside the new Foster & Partners-designed JPMorganChase supertall skyscraper in Midtown Manhattan.\nThe eight trading floors sit just above the vast lobby inside 270 Park Avenue, which officially opened as the headquarters of the American financial company in October 2025.\n\"Our goal was to create a trading environment that supports both the focus and collaboration inherent in the work,\" said SOM interior design principal Ece Calguner Erzan.\nLarge, open trading floors are laid out to maximise daylight from the glass facades, supplemented by ceilings with integrated circadian lighting deeper into the floor plates.\nAbove each central cafe are two boardrooms that overlook the trading floors on one side and Park Avenue on the other.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-22T18:00:26Z",
      "source": "Dezeen"
    }
  },
  {
    "article": {
      "id": "NDA=",
      "url": "https://www.cnet.com/home/energy-and-utilities/5-simple-ways-to-lower-your-heat-and-electric-bills/",
      "title": "Keep Cozy With These 5 Tips for Lowering Your Heat and Electric Bills This Winter",
      "summary": "Rather than huddling under a blanket and dealing with the chill, there are options to keep your heating costs within budget this winter.\n(You can also save on heating costs with this small home upgrade and set your thermostat to this temperature.)\nIf you find you don't mind it or even like it, you just found an easy way to save on heating costs this winter.\nYou might have to invest in a solar array and a solar battery and even install central electric heating.\nThat will help reduce the urge to scream when you open your winter energy bill in the future, as well as other utility bills.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2026-01-22T20:34:00Z",
      "source": "CNET"
    }
  },
  {
    "article": {
      "id": "NDE=",
      "url": "https://www.nature.com/articles/s41598-026-35389-6",
      "title": "LED lighting (350-650nm) undermines human visual performance unless supplemented by wider spectra (400-1500nm+) like daylight",
      "summary": "Hence, exposure to full spectrum lighting results in a balanced pattern of improvement in visual performance.\nThese three features change the way in which long wavelength light may be applied to improve human physiology by delivery in normal environments with lasting balance effects.\nWhen shorter wavelength exposure is dominant, as in LED lighting, mitochondrial function declines.\nRetinal metabolism declines with age, but this can be partly corrected with long wavelength light across species16,21.\nConsequently, it has been suggested that longer wavelengths reduce water viscosity around rotary ATP pumps allowing the rotor to increase speed27.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-25T21:44:10Z",
      "source": "Nature.com"
    }
  },
  {
    "article": {
      "id": "NDI=",
      "url": "https://autos.yahoo.com/policy-and-environment/articles/report-warns-nearly-half-car-003000906.html",
      "title": "Report warns nearly half of all car buyers put off by newly proposed 'per-mile' tax: 'Incoherent and inconsistent'",
      "summary": "British motorists are facing a significant barrier to switching to electric vehicles, according to The Times.\nPart of the issue is that the U.K.'s EV transition has been so successful.\nElectric vehicles are cheaper to run than gas cars, making the switch a major cost-of-living improvement.\n\"We need more carrot and less stick if we're serious about the electric transition,\" said Ian Plummer, Autotrader's Chief Customer Officer.\n\"Drivers respond to incentives, and anything that puts up running costs for electric vehicles will slow that momentum.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-01-24T00:30:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDM=",
      "url": "https://hardware.slashdot.org/story/26/01/25/2153246/gasoline-out-of-thin-air-its-a-reality",
      "title": "Gasoline Out of Thin Air? It's a Reality!",
      "summary": "The confusion of a staff member is measured by the length of his memos.\n-- New York Times, Jan. 20, 1981",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-25T21:56:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "NDQ=",
      "url": "https://www.statesman.com/weather/article/texas-power-outages-live-map-ercot-updates-21306837.php",
      "title": "Arctic blast hits Texas: See power outage maps, how to report outage",
      "summary": "Texas power outage mapSee Texas energy provider outage maps, how to report an outageAustin EnergyAustin Energy serves the city of Austin.\nSee an outage mapTo report an outage: Call 888-883-3379, text \"outage\" to 25022 or go to https://www.pec.coop/reportoutageAdvertisement Article continues below this adCenterPoint EnergyCenterPoint Energy serves the Houston metro area.\nSee an outage mapTo report an outage: Call 800-227-1376.\nTo report an electric outage, email or text Lubbock Power & Light at LightsOut@LPandL.com or call (806) 775-2509.\nAdvertisement Article continues below this adAtmos EnergyPotter County's main energy provider is Atmos Energy.",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2026-01-24T11:00:00Z",
      "source": "Austin American-Statesman"
    }
  },
  {
    "article": {
      "id": "NDU=",
      "url": "https://www.yankodesign.com/2026/01/22/this-desk-hood-blocks-office-noise-without-walling-you-in/",
      "title": "This Desk Hood Blocks Office Noise Without Walling You In",
      "summary": "Canopy is KFI Studios and Gensler’s answer, a freestanding workstation that behaves like a tiny room inside the open plan.\nIt combines a height-adjustable desk with an upholstered privacy hood, integrated lighting, and built-in power, creating a personal haven for focused work without walling people off.\nThe upholstered hood softens the hum of the floor, integrated lighting dials in for your screen, and the sit-stand surface adjusts to your height with intuitive controls and a digital readout.\nThe fully upholstered hood gives a sense of boundary without feeling like a box.\nBy giving each person a small, height-adjustable, well-lit, and acoustically softened bay, it brings a bit of architectural calm into the open plan.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-22T18:20:20Z",
      "source": "Yanko Design"
    }
  },
  {
    "article": {
      "id": "NDY=",
      "url": "https://www.bbc.com/news/articles/cwyr6p30054o",
      "title": "Peace talks on Russia-Ukraine war end as fighting rages",
      "summary": "Peace talks on Russia-Ukraine war end as fighting rages1 day ago Share Save Dearbail Jordan and Patrick Jackson Share SaveWatch: Firefighters battle blazes in Kyiv and Kharkiv after Russian strikesThe first three-way peace talks between Russia, Ukraine and the US have ended in Abu Dhabi with no apparent breakthrough, as fighting rages.\nThe two-day talks ended after waves of Russian air strikes targeted Ukraine's badly damaged energy infrastructure, killing one person and injuring 35 others, Ukrainian officials said.\nLater, it reported a Ukrainian missile attack on energy infrastructure in Belgorod.\nZelensky said for his part that \"the main target of the Russians\" had been the energy infrastructure.\nReuters Talks between Ukraine, Russia and the US are being hosted by the United Arab Emirates",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-01-24T07:59:48Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NDc=",
      "url": "https://www.bbc.com/news/articles/ce3kkvkdpw0o",
      "title": "First asylum seekers moved into Crowborough former military site",
      "summary": "Mahmood said: \"I will bring forward site after site until every asylum hotel is closed and returned to local communities.\"\nMahmood said she would defend \"vigorously\" any legal challenges to moving asylum seekers into sites like Crowborough.\nWealden District Council leader James Partridge said housing asylum seekers at Crowborough was the wrong decision.\nKim Bailey, who chairs Crowborough Shield, told BBC Radio Sussex housing asylum seekers in camps costs a \"hell of a lot more\" than hotels.\n\"All asylum seekers will have been screened against policing, criminality and immigration databases before arriving,\" it added.",
      "category": "immigration",
      "bias": "lean right",
      "publishedAt": "2026-01-22T11:03:11Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NDg=",
      "url": "https://www.yahoo.com/news/articles/trump-officials-immigration-lawyers-ice-013612595.html",
      "title": "What Trump officials and immigration lawyers say about ICE detaining a 5-year-old",
      "summary": "Neighbors and school officials say that federal immigration officers used the preschooler as “bait” by telling him to knock on the door to his house so that his mother would answer.\nFederal officials say the father was in the U.S. illegally, without offering details.\nAdvertisement AdvertisementAdvertisement AdvertisementBovino and ICE officials criticize media coverageAt a news conference Friday, Border Patrol Commander at Large Greg Bovino criticized what he called the “false media narrative” about the case.\nThe directive says that ICE should allow parents and guardians to make alternate care arrangements for the children before their detention.\nAdvertisement AdvertisementAdvertisement AdvertisementIt does not specify what happens when the parents say that they want their child to stay with them.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-24T01:36:12Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDk=",
      "url": "https://abcnews.go.com/US/top-ice-official-accuses-father-detained-5-year/story?id=129500186",
      "title": "Top ICE official accuses father of detained 5-year-old of 'abandoning his child'",
      "summary": "Liam Conejo Ramos, 5, is detained by U.S. Immigration and Customs Enforcement officers after arriving home from preschool, Jan. 20, 2026, in a Minneapolis suburb.\nLiam Conejo Ramos, 5, is detained by U.S. Immigration and Customs Enforcement officers after arriving home from preschool, Jan. 20, 2026, in a Minneapolis suburb.\nA top federal official has accused the father of a 5-year-old detained by Immigration and Customs Enforcement of \"abandoning his child,\" despite school officials saying the boy's mother was home and begged for him.\nICE agents stand next to Liam Conejo Ramos, a five-year-old that school officials said was detained in Minneapolis, Minnesota, January 20, 2026.\nThe family has a pending asylum case and no order of deportation, officials at Conejo Ramos' school said in a statement.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-24T01:36:06Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NTA=",
      "url": "https://www.npr.org/2026/01/24/nx-s1-5687276/man-shot-dead-minneapolis",
      "title": "Man shot dead by federal immigration officers in Minneapolis",
      "summary": "Man shot dead by federal immigration officers in Minneapolistoggle caption Erin Trieb for NPRA man shot Saturday morning by federal immigration officers in Minneapolis has died, federal and local officials said.\nThe incident marks the third shooting involving federal immigration agents in Minneapolis this month.\n\"Today, federal agents beat and then shot multiple times and killed 37-year-old Alex Jeffrey Pretti, a U.S. citizen, a Minneapolis resident, and a V.A.\n\"Eyewitness video shows, once again, reckless, violent, and dangerous federal agents taking the life of a Minnesotan.\"\ntoggle caption Erin Trieb for NPRtoggle caption Erin Trieb for NPRBystander video, posted to social media and not independently confirmed by NPR, appears to contradict DHS' account of the shooting.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-24T19:01:37Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTE=",
      "url": "https://www.bbc.com/news/videos/cgqegq0kj02o",
      "title": "Watch: Federal and state officials give conflicting accounts of Alex Pretti's death",
      "summary": "Officials provided differing accounts of Alex Pretti's death after an altercation with federal agents in Minneapolis on Saturday.\nHomeland Security Secretary Kristi Noem said Pretti \"reacted violently\" when approached by law enforcement officers.\nHowever, Minnesota Governor Tim Walz described the claims as \"nonsense\", blaming federal officers deployed to the city for \"sowing chaos and violence\".\nRead more on this story here.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-01-25T06:14:24Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NTI=",
      "url": "https://www.businessinsider.com/ice-shooting-alex-pretti-minnesota-corporations-deescalation-peace-target-allianz-2026-1",
      "title": "The CEOs of Minnesota's largest companies call for 'de-escalation' of tensions after second fatal ICE shooting",
      "summary": "The CEOs of Minnesota's most prominent businesses are calling for local, state, and federal officials to find a solution as tensions skyrocket the day after federal agents shot and killed a second person in Minneapolis.\nThe letter called for an \"immediate de-escalation of tensions\" and for state, local, and federal officials to \"work together to find real solutions.\"\nPresident Donald Trump's immigration policies have long been the subject of sharp debate among business and tech leaders, many of whom have sought to curry favor during the president's second term.\nAfter the latest fatal shooting in Minneapolis, some business and tech leaders themselves took to social media to say their piece.\n\"There is far more outrage from tech leaders over a wealth tax than masked ICE agents terrorizing communities and executing civilians in the streets,\" Dyer wrote on X.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-01-25T20:02:30Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NTM=",
      "url": "https://www.npr.org/2026/01/22/g-s1-106927/house-spending-homeland-immigration",
      "title": "House approves spending bills despite many Democrats' objections to ICE funds",
      "summary": "House approves spending bills despite many Democrats' objections to ICE fundstoggle caption Zayrha Rodriguez/NPRThe House passed the final slate of funding measures Thursday covering large swaths of the federal government, sending the package to the Senate ahead of a Jan. 30 deadline to avert a partial shutdown.\nJust seven House Democrats voted for the bill funding the Department of Homeland Security through September, citing Immigration and Customs Enforcement tactics in Minneapolis and elsewhere.\n\"ICE is totally out of control using taxpayer dollars to brutalize American citizens and law-abiding immigrant families,\" House Minority Leader Hakeem Jeffries told reporters Thursday.\nThe final legislation also holds funding for ICE flat, while reducing the budget for enforcement and removal operations by $115 million and cutting detention bed capacity.\n\"The hard truth is that Democrats must win political power to enact the kind of accountability we need.\"",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-22T22:15:16Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTQ=",
      "url": "https://abcnews.go.com/Politics/vance-minneapolis-calls-local-officials-lower-temperature-amid/story?id=129469961",
      "title": "Vance, in Minneapolis, calls on local officials to 'lower the temperature' amid anti-ICE protests",
      "summary": "At the same time, he admitted law enforcement there had made \"mistakes.\"\nFederal agents hold a person down as they are surrounded by tear gas used to deter protesters in Minneapolis, Minnesota, January 21, 2026.\nYou have a federal law enforcement official engaging in federal law enforcement action, that's a federal issue.\nJim Watson/AFP via Getty Images\"What I did say is that when federal law enforcement officers violate the law, that is typically something that federal officials would look into.\nFederal immigration agents listen to Vice President JD Vance speak at Royalston Square in Minneapolis, Minnesota, January 22, 2026.",
      "category": "immigration",
      "bias": "right",
      "publishedAt": "2026-01-23T00:13:12Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NTU=",
      "url": "https://www.npr.org/2026/01/23/nx-s1-5686733/minnesotans-day-of-ice-protests",
      "title": "Minnesotans turn out in the frigid cold to protest Trump's immigration crackdown",
      "summary": "They often then show up in protest — honking, whistling, yelling and filming — when federal agents make arrests.\nThere are now as many as 3,000 federal immigration officers in the state.\nThis week, federal officers detained a 5-year-old boy and his father in the northern suburb of Columbia Heights.\nSponsor MessageOfficials with the school district there say federal agents used the child as \"bait\" to draw family members out of the home.\nSome U.S. Citizens are also speaking out about being stopped or detained by immigration agents.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-23T22:10:38Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTY=",
      "url": "https://www.npr.org/2026/01/25/nx-s1-5687875/minneapolis-shooting-minnesota-ice-alex-pretti-dhs-investigation",
      "title": "Videos and eyewitnesses refute federal account of Minneapolis shooting",
      "summary": "Videos and eyewitnesses refute federal account of Minneapolis shootingtoggle caption Zaydee Sanchez for NPRMinnesota officials are pushing to ensure they can help investigate the shocking fatal shooting of 37-year-old intensive care nurse Alex Pretti .\nThere has been no evidence that NPR has verified of Pretti brandishing his handgun at any time during the encounter with federal agents.\nGregory Bovino, the immigration official commanding the operation in Minneapolis told CNN on Sunday that \"the victims are the Border Patrol agents.\nWalz said the state is creating a log of evidence for possible future prosecution of immigration agents.\nSponsor Message\"They're trying to have the narrative be that the people are the aggressors,\" she told NPR.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-25T20:00:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTc=",
      "url": "https://www.yahoo.com/news/articles/brazil-takes-mexicos-diplomatic-representation-192701201.html",
      "title": "Brazil takes Mexico's diplomatic representation in Peru after spat over ex-PM asylum",
      "summary": "SAO PAULO, Jan 25 (Reuters) - Brazil will take over Mexico's diplomatic interests ​in Peru, Brasilia said on Sunday, ‌a couple of months after the Andean country ‌broke off relations with the North American nation over asylum for a former prime minister.\nLima severed relations with the Mexican ⁠government in ‌early November after Peru's former Prime Minister Betssy Chavez was granted ‍asylum in the Mexican embassy in the country.\nChavez, the last prime minister for Peru's ousted ​and now jailed former President Pedro ‌Castillo, faces conspiracy charges linked to Castillo's 2022 attempt to dissolve Congress.\nAdvertisement AdvertisementAdvertisement AdvertisementIn a statement, the Brazilian Foreign Ministry said it took the ⁠representation at the request ​of the Mexican government ​and with approval from Lima.\nBrazil said the representation includes the safekeeping ‍of the ⁠Mexican embassy's premises in Peru, including the residence of the head of ⁠mission, as well as its assets and archives.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-25T19:27:01Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTg=",
      "url": "https://www.aljazeera.com/news/2026/1/23/us-officers-detain-5-year-old-boy-as-minnesota-immigration-raids-continue",
      "title": "US officers detain 5-year-old boy as Minnesota immigration raids continue",
      "summary": "School official says the child, Liam Conejo Ramos, was ‘essentially’ used ‘as bait to apprehend his father, who is seeking asylum in the US.\nUS Immigration and Customs Enforcement (ICE) officers have detained a five-year-old boy arriving home from preschool in Minnesota, after allegedly using him “as bait” to apprehend his father, who has a pending asylum case.\nFederal agents took the child, Liam Conejo Ramos, from a running car while it was in the family’s driveway on Tuesday afternoon, Columbia Heights Public Schools Superintendent Zena Stenvik said during a news conference on Wednesday.\nAre they supposed to let a five-year-old child freeze to death?\nUS federal agents have arrested some 3,000 people in immigration raids across Minnesota in recent weeks, according to Greg Bovino, a US Customs and Border Protection official.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-01-23T02:05:49Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTk=",
      "url": "https://www.npr.org/2026/01/23/nx-s1-5683204/abortion-trump-mexico-city-policy",
      "title": "Trump expands policy banning aid to groups abroad that discuss or provide abortions",
      "summary": "Trump expands policy banning aid to groups abroad that discuss or provide abortionstoggle caption Samantha Reinders for NPRFor over four decades, Republican presidents have banned U.S. funds from going to groups that provide or promote abortion — and Democratic presidents have reversed the ban.\nIn effect, she says the policy will make it harder for marginalized groups, including transgender people, to get health care.\nInitially, the policy was focused narrowly, banning U.S. money appropriated for family planning from going to groups that provide or promote abortion.\n\"This is an expansion of the likes we have never seen before,\" says Elisha Dunn-Georgiou , CEO of the Global Health Council, a nonprofit group that advocates for global health priorities.\nIn practice, the new policy could mean groups that focus on providing health care of any kind to transgender people abroad can't get U.S. funding.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-23T21:36:28Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NjA=",
      "url": "https://www.bbc.com/news/articles/c9wxx29yknpo",
      "title": "Republic Day: How does India choose its chief guest for 26 January parade",
      "summary": "What India's Republic Day red carpet means for its foreign policy23 hours ago Share Save Nikita Yadav Share SaveEPA/Shutterstock The Republic Day parade is a display of India's culture, achievements and military mightIndia will mark its 77th Republic Day on 26 January - the day when the country adopted its constitution and formally became a republic, breaking from its colonial past.\nThe practice began in 1950 with the then Indonesian president, Sukarno, attending India's first Republic Day parade.\nIn its early years as a republic, India prioritised ties with other newly-independent countries - a focus reflected in its early choice of chief guests.\nGetty Images Queen Elizabeth II was the chief guest at India's Republic Day parade in 1961Since then, the parade has hosted leaders from across the world, reflecting shifts in India's global relations and strategic priorities.\nAFP via Getty Images Russian President Vladimir Putin attended the Republic Day parade in 2007",
      "category": "international",
      "bias": "right",
      "publishedAt": "2026-01-25T02:03:04Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NjE=",
      "url": "https://www.npr.org/2026/01/22/g-s1-106678/trump-allies-nato",
      "title": "Trump vs. U.S. allies: How will this end?",
      "summary": "Trump vs. U.S. allies: How will this end?\ntoggle caption Evan Vucci/APPresident Trump has backed off his threat to take Greenland by force.\nU.S. allies have often tried to appease Trump to avoid open confrontation.\n\"The American-dominated liberal world order is over,\" Robert Kagan, of the Brookings Institution, wrote in a recent essay in The Atlantic.\nThe American might that upheld the world order of the past 80 years will now be used instead to destroy it,\" Kagan said.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-22T10:00:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NjI=",
      "url": "https://www.bbc.com/news/articles/cm244zlnmkvo",
      "title": "UK and European concerns made Trump back down on Greenland, says David Lammy",
      "summary": "Trump responded to UK and European concerns over Greenland, says Lammy3 days ago Share Save Paul Seddon Politics reporter Share SaveBBCDonald Trump backed down from his threats on Greenland because the UK stood up for the Danish territory's sovereignty, David Lammy has told the BBC.\nHe added that European countries were \"now back where we wanted to be, which is a negotiation, effectively\".\nHe then stepped up his public opposition to Trump on Wednesday, telling MPs he would not \"yield\" on Greenland's right to self-determination.\nLammy said in January last year, before his second term began, that Trump would not try to take Greenland by force.\nDonald Trump stepped back from any suggestion of force, and he stepped back from the use of tariffs,\" he added.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-01-23T05:59:34Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NjM=",
      "url": "https://www.bbc.com/news/articles/czr444j671vo",
      "title": "Trump 'wrong' to claim Nato troops avoided Afghanistan front line, Downing Street says",
      "summary": "Trump 'wrong' to claim Nato troops avoided Afghanistan front line, Downing Street says2 days ago Share Save Thomas Mackintosh and Sofia Ferreira Santos Share SaveWatch: Trump's comments 'extremely disrespectful', says British veteranDonald Trump was \"wrong\" to diminish the role of Nato and British troops in Afghanistan, Downing Street has said, after the US president claimed allies stayed away from the front line.\nFollow live: Downing Street says Trump 'wrong' to claim Nato troops avoided Afghanistan front line But Trump told Fox News on Thursday that he was \"not sure\" the military alliance would be there for the US \"if we ever needed them\".\nResponding on Friday, the prime minister's official spokesperson said: \"The president was wrong to diminish the role of Nato troops, including British forces.\"\nHe added that Nato troops made sacrifices \"in the service of collective security and in response to an attack on our ally\".\nWatch: Labour and Conservative MPs criticise Trump Afghanistan remarksLiberal Democrat leader Sir Ed Davey criticised the US president's remarks and said: \"Trump avoided military service five times.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-01-22T22:21:08Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NjQ=",
      "url": "https://www.yahoo.com/news/articles/trump-stirs-talk-world-order-235438659.html",
      "title": "Trump stirs talk of 'new world order' as leaders signal shifting global alliances",
      "summary": "Offended by Canadian Prime Minister Mark Carney's increasingly assertive posture toward the U.S., Trump revoked an invitation to join his Board of Peace.\nAppearing at the World Economic Forum, Trump spoke of imposing tariffs on Switzerland — which he ultimately lowered — because the country's leader “rubbed me the wrong way” during a phone call.\nBefore shelving sweeping tariffs on multiple European countries, Trump pressed Denmark to “say yes” to the U.S. push to control Greenland “and we will be very appreciative.\nBut leaders of other countries, who have spent much of Trump's administration trying to find ways to work with him, are increasingly vocal.\n“Remember that, Mark, the next time you make your statements.”Some leaders are pushing backCarney, however, was unbowed, speaking of Canada as “an example to a world at sea” as he crafted a potential template for other world leaders navigating a new era.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-23T23:54:38Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NjU=",
      "url": "https://www.npr.org/2026/01/22/g-s1-106799/board-of-peace-gaza-trump",
      "title": "Trump signs Board of Peace charter at Davos as allies split on Gaza plan",
      "summary": "Trump signs Board of Peace charter at Davos as allies split on Gaza plantoggle caption Chip Somodevilla/Getty ImagesDAVOS, Switzerland — President Trump on Thursday signed the founding charter of his proposed Board of Peace at the World Economic Forum.\nSponsor Message\"This isn't the United States — this is for the world,\" Trump said during the ceremony.\nFrom Gaza ceasefire to broader global ambitionsTrump's son-in-law Jared Kushner presented a slideshow in Davos with his vision for rehabilitating Gaza.\nHe presented simulated images of sleek skyscrapers on the shores of Gaza, and a master plan envisioning an airport and seaport.\nSponsor MessageUnder this charter, the Board of Peace would coordinate international assistance, support security arrangements, and help guide Gaza's post-conflict administration.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-22T18:45:50Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NjY=",
      "url": "https://www.theverge.com/news/866977/tiktok-deal-congress-china",
      "title": "Congress doesn’t seem to know if the TikTok deal complies with its law",
      "summary": "TikTok finally closed a deal meant to bring it into compliance with the law that should have banned it a year ago, and the lawmakers who passed that law still don’t seem to know what’s going on.\nNow that a deal has been reached, Markey said in a statement, “this TikTok deal raises many more questions than answers.”Trump has played a significant role in how the negotiations have played out, talking about the TikTok deal with China’s President Xi Jinping, and at one point bantering at a press conference with Oracle chairman Larry Ellison that they could “negotiate in front of the media” over the deal.\nMarkey griped that the White House “has provided virtually no details about this agreement, including whether TikTok’s algorithm is truly free of Chinese influence,” despite repeated requests for details.\nThe White House and TikTok did not immediately respond to requests for comment.\n“The sparse information provided doesn’t address serious concerns about compliance with the law or address the national security threat posed by Beijing’s continued control of the platform.”",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-23T22:08:43Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "Njc=",
      "url": "https://www.businessinsider.com/the-us-militarys-drone-defense-confusion-is-leaving-bases-vulnerable-2026-1",
      "title": "The US military's drone-defense confusion is leaving its bases vulnerable, Pentagon watchdog finds",
      "summary": "A US Army soldier trains with a counter-UAS weapon known as a \"Drone Buster,\" at Fort Irwin, California, in October 2024.\nA Pentagon watchdog report is warning that gaps in Pentagon policy are leaving some US military bases vulnerable to drone threats.\nThat lack of awareness derived from confusing policy risks leaving bases exposed to uncrewed threats, a growing concern.\nThe Inspector General report examines 10 military installations where drone incursions have occurred.\n\"In recent years, adversary unmanned systems have evolved rapidly,\" a Department of Defense counter-drone strategy released in the final months of the Biden administration said.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-25T14:07:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Njg=",
      "url": "https://hackaday.com/2026/01/25/commodore-64-helps-revive-the-bbs-days/",
      "title": "Commodore 64 Helps Revive The BBS Days",
      "summary": "One of those systems was the Bulletin Board System, or BBS, which would have been a single computer, often in someone’s home, connected to a single phone line.\nThe video by [The Retro Shack] sets up a lot of this history for context, then, towards the end, uses a modern FPGA-based recreation called the Commodore 64 Ultimate to access a BBS called The Old Net, a modern recreation of what these 80s-era BBS systems were like.\nOnce there, users can access mail, share files, and even play a few games.\nA retro machine like a C64 or Atari is not required either; modern operating systems can access these with the right terminal program, too.\nA more in-depth guide to the BBS can be found here for those looking to explore, and we’ve also seen other modern BBS systems recently.",
      "category": "technology",
      "bias": "right",
      "publishedAt": "2026-01-25T09:00:44Z",
      "source": "Hackaday"
    }
  },
  {
    "article": {
      "id": "Njk=",
      "url": "https://www.aljazeera.com/video/the-bottom-line/2026/1/25/why-is-trump-upending-80-years-of-us-foreign-policy",
      "title": "Why is Trump upending 80 years of US foreign policy?",
      "summary": "Former Trump official Christian Whiton argues it is about time to press ‘reset’ on US relations with the world.\nUnited States President Donald Trump realises “the rules-based international order” never existed, and he’s “willing to turn his back on that”, former Trump administration official Christian Whiton argues.\nWhiton tells Steve Clemons that US foreign policy remained fairly consistent over the past 80 years while Trump is happy to upset “the globalists and the establishment unity party in Washington – Republican and Democrat – and all the generals”.\nIn Europe, the US would like to see more populist, anti-immigration governments, Whiton said, adding that Western societies should “cast aside” the idea that they are “inherently racist, a patriarchy [with] … a racist, imperialist history”.",
      "category": "international",
      "bias": "right",
      "publishedAt": "2026-01-25T16:01:59Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NzA=",
      "url": "https://www.npr.org/2026/01/24/nx-s1-5687236/canada-china-tariffs-trump",
      "title": "Trump threatens Canada with 100% tariffs over its new trade deal with China",
      "summary": "Trump threatens Canada with 100% tariffs over its new trade deal with Chinatoggle caption Jacques Boissinot/The Canadian Press via APWASHINGTON — President Donald Trump on Saturday threatened to impose a 100% tariff on goods imported from Canada if America's northern neighbor went ahead with its China trade deal.\nTrump initially had said that agreement was what Carney \"should be doing and it's a good thing for him to sign a trade deal.\"\nTrump had commented while in Davos, Switzerland, this week that \"Canada lives because of the United States.\"\nSpeaking in Davos before Trump, Carney said, \"Middle powers must act together because if you are not at the table, you are on the menu.\"\nAs for China, Canada had initially mirrored the United States by putting a 100% tariff on electric vehicles from Beijing and a 25% tariff on steel and aluminum.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-24T16:53:17Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NzE=",
      "url": "https://abcnews.go.com/International/europe-play-power-game-trump-greenland-former-danish/story?id=129418834",
      "title": "Europe must 'play the power game' with Trump over Greenland, former Danish FM says",
      "summary": "Europe must 'play the power game' with Trump over Greenland, former Danish FM saysThe HDMS Knud Rasmussen ship of the Danish Navy patrols, January 20, 2026 near Nuuk, Greenland.\nThe HDMS Knud Rasmussen ship of the Danish Navy patrols, January 20, 2026 near Nuuk, Greenland.\nAurora borealis, also known as the northern lights, is seen in the sky above Nuuk, Greenland, Tuesday, Jan. 20, 2026.\nTrump has repeatedly said the U.S. will acquire Greenland -- \"one way or another,\" he said earlier this month.\nA sign reading \"Greenland is not for sale\" is pictured outside of a clothing shop in Nuuk, Greenland, on Jan. 19, 2026.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-23T10:08:35Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NzI=",
      "url": "https://www.businessinsider.com/read-tiktok-ceo-memo-closing-a-deal-avoid-a-ban-2026-1",
      "title": "Read the memo TikTok's CEO sent staff after closing a deal to avoid a US ban",
      "summary": "The deal involved setting up a joint venture with an investor consortium that now owns just over 80% of the new US entity.\nThe group, led by managing investors Oracle, Silver Lake, and MGX, is tasked with securing US user data, content moderation, and trust and safety.\nThe company is splitting up its US employees into different entities based on whether they'll stay under ByteDance's wing or work for the new joint venture, TikTok USDS Joint Venture LLC.\nMoving forward, Chew will continue to run TikTok globally, while trust and safety executive Adam Presser will oversee the US joint venture.\nTikTok's growth in the US nicely sets up the Joint Venture for strong future success.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-23T15:14:09Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NzM=",
      "url": "https://www.cbsnews.com/news/golden-dome-for-america-trump-missile-defense-plan/?ftag=YHF4eb9d17",
      "title": "What is the \"Golden Dome\"? Here's what to know about Trump's missile defense plans",
      "summary": "What is the Golden Dome and how would it work?\nThe president was referring to Israel's Iron Dome defense system, which at least partially inspired the Golden Dome concept.\nChina respondsChina's foreign ministry has called on the U.S. \"to abandon the development and deployment of a global missile defense system as soon as possible.\"\nKarako said that the Golden Dome initiative was \"a belated realignment of U.S. missile defense policy\" to counter both China and Russia.\n\"Could [the Golden Dome] launch another spiral of offensive developments to try to break through?\"",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-22T16:50:07Z",
      "source": "CBS News"
    }
  }
]