[
  {
    "article": {
      "id": "MA==",
      "url": "https://www.yahoo.com/news/articles/economic-speeches-trump-claims-inflation-110129026.html",
      "title": "In economic speeches, Trump claims inflation victory nearly 20 times even as prices bite",
      "summary": "Advertisement AdvertisementOnly twice in the five speeches did Trump acknowledge that prices are still too high, but he blamed them on Biden.\nIn four of the speeches Trump repeatedly and haphazardly switches topics, often when he is in the middle of talking about the economy, the Reuters review found.\n\"But they have no memory of what Trump says about economic issues because of the volume of his own rhetoric.\"\nPrices remain high, even though the inflation rate has inched down since Trump took office, from 3% to 2.7%.\nIn ⁠some of the speeches Trump correctly identifies a drop in prices for a few everyday goods, including eggs and gas.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-08T09:50:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MQ==",
      "url": "https://www.businessinsider.com/bitcoin-price-today-bear-market-why-btc-is-down-crypto-2026-2",
      "title": "Bitcoin is struggling again after a brief comeback. Here's what's keeping it down.",
      "summary": "Bitcoin bounced off its lows last week, but it's struggling around the $70,000 mark on Monday.\nHowever, as other assets like stocks and precious metals continue to mount a solid recovery to start the week, bitcoin is in low gear.\nAlso, gold is still supported by central banks, while bitcoin is not.\n\"When you look at who's buying gold, it's the central banks,\" he said.\n\"And the central banks are essentially trying to get away from all fiat currency, not just dollars.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-09T17:48:40Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mg==",
      "url": "https://abcnews.go.com/US/consumer-sentiment-brightens-defying-economists-expectations/story?id=129917452",
      "title": "Consumer sentiment brightens, defying economists' expectations",
      "summary": "Customers shops for fruit in a supermarket in New York City, January 22, 2026.\nCustomers shops for fruit in a supermarket in New York City, January 22, 2026.\nCustomers shops for fruit in a supermarket in New York City, January 22, 2026.\nCustomers shops for fruit in a supermarket in New York City, January 22, 2026.\nThe reading exceeded economists' expectationsAt its low point in November, consumer sentiment fell close to its worst level since a pandemic-era bout of acute inflation.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-06T15:40:15Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "Mw==",
      "url": "https://www.theverge.com/tech/876080/mrbeast-step-mobile-banking-app",
      "title": "MrBeast just bought a banking app",
      "summary": "Stevie started out at Laptop Mag writing news and reviews on hardware, gaming, and AI.\nPosts from this author will be added to your daily email digest and your homepage feed.\nBeast Industries, owned by YouTuber Jimmy “MrBeast” Donaldson, announced on Monday that it has acquired Step, a banking app designed for teens and young adults.\nThe move comes a couple of months after Donaldson announced plans to start a new YouTube channel centered on personal finance and investing.\nStep’s investors also include Gen-Z influencers Josh Richards and Charli D’Amelio, the latter of whom has appeared on MrBeast’s YouTube channel.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-09T22:14:13Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "NA==",
      "url": "https://www.wired.com/story/your-annual-personal-finance-checklist/",
      "title": "Your Annual Personal Finance Checklist",
      "summary": "Get on your path to better financial health by taking care of some routine personal finance tasks.\nAdjust Your Retirement and Savings PlansSet-it-and-forget-it retirement savings?\nCheck Your Credit ReportA credit report is a history of your financial accounts and a way to gauge your financial responsibility.\nChecking your credit report is a security task as much as a finance task.\nIf someone uses your identity to open a line of credit, the new account will appear on your credit report.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-07T10:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "NQ==",
      "url": "https://finance.yahoo.com/news/japan-markets-set-renewed-takaichi-132924343.html",
      "title": "Japan markets set for renewed 'Takaichi trade' after landslide election win",
      "summary": "More from Yahoo Scout How has the Takaichi trade impacted Japanese markets?\nVoters braved heavy snowfalls in Tokyo and other parts of Japan to deliver what exit polls indicated to be the most decisive win for Takaichi's Liberal Democratic Party since 1996.\nWith polls already indicating a decisive LDP win, Japan's benchmark ​Nikkei 225 Index set an all-time high of 54,782.83 on Tuesday.\nBig winners of late include sectors like defence, artificial intelligence and chips that ‌have been singled out by Takaichi for targeted investment.\nBut prospects for more government outlays have unsettled investors already concerned about Japan's debt burden, the largest in the developed world.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-08T13:29:24Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Ng==",
      "url": "https://tech.slashdot.org/story/26/02/09/1548222/google-lines-up-100-year-sterling-bond-sale",
      "title": "Google Lines Up 100-Year Sterling Bond Sale",
      "summary": "Different all twisty a of in maze are you, passages little.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-09T17:01:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "Nw==",
      "url": "https://www.bbc.com/news/articles/c99j01p1yjro",
      "title": "Andrew shared confidential information with Epstein as trade envoy, files suggest",
      "summary": "Andrew Mountbatten-Windsor appears to have knowingly shared confidential information with Jeffrey Epstein from his official work as trade envoy in 2010 and 2011, according to material in the latest release of files in the US seen by the BBC.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-08T17:31:03Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "OA==",
      "url": "https://www.businessinsider.com/prediction-markets-capitol-hill-lawmakers-concerns-2026-2",
      "title": "The DC lawmakers who think prediction markets are 'bad' and 'kind of sad'",
      "summary": "Sen. Chris Murphy of Connecticut is among the lawmakers sounding a note of deep skepticism about prediction markets.\nSen. Chris Murphy of Connecticut is among the lawmakers sounding a note of deep skepticism about prediction markets.\nNathan Posner/Anadolu via Getty ImagesAsk a member of Congress about the rise of prediction markets, and there's a decent chance they'll air some concerns.\nAnd many on Capitol Hill still have yet to make up their minds when it comes to prediction markets.\nTorres, who said that he monitored prediction markets during the 2024 election alongside polling, said he could see the potential in that respect.",
      "category": "economics",
      "bias": "right",
      "publishedAt": "2026-02-07T09:49:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "OQ==",
      "url": "https://www.yahoo.com/news/articles/russian-officials-warning-putin-financial-211434255.html",
      "title": "Russian officials are warning Putin that a financial crisis could arrive this summer, report says, while his war on Ukraine becomes too big to fail",
      "summary": "Russian officials have been warning Putin with growing alarm that a financial crisis could hit by the summer, sources told the Washington Post.\nAs sanctions took hold and Putin mobilized the economy for a prolonged war, a tight labor market and high inflation forced the central bank to keep interest rates high.\nWith companies feeling the squeeze of high rates and weaker consumption, more workers not being paid, getting furloughed, or seeing their hours cut.\nThat would add to recent U.S. penalties on Russian oil majors Rosneft and Lukoil.\n“Russia has to continue the war because this war is too big for Putin to fail.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-08T21:14:34Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTA=",
      "url": "https://uk.finance.yahoo.com/news/silver-heads-towards-70-precious-metals-end-volatile-week-lower-105012693.html",
      "title": "Silver dips nearer $70 as precious metals end volatile week lower",
      "summary": "Gold (GC=F) and silver (SI=F)Silver prices took the headlines in precious metals on Friday, with a dip below the $74 per ounce mark and a 4.7% selloff for silver futures (SI=F) contracts.\nSilver is ending the week nearly 5.7% lower overall.\nMeanwhile, gold futures (GC=F) traded slightly lower, around the $4,880 per ounce mark, while spot prices were at $4,872.\nGold futures are set to end the week about 3.6% higher.\nOil prices headed for their first weekly dip of the year, despite an uptick on Friday, as the risk of a military conflict between Iran and the US waned.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-06T10:50:12Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTE=",
      "url": "https://www.businessinsider.com/investment-banking-advising-secondaries-became-hottest-job-wall-street-2026-2",
      "title": "How this job went from the Wall Street equivalent of a used car dealer to the hottest gig for 2026",
      "summary": "In late January, JPMorgan Chase announced a new \"center of excellence\" in its investment bank: the Private Capital Advisory and Solutions group.\nMiller told Business Insider that the pace of the activity has become breathless.\nLast month, London-based banker Andrei Brougham joined Goldman Sachs from Rothschild to steer its EMEA secondaries advisory business.\nA February report from JPMorgan found that 76% of family offices still have no secondary private equity exposure, illustrating how much runway remains.\n\"I think it's a really big hiring story,\" she told Business Insider.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-09T10:34:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTI=",
      "url": "https://www.npr.org/2026/02/06/nx-s1-5704104/argentina-us-trade-deal",
      "title": "Argentina and U.S. sign a major trade deal to slash tariffs, boost political alliance",
      "summary": "Argentina and U.S. sign a major trade deal to slash tariffs, boost political alliancetoggle caption Evan Vucci/APBUENOS AIRES, Argentina — Argentina and the United States agreed Thursday to ease restrictions on each other's goods in an expansive trade deal that boosts a drive by President Javier Milei to open up Argentina's protectionist economy and a push by the Trump administration to reduce food prices for Americans.\nA trade deal between ideological alliesOn Thursday Argentine Foreign Minister Pablo Quirno and U.S. Trade Representative Jamieson Greer said they signed the trade and investment agreement in Washington.\nAfter imposing sweeping tariffs on its trading partners, the Trump administration changed its tune last November in announcing framework deals with four Latin American countries, including Argentina.\nThose are key concessions as Argentine industries long protected by steep tariffs fret about their ability to compete with American manufacturers.\nWashington, for its part, will eliminate reciprocal tariffs on 1,675 Argentine products, Argentina's Foreign Ministry said, increasing government export revenue by over $1 billion.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-06T07:05:22Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "MTM=",
      "url": "https://www.theverge.com/tech/875454/iphone-17e-launching-soon-magsafe-a19",
      "title": "The iPhone 17e could launch soon with MagSafe and an A19 chip",
      "summary": "Almost exactly one year after launching the iPhone 16e, Apple is preparing to launch the 17e, according to Mark Gurman.\nThe iPhone 17e will feature an upgraded A19 chip from the iPhone 17 lineup, plus MagSafe charging, and move to Apple’s in-house cellular chips.\nGurman says Apple is planning to pitch the iPhone 17e aggressively in emerging markets and to enterprises.\nWe also expect Apple to launch an updated iPad and iPad Air around the same time, alongside the spec-bumped MacBook Pros and a MacBook Air with an M5 processor.\nThe base-model iPad will be moving to an A18 chip, which means it will support Apple Intelligence, while the iPad Air will move to an M4 and switch to an OLED display.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-08T15:26:33Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTQ=",
      "url": "https://www.businessinsider.com/canada-travel-demand-us-tourism-2026-2",
      "title": "Canadians are staying away from the US — and the drop in travel is getting hard to ignore",
      "summary": "Data from Statistics Canada up to November showed that fewer Canadians returned from the US — indicating fewer visited the US — than in the past couple of years.\nStatistics Canada data also showed that US residents entering Canada haven't had as large a drop from the start of the year as Canadian residents returning did.\nStatistics Canada said domestic travel in the second quarter of 2025 was 10.9% higher than a year ago.\nKaraguesian expects Canadian travel to the US to continue to cool due to the \"Buy Canadian\" movement, political instability, the trade war, and recent violence in the US.\nU.S. Travel Association said Canada is the main driver for the expected 3.2% drop in international inbound travel spending from 2024 to 2025.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-06T09:34:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTU=",
      "url": "https://www.businessinsider.com/giannis-antetokounmpo-kalshi-prediction-market-nba-gambling-2026-2",
      "title": "Giannis Antetokounmpo invests in Kalshi, a day after fans traded over $23 million on his NBA future",
      "summary": "\"I love the Kalshi markets and have been checking them often recently,\" Antetokounmpo said in a press release.\nKalshi users wagered on Giannis Antetokounmpo.\nKalshiSome Kalshi users, for instance, got a payday earlier this week by wagering on Antetokounmpo's future in the NBA.\nSome US lawmakers have also raised concerns that prediction markets veer too closely to traditional gambling, which is subject to stricter regulations.\nIn January, a lawmaker introduced a bill to ban government officials from engaging in insider trading in prediction markets.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-07T20:07:38Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTY=",
      "url": "https://www.businessinsider.com/kalshi-transfers-delayed-in-the-middle-of-super-bowl-2026-2",
      "title": "Some Kalshi transfers are delayed during the Super Bowl",
      "summary": "Kalshi said that some transfers on its prediction markets app are delayed because of the high volume of traffic during the Super Bowl.\n\"Some deposits are delayed because of the amount of traffic and deposits we're getting,\" Kalshi cofounder Luana Lopes Lara wrote on X on Sunday evening.\nOn X, some Kalshi users said that they felt relieved to receive an explanation for why their deposits did not go through.\nIn an X post, Kalshi said it saw over $325 million in volume less than an hour before the championship game started.\nKalshi, founded in 2018, lets users bet on the outcome of events such as elections, sports matches, and economic indicators.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-09T02:07:33Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTc=",
      "url": "https://www.theverge.com/policy/875665/live-nation-ticketmaster-settlement-doj-discussions-monopoly-trial",
      "title": "Live Nation’s monopoly trial is reportedly fracturing Trump’s Justice Department",
      "summary": "Posts from this author will be added to your daily email digest and your homepage feed.\nLive Nation executives have reportedly sidestepped the Justice Department’s antitrust division to negotiate directly with more sympathetic senior officials in the hopes of avoiding a monopoly trial.\nCiting “people familiar with the matter,” Semafor reports that some talks have excluded antitrust chief Gail Slater, who has pushed for a trial to take place in March after inheriting the case from the Biden administration.\n“This report contains misinformation about an ongoing matter that is confidential, but what can be said is that AAG Slater is very much involved” in the Live Nation matter, a Justice Department spokesman told Semafor.\nThis DOJ will always pursue what is in the best interest of the American people.”",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-09T12:22:41Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTg=",
      "url": "https://finance.yahoo.com/news/tony-robbins-says-us-congress-120100463.html",
      "title": "Tony Robbins says US Congress quietly unlocked a door that America’s ultra-rich have used for decades. Capitalize now",
      "summary": "Those thresholds have historically restricted participation in private equity, venture capital and other alternative investments to institutions and high-net-worth households.\nHere's howBut according to best-selling author and motivational speaker Tony Robbins, that long-standing divide may soon be starting to close.\nVenture capital is where the early bets on future giants are placed.\nBut, for decades, venture capital has been one of the few remaining tables in finance where retail investors can’t get a seat.\nFundrise finally disrupted that dynamic a few years ago by launching a venture capital product with two goals.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-06T12:01:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTk=",
      "url": "https://hbr.org/2026/02/do-you-know-what-your-customers-aspirations-are",
      "title": "Do You Know What Your Customers’ Aspirations Are?",
      "summary": "In his new book The Transformation Economy: Guiding Customers to Achieve Their Aspirations, B. Joseph Pine II argues that there is a new offering companies can provide: change.\nIn this adapted excerpt, he explores four types of aspirations people have and how companies can tap into them when creating their products, services, or experiences.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-06T14:00:00Z",
      "source": "Harvard Business Review"
    }
  },
  {
    "article": {
      "id": "MjA=",
      "url": "https://www.bbc.com/news/articles/cjd9k852zdjo",
      "title": "Japan election: Stocks surge as Takaichi secures historic election victory",
      "summary": "Just one week after Takaichi took office in October last year, Tokyo rolled out the red carpet for Trump when he visited Japan.\nIt was her diplomatic debut, and the optics were striking: fists pumping as the US president praised her in front of thousands of US soldiers.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-09T05:34:33Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "MjE=",
      "url": "https://www.cbc.ca/news/business/job-numbers-january-2026-9.7077050",
      "title": "Canada's economy lost 25,000 jobs in January, but unemployment rate ticked down to 6.5%",
      "summary": "The Canadian employment landscape was a mixed bag in January, with the economy losing 25,000 jobs but the unemployment rate cooling to 6.5 per cent, Statistics Canada said on Friday.\nWATCH | The Canadian employment landscape was a mixed bag last month: Canada's economy loses 25,000 jobs in January | Duration 3:27 Canada's economy lost 25,000 jobs in January, mostly due to a decline in part-time work, Statistics Canada said Friday.\nThe unemployment rate ticked down to 6.5 per cent — the lowest since September 2024 — as a result of fewer people actively searching for work.\n\"Is this bad news (drop in employment, with notable weakness in manufacturing) or good news (bigger drop in the unemployment rate, and a rise in hours worked)?\nMeanwhile, Alberta gained 20,000 jobs, Saskatchewan gained 6,100 jobs and Newfoundland and Labrador gained 3,800 jobs.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-06T13:39:37Z",
      "source": "CBC News"
    }
  },
  {
    "article": {
      "id": "MjI=",
      "url": "https://www.businessinsider.com/lema-has-come-out-of-stealth-to-raise-24-million-2026-2",
      "title": "Cybersecurity Startup Lema Comes Out of Stealth to Raise $24 Million",
      "summary": "Lema has announced a $24 million Series A funding round led by Team8, a Tel Aviv-based venture capital firm.\n\"I think that third-party risk management was the neglected child of cybersecurity for a very long time,\" Eddie Dovzhik, Lema's co-founder and CEO, told Business Insider.\n60% of companies now rely on over 1,000 external vendors, according to Gartner.\nAnd nearly one-third of recent cyber breaches originated with third parties, according to McKinsey & Company.\n\"Our goal was to come up with a completely different solution that completely changes the way that third-party risk management is being done.\"",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-09T14:00:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjM=",
      "url": "https://www.wired.com/story/satellites-ai-nuclear-treaties/",
      "title": "AI Is Here to Replace Nuclear Treaties. Scared Yet?",
      "summary": "For half a century, the world’s nuclear powers relied on an intricate and complex series of treaties that slowly and steadily reduced the number of nuclear weapons on the planet.\nBoth countries are spending billions to build new and different kinds of nuclear weapons.\nSo, failing that, the world’s nuclear powers can use satellites and other remote sensors to monitor the world’s nuclear weapons remotely.\nFor decades, the US and Russia have worked to reduce the amount of nuclear weapons in the world.\nEliminating roughly 50,000 nuclear weapons took decades of dedicated work from politicians, diplomats, and scientists.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-09T11:30:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MjQ=",
      "url": "https://www.businessinsider.com/sentinel-global-backs-ai-firms-beyond-silicon-valley-2026-2",
      "title": "Sentinel Global Backs AI Firms, Aims Beyond Silicon Valley",
      "summary": "Kranz says AI has made companies leaner, meaning there will be many more companies worth $1 billion that only raised $20 million.\n\"We think that AI is one of the black swans that impacts how you build a firm,\" he said.\nSentinel's investment focus spans enterprise AI, programmable money, and what Kranz calls the \"connected commerce,\" startups linking the physical world with software and AI.\nKranz believes those economics favor founders outside Silicon Valley, particularly in regions where efficiency has always mattered.\nSentinel typically makes fewer than 10 investments annually, writing checks ranging from $5 million to $30 million.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-09T13:00:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjU=",
      "url": "https://www.wired.com/story/the-technologies-changing-how-youll-watch-the-2026-winter-olympic-games/",
      "title": "The Technologies Changing How You’ll Watch the 2026 Winter Olympic Games",
      "summary": "During the 2024 Summer Olympics in Paris, 5G and 4K were the leading technologies available to many viewers.\nFor the 2026 Milano Cortina Winter Games there will be more technology than ever, for both athletes and fans.\nMuch of that technology has never been used at the Games before, says Yiannis Exarchos, the managing director of Olympic Broadcasting Services and executive director of Olympic Channel Services.\nDrone Views of Athlete PerformancesOne of the big technologies coming to the Milano Cortina Olympics are first-person view, or FPV, drones.\nThe Olympics’ New AI Tool: Olympic GPTGot a question about this year’s Games?",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-07T12:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MjY=",
      "url": "https://thenextweb.com/news/techex-global-returns-to-london-with-enterprise-technology-and-ai-execution",
      "title": "TechEx Global returns to London with enterprise technology and AI execution",
      "summary": "London, TechEx Global 2026, one of Europe’s biggest enterprise technology conferences, brought thousands of technology professionals together at Olympia London on 4 and 5 February.\nThe event went beyond buzzwords, focusing on how emerging technologies, especially AI, are being applied in real business contexts.\nTechEx Global combines several co-located expos, including AI & Big Data, Cyber Security & Cloud, IoT Tech, Intelligent Automation, and Digital Transformation.\nA broad technology mixBeyond AI, TechEx also treated other pillars of digital transformation.\nFor enterprise leaders, the value of TechEx Global lies in its focus on actionable outcomes rather than abstract vision.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-06T08:56:15Z",
      "source": "The Next Web"
    }
  },
  {
    "article": {
      "id": "Mjc=",
      "url": "https://tech.slashdot.org/story/26/02/09/0030214/carmakers-rush-to-remove-chinese-code-under-new-us-rules",
      "title": "Carmakers Rush To Remove Chinese Code Under New US Rules",
      "summary": "Different all twisty a of in maze are you, passages little.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-09T02:34:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "Mjg=",
      "url": "https://www.businessinsider.com/angel-investor-mentor-startups-became-better-founder-2026-2",
      "title": "I left Amazon and became an angel investor. Mentoring startups for 6 years made me a better founder.",
      "summary": "This as-told-to essay is based on a conversation with William Tunstall-Pedoe, 56, an angel investor and founder based in the UK.\nThat gave me the capital to invest in the next generation of startups when I left Amazon in 2016.\nI leaned into that opportunity, becoming both a mentor and a very active angel investor.\nI started saying yes to thingsWhen I left Amazon, I suddenly found myself with an empty calendar.\nWhen I later raised a friends-and-family round, it was largely made up of prominent angel investors I'd met through mentoring and angel investing.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-06T08:58:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mjk=",
      "url": "https://www.businessinsider.com/agentic-engineering-andrej-karpathy-vibe-coding-2026-2",
      "title": "The guy who coined 'vibe-coding' says the next big thing is 'agentic engineering'",
      "summary": "OpenAI founder Andrej Karpathy commemorated the first anniversary of coining vibe-coding by unveiling a new term.\nOpenAI founder Andrej Karpathy commemorated the first anniversary of coining vibe-coding by unveiling a new term.\nSan Francisco Chronicle/Hearst Newspapers via Getty Images/Contributor/Getty ImagesOpenAI founder Andrej Karpathy commemorated the first anniversary of coining vibe-coding by unveiling a new term.\nNow, the man who coined the term is celebrating the birth of a new one: \"agentic engineering.\"\nWhile vibe-coding is when humans prompt AI to write code, OpenAI cofounder Andrej Karpathy says agentic engineering is when AI agents write the code themselves.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-08T18:18:26Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzA=",
      "url": "https://www.businessinsider.com/amazon-ai-bet-anthropic-soars-61-billion-valuation-2026-2",
      "title": "Amazon's $8 billion Anthropic investment balloons to $61 billion",
      "summary": "The cloud giant disclosed on Friday that it holds $45.8 billion of convertible notes and $14.8 billion of nonvoting preferred stock in the AI startup.\nTaken together, the figures show that Amazon's Anthropic stake is now worth $60.6 billion.\nAmazon has invested $8 billion in Anthropic since late 2023, indicating a seven-fold increase in value.\nAnthropic last raised $13 billion in September at a $183 billion post-money valuation, following a $3.5 billion round in March that valued the company at $61.5 billion.\nThe AI startup is in talks for another funding round that would push its value to $350 billion.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-06T19:42:24Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzE=",
      "url": "https://slashdot.org/story/26/02/08/220228/do-super-bowl-ads-for-ai-signal-a-bubble-about-to-burst",
      "title": "Do Super Bowl Ads For AI Signal a Bubble About to Burst?",
      "summary": "Different all twisty a of in maze are you, passages little.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-08T22:06:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MzI=",
      "url": "https://www.wired.com/gallery/best-ai-notetakers/",
      "title": "The Best AI Notetakers to Record Your Meetings, Interviews, or Classes",
      "summary": "The small LCD is helpful (and rare in this market), indicating when you’re recording and offering a recording duration.\nThis makes it a lot more foolproof than other notetakers, which offer nothing more than a colored LED to tell you if it’s on.\nThe Note Pro supports 113 languages—sort of.\nIt will record in a foreign tongue and offer a verbatim transcript in the native language, but insights and summaries are delivered in your language of choice.\nBest of all, for a limited time, the company includes a generous three months of premium service at no charge.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-08T12:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MzM=",
      "url": "https://slashdot.org/story/26/02/09/1514248/ai-gold-rush-is-resurrecting-chinas-infamous-72-hour-work-week---in-us",
      "title": "AI Gold Rush is Resurrecting China's Infamous 72-hour Work Week",
      "summary": "Different all twisty a of in maze are you, passages little.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-09T15:14:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MzQ=",
      "url": "https://www.businessinsider.com/evident-ai-alexandra-mousavizadeh-banks-wall-street-2026-2",
      "title": "Where banks should focus AI spending to stay ahead, from Wall Street's AI scorekeeper",
      "summary": "Alexandra Mousavizadeh said banks are all racing to make sure engineers are up to speed on AI.\nAlexandra Mousavizadeh said banks are all racing to make sure engineers are up to speed on AI.\nEvidentAlexandra Mousavizadeh said banks are all racing to make sure engineers are up to speed on AI.\nBeyond that, though, Mousavizadeh banks need to double down on their \"competitive edge.\"\nBanks need to get technology into every employee's hands, Mousavizadeh said, and mandatory training often yields better results.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-07T11:37:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzU=",
      "url": "https://www.wired.com/story/new-york-is-the-latest-state-to-consider-a-data-center-pause/",
      "title": "New York Is the Latest State to Consider a Data Center Pause",
      "summary": "Two New York lawmakers on Friday announced that they are introducing a bill that would impose a three-year moratorium on data center development.\nThe announcement makes New York at least the sixth state to introduce legislation putting a pause on data center development in the past few weeks—one of the latest signs of a growing and bipartisan backlash that is quickly finding traction in statehouses around the country.\nDeSantis had previously proposed legislation that would offer a variety of consumer protections and limit the expansion of data centers in Florida.\nThe bill imposes at least a three-year moratorium on issuing permits for new data centers.\n“There are a lot of extraordinarily well-intentioned and well-meaning bills that have been introduced to attempt to address the many impacts that data centers have,” says Weltman.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-06T18:58:46Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MzY=",
      "url": "https://www.businessinsider.com/orange-slice-pitch-deck-seed-funding-y-combinator-2026-2",
      "title": "Bollywood dance teammates raised $5.3 million for their Y Combinator AI startup. Read their pitch deck.",
      "summary": "Lighning bolt icon An icon in the shape of a lightning bolt.\nImpact LinkTwo University of Michigan graduates who met on a Bollywood dance team have emerged from Y Combinator with $5.3 million in seed funding.\nOrange Slice sells subscriptions to customers like sales engineers, with fellow Y Combinator startups Novoflow and Pirros among its early users, they said.\nNandigala and Sripada began building the startup and applied to Y Combinator as college seniors last year.\nHere's a look at the pitch deck Orange Slice used to raise its $5.3 million seed round.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-06T10:00:02Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mzc=",
      "url": "https://www.cnet.com/health/medical/apples-ai-health-coach-project-may-need-a-wellness-check/",
      "title": "Apple's AI Health Coach Project May Need a Wellness Check",
      "summary": "Apple is scaling back and rethinking its ambitious plans to introduce an AI-powered health coach, according to a Bloomberg report by Mark Gurman citing anonymous sources privy to the company's plans.\nThe project, known inside Apple as Mulberry, was first reported last year, with the company expected to roll together health-related AI features as a coach or assistant.\nBloomberg's sources point to a change in leadership over Apple's health technology.\nApple was also said to have built a studio for a revamped health services app that would have included virtual and video wellness instructions, and integration with existing health tools and Apple devices.\nIt is likely that some of that content and software will still be released publicly, just not in one package, according to Bloomberg.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-06T18:00:13Z",
      "source": "CNET"
    }
  },
  {
    "article": {
      "id": "Mzg=",
      "url": "https://www.theverge.com/ai-artificial-intelligence/875501/new-york-is-considering-two-bills-to-rein-in-the-ai-industry",
      "title": "New York is considering two bills to rein in the AI industry",
      "summary": "It would also require that any content created using AI be reviewed and approved by a human with “editorial control” before being published.\nBeyond that, the bill requires organizations to disclose to newsroom employees how and when AI is being used.\nAnd it would call for safeguards that prevent confidential information, especially about sources, from being accessed by AI.\nMeanwhile, S9144 “imposes a moratorium on the issuance of permits for new data centers” for at least three years.\nThere are already over 130 data centers in New York, according to Data Center Map.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-08T21:04:53Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "Mzk=",
      "url": "https://hbr.org/2026/02/why-new-technologies-dont-transform-incumbents",
      "title": "Why New Technologies Don’t Transform Incumbents",
      "summary": "The challenge of AI adoption is proving frustrating for many incumbent companies.\nThey’re deploying the technology widely—adding it to existing workflows, using it to automate individual tasks, incorporating it in new productivity tools—but nonetheless they’re losing out to smaller challengers.",
      "category": "technology",
      "bias": "right",
      "publishedAt": "2026-02-09T14:00:00Z",
      "source": "Harvard Business Review"
    }
  },
  {
    "article": {
      "id": "NDA=",
      "url": "https://slashdot.org/story/26/02/06/1632210/kpmg-pressed-its-auditor-to-pass-on-ai-cost-savings",
      "title": "KPMG Pressed Its Auditor To Pass on AI Cost Savings",
      "summary": "Different all twisty a of in maze are you, passages little.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-06T16:31:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "NDE=",
      "url": "https://hardware.slashdot.org/story/26/02/08/0233236/why-is-china-building-so-many-coal-plants-despite-its-solar-and-wind-boom",
      "title": "Why Is China Building So Many Coal Plants Despite Its Solar and Wind Boom?",
      "summary": "Want to read Slashdot from your mobile device?\nPoint it at m.slashdot.org and keep reading!",
      "category": "environment",
      "bias": "lean right",
      "publishedAt": "2026-02-08T17:34:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "NDI=",
      "url": "https://www.bbc.com/news/articles/cd0y0y9z231o",
      "title": "US wants Russia and Ukraine to end war by June, says Zelensky",
      "summary": "\"Why before this summer?\"\n\"We understand that their domestic issues in the US will have an impact.\"\nThese issues include the November midterm elections, which could affect the balance of power in the US government.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-07T11:53:53Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NDM=",
      "url": "https://www.yahoo.com/news/articles/scientists-achieve-major-breakthrough-pursuit-170000945.html",
      "title": "Scientists achieve major breakthrough in pursuit of nearly limitless energy source: 'Cutting-edge upgrades'",
      "summary": "A team of global experts working on a fusion power generator in the United Kingdom is entering its fifth development campaign in pursuit of nearly limitless energy source.\nAs explained by the United States Department of Energy, fusion energy could be a game-changing source of abundant power, made when atoms collide to form larger ones.\nSolar panels can provide household energy independence by lowering or even eliminating your electricity bill with abundant energy from the sun.\nAdvertisement AdvertisementFor their part, UKAEA scientists plan to learn some important details from the latest project, which could expedite large-scale fusion electricity production.\n\"Over the coming months, we hope to push further the boundaries of what's possible in spherical tokamak science.\"",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2026-02-08T17:00:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDQ=",
      "url": "https://www.yahoo.com/news/articles/over-100-000-people-ordered-080500349.html",
      "title": "Over 100,000 people ordered to evacuate as catastrophic flooding threatens entire city: 'Water is coming in from every corner'",
      "summary": "Advertisement AdvertisementMorocco's historic city of Ksar El-Kbir has been hit hard by this week's flooding.\n\"Water is coming in from every corner and rainfall is expected to reach 150 millimeters between afternoon and evening today.\nThe Grand Palace is at risk of flooding from this week's rain.\nWhile the northern part of the country is facing flooding today, officials were addressing a major drought in parts of the country late last year.\nMorocco's innovative floating solar installation shades reservoir water to save it from evaporation while producing electricity for nearby infrastructure.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2026-02-06T08:05:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDU=",
      "url": "https://uk.finance.yahoo.com/news/britain-invest-1-4-billion-223603099.html",
      "title": "Britain to invest up to $1.4 billion in community energy projects",
      "summary": "LONDON, Feb 9 (Reuters) - Britain will invest up to 1 billion pounds ($1.4 billion) in community ​energy projects, such as installing solar panels on ‌libraries and other public buildings, to help meet climate targets and ‌cut local energy costs, it said on Tuesday.\nThe Local Power Plan, ‌launched on Monday, aims to support locally owned clean energy projects across community buildings ‍and public sites.\nIt will be backed by Great British Energy, the government's publicly owned energy company, with the funding ​part of the 8.3 billion pounds committed to ‌GBE over the current Parliament.\nEnergy Secretary Ed Miliband said the initiative would allow communities to own and control clean energy generation, ensuring profits flow into local areas rather than to large energy companies.\nThe funding will be distributed through grants and loans to community energy ⁠groups and local authorities, with schemes launching later this year, ‌the government said.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2026-02-09T22:36:03Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDY=",
      "url": "https://www.businessinsider.com/nominations-entry-form-most-innovative-cmo-list-2026-2",
      "title": "Seeking nominations for Business Insider's most innovative CMOs of 2026 list — submit entries by March 27",
      "summary": "Business Insider is seeking nominations for our 11th annual list of the most innovative CMOs in the world.\nWe want to showcase the CMOs who are leading from the top and inspiring the next generation of marketers.\nWhile information about the individual's broader career history will be helpful context, the entries should focus on the impact nominees have had over the past 12 months.\nBusiness Insider's editorial team will judge and determine the list based on the nominations we receive and our own reporting.\nWe may contact you with follow-up questions or invitations for your nominee to be interviewed for additional articles and features.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-02-09T13:56:11Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NDc=",
      "url": "https://hardware.slashdot.org/story/26/02/07/0624254/free-bi-directional-ev-chargers-tested-to-improve-massachusetts-power-grid",
      "title": "Free Bi-Directional EV Chargers Tested to Improve Massachusetts Power Grid",
      "summary": "Different all twisty a of in maze are you, passages little.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-07T16:34:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "NDg=",
      "url": "https://www.businessinsider.com/spacex-hiring-elon-musk-data-centers-in-space-2026-2",
      "title": "SpaceX is hiring to turn Elon Musk's plan for data centers in space a reality",
      "summary": "As countries pour billions into new Earth-bound data centers in a global race for AI dominance, SpaceX CEO Elon Musk thinks the best way to conserve energy, money, and space is to put data centers in, well, space.\nSpaceX says its goal is to launch a \"constellation of a million satellites that operate as orbital data centers,\" and it's now hiring to make it happen.\nAs of 2023, about 4.4% of total US electricity consumption came from data centers, according to the Department of Energy.\nGlobally, data centers accounted for about 1.5% of global electricity consumption in 2024, according to the International Energy Agency.\nLocating data centers in space might appeal to the communities, like Northern Virginia, where electricity costs are growing and housing developments are vying with data centers for land.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-07T10:41:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NDk=",
      "url": "https://www.businessinsider.com/eric-schmnidt-data-center-firm-negotiating-texas-deal-with-google-2026-2",
      "title": "Eric Schmidt-backed data center venture is negotiating a major deal with Google",
      "summary": "Bolt Data and Energy, a data center development firm that was cofounded late last year by former Google CEO Eric Schmidt, is negotiating a deal that would allow it to begin construction on a large data center project it is planning in West Texas.\n\"We don't comment on rumors,\" a Google spokeswoman told Business Insider, declining to comment further.\nThese commodities have become increasingly strained as data center development has boomed around the country.\nIn December, Business Insider revealed that Amazon had pulled back a $150 million cash advance it had pledged as part of a preliminary deal to anchor the project.\nFermi's CEO, Toby Neugebauer, told Business Insider that although Amazon had reclaimed its advance, the negotiations for it to take space with Fermi were still ongoing.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-09T19:33:44Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NTA=",
      "url": "https://www.businessinsider.com/russia-economy-venezuela-oil-investment-us-push-russian-companies-out-2026-2",
      "title": "Russia says the US is pushing its companies out of Venezuela's energy sector",
      "summary": "The administration of Russian President Vladimir Putin faces uncertainty over its ties with Venezuela following the US military operation in January.\nThe administration of Russian President Vladimir Putin faces uncertainty over its ties with Venezuela following the US military operation in January.\nImpact LinkRussia said the United States is pushing Russian companies out of Venezuela's energy sector.\nLavrov cited recent sanctions against Rosneft and Lukoil, as well as tariffs and restrictions on countries purchasing Russian oil, including India.\n\"Everywhere it is being said that Russian oil and Russian gas will be replaced by American oil and American liquefied natural gas,\" Lavrov said.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-06T06:59:19Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NTE=",
      "url": "https://www.bbc.com/news/articles/c0lx3e1w5y8o",
      "title": "Rare mosses reintroduced to Yorkshire to fight climate change",
      "summary": "\"We want to try to produce the diversity of plant life there because the more diversity we have, the more resilient they're going to be through climate change and if we can bring back these species that have been lost we can see if we will get resilient habitats that will survive the next 100, 1,000 or millennia in these places.\"",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2026-02-08T09:04:47Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NTI=",
      "url": "https://www.androidcentral.com/phones/i-want-a-phone-i-can-actually-fix-and-fairphones-record-growth-shows-the-world-does-too",
      "title": "I want a phone I can actually fix, and Fairphone’s record growth shows the world does too",
      "summary": "What you need to knowFairphone has posted 83.7% YoY growth in Q4 2025, even as major brands deal with rising costs and supply shortages.\nThe company is on pace for $500 million in sales and over one million devices sold.\nWhile the smartphone industry focused on faster upgrades and flashy features, Fairphone is going against the trend and finding success.\nWhile big brands face higher component costs and supply shortages, the Dutch company reported an impressive 83.7% year-on-year growth in Q4 2025.\nThe company is on track to reach $500 million in total sales and sell over one million devices since it started.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-09T17:22:44Z",
      "source": "Android Central"
    }
  },
  {
    "article": {
      "id": "NTM=",
      "url": "https://hardware.slashdot.org/story/26/02/08/0430252/are-big-techs-nuclear-construction-deals-a-tipping-point-for-small-modular-reactors",
      "title": "Are Big Tech's Nuclear Construction Deals a Tipping Point for Small Modular Reactors?",
      "summary": "Different all twisty a of in maze are you, passages little.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-08T04:35:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "NTQ=",
      "url": "https://www.npr.org/2026/02/09/nx-s1-5707217/somali-asylum-cases-rescheduled",
      "title": "Immigration courts fast-track hearings for Somali asylum claims",
      "summary": "Immigration courts fast-track hearings for Somali asylum claimstoggle caption Charles Rex Arbogast/APDozens of asylum cases filed by Somali migrants in immigration courts were suddenly rescheduled and recategorized over the weekend, according to four lawyers interviewed by NPR.\nPresident Trump's rhetoric toward Somali immigrants, as well as his administration's emphasis on deportations, raises concern that the notices represent the first step toward the removal without due process of Somali asylum applicants in the country.\nDifferent types of hearingsThere are generally two kinds of hearings in immigration court: master calendar and individual merits hearings.\nLast spring, a memo sent to EOIR staff encouraged immigration judges to deny \"legally deficient asylum cases without a hearing.\"\nHe characterized Somali immigrants as \"garbage\" during a Cabinet meeting in early December, adding, \"they contribute nothing.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-09T17:41:01Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTU=",
      "url": "https://uk.news.yahoo.com/trump-border-tsar-warned-immigration-215021755.html",
      "title": "Trump’s border tsar warned immigration crackdown would upset public",
      "summary": "Donald Trump’s border tsar warned months ago that the administration’s aggressive and sweeping immigration crackdown risked losing public support.\nIn a June 16 interview for NBC, published for the first time on Monday, Mr Homan said: “I think the vast majority of the American people think criminal illegal aliens need to leave.\nIn the face of cross-party and nationwide outcry following the deaths of Renee Good and Alex Pretti, both 37, Mr Trump pledged to “de-escalate”.\nHe replaced Mr Bovino, the hardline “commander at large” of Border Control who had been leading the immigration operation in the city, with Mr Homan to diffuse the tensions and scale back its most aggressive tactics.\nThere has been a 2,450 per cent increase in the number of people with no criminal record being held in ICE detention, according to a new report by the American Immigration Council.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-02-09T21:50:21Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTY=",
      "url": "https://www.bbc.com/news/articles/cy9y3n43192o",
      "title": "Number of homeless refugees in England soars, BBC has found",
      "summary": "Once an asylum seeker is given refugee status they have 28 days to move out of government-funded accommodation - usually a house in multiple occupation (HMO) or a hotel - and find their own housing.\nAt the same time, they must find work or, if necessary, apply for universal credit.",
      "category": "immigration",
      "bias": "lean right",
      "publishedAt": "2026-02-06T00:05:26Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NTc=",
      "url": "https://www.yahoo.com/news/articles/leadership-changes-minnesota-tensions-among-182440908.html",
      "title": "Leadership changes in Minnesota follow tensions among agencies over immigration enforcement tactics",
      "summary": "In Congress, the Department of Homeland Security is increasingly under attack by Democrats who want to rein in immigration enforcement.\n“In targeted enforcement operations, we go out there.\nThe Border Patrol does.”The Border Patrol's high-profile raids, including a helicopter landing on the roof of a Chicago apartment building that involved agents rappelling down, rankled ICE officials.\nMany were replaced by current or retired officials from CBP, the Border Patrol's parent agency.\nHoman's arrival in Minnesota and his emphasis on “targeted enforcement” mark a subtle but unmistakable shift, at least in tone.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-02-06T18:24:40Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTg=",
      "url": "https://www.yahoo.com/news/articles/us-moves-deport-5-old-200241547.html",
      "title": "US moves to deport 5-year-old detained in Minnesota",
      "summary": "By Jasper WardWASHINGTON, Feb 6 (Reuters) - The U.S. Department of Homeland Security said on Friday it is seeking to deport ​a 5-year-old Ecuadorean boy who was detained in Minnesota last month.\n\"These are regular removal proceedings,\" ⁠department spokesperson Tricia McLaughlin ‌said, adding, \"This is standard procedure and there is nothing retaliatory about enforcing the nation’s immigration laws.\"\nLawyers for Liam and ‍the Department of Justice did not immediately respond to requests for comments.\nThe Trump administration defended the move, with the Department of Homeland Security accusing Conejo Arias of being in the U.S. illegally, without providing additional details.\nAdvertisement AdvertisementProtests have ⁠erupted across Minnesota in opposition to the deployment of immigration agents, who have fatally ‌shot two U.S. citizens in the state.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-02-06T20:02:41Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTk=",
      "url": "https://www.npr.org/2026/02/06/nx-s1-5701432/minneapolis-ice-air-deportation-flights",
      "title": "Minneapolis now has daily deportation flights. One man has been documenting them",
      "summary": "Federally chartered deportation flights on ICE Air, as the Department of Homeland Security calls it , aren't new.\nBut in Trump's second term, their frequency and scope has essentially doubled, according to ICE Flight Monitor, an advocacy initiative that keeps watch.\ntoggle caption Jaida Grey Eagle\"It's just happening in the background,\" says Benson, motioning to the rest of the airport.\nBut in recent months, he's started tracking these ICE flights in and out of Minneapolis, counting the people loaded on as they are forced to leave the state.\ntoggle caption Jaida Grey EagleHe says sometimes the weight of what he's witnessing each day catches up with him.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-06T10:00:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NjA=",
      "url": "https://www.bbc.com/news/videos/c86v6p1djvqo",
      "title": "ICE protester speaks out after White House shared fake arrest image",
      "summary": "US civil rights lawyer and activist Nekima Levy Armstrong says she was \"disgusted\" after the White House posted an image of her arrest which was edited to show her in tears.\nShe was detained for organising a protest against Immigration and Customs Enforcement (ICE) in a Minnesota church last month.\nBBC Verify's Jake Horton spoke to Levy Armstrong about the manipulated image and the backlash she has faced.\nProduced by Tom Joyner.\nGraphics by Mark Edwards.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-07T23:59:43Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NjE=",
      "url": "https://abcnews.go.com/US/judge-orders-3-families-returned-us-after-finding/story?id=129897419",
      "title": "Judge orders 3 families returned to US after finding agents used 'lies' to deport them",
      "summary": "Judge orders 3 families returned to US after finding agents used 'lies' to deport themIn this Aug. 26, 2011, file photo, the Homeland Security logo is seen shortly before a press conference at FEMA headquarters in Washington, D.C.\nIn this Aug. 26, 2011, file photo, the Homeland Security logo is seen shortly before a press conference at FEMA headquarters in Washington, D.C.\nIn this Aug. 26, 2011, file photo, the Homeland Security logo is seen shortly before a press conference at FEMA headquarters in Washington, D.C.\nIn the eight-page ruling, Judge Sabraw found that the government's removal of the families rendered the protections of the settlement \"illusory.\"\nA spokesperson with the Department of Homeland Security did not immediately respond to a request for comment from ABC News.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-06T22:17:53Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NjI=",
      "url": "https://www.npr.org/2026/02/06/nx-s1-5703603/court-records-chicago-immigration-raid-was-about-squatters-not-venezuelan-gangs",
      "title": "Court records: Chicago immigration raid was about squatters, not Venezuelan gangs",
      "summary": "Court records: Chicago immigration raid was about squatters, not Venezuelan gangstoggle caption Sergio Martínez-Beltrán/NPRNewly revealed arrest records show that a high-profile immigration raid on a South Shore Chicago apartment building last year that became a symbol of President Trump's harsh immigration tactics actually targeted squatters, not Venezuelan gang members.\nOn multiple occasions, the Trump administration has said the building was frequented by members of Tren de Aragua, a Venezuelan gang.\nSponsor MessageBut arrest records for two of the men show the government's stated reason for the raid was to take out squatters, not gang members.\n\"They have no legal authority to be addressing purported squatters; that is not within the purview of the federal government.\"\nNPR went inside the building days after the raid and found it dilapidated, with graffiti on walls and doors.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-06T10:19:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NjM=",
      "url": "https://www.yahoo.com/news/articles/ukrainian-shelling-causes-serious-damage-000632794.html",
      "title": "Ukrainian shelling causes 'serious damage' in Russia's Belgorod, governor says",
      "summary": "Feb 6 (Reuters) - Nighttime shelling by Ukraine inflicted \"serious damage\" in the Russian city of Belgorod, near the border, the region's governor said ​early on Friday.\nAdvertisement Advertisement\"The enemy has shelled the civilian city of Belgorod.\nIn his morning address, Gladkov said the works to restore electric power supply continue.\n\"As of today, we have not ‍been able to fully ⁠restore electricity supply in Belgorod,\" he said.\nAdvertisement AdvertisementUkrainian forces have regularly attacked Belgorod and nearby parts of the region since Russia's February 2022 invasion ⁠of its smaller neighbour.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-06T00:06:32Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NjQ=",
      "url": "https://www.aljazeera.com/news/2026/2/6/nothing-retaliatory-us-seeks-deportation-of-5-year-old-liam-conejo-ramos",
      "title": "‘Nothing retaliatory’: US seeks deportation of 5-year-old Liam Conejo Ramos",
      "summary": "Lawyers for the Ecuadorian asylum seeker have speculated the Trump administration is seeking ‘retaliatory’ actions.\nThe United States Department of Homeland Security (DHS) has revealed it will continue to seek the deportation of five-year-old Liam Conejo Ramos and his father Adrian Conejo Arias, after their recent return to Minnesota.\nPhotos went viral of Conejo Ramos standing in the snow, dressed in floppy blue bunny ears, with an immigration agent grabbing onto his Spiderman backpack.\nThe detention of Conejo Ramos and his father had been among the high-profile flashpoints during the crackdown.\nConejo Ramos and his father arrived in the US from Ecuador.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-02-06T23:13:30Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NjU=",
      "url": "https://www.npr.org/2026/02/07/nx-s1-5704785/state-department-trump-posts-x",
      "title": "State Department will delete X posts from before Trump returned to office",
      "summary": "State Department will delete X posts from before Trump returned to officetoggle caption Anna Moneymaker/Getty ImagesThe State Department is removing all posts on its public accounts on the social media platform X made before President Trump returned to office on Jan. 20, 2025.\nThe posts will be internally archived but will no longer be on public view, the State Department confirmed to NPR.\nThe removal of State Department X posts from public view appears to be less about ideological differences with past statements and more about control of future messaging.\nSome current and former State Department employees as well as academics worry that it will make the historical record of the government's communications and actions harder to trace.\nThe State Department also has publicly available archived versions of its website under previous administrations dating back to President Bill Clinton.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-07T10:00:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NjY=",
      "url": "https://www.yahoo.com/entertainment/videos/lavrov-slams-french-diplomacy-pathetic-104500396.html",
      "title": "Lavrov Slams French Diplomacy as \"Pathetic\" After Macron Adviser's Moscow Visit",
      "summary": "The boys dig into some of the most disappointing Designated Player signings in MLS history, from Rafa Márquez’s chaos years to the underwhelming impacts of Olivier Giroud, Xherdan Shaqiri, and Lorenzo Insigne.\nThen it’s off to the Premier League, reacting to Liverpool’s heated loss to Manchester City — was the red card fair, and what does City’s win mean for Arsenal as the title race tightens?\nFinally, the crew breaks down Mauricio Pochettino telling Timothy Weah to “keep quiet” about World Cup ticket prices and what that moment says about power, pressure, and transparency in the modern game.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-02-06T10:45:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Njc=",
      "url": "https://www.bbc.com/news/articles/cvgpgnw5dnro",
      "title": "Universities told to report foreign interference on campus to MI5",
      "summary": "Meawhile, in November BBC News reported how a campaign of harassment and intimidation took place at Sheffield Hallam University in an attempt to shut down an academic's research into allegations of forced labour among Uyghur Muslims in the Xinjiang region of China.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-09T00:03:49Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Njg=",
      "url": "https://www.bbc.com/news/articles/cz9v9d0xj8qo",
      "title": "Foreign Office to review Mandelson's US ambassador pay-off",
      "summary": "However, he is believed to have been given an exit payment equivalent to three months' salary according to the Times.\nWhile his salary as US ambassador has not been disclosed, the post typically has a salary of £155,000-£159,999.\nThis would put a three months' pay-out at around £40,000.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-02-07T22:10:09Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Njk=",
      "url": "https://www.aljazeera.com/opinions/2026/2/6/trumps-america-first-doctrine-is-remaking-global-diplomacy",
      "title": "Trump’s America First doctrine is remaking global diplomacy",
      "summary": "His political trajectory and election as President of the United States were unprecedented.\nCritics dismiss the Trump Doctrine as nothing more than a chaotic combination of isolationism, dismantlement of multilateralism, and imperialism.\nAt its core, the Trump Doctrine rests on two strategic pillars designed to secure peace through strength and prosperity through leverage.\nAdvertisementIt is essential to consider the Trump Administration’s global foreign policy achievements and objectives through a broad lens, recognising them as part of a deliberate and coherent strategic doctrine.\nBoth Presidents put America First and carried a big stick, prioritising national power as the foundation of global influence and stability.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-06T11:21:05Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NzA=",
      "url": "https://www.theregister.com/2026/02/09/europe_sovereign_cloud_spend/",
      "title": "Europe set to treble sovereign cloud investment",
      "summary": "Worldwide sovereign cloud spending is forecast to hit $80 billion in 2026, up 35.6 percent from 2025.\nSpeaking to The Register, Rene Buest, Gartner senior director analyst, agreed geopolitics was a factor in European sovereign cloud decisions since January last year.\nA broader issue of strategic or economic sovereignty was influencing investment decisions to make local and regional cloud providers more competitive.\n\"But the AWS European Sovereign Cloud GmbH is a 100 percent subsidiary of Amazon Inc.\nIt claimed:\"These dedicated European subsidiaries maintain direct management and control over the AWS European Sovereign Cloud infrastructure and operations, and are led by EU citizens who are obligated to abide by European laws and to act in the best interest of the AWS European Sovereign Cloud.\"",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-09T14:12:08Z",
      "source": "Theregister.com"
    }
  },
  {
    "article": {
      "id": "NzE=",
      "url": "https://www.aljazeera.com/news/2026/2/8/saudi-arabia-slams-foreign-interference-in-sudan-after-deadly-rsf-attacks",
      "title": "Saudi Arabia denounces ‘foreign interference’ in Sudan after RSF attacks",
      "summary": "In a statement on Saturday, the Saudi Ministry of Foreign Affairs condemned “foreign interference” by “some parties” in Sudan, including the “continued influx of illegal weapons, mercenaries and foreign fighters” for the continuation of the nearly three-year-old war.\nThe Saudi Ministry of Foreign Affairs said on Saturday the deadly RSF attacks “are completely unjustifiable and constitute flagrant violations of all humanitarian norms and relevant international agreements”.\nSeparately, Saudi Arabia has also accused the UAE of backing the separatist Southern Transitional Council (STC) in Yemen.\nThe offensive resulted in a split in Yemen’s internationally-backed government, and prompted Saudi Arabia to launch deadly raids targeting the STC.\nThe UAE pulled out its troops from Yemen following the Saudi allegation, saying it supports Saudi Arabia’s security.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-08T07:34:12Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NzI=",
      "url": "https://abcnews.go.com/International/iran-us-reopen-nuclear-talks-oman-after-weeks/story?id=129907788",
      "title": "Iran and US to reopen nuclear talks in Oman after weeks of tension",
      "summary": "LONDON -- Negotiating teams from the United States and Iran are expected to meet on Friday in Oman, marking a reopening of nuclear talks following weeks of tensions and threats, as leaders in Tehran oversaw a deadly crackdown on widespread protests.\nOmani Foreign Ministry via AFP via Getty ImagesThe talks, which were expected to begin at 10 a.m. local time, followed weeks of escalating tension between the U.S. and Iran, fueled in part by massive protests that have roiled Iran.\nIran's foreign minister met with his Omani counterpart in Muscat on Feb. 6, ahead of Oman-mediated talks with the United States on the Islamic republic's nuclear program.\nThe Iranian foreign minister responded by saying the country's military had \"their fingers on the trigger.\"\nMembers of the Trump administration last held a series of nuclear talks with Iran in April and May 2025 in Oman.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-06T09:34:58Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NzM=",
      "url": "https://www.aljazeera.com/news/2026/2/7/israels-gaza-genocide-risks-global-order-leaders-warn-at-al-jazeera-forum",
      "title": "Israel’s Gaza genocide risks global order, leaders warn at Al Jazeera Forum",
      "summary": "Israel’s war on Gaza and ‘expansionist’ actions beyond are reshaping global politics and threatening stability outside the region, forum hears in Doha.\nIsrael’s genocide against Palestinians in Gaza and its geopolitical fallout reverberating across the Middle East and beyond have dominated the 17th Al Jazeera Forum in Doha.\nIsraeli threat to the Red SeaSomali President Hassan Sheikh Mohamud, also speaking at the forum, warned that Israel’s Gaza war and escalating tensions in the Red Sea are unfolding alongside a broader breakdown in the international system.\nPlacing the conflict within a wider geopolitical context, Mohamud warned that the foundations of global governance are weakening.\n“Key among the global concerns is the weakening of the established rules based on international order.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-07T10:22:51Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NzQ=",
      "url": "https://www.npr.org/2026/02/09/nx-s1-5706602/japan-takaichi-conservative-agenda-election-landslide",
      "title": "Japan's Takaichi to pursue conservative agenda after election landslide",
      "summary": "Japan's Takaichi to pursue conservative agenda after election landslidetoggle caption Keisuke Hosojima/Kyodo News/APSEOUL — Japan's first female Prime Minister, Sanae Takaichi, brought the ruling Liberal Democratic Party (LDP) its biggest electoral victory in its 71-year history, fueling her ambitions to pursue to a political agenda which she herself says could \"split public opinion.\"\nCharismatic Japanese leaders, including Takaichi's mentor former Prime Minister Shinzo Abe, have helped the LDP stage comebacks before.\nQuestions and criticisms remain about how Takaichi will pay for these priorities, given that Japan's government debt is more than 200% of GDP.\nTakaichi also restated at her press conference her intention to revise Japan's National Defense Strategy and related documents.\n\"This year marks 10 years since Prime Minister Shinzo Abe advocated a free and open Indo-Pacific,\" Takaichi told the press conference.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-09T13:13:38Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NzU=",
      "url": "https://www.npr.org/2026/02/09/nx-s1-5706515/china-media-tycoon-jimmy-lai-sentenced-20-years-hong-kong",
      "title": "China critic and former media tycoon Jimmy Lai sentenced to 20 years in Hong Kong",
      "summary": "China critic and former media tycoon Jimmy Lai sentenced to 20 years in Hong Kongtoggle caption Vincent Yu/APHONG KONG — Jimmy Lai, the pro-democracy former Hong Kong media tycoon and a fierce critic of Beijing, was sentenced on Monday to 20 years in prison in the longest punishment given so far under a China-imposed national security law that has virtually silenced the city's dissent.\n\"It signifies the total destruction of the Hong Kong legal system and the end of justice,\" he said.\nHong Kong leader John Lee said Lai's sentence demonstrated the rule of law, citing his serious crimes.\nHong Kong ranked 140th out of 180 territories in the press-freedom index compiled by media freedom organization Reporters Without Borders in 2025, far from its 18th place in 2002.\n\"Obviously, he has done nothing good for Hong Kong that could serve as a basis for his mitigation,\" he told reporters.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-09T07:52:28Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NzY=",
      "url": "https://www.aljazeera.com/opinions/2026/2/8/iran-us-talks-in-muscat-bought-time-not-a-deal",
      "title": "Iran-US talks in Muscat bought time, not a deal",
      "summary": "The first round of Iran-US talks in Muscat produced no breakthrough.\nWhen Iranian and American negotiators concluded several hours of talks in Muscat on February 6, publicly, neither side signalled any shift from its opening position.\nDiplomacy conducted under military escortThe most striking feature of the Muscat round was not what was said, but who sat in the room.\nConsider the sequence of events surrounding the Muscat round itself.\nThe Muscat talks did not fail.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-08T07:04:06Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "Nzc=",
      "url": "https://www.bbc.com/news/articles/c20z4254524o",
      "title": "South Korea: Official expelled from party for remark on 'importing' foreign women",
      "summary": "The Vietnamese Embassy in Seoul had condemned Kim's remarks, saying in a statement on Facebook that his words were \"not simply a matter of expression but a matter of values and attitudes towards migrant women and minority groups\".",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-02-09T09:45:29Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Nzg=",
      "url": "https://www.yahoo.com/news/articles/russia-says-man-suspected-shooting-074544244.html",
      "title": "Russia says man suspected of shooting top general has been flown to Moscow from Dubai",
      "summary": "His wife told a Russian war blogger on Sunday that Alexeyev ‌had regained consciousness and was able to talk.\nRussia said Ukraine was behind the shooting but Kyiv has denied involvement.\nRussian media showed masked FSB officers escorting a blindfolded ⁠man from a small jet in Russia in the ‌dark.\nOne, Viktor Vasin, was detained in Moscow, while another, Zinaida Serebritskaya, escaped to Ukraine, Russian investigators said.\n'SERIOUS BLOW'The GRU, like the FSB, is a vast and powerful Russian intelligence agency that includes sleeper agents abroad, special forces units and advanced cyber capabilities.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-08T12:49:07Z",
      "source": "Yahoo Entertainment"
    }
  }
]