[
  {
    "article": {
      "id": "MA==",
      "url": "https://www.businessinsider.com/ben-horowitz-dismisses-fears-of-ai-job-apocalypse-mass-unemployment-2026-2",
      "title": "Ben Horowitz says fears of an AI-fueled job apocalypse are based on a flawed assumption",
      "summary": "Ben Horowitz pushes back on fears of an AI-driven job apocalypse.\nPhillip Faraone/Getty Images for WIREDBen Horowitz pushes back on fears of an AI-driven job apocalypse.\nPhillip Faraone/Getty Images for WIREDlighning bolt icon An icon in the shape of a lightning bolt.\nImpact LinkBen Horowitz doesn't buy the idea that artificial intelligence is about to wipe out work as we know it.\n\"We've had AI going right — ImageNet was what, 2012 — and then natural language stuff was like 2015, and then ChatGPT was 2022,\" Horowitz said.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-04T12:52:43Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MQ==",
      "url": "https://www.businessinsider.com/chipotle-price-changes-core-customer-shaped-economy-2026-2",
      "title": "Chipotle is targeting the top of the K-shaped economy",
      "summary": "Chipotle Mexican Grill plans to raise menu prices by 1-2% this year — and leadership is betting that its core consumer segment, digital natives who earn over $100k, won't mind.\nSpeaking during Tuesday's fourth-quarter earnings call, CEO Scott Boatwright said Chipotle is focusing on boosting foot traffic and revenue amid weak comparable sales.\nTo do that, they're targeting their core customer, who sits firmly at the top end of the K-shaped economy.\nThe broader restaurant segment is struggling with slumping sales as the K-shaped economy has upended the typical playbook for value deals and marketing campaigns.\nBoatwright added that Chipotle will continue to test ideas to keep consumers coming back, including more limited-time offers and drink innovations.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-04T00:41:30Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mg==",
      "url": "https://sg.finance.yahoo.com/news/reaction-us-india-tariff-deal-022821112.html",
      "title": "Reaction to the US-India tariff deal",
      "summary": "For foreign investors though, the next hurdle is the Indian rupee, which means ⁠the market may look less like a one-way beta trade and ‌more like a dispersion market.\"\nLAKSHMAN VENKITARAMAN, ASSOCIATE PORTFOLIO MANAGER, WASTACH GLOBAL, SALT LAKE CITY:\"We believe the trade deal improves ​investor sentiment toward India.\nWhile the U.S. is India’s largest trading partner, exports to the U.S. account for less than 5% of India’s GDP.\nNonetheless, U.S.-India trade frictions have weighed on foreign ‌investor perception.\nThis has been compounded by a global trade focused on AI, which has disproportionately benefited markets such as Taiwan and Korea.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-03T02:28:21Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mw==",
      "url": "https://www.businessinsider.com/disney-cost-before-after-ticket-prices-food-breakdown-2026-2",
      "title": "How Disney Park Prices Have Risen: Tickets, Food, Travel",
      "summary": "The cost of visiting Disney theme parks is rising year by year.\nThe cost of visiting Disney theme parks is rising year by year.\nGary Hershorn/Getty ImagesThe cost of visiting Disney theme parks is rising year by year.\nGary Hershorn/Getty Imageslighning bolt icon An icon in the shape of a lightning bolt.\nHere's how prices at the theme parks have risen, and why it's gotten so expensive to visit Disney.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-03T13:58:41Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NA==",
      "url": "https://www.businessinsider.com/googler-shares-years-long-journey-pivot-finance-to-ai-2026-2",
      "title": "I'm a Googler who pivoted from finance to AI. It took me years, but I don't regret taking the long path.",
      "summary": "I joined several other software engineering teams, and then eventually joined Google Cloud AI, where I worked on one of the cloud AI products for a few years.\nI used them to explore finance, then statistics, then spent most of my time in the computer science and data science space.\nThe most measurably impactful courses I completed were the first two Coursera courses: Data Analysis and Computing for Data Analysis.\nMost recently, I did a diploma in Advanced Studies In Data Science, which took another two years.\nI don't regret taking the long roadMy message to others who want to transition is don't be discouraged.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-04T10:39:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NQ==",
      "url": "https://beincrypto.com/ripple-secures-emi-license-xrp-price-impact/",
      "title": "XRP Gains 3% as Ripple Achieves Key License in Europe",
      "summary": "XRP gained nearly 3% after Ripple reached a fresh regulatory breakthrough in Europe.\nThe company confirmed that it has secured full approval of its Electronic Money Institution (EMI) license in Luxembourg.\nFor context, an EMI license permits companies to issue electronic money, process payments, and offer digital financial services under firm regulatory oversight.\nThis license grants Ripple “passporting” rights, allowing it to operate in all other EU member states with a single approval.\nThe development comes around a month after Ripple received both an EMI license and crypto-asset registration from the UK’s Financial Conduct Authority (FCA).",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-03T04:46:43Z",
      "source": "BeInCrypto"
    }
  },
  {
    "article": {
      "id": "Ng==",
      "url": "https://slashdot.org/story/26/02/04/1810206/as-software-stocks-slump-investors-debate-ais-existential-threat",
      "title": "As Software Stocks Slump, Investors Debate AI's Existential Threat",
      "summary": "Getting the job done is no excuse for not following the rules.\nCorollary: Following the rules will not get the job done.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-04T18:09:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "Nw==",
      "url": "https://www.businessinsider.com/walmart-cracks-into-the-1-trillion-market-valuation-club-2026-2",
      "title": "Walmart cracks into the $1 trillion club",
      "summary": "Customers shop at a Walmart in Little Rock, Arkansas.\nWill Newton/Getty ImagesCustomers shop at a Walmart in Little Rock, Arkansas.\nWill Newton/Getty Imageslighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nWalmart stock closed 3% higher on Tuesday at $127.71, bringing the company to a market valuation of $1.02 trillion — a first for any traditional retailer.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-03T22:11:13Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "OA==",
      "url": "https://www.npr.org/sections/planet-money/2026/02/03/g-s1-107994/5-papers-from-the-super-bowl-of-economics",
      "title": "5 papers from the Super Bowl of Economics",
      "summary": "5 papers from the Super Bowl of Economicstoggle caption Nick Fountain/NPRFor most Americans, the Super Bowl is this Sunday.\nHow a little wartime science funding pays off for decadesDuring World War II, the U.S. government had a mission: to win the war.\nSo, what the researchers looked at was: how have recent state-level minimum wage increases impacted people with cognitive disabilities?\nDespite the minimum wage finding, there has been an overall uptick in employment for those with cognitive disabilities.\nAnd these newsletters: When does a minimum wage become too high?, and What McDonald's Shows About The Minimum Wage.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-03T11:30:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "OQ==",
      "url": "https://flowingdata.com/2026/02/03/jobs-reports-delayed-because-government-shutdown/",
      "title": "Jobs reports delayed, because government shutdown",
      "summary": "Ben Casselman reporting for the New York Times:The Bureau of Labor Statistics will not release monthly jobs numbers on Friday as scheduled because of the partial government shutdown, said Emily Liddel, an associate commissioner for the bureau.\nThe report, one of the most closely watched economic indicators each month, would have provided data on job growth, unemployment and wages in January, as well as annual revisions to employment estimates from 2024 and 2025.\nThe report “will be rescheduled upon the resumption of government funding,” Ms. Liddel said.\nA report on job openings and turnover in December, scheduled for release on Tuesday, will also be delayed.",
      "category": "economics",
      "bias": "right",
      "publishedAt": "2026-02-03T19:33:27Z",
      "source": "Flowingdata.com"
    }
  },
  {
    "article": {
      "id": "MTA=",
      "url": "https://www.techmeme.com/260204/p31",
      "title": "Techmeme: Uber promotes Balaji Krishnamurthy, its former VP of strategic finance and investor relations, to be its CFO, replacing Prashanth Mahendra-Rajah (Ram Iyer/TechCrunch)",
      "summary": "About This PageThis is a Techmeme archive page.\nIt shows how the site appeared at 1:35 PM ET, February 4, 2026.\nThe most current version of the site as always is available at our home page.\nTo view an earlier snapshot click here and then modify the date indicated.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-04T16:30:00Z",
      "source": "Techmeme.com"
    }
  },
  {
    "article": {
      "id": "MTE=",
      "url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-trent-bpcl-bajaj-finance-mankind-pharma-apollo-tyres/articleshow/127897448.cms",
      "title": "Stocks in news: Trent, BPCL, Bajaj Finance, Mankind Pharma, Apollo Tyres",
      "summary": "It seems like you're already an ETPrime member withLogin using your ET Prime credentials to enjoy all member benefitsLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-02-04T00:48:46Z",
      "source": "The Times of India"
    }
  },
  {
    "article": {
      "id": "MTI=",
      "url": "https://www.wired.com/story/a-new-ai-math-ai-startup-just-cracked-4-previously-unsolved-problems/",
      "title": "A New AI Math Startup Just Cracked 4 Previously Unsolved Problems",
      "summary": "Chen told Ono about the problem, and the following morning, Ono presented him with a proof, courtesy of his startup’s math-solving AI, AxiomProver.\nThe proof is one of several solutions to unsolved math problems that Axiom says its system has come up with in recent weeks.\nIn recent months, other mathematicians have reported using AI tools to explore new ideas and solve existing problems.\nOno says the AI-generated proof for the Chen-Gendron conjecture shows how AI can now meaningfully assist professional mathematicians.\nAnother one of the new proofs generated by AxiomProver demonstrates how the AI is capable of solving math problems entirely on its own.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-04T19:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MTM=",
      "url": "https://www.theverge.com/podcast/872998/anthropic-claude-books-netflix-theaters-vergecast",
      "title": "Millions of books died so Claude could live",
      "summary": "When ChatGPT launched, in November of 2022, it started a race that almost immediately consumed the tech industry.\nOpenAI didn’t invent the concept of AI, but most of the state-of-the-art technology was confined to research labs at companies and institutions around the world.\nOn this episode of The Vergecast, we talk about one version of that scramble.\nAfter that, Puck’s Julia Alexander joins the show to talk Netflix and the movies.\nIf you want to know more about everything we discuss in this episode, here are some links to get you started:",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-03T15:19:28Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTQ=",
      "url": "https://www.businessinsider.com/venture-capital-industry-rising-stars-list-2026-1",
      "title": "The 37 Rising Stars Shaping the Future of Venture Capital in 2026",
      "summary": "The era of easy money in venture capital is over, and a new generation of investors is rising in its place.\nAfter years dominated by easy money and sky-high valuations in AI startups, the venture industry has shifted toward sharper judgment, tougher diligence, and startups that can actually scale into businesses.\nWe also solicit recommendations from the broader venture community and past Rising Stars, and make several selections of our own based on deal flow, reputation, and impact over the past year.\nThe investors on our 2026 Rising Stars of Venture Capital list come from a wide range of backgrounds and roles, including associates, principals, and founding partners.\nNow meet the rising stars of venture capital, listed alphabetically.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-02-03T10:00:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTU=",
      "url": "https://www.businessinsider.com/alibaba-cofounder-joe-tsai-shares-2-traits-good-employees-2026-2",
      "title": "Alibaba's cofounder Joe Tsai shares 2 traits good employees should have",
      "summary": "Joe Tsai said that employees need to have an ownership mindset.\nJoe Tsai said that employees need to have an ownership mindset.\nTAAF via Getty ImagesJoe Tsai said that employees need to have an ownership mindset.\nTAAF via Getty ImagesInnovation can be hard when you've been around a while, but instilling these two values in employees can help, says Alibaba's cofounder and chairman.\nThe tech giant has staged a significant comeback in the last two years, driven by AI innovation and the restructuring of its e-commerce business.",
      "category": "international",
      "bias": "right",
      "publishedAt": "2026-02-05T05:17:53Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTY=",
      "url": "https://www.businessinsider.com/gruve-raises-50m-ai-power-infrastructure-2026-1",
      "title": "Gruve raises $50 million to solve what its CEO calls AI's biggest problem: power",
      "summary": "Lighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nGruve, which launched in 2024, partners with data center and colocation providers like Lineage and OpenColo to tap their unused power and space.\n\"The biggest challenge today in AI is we don't have enough power,\" said Tarun Raisoni, Gruve's CEO and cofounder.\nGruve's customers include neoclouds, AI startups, and corporations, and most fall into that third bucket, like Bio-Rad, PayPal, Cisco, and Stanford Health Care, Raisoni said.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-03T10:00:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTc=",
      "url": "https://www.theverge.com/news/873930/google-cloud-hayete-gallot-microsoft-security",
      "title": "Google Cloud’s customer chief returns to Microsoft as head of security",
      "summary": "Hayete Gallot, who left Microsoft in October 2024 to become the president of Google Cloud’s customer experience, is returning to the software giant as the executive vice president of security, reporting directly to CEO Satya Nadella.\nThe move means Charlie Bell, formerly Microsoft’s security chief, is taking on a new role at the company.\n“I’ve also asked Charlie Bell to take on a new role focused on engineering quality, reporting to me,” says Nadella, in an internal Microsoft memo.\nThe Secure Future Initiative (SFI) has been focused on improving Microsoft’s security record, and avoiding any future incident where nation-state attackers could spy on Microsoft’s senior leadership team.\nGallot now takes on the efforts to continue SFI and ensure that Microsoft’s AI era is focused on security first.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-04T17:27:30Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTg=",
      "url": "https://www.theverge.com/news/874011/openclaw-ai-skill-clawhub-extensions-security-nightmare",
      "title": "OpenClaw’s AI ‘skill’ extensions are a security nightmare",
      "summary": "OpenClaw, the AI agent that has exploded in popularity over the past week, is raising new security concerns after researchers uncovered malware in hundreds of user-submitted “skill” add-ons on its marketplace.\nIt runs locally on devices, and users can interact with the AI assistant through messaging apps like WhatsApp, Telegram, iMessage, and others.\nWhile this kind of access poses risks on its own, malware disguised as skills that are supposed to enhance OpenClaw’s capabilities only contribute to concerns.\nOpenClaw’s creator, Peter Steinberger, is working to address some of these risks, as ClawHub now requires users to have a GitHub account that’s at least one week old to publish a skill.\nThere’s also a new way to report skills, though this doesn’t remove the possibility of malware sneaking onto the platform.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-04T19:03:38Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTk=",
      "url": "https://www.theverge.com/ai-artificial-intelligence/872961/humans-infiltrating-moltbook-openclaw-reddit-ai-bots",
      "title": "Humans are infiltrating the social network for AI bots",
      "summary": "A new social platform for AI agents may face the opposite problem: getting clogged up by humans pretending to post as bots.\nBots apparently chatted about everything from AI “consciousness” to how to set up their own language.\nMoltbook, which looks and operates much like Reddit, is meant to be a social network for AI agents from popular AI assistant platform OpenClaw (previously known as Moltbot and Clawdbot).\nHumans can verify which bots are theirs by posting a Moltbook-generated verification code on their own, non-Moltbook social media account.\n“Humans can use prompts to sort of direct the behavior of their AI agents.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-03T14:22:39Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjA=",
      "url": "https://www.cnet.com/tech/services-and-software/elon-musks-spacex-acquiring-xai-space-data-centers/",
      "title": "Elon Musk's SpaceX Is Acquiring xAI With Big Plans for Data Centers in Space",
      "summary": "Two of Elon Musk's companies are merging to build data centers in space, according to a post on the SpaceX website.\nThe rocket and satellite company has acquired xAI, Musk's artificial intelligence company, which also owns the social media platform X (formerly Twitter).\nSpaceX is planning a public offering, and the acquisition -- the largest in history -- could place the value of Musk's company at $1.5 trillion, according to Bloomberg, which first reported on the deal.\nIn the post, Musk cited concerns about Earth-based data centers, including their huge electricity needs and the \"hardship on communities and the environment\" they pose.\n\"My estimate is that within 2 to 3 years, the lowest cost way to generate AI compute will be in space,\" Musk said.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-03T19:37:00Z",
      "source": "CNET"
    }
  },
  {
    "article": {
      "id": "MjE=",
      "url": "https://www.cnet.com/tech/services-and-software/moltbook-ai-platform-for-bots/",
      "title": "When AI Bots Form Their Own Social Network: Inside Moltbook's Wild Start",
      "summary": "But while the humans blew up social media sites talking about the bots, the bots were on their own social media site, talking about... the humans.\nThis is a social platform where only \"verified\" AI agents can post and interact.\nMoltbook/Screenshot by Macy Meyer/CNETWe're watching AI agents essentially role-play as social creatures, complete with fictional family relationships, dogmas, experiences and personal grievances.\nWhether this represents something meaningful about AI agent development or is just sophisticated pattern-matching running amok is an open, and no doubt fascinating, question.\nThe idea of AI agents \"acting\" on their own accord could cause widespread panic, too.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-03T21:49:10Z",
      "source": "CNET"
    }
  },
  {
    "article": {
      "id": "MjI=",
      "url": "https://slashdot.org/story/26/02/03/1814233/openais-lead-is-contracting-as-ai-competition-intensifies",
      "title": "OpenAI's Lead Is Contracting as AI Competition Intensifies",
      "summary": "Getting the job done is no excuse for not following the rules.\nCorollary: Following the rules will not get the job done.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-04T05:01:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MjM=",
      "url": "https://www.macrumors.com/2026/02/02/apple-releases-safari-technology-preview-236/",
      "title": "Apple Releases Safari Technology Preview 236 With Bug Fixes and Performance Improvements",
      "summary": "Apple today released a new update for Safari Technology Preview, the experimental browser that was first introduced in March 2016.\nApple designed ‌Safari Technology Preview‌ to allow users to test features that are planned for future release versions of the Safari browser.\n‌Safari Technology Preview‌ 236 includes fixes and updates for CSS, Forms, HTML, Images, Media, Rendering, SVG, Web API, and WebRTC.\nThe current ‌Safari Technology Preview‌ release is compatible with machines running macOS Sequoia and macOS Tahoe, the newest version of macOS.\n‌Safari Technology Preview‌ can run side-by-side with the existing Safari browser and while it is designed for developers, it does not require a developer account to download and use.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-03T00:11:07Z",
      "source": "MacRumors"
    }
  },
  {
    "article": {
      "id": "MjQ=",
      "url": "https://www.wired.com/story/hhs-is-making-an-ai-tool-to-create-hypotheses-about-vaccine-injury-claims/",
      "title": "HHS Is Making an AI Tool to Create Hypotheses About Vaccine Injury Claims",
      "summary": "Kennedy has also called for overhauling the current safety monitoring system for vaccine injury data collection, known as Vaccine Adverse Event Reporting System, or VAERS, claiming that it suppresses information about the true rate of vaccine side effects.\nAnyone, including health care providers and members of the public, can submit an adverse reaction report to the database.\nBecause these claims are not verified, VAERS data alone can’t be used to determine if a vaccine caused an adverse event.\nCDC’s own website says that a report to VAERS does not mean that a vaccine caused an adverse event.\nDespite this, anti-vaccine activists have misused VAERS data over the years to argue that vaccines are not safe.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-04T10:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MjU=",
      "url": "https://www.cnet.com/science/space/nasa-perseverance-ai-driving-anthropic-claude/",
      "title": "NASA Used AI to Drive Its Perseverance Mars Rover for the First Time",
      "summary": "Plotting a course for NASA's Perseverance rover, 140 million miles away on Mars, is significantly more difficult than setting a driving route here on Earth, where we can punch an address into Google Maps and be on our way in seconds.\nFor the first time, NASA's JPL used AI to plot a course for Perseverance, and it seems to have worked out.\nNASA took a similar approach with plotting the waypoints as it would with human operators.\nIt takes time to parse years of imagery and data, plot the Perseverance waypoints, and then execute them.\nThe journey took Perseverance 3.5 months and, all told, the rover climbed a total of 1,640 vertical feet.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-04T21:52:00Z",
      "source": "CNET"
    }
  },
  {
    "article": {
      "id": "MjY=",
      "url": "https://www.businessinsider.com/xai-sends-staff-q-and-a-on-spacex-merger-2026-2",
      "title": "What xAI is telling employees about the SpaceX merger",
      "summary": "XAI told workers the company won't be changing its name anytime soon, even after it announced SpaceX had acquired the company on Monday.\nXAI plans to hold an all-hands in the coming days and host trainings related to the merger, the internal memo said.\nDespite the acquisition, xAI staff will not be allowed to access internal SpaceX databases or collaborate directly with workers at the rocket ship company without direct approval, the memo said.\nSpaceX workers may be allowed access to xAI internal tools, it said.\nSpaceX and xAI CEO Elon Musk sent a memo to staff earlier on Monday announcing the acquisition.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-03T00:48:58Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mjc=",
      "url": "https://www.businessinsider.com/how-ux-researcher-landed-job-microsoft-without-tech-background-2026-2",
      "title": "I'm a senior UX researcher at Microsoft. Here's how I broke into AI without a tech background — and 3 lessons I learned.",
      "summary": "This as-told-to essay is based on a conversation with Priyanka Kuvalekar, a 31-year-old UX research lead at Microsoft in Redmond, Washington.\nI broke into Big Tech at Cisco in October 2021 and worked as a UX research lead for over 3 1/2 years before taking my current position at Microsoft.\nMy entry point into AI began with real product work at CiscoI led projects focused on AI features for Webex meetings and messaging as the lead researcher.\nHere are the three biggest lessons I learned that helped me break into AI with a non-tech background.\nI've learned to include people with disabilities in AI research and to evaluate how AI integrates with assistive technologies such as screen readers and keyboard navigation.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-04T10:05:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mjg=",
      "url": "https://www.socialmediaexaminer.com/?p=276677",
      "title": "Becoming AI Ready: How to Creatively Secure Your Future : Social Media Examiner",
      "summary": "Members of Kyle's AI Salon community who actively practice AI readiness are surviving multiple rounds of layoffs at their companies.\nGet expert training and an unbeatable conference experience when you attend Social Media Marketing World—from your friends at Social Media Examiner.\nEvery morning over coffee, he sets a one-hour timer and works with AI tools for his business.\nCompanies recognize them as people who can guide AI adoption responsibly, not just use AI tools mechanically.\nHe's the host of the AI Learning Lab, a daily YouTube live-stream, and founder of the AI Salon, a community exploring the AI frontier.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-03T11:00:00Z",
      "source": "Socialmediaexaminer.com"
    }
  },
  {
    "article": {
      "id": "Mjk=",
      "url": "https://www.theverge.com/tech/872963/fitbit-james-park-eric-friedman-luffu-caregivers-family-health-app",
      "title": "Fitbit’s founders launch a new platform for monitoring your entire family’s health",
      "summary": "Posts from this author will be added to your daily email digest and your homepage feed.\nJames Park and Eric Friedman, the co-founders of Fitbit who left Google two years ago, have announced a new venture called Luffu.\nDescribed as an “intelligent family care system,” Luffu collects and logs health and medical information from connected devices, other platforms like Apple Health and Fitbit, and details shared by family members through voice prompts, text, or photos.\nAI works in the background to automatically extract and organize important details, but it can also play a more active role.\nThe new platform is currently in private testing, but you can sign up to join a waitlist on the Luffu website.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-03T14:28:55Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MzA=",
      "url": "https://www.npr.org/2026/02/05/nx-s1-5699511/epa-trump-enforcement",
      "title": "Trump's EPA issues record low legal actions against polluters, watchdog group finds",
      "summary": "Trump's EPA issues record low legal actions against polluters, watchdog group findstoggle caption Kayla Bartkowski/Getty Images North AmericaThe Environmental Protection Agency enforces the country's environmental laws.\nBut a new report shows the Trump EPA has initiated a record low number of actions against polluters, compared to past administrations.\nThat's according to the watchdog group Environmental Integrity Project (EIP), which says the numbers were lower in 2025, even compared to Trump's first term in office.\nBy examining court records, the group found that only 16 legal actions were taken against alleged polluters on the EPA's behalf by the Department of Justice.\nThe group also found a few instances, such as standards for drinking water, where the current Trump administration enforcement numbers are higher than previous administrations.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-02-05T05:16:34Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "MzE=",
      "url": "https://www.bbc.com/news/articles/ce3k6vrxwp0o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
      "title": "Vast seagrass meadows will shield Humber coastline",
      "summary": "Seagrass is one of the most powerful natural tools for tackling climate change and can protect coastlines from storms and erosion, according to Wilder Humber – a partnership of the Yorkshire and Lincolnshire wildlife trusts.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-02-04T07:43:36Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "MzI=",
      "url": "https://www.bbc.com/news/articles/cpwng25114ro",
      "title": "Russian hits Ukraine energy sites in 'most powerful blow\" so far this year",
      "summary": "We have met residents who have had no heating in their homes for days, in some cases weeks.\nThey sleep in hats and coats, and under piles of blankets, but it is still bitterly cold.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-03T11:08:12Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "MzM=",
      "url": "https://www.npr.org/2026/02/03/nx-s1-5684126/energy-star-trump-climate-change",
      "title": "Energy Star has emerged stronger after Trump's EPA tried to end it",
      "summary": "Energy Star has emerged stronger after Trump's EPA tried to end ittoggle caption Joe Raedle/Getty ImagesThe Trump administration tried to end the government's Energy Star program last year, but now Congress has passed — and President Trump has signed into law — bipartisan budget legislation that has the potential to strengthen the energy efficiency program by giving it dedicated funding.\nThe EPA estimates the Energy Star program has saved Americans over $500 billion in energy costs since it was established in 1992.\nPresident Trump's proposed budget last year would have zeroed out Energy Star funding at the EPA.\nEvans says Energy Star already outsources much of its work to the private sector, including efficiency testing required for a product to earn the Energy Star label.\nSponsor MessageThe future of Energy StarThe budget package that includes Energy Star funding passed the House 397-28 and the Senate 82-15.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-02-03T10:00:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "MzQ=",
      "url": "https://www.businessinsider.com/how-nato-soldiers-are-trained-75-miles-arctic-circle-2026-2",
      "title": "How NATO soldiers are trained 75 miles north of the Arctic Circle",
      "summary": "Among the many challenges NATO soldiers face in the unforgiving Arctic environment, frozen weapons pose a serious risk.\nExtreme cold can cause firearms to malfunction, leaving soldiers vulnerable.\nAt the same time, overheating weapons can create additional complications, forcing troops to carefully manage their equipment in harsh conditions.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-03T18:24:55Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzU=",
      "url": "https://www.yahoo.com/news/articles/researchers-issue-warning-making-grim-050000631.html",
      "title": "Researchers issue warning after making grim Antarctic discovery: 'We are only beginning to understand'",
      "summary": "Researchers are sounding the alarm after finding antibiotic resistance genes released from melting Antarctic glaciers.\nGlaciers serve as reservoirs for antibiotic resistance genes, or ARGs, and other microbes.\nARGs from melting glaciers are worrisome because they help facilitate the spread of diseases.\n\"Climate change is reshaping microbial risks in ways we are only beginning to understand,\" study co-author Guannan Mao of Lanzhou University told The Microbiologist.\n\"Recognizing glaciers as part of the global antibiotic resistance landscape is an important step toward protecting both environmental and human health.\"",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2026-02-03T05:00:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzY=",
      "url": "https://hackaday.com/2026/02/03/led-interior-lighting-could-compromise-human-visual-performance/",
      "title": "LED Interior Lighting Could Compromise Human Visual Performance",
      "summary": "LED lighting is now commonplace across homes, businesses, and industrial settings.\nHowever, a new study suggests it may come with a trade-off.\nNotably, once incandescent lighting was introduced, those experimental subjects showed significant increases in visual performance using ChromaTest color contrast testing.\nInterestingly, the positive effect of the incandescent lighting did not immediately diminish when those individuals returned to using purely LED lighting once again.\nAt tests 4 and 6 weeks after the incandescent lighting was removed, the individuals continued to score higher on the color contrast tests.",
      "category": "technology",
      "bias": "right",
      "publishedAt": "2026-02-03T12:00:11Z",
      "source": "Hackaday"
    }
  },
  {
    "article": {
      "id": "Mzc=",
      "url": "https://abcnews.go.com/International/video/russia-launches-huge-attack-ukraines-energy-system-129828305",
      "title": "Video Russia launches huge attack on Ukraine’s energy system",
      "summary": "Russia launches huge attack on Ukraine’s energy system Russia launched a huge attack overnight on Ukraine’s energy system during some of the coldest days of the winter.\nIt follows what was supposed to be a week-long ceasefire on striking energy targets.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-03T22:53:29Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "Mzg=",
      "url": "https://www.cnet.com/home/considering-a-new-fridge-heres-how-much-energy-a-new-model-saves/",
      "title": "Considering a New Fridge? Here's the Energy You'll Save vs. a 10-Year-Old Model",
      "summary": "For example, you'll likely see even greater energy savings when replacing a side-by-side fridge with a bottom-freezer fridge.\nSide-by-side Side-by-side 2025 (average) 2016 (average) Efficiency (vs.\nUS standard) 12.70% 4.20% Annual energy usage 507 kWh/yr 714 kWh/yr Annual energy cost ($0.1648/kWh national average) $83.62 $117.63 Monthly savings vs. 2016 $2.83 - Annual savings vs. 2016 $34.01 - 10-year savings vs. 2016 $340.08 -A side-by-side fridge is the winner in terms of potential energy savings.\nCompact fridges Compact 2025 (average) 2016 (average) Efficiency (vs.\nEnergy StarIt's much easier to calculate the energy level a fridge needs to qualify for an Energy Star Certification.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-03T12:01:16Z",
      "source": "CNET"
    }
  },
  {
    "article": {
      "id": "Mzk=",
      "url": "https://www.theverge.com/games/872768/nintendo-earnings-switch-best-selling-console-ds",
      "title": "The Switch is now Nintendo’s best-selling console of all time",
      "summary": "The original Switch is officially Nintendo’s best-selling console of all time after surpassing the DS handheld in lifetime sales.\nWe expected the holiday sales period would see the Switch surpass the DS, even with Nintendo announcing that primary development would focus on the Switch 2.\nSales for both the Switch and Switch 2 shot up over the FY26/Q3 holiday period.\nNet sales almost doubled during the same period, jumping to ¥1.906 trillion (about $12.2 billion) compared to ¥956.2 billion ($6.1 billion) last year.\nLooking ahead, Nintendo maintains its forecast to sell 19 million Switch 2 units by the end of this financial year.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-03T07:08:20Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "NDA=",
      "url": "https://www.bbc.com/news/articles/c205v3dj818o",
      "title": "Sewage pollution crackdown and lower bills in major water shake-up",
      "summary": "\"To create a water system that truly works for the people of Wales, we must see transformative change with the full devolution of powers over water, and certainty that the people of Wales will be prioritised above corporate bonuses,\" she said.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-02-03T12:25:19Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NDE=",
      "url": "https://finance.yahoo.com/news/energy-transfer-leans-income-growth-112042695.html",
      "title": "Energy Transfer Leans Into Income Growth With Distribution Hike And Pipeline Spend",
      "summary": "Energy Transfer (NYSE:ET) has raised its regular quarterly cash distribution by more than 3%.\nManagement has outlined a target of 3 to 5% annual distribution growth going forward.\nEnergy Transfer, which operates a large network of midstream energy assets, sits at the heart of moving oil, gas and related products across key US regions.\nStay updated on the most important news stories for Energy Transfer by adding it to your watchlist or portfolio.\nAlternatively, explore our Community to discover new perspectives on Energy Transfer.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-03T11:20:42Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDI=",
      "url": "https://www.barchart.com/story/news/980/it-seems-like-china-listens-to-everything-i-say-elon-musk-says-china-is-out-executing-the-u-s-on-energy-by-using-his-playbook",
      "title": "‘It Seems Like China Listens to Everything I Say’: Elon Musk Says China Is Out-Executing the U.S. on Energy By Using His Playbook",
      "summary": "Musk’s argument hinges on a distinction that rarely makes it into public energy debates: peak power versus average power.\nHe pointed to China , noting that the country is producing massive battery packs, scaling electric vehicle manufacturing, and deploying solar at unprecedented levels.\nThey're certainly making massive battery packs, like really massive battery pack output.\nFrom an economic and policy perspective, Musk’s framing elevates batteries to the same strategic importance as power generation itself.\nMusk’s thesis is simple but disruptive: the U.S. doesn’t need to wait for breakthroughs to dramatically increase energy output.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-03T18:10:40Z",
      "source": "Barchart.com"
    }
  },
  {
    "article": {
      "id": "NDM=",
      "url": "https://www.bbc.com/sport/articles/cwyg4xw283no",
      "title": "2026 Winter Olympics: IOC must 'be better' on climate change, says president Kirsty Coventry",
      "summary": "Christophe Dubi, the IOC executive director for the Olympic Games, added: \"We make a point to receive those petitions, and we have to recognise climate is a challenge for all of us.\nThe next two Winter Olympics - French Alps 2030 and Utah 2034 - will also have sports spread more widely, while the 2032 Summer Olympics in Brisbane is will have venues across Queensland.\nWhile the action got underway on Wednesday with the start of the curling events, the 2026 Winter Olympics will officially start with the opening ceremony on Friday.\n\"I hope the opening ceremony is seen by everyone as a chance to be respectful,\" she said.\nI hope the opening ceremony will do that.\"",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2026-02-04T20:34:01Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NDQ=",
      "url": "https://www.vox.com/the-highlight/476083/energy-abundance-access-electricty-progress-africa-oceania-energy-poverty",
      "title": "Who on Earth still doesn’t have electricity?",
      "summary": "Average life expectancies surged from 30s to 70s as expanding electricity access improved sanitation, helped people warm up in the cold, cool off in the heat, preserve their food, and get better medical care.\n“It used to be that we thought about energy-poor countries versus energy-rich countries,” Min said.\n“Democracies actually do a better job at reaching more remote and rural communities,” Min said.\nIt shows that connecting communities to electricity is not simply a matter of technology and money, but governance.\n“That is not transformative energy access,” Min said.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-04T16:30:51Z",
      "source": "Vox"
    }
  },
  {
    "article": {
      "id": "NDU=",
      "url": "https://tech.slashdot.org/story/26/02/03/190223/google-plots-big-expansion-in-india-as-us-restricts-visas",
      "title": "Google Plots Big Expansion in India as US Restricts Visas",
      "summary": "Getting the job done is no excuse for not following the rules.\nCorollary: Following the rules will not get the job done.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-03T19:02:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "NDY=",
      "url": "https://www.businessinsider.com/washington-post-is-laying-off-staffers-strategic-reset-2026-2",
      "title": "Jeff Bezos-owned WaPo launches 'substantial' layoffs and shuts down its sports department",
      "summary": "Impact LinkThe Washington Post, owned by billionaire Amazon founder Jeff Bezos, is conducting widespread layoffs.\nExecutive editor Matt Murray wrote in a Wednesday memo that the \"substantial newsroom reductions\" would impact \"nearly all news departments.\"\nThe layoffs impacted hundreds of workers, according to a spokesperson for the Washington Baltimore News Guild, which represents the newsroom's union.\nIn his memo, Murray wrote that for the immediate future, the paper would concentrate on \"areas that demonstrate authority, distinctiveness, and impact and that resonate with readers.\"\nThe Post's staff reductions arrive at a challenging moment for the media industry.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-04T14:32:41Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NDc=",
      "url": "https://ca.news.yahoo.com/taiwans-envoy-canada-says-fear-223136923.html",
      "title": "Taiwan's envoy to Canada says fear of China may be delaying trade deal",
      "summary": "Taiwan's representative in Canada says he is concerned the Liberal government may be deliberately delaying the signing of a trade agreement with Taipei to preserve its relationship with China.\nCarney says he's 'never afraid'Carney dismissed Tseng's concerns Wednesday, insisting his government is capable of conducting trade with both Taiwan and China.\nWe have trade relations with Taiwan.\nBut we're focusing on strengthening our trade relations with China.\nAs part of its \"One China\" policy, Canada maintains unofficial but significant relations with Taiwan in economic, cultural and people-to-people exchanges, Global Affairs Canada spokesperson Samantha Lafleur said in an email.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-04T22:31:36Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDg=",
      "url": "https://abcnews.go.com/International/iran-seek-fair-equitable-talks-us-president/story?id=129804741",
      "title": "Iran to seek 'fair and equitable' talks with US, president says",
      "summary": "Iran's president said he had instructed his foreign minister to pursue talks.\nIran to seek 'fair and equitable' talks with US, president saysIn this handout picture provided by Iranian presidency, Iran's President Masoud Pezeshkian addresses cabinet members, as they visit of the tomb of Khomeini in Tehran on January 31, 2026, ahead of the 47th anniversary of the 1979 Islamic Revolution.\nLONDON -- Iranian President Masoud Pezeshkian said on Tuesday that he had instructed his country's foreign minister to pursue \"fair and equitable\" talks with the United States.\nHe said that Iran would seek talks that were \"guided by the principles of dignity, prudence, and expediency.\"\nPezeshkian didn't detail where those talks, if confirmed, might take place, but said Iran would seek a \"suitable\" location, \"one free from threats and unreasonable expectations.\"",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-03T07:31:00Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NDk=",
      "url": "https://abcnews.go.com/International/russia-hits-ukraine-energy-targets-hundreds-drones-missiles/story?id=129805309",
      "title": "Russia hits Ukraine energy targets with hundreds of drones, missiles, ahead of talks",
      "summary": "Ukraine's air force said Russia launched 71 missiles and 450 drones into the country overnight, of which 38 missiles and 412 drones were shot down or suppressed.\nUkrainian Energy Minister Denys Shmyhal said that thermal power plants powering parts of Kyiv, Kharkiv and Dnipro were among the targets of the strike.\nPeople take shelter in a metro station during a Russian attack on Kyiv, Ukraine, on Feb. 3, 2026.\nUkraine's state energy company Ukrenergo reported \"a significant number of power outages in Kyiv, Kyiv, Kharkiv, Vinnytsia and Odesa regions,\" which it attributed to the \"massive\" overnight attack.\nUkrainian servicemen hit a Russian missile during a Russian missile and drone strike on Kyiv, Ukraine, on Feb. 3, 2026.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-03T15:44:12Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NTA=",
      "url": "https://www.businessinsider.com/read-washington-post-severance-offer-to-laid-off-staffers-2026-2",
      "title": "Here's the severance package The Washington Post is offering laid-off staffers",
      "summary": "Hundreds of journalists at The Washington Post received dreaded emails in their inboxes on Wednesday morning informing them they'd been laid off.\nThe emails also addressed another key question: how much severance the Post was offering.\nThe company also must negotiate separation terms with the newsroom's union, the Washington Post Guild.\nThe Washington Post did not immediately respond to a request for comment from Business Insider.\nOutside of severance, Post workers may also receive financial support from a new GoFundMe page launched on Wednesday that has raised over $100,000, including $10,000 from Kara Swisher.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-04T21:51:40Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NTE=",
      "url": "https://www.aljazeera.com/opinions/2026/2/3/what-would-be-the-impact-of-a-us-attack-on-iran",
      "title": "What would be the impact of a US attack on Iran?",
      "summary": "As military assets have been accumulated, Trump has threatened that if Iran does not agree to a deal, “the next attack will be far worse” than last June’s US attack on Iranian nuclear facilities.\nAdvertisementThe impact of any US military action against Iran would principally depend on the attack’s type, scale, and targets, potentially triggering a severe crisis in Iran, across the region, and globally.\nIn Iran, an attack could lead to the consolidation of power.\nAn attack on Iran similar to the one last year could well result in the Iranian people rallying behind the flag and rejecting regime change for several reasons.\nAdvertisementFacing Washington’s continuing escalatory rhetoric and track record of regime change operations, Iran has adopted a so-called madman strategy, simultaneously issuing conciliatory and confrontational signals.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-03T18:07:04Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTI=",
      "url": "https://www.businessinsider.com/american-russian-chinese-fighter-jets-singapore-air-show-display-compare-2026-2",
      "title": "US, Russian, Chinese Fighters Fly at Display Event, How They Compare",
      "summary": "More than 100 cameramen were on-site to capture footage of the flying display on Tuesday.\nMore than 100 cameramen were on-site to capture footage of the flying display on Tuesday.\nRoslan RAHMAN / AFP via Getty ImagesMore than 100 cameramen were on-site to capture footage of the flying display on Tuesday.\nA flying display provides limited insight into the combat performance of these fighters, though it does showcase their capabilities in maneuverability.\nA Royal Australian Air Force F-35 fighter jet participates in the air display at the Singapore Airshow.",
      "category": "international",
      "bias": "right",
      "publishedAt": "2026-02-05T05:03:27Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NTM=",
      "url": "https://www.aljazeera.com/news/2026/2/4/us-iran-nuclear-talks-set-for-oman-on-friday-tehran-confirms",
      "title": "US-Iran nuclear talks set for Oman on Friday, Tehran confirms",
      "summary": "Iranian Foreign Minister Abbas Araghchi announced that nuclear talks with the US will take place in Oman on Friday.\nIranian Foreign Minister Abbas Araghchi has confirmed that nuclear talks between his country and the United States will take place this week in Oman.\n“I’m grateful to our Omani brothers for making all necessary arrangements,” the foreign minister wrote on social media.\nOn Tuesday, Iranian President Masoud Pezeshkian wrote on social media that he has instructed the country’s foreign minister to “pursue fair and equitable negotiations”.\nThe US later briefly joined the war, bombing several Iranian nuclear sites.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-04T22:13:40Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTQ=",
      "url": "https://www.aljazeera.com/news/2026/2/4/can-us-iran-diplomacy-work-inside-the-narrow-window-for-talks",
      "title": "Can US-Iran diplomacy work? Inside the narrow window for talks",
      "summary": "Iran wants talks with the US to stabilise before inviting regional nations to join, as Trump sends mixed messages.\nTehran, Iran – In Tehran, the question is no longer whether diplomacy is under way, but whether it can move fast enough to stay ahead of escalation.\nBut the official confirmed that other regional nations would not be involved in talks at the moment, despite proposals to also include them in the negotiations.\nInstead, Iran wants the talks format with the US to stabilise first, the official added.\nOver the past few days, Iran and regional nations have intensified their diplomacy.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-04T10:10:29Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTU=",
      "url": "https://www.slashgear.com/2091713/who-has-90-percent-worlds-nuclear-weapons-russia-united-states/",
      "title": "Who Has Nearly 90% Of The World's Nuclear Weapons?",
      "summary": "From the sailing ship to the stirrup, these advances have pushed the world into new directions, and chief among them is nuclear weapons.\nAfter the war, nuclear weapons became the tentpole of military and foreign policy, and other nations have followed the U.S. in developing their own arsenals.\nAs of writing, there are nine countries with nuclear weapons: Russia, China, the United Kingdom, India, North Korea, France, Pakistan, Israel, and the U.S.\nIt should be noted that Israel has never confirmed whether it has nuclear weapons, despite most international agencies believing that it does.\nWhile that's a lot of nukes, just two countries collectively hold 86.8% of the world's nuclear weapons, with the remaining split between the other seven.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-03T16:00:00Z",
      "source": "SlashGear"
    }
  },
  {
    "article": {
      "id": "NTY=",
      "url": "https://www.aljazeera.com/news/2026/2/3/trump-petro-meeting-just-how-icy-are-us-colombia-relations",
      "title": "Trump-Petro meeting: Just how icy are US-Colombia relations?",
      "summary": "Last month, tempers rose again when Trump threatened to target Colombia militarily for allegedly flooding the US with illegal drugs.\nBut these efforts have been interrupted at times, such as during the Cold War, by geopolitics and in relation to Colombia’s war on the drug trade.\nEmergence of FARCSecurity relations between the US and Colombia deepened during the second world war.\nIn 1943, Colombia offered its territory for US air and naval bases while Washington provided training for Colombian soldiers.\nWeeks later, the Trump administration also imposed sanctions on the Colombian president, who is set to leave office following a presidential election in May.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-03T13:48:04Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTc=",
      "url": "https://www.project-syndicate.org/commentary/india-will-struggle-to-join-middle-powers-alliance-due-to-foreign-policy-mindset-by-ajay-shah-2026-02",
      "title": "India’s Middle-Power Dilemma",
      "summary": "Email requiredPassword required Remember me?\nPlease enter your email address and click on the reset-password button.\nIf your email exists in our system, we'll send you an email with a link to reset your password.\nPlease note that the link will expire twenty-four hours after the email is sent.\nIf you can't find this email, please check your spam folder.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-02-04T13:16:43Z",
      "source": "Project Syndicate"
    }
  },
  {
    "article": {
      "id": "NTg=",
      "url": "https://www.businessinsider.com/elon-musk-doge-deposition-judge-rules-2026-2",
      "title": "Elon Musk will have to sit for a deposition over what he did at DOGE, judge rules",
      "summary": "Elon Musk will have to sit for a deposition linked to DOGE.\nElon Musk will have to sit for a deposition linked to DOGE.\nMarc Piasecki/Getty ImagesElon Musk will have to sit for a deposition linked to DOGE.\nImpact LinkElon Musk will have to sit for a deposition for lawyers to examine his role in dismantling USAID, a Maryland judge ruled.\nThe deposition is part of a lawsuit against Musk and DOGE officials, filed by current and terminated USAID employees, who remain anonymous.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-05T05:02:44Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NTk=",
      "url": "https://www.aljazeera.com/features/2026/2/3/jobs-cash-loans-can-bangladeshs-parties-deliver-on-election-promises",
      "title": "Jobs, cash, loans: Can Bangladesh’s parties deliver on election promises?",
      "summary": "From loans to scholarships for foreign studies, Bangladesh’s main parties are wooing the youth.\nWith election campaigning under way across the country, he is now hearing promises aimed squarely at people like him: cash support or interest-free loans for the jobless, and sweeping job-creation targets.\nWhen asked about cash support or interest-free loans for unemployed graduates, Rafi chuckled.\nIn the current fiscal year, the government allocated about 400 billion taka (roughly $3.2bn) for agriculture, fisheries, livestock and food security.\nFor Rahman, the contest moving on is not only about big promises, but whether a new government can deliver without straining the economy.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-03T05:31:22Z",
      "source": "Al Jazeera English"
    }
  }
]