[
  {
    "article": {
      "id": "MA==",
      "url": "https://www.cnn.com/2025/12/20/business/russia-economy-struggling-ukraine-war-intl",
      "title": "Russia’s economy is struggling. But that won’t bring Putin to the negotiating table for years",
      "summary": "But the gathering economic storm is unlikely to bring President Vladimir Putin to the negotiation table anytime soon to end the war in Ukraine.\n“Russian soldiers today are paid more than any Russian soldier in the history of Russian soldiers,” RUSI’s Connolly said.\nSome of Russia’s more deprived areas have experienced an uplift during the war, in part because of huge pay checks going to Russian soldiers and their families.\n“They (Russian oil producers) are rerouting oil exports through smaller Russian companies… That is all costing a lot of money,” she said.\nIf that is combined with stronger sanctions enforcement and increased pressure on India and China to stop buying Russian oil, the Kremlin could eventually change its calculus, she argued.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2025-12-20T08:00:00Z",
      "source": "CNN"
    }
  },
  {
    "article": {
      "id": "MQ==",
      "url": "https://www.investopedia.com/how-trump-can-turbocharge-the-global-economy-and-crush-inflation-11871221",
      "title": "There's One Thing Trump Could Do To Turbocharge The Global Economy And Crush Inflation",
      "summary": "There's no indication that tariffs will suddenly be removed, but the paper highlighted the extreme impact they've had on the global economy.\nPresident Donald Trump could invigorate the global economy and stamp out inflation quickly.\nThat's a boost of 0.5 percentage points per year, all while reducing inflation for U.S. consumers.\n\"One year after \"liberation day,\" the U.S. administration starts lowering U.S. tariffs back to the levels at end-2024.\"\nLiberation from \"Liberation Day\" would not only reinvigorate global trade, but would help household budgets for U.S. consumers.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2025-12-21T11:20:00Z",
      "source": "Investopedia"
    }
  },
  {
    "article": {
      "id": "Mg==",
      "url": "https://www.calculatedriskblog.com/2025/12/ten-economic-questions-for-2026.html",
      "title": "Calculated Risk: Ten Economic Questions for 2026",
      "summary": "1) Economic growth: Economic growth was probably close to 2% Q4-over-Q4 in 2025.\n3) Unemployment Rate: The unemployment rate was at 4.6% in November, up from 4.2% in November 2024.\nWill the core inflation rate decrease further in 2026, and what will the YoY core inflation rate be in December 2026?\nCurrently the FOMC is projecting the unemployment rate will decrease to the 4.3% to 4.4% range in Q4 2026.\nLong term, the BLS is projecting the overall participation rate will decline to 61.1% by 2034 due to demographics.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2025-12-21T13:21:00Z",
      "source": "Calculatedriskblog.com"
    }
  },
  {
    "article": {
      "id": "Mw==",
      "url": "https://www.businessinsider.com/economists-paint-a-complicated-picture-of-trumps-economic-outcomes-2025-12",
      "title": "Trump is touting a smaller trade deficit. Economists paint a more complicated picture.",
      "summary": "Ahead of the midterm elections, Trump is promoting reduced trade deficit and tariff revenue as economic successes.\nAhead of the midterm elections, Trump is promoting reduced trade deficit and tariff revenue as economic successes.\nJonathan Ernst/REUTERSAhead of the midterm elections, Trump is promoting reduced trade deficit and tariff revenue as economic successes.\n'\"Unlike the budget deficit, the trade deficit is meaningless,\" Winegarden added.\n\"Remember when I said 'tariff' — my favorite word is 'tariff,'\" Trump told a crowd in Pennsylvania, \"Tariffs are bringing us hundreds of billions of dollars.\"",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2025-12-22T12:34:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NA==",
      "url": "https://www.yahoo.com/news/articles/long-lines-food-pantry-inflation-100428499.html",
      "title": "Long lines at the food pantry: Inflation tests Trump’s base in Michigan",
      "summary": "CAPAC, Michigan, Dec 21 (Reuters) - On a recent snowy morning in a Trump-loving part of rural Michigan, three dozen cars idled outside a firehouse-turned-food pantry.\nLudwig said she had expected Trump to have made greater ​progress on inflation nearly a year into his presidency.\nBut now, persistent inflation is testing that pledge — and the patience of voters who helped put him in office.\nA dozen said they would still vote Republican, and three said they were unsure or did not share their voting plans.\nAdvertisement AdvertisementAdvertisement AdvertisementHe predicted Trump's tariffs would bring back high-paying manufacturing jobs and boost wages above the rate of inflation.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2025-12-21T10:04:28Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NQ==",
      "url": "https://finance.yahoo.com/news/trump-shook-global-trade-uncertainty-060313193.html",
      "title": "Trump shook up global trade this year; some uncertainty may persist in 2026",
      "summary": "His trade policies - and the global reaction to them - will remain front and ​center in 2026, but face some hefty challenges.\nSince then, European exporters and economies have broadly coped with the new tariff rate, thanks to various exemptions and their ability to find ⁠markets elsewhere.\nFrench bank Societe Generale estimated the total direct impact of the tariffs ‌was equivalent to just 0.37% of the region's GDP.\nWhat notably did not happen was the economic calamity and high inflation that legions of economists predicted would unfold from Trump's tariffs.\nThe International Monetary Fund, in fact, twice lifted its global growth outlook in the months following Trump's \"Liberation Day\" tariffs announcement ​in April as uncertainty ebbed and deals were struck to reduce the originally announced rates.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2025-12-22T06:03:13Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Ng==",
      "url": "https://www.yahoo.com/news/articles/trumps-economy-collides-reality-pennsylvania-130334158.html",
      "title": "Trump's 'A+++++' economy collides with the reality in a Pennsylvania city critical to the midterms",
      "summary": "“It's worse than ever,” the 67-year-old retiree, who relies on Social Security, said when asked about the economy.\nIn our world, trust me, it’s not an ‘A.’ To me, it’s an ‘F,’ ‘F,’ ‘F,’ ‘F,’ ‘F,’ ‘F.’”Agreement that prices are too highWith a population of roughly 125,000 people, Allentown anchors the Lehigh Valley, which is Pennsylvania's third-largest metro area.\nAdvertisement AdvertisementAdvertisement Advertisement“Every race here, all the time,” Allentown’s mayor, Democrat Matt Tuerk, recalled of the frenzied race last year.\nBut as attention shifts to next year’s midterms, Allentown cannot escape its place as a political battleground.\nHarris' nearly 2.7 percentage point win in the county was the tightest margin for a Democratic presidential candidate since 2004.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2025-12-20T13:03:34Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Nw==",
      "url": "https://finance.yahoo.com/news/bitcoin-hit-200-000-2026-043106493.html",
      "title": "Bitcoin Will Hit $200,000 In 2026 Thanks To This New Federal Reserve Program, Arthur Hayes Says",
      "summary": "Bitcoin (CRYPTO: BTC) is consolidating below $90,000, but BitMEX co-founder Arthur Hayes says the pause masks a powerful liquidity-driven move that could send the cryptocurrency to $200,000 in 2026.\nWhat Happened: In his latest essay, \"Love Language,\" Hayes argues the Federal Reserve's newly introduced \"Reserve Management Purchases\" (RMP) program is effectively a rebranded form of Quantitative Easing (QE).\nIn that environment, he believes hard assets such as Bitcoin and gold are the most effective hedges against currency debasement.\nHe also argues the traditional four-year Bitcoin cycle has been replaced by a \"permanent\" cycle of debt monetization.\nPrice Target: Hayes expects Bitcoin to reclaim $124,000 before accelerating toward $200,000 in 2026.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2025-12-22T04:31:06Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "OA==",
      "url": "https://www.bbc.com/news/articles/c99722j4lkgo",
      "title": "Trump says US is pursuing third oil tanker linked to Venezuela",
      "summary": "Trump says US is pursuing third oil tanker linked to Venezuela14 hours ago Share Save Vanessa Buschschlüter and Seher Asaf Share SaveWatch: Moment US intercepts a second oil tanker off VenezuelaThe US Coast Guard is still pursuing a vessel in international waters near Venezuela as tensions in the region escalate, President Donald Trump has confirmed.\n\"We're actually pursuing\" the tanker, Trump said on Monday.\nThe Trump administration has accused Venezuela of using oil money to fund drug-related crime, while Venezuela has described the tanker seizures as \"piracy\".\nLate on Saturday the US Coast Guard approached an oil tanker, which US officials said was not flying a valid national flag, the New York Times reported.\nThe Bella 1 is the third oil tanker to be targeted by the US in waters off Venezuela.",
      "category": "international",
      "bias": "right",
      "publishedAt": "2025-12-21T21:13:50Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "OQ==",
      "url": "https://hardware.slashdot.org/story/25/12/20/0733202/ev-battery-swapping-startup-that-raised-330-million-files-for-bankruptcy",
      "title": "EV Battery-Swapping Startup That Raised $330 Million Files for Bankruptcy",
      "summary": "I've got a bad feeling about this.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2025-12-20T17:34:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MTA=",
      "url": "https://finance.yahoo.com/video/25-shift-made-china-global-150807356.html",
      "title": "The 25-Year Shift That Made China a Global Superpower",
      "summary": "China's entry into the WTO in 2001 accelerated its rise as a global manufacturing and technology powerhouse, fueled export growth, and helped stabilize global demand during the financial crisis.\nAs China expanded Belt and Road investments, advanced in EVs and AI, and entered a sharper economic rivalry with the United States, its property slowdown and domestic inequality exposed new vulnerabilities.\nEnda Curran, Elizabeth Economy, and Afsaneh Beschloss explain China's past 25 years and what its next phase means for the global economy.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2025-12-20T15:08:07Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTE=",
      "url": "https://www.businessinsider.com/job-market-find-work-employment-hiring-slowdown-careers-2025-12",
      "title": "Job Market in 2025: Americans Struggled to Find Work, Trying to Cope",
      "summary": "Business Insider spoke with dozens of job seekers across generations in 2025, some of whom have been unemployed for more than a year.\nStill, through the frustration, they've also found ways to cope and connect with a community of fellow job seekers.\nGiving up on job goalsA challenging job market has forced some job seekers to confront the possibility that their goals and aspirations may be out of reach.\nHow job seekers are coping with the stress — and breaking throughSome job seekers Business Insider spoke with have leaned on others — including friends, family, professional contacts, and fellow job seekers — for support and solidarity during their job searches.\nValen's top advice for other job seekers: Reframe how you view the process — and lean on others along the way.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2025-12-21T09:53:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTI=",
      "url": "https://www.project-syndicate.org/commentary/powerful-headwinds-facing-global-economy-in-2026-by-kenneth-rogoff-2025-12",
      "title": "Expect Turbulent Asset Markets in 2026",
      "summary": "After three years of extraordinary returns, investors should start worrying about the inevitable crash that follows periods of sustained euphoria.\nOne might expect that, after three years of extraordinary returns, markets would start worrying about the inevitable crash that follows periods of sustained euphoria.\nHOLIDAY SALE: Save $25 on a Digital Plus subscription Our annual flagship magazine, PS Quarterly: The Year Ahead 2026, is here!\nMoreover, the negative impact of Trump’s tariff and immigration policies will be felt more acutely in 2026.\nAs markets begin to sense that growth is slowing, possibly accompanied by rising inflation, today’s euphoria could quickly fade.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2025-12-22T15:13:49Z",
      "source": "Project Syndicate"
    }
  },
  {
    "article": {
      "id": "MTM=",
      "url": "https://www.businessinsider.com/ai-security-gap-companies-researcher-sander-schulhoff-2025-12",
      "title": "AI is creating a security problem most companies aren't staffed to handle, says an AI researcher",
      "summary": "An AI security researcher says traditional cybersecurity teams aren't ready for how AI systems fail.\nAn AI security researcher says traditional cybersecurity teams aren't ready for how AI systems fail.\nCravetiger/Getty ImagesAn AI security researcher says traditional cybersecurity teams aren't ready for how AI systems fail.\nImpact LinkCompanies may have cybersecurity teams in place, but many still aren't prepared for how AI systems actually fail, says an AI security researcher.\nThe rise of AI security startupsSchulhoff also said that many AI security startups are pitching guardrails that don't offer real protection.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2025-12-22T05:29:35Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTQ=",
      "url": "https://www.businessinsider.com/healthcare-vc-predictions-2026-more-ai-acquisitions-few-ipos-2025-12",
      "title": "Healthcare VCs predict more AI transparency investment, private equity M&A, and a quiet year for IPOs in 2026",
      "summary": "2025 saw a welcome surge in healthcare venture funding as investors rushed to back top AI startups.\nTwo venture-backed digital health companies went public this year: Hinge Health in May, and Omada Health in June.\nAI behind the scenesThis year, investment surged for AI startups tackling administrative burdens for large health systems.\nVaughn Ridley/Sportsfile for Collision via Getty ImagesCautious IPO candidatesThere are a few healthcare companies that could be eyeing the exits next year.\nBut he's anticipating more M&A activity as interest rates come down and private equity buyers look for healthcare AI acquisitions in the VC world.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2025-12-22T10:00:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTU=",
      "url": "https://developers.slashdot.org/story/25/12/19/236259/stanford-computer-science-grads-find-their-degrees-no-longer-guarantee-jobs",
      "title": "Stanford Computer Science Grads Find Their Degrees No Longer Guarantee Jobs",
      "summary": "Please create an account to participate in the Slashdot moderation system",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2025-12-20T01:00:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MTY=",
      "url": "https://finance.yahoo.com/news/moore-threads-unveils-ai-chips-093000651.html",
      "title": "Moore Threads unveils new AI chips to challenge Nvidia",
      "summary": "Chinese chip designer Moore Threads Technology has unveiled a suite of new products, including its next generation of chip architecture and artificial intelligence chips as it looks to challenge US chip-making heavyweights Nvidia and AMD.\nThe launch marks Moore Threads' latest bid to challenge foreign rivals like Nvidia, and comes close on the heels of the company's blockbuster initial public offering on the Shanghai Stock Exchange on December 5.\nZhang Jianzhong, founder and CEO of Moore Threads, pictured in November 2023.\nPhoto: Handout alt=Zhang Jianzhong, founder and CEO of Moore Threads, pictured in November 2023.\nZhang, 59, an Nvidia veteran and former China market general manager who left to found Moore Threads in 2020, acknowledged that local AI developers had previously hesitated to use domestic chips to train their AI models, fearing subpar outcomes.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2025-12-21T09:30:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTc=",
      "url": "https://www.businessinsider.com/taiwan-needs-tech-industries-involved-in-drone-push-us-official-2025-12",
      "title": "Taiwan's drone push needs its powerhouse industries, former US commerce official says",
      "summary": "Taiwan's government has prioritized increasing investment in the development and use of drone systems.\nTaiwan's government has prioritized increasing investment in the development and use of drone systems.\nI-Hwa Cheng/AFPTaiwan's government has prioritized increasing investment in the development and use of drone systems.\nTo expand the sector, though, it needs to have its powerhouse industries fully engaged, a former US commerce official said recently.\nChina has also sanctioned some US defense companies involved in supporting Taiwan's drone industry.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2025-12-22T13:57:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTg=",
      "url": "https://www.businessinsider.com/yoshua-bengio-godfather-beautiful-human-ai-2025-12",
      "title": "Godfather of AI Shares Advice to His Grandson in the Age of AI: Be a 'Beautiful Human'",
      "summary": "\"Work on the beautiful human being that you can become,\" Bengio said.\n\"Work on the beautiful human being that you can become,\" Bengio said.\nANGELA WEISS/AFP via Getty Images\"Work on the beautiful human being that you can become,\" Bengio said.\nANGELA WEISS/AFP via Getty ImagesAs AI displaces jobs, one of the \"godfathers of AI\" shared the career advice he'd give to his 4-year-old grandson to prepare him for the future.\n\"Work on the beautiful human being that you can become.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2025-12-22T13:04:18Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTk=",
      "url": "https://www.cnet.com/tech/computing/we-may-not-know-how-strong-ai-humanoid-robots-really-are/",
      "title": "We May Not Know How Strong AI Humanoid Robots Really Are",
      "summary": "First in the spotlight is the robotics company Figure AI, which is facing a lawsuit from former safety engineer Robert Gruendel.\nThe lawsuit alleges the company's Figure 02 humanoid was shown in tests to be strong enough to \"fracture a human skull,\" and that Gruendel was fired after raising concerns.\nA recent lawsuit alleges the Figure 02 humanoid showed in testing was strong enough to \"fracture a human skull.\"\nEngine AI's T800 humanoid robot squares up.\nTaken together, these two parallel news stories raise questions about what kind of information humanoid robot developers should share so that the risks of this technology are properly understood.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2025-12-21T13:00:00Z",
      "source": "CNET"
    }
  },
  {
    "article": {
      "id": "MjA=",
      "url": "https://www.businessinsider.com/former-tesla-waymo-employee-leadership-lessons-from-elon-musk-2025-12",
      "title": "I worked at Tesla and Waymo. Here are the leadership lessons I bring to my startup.",
      "summary": "My friends and family were telling me it was a big career mistake to work at Tesla.\nJust because it's a flat org structure, doesn't mean it's a horizontal power dynamic.\nIt's a very vertical org structure.\nEven though it's a very vertical org structure, it's a horizontal power structure.\nAt Tesla, it was very clear that Elon and his lieutenants were driving a lot of the decisions.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2025-12-20T09:52:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjE=",
      "url": "https://www.businessinsider.com/yann-lecun-advice-ai-careers-computer-science-degree-2025-12",
      "title": "Yann LeCun's advice for young students wanting to go into AI",
      "summary": "Yann LeCun said if computer science majors don't spend their time wisely, they may find out their degree doesn't add up.\nLeCun, who teaches computer science at NYU, said during a recent podcast appearance that he jokes that he's \"a computer science professor arguing against studying computer science\" based on his push on where students should focus their time.\nThe former chief AI scientist at Meta said his advice is that students \"learn things with a long shelf life.\"\nDepending on the computer science program, not all of these skills may be baked into a degree.\nUniversities and computer science students continue to grapple with how to adapt their programs to the age of generative and increasingly agentic AI.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2025-12-22T09:03:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjI=",
      "url": "https://www.theatlantic.com/culture/2025/12/ai-music-suno-warner-bros/685331/",
      "title": "AI Is Democratizing Music. Unfortunately.",
      "summary": "The case against AI music feels, to many, intuitive.\nAnother problem: AI music tends to be, and I don’t know how else to put this, creepy.\nAversion to AI music is so widespread that corporate interests are now selling themselves as part of the resistance.\nThese developments will not end AI music, but they may slightly rein in the creative and copyright free-for-all, at least temporarily.\nBut the generative possibilities and consumer demand demonstrated in the brief history of AI music to date aren’t going to be forgotten.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2025-12-22T13:00:00Z",
      "source": "The Atlantic"
    }
  },
  {
    "article": {
      "id": "MjM=",
      "url": "https://www.androidcentral.com/phones/the-biggest-tech-stories-of-2025",
      "title": "From foldables to AI: How 2025 reshapes the smartphone landscape",
      "summary": "Trifold devices have arrived, ultra-thin designs are on the rise, and smart glasses are gaining popularity.\n(Image credit: Harish Jonnalagadda / Android Central)Essentially, making the form factor more valid and widely available to the broader smartphone market.\nTariffs, Tariffs and, more Tariffs(Image credit: Android Central)Well, all wasn't merry in the town of Tech.\nThat said, it created enough confusion for consumers and tech companies alike.\nGalaxy XR came built on Android XR, and with Google’s Gemini AI baked right in.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2025-12-20T19:15:00Z",
      "source": "Android Central"
    }
  },
  {
    "article": {
      "id": "MjQ=",
      "url": "https://www.businessinsider.com/gop-critics-trump-ai-preemption-policy-2025-12",
      "title": "Trump's AI policy is dividing his party. Here's what key GOP critics are saying about it.",
      "summary": "Trump signed an executive order earlier this month aimed at restricting states' ability to regulate AI.\nTrump signed an executive order earlier this month aimed at restricting states' ability to regulate AI.\nAlex Wong/Getty ImagesTrump signed an executive order earlier this month aimed at restricting states' ability to regulate AI.\nTrump's AI policy has been broadly friendly toward the industry.\nHere's what key GOP critics are saying about Trump's AI policy.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2025-12-20T10:59:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjU=",
      "url": "https://www.androidcentral.com/gaming/virtual-reality/xreal-deals-blow-to-viture-with-patent-victory-and-german-sales-ban",
      "title": "Xreal and Viture enter a patent battle in Europe, marking a milestone in XR",
      "summary": "What you need to knowA German court granted a temporary preliminary injunction on Viture’s smart glasses, citing Xreal's suit over hardware patents.\nAmazon listings for most of Viture's products remain available for purchase, and a final ruling is expected sometime after the New Year.\nNow, though, the rivalry between Xreal and Viture has shifted from product features to a legal battle.\nHowever, Viture products in those countries are still available for sale on Amazon as of this time of writing.\nXreal started preliminary injunction proceedings in September 2025 against both Viture Inc. and Eden Future.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2025-12-20T12:02:00Z",
      "source": "Android Central"
    }
  },
  {
    "article": {
      "id": "MjY=",
      "url": "https://www.yahoo.com/news/articles/analysis-chinas-power-reforms-global-230907043.html",
      "title": "Analysis-China's power reforms, global data centre buildout usher in battery boom",
      "summary": "The boom \"is one of the biggest surprises of the year, I think, in China's energy space.\"\nThe International Energy Agency forecasts global investment in battery storage facilities will rise 16% this year to $66 billion.\n\"U.S. AI data centre power demand is very robust, but power is the biggest bottleneck, and U.S. baseload power - gas, nuclear, thermal - they ‌won't grow much in the next five years.\"\nHowever, much of that battery storage capacity has sat idle because it was not profitable to operate.\nIt is \"the most decisive policy shift for energy storage in over ‌a decade\", Jefferies analyst Johnson Wan wrote in a note.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2025-12-21T23:09:07Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mjc=",
      "url": "https://www.yahoo.com/news/articles/government-research-exposes-culprits-behind-072000708.html",
      "title": "New government research exposes the culprits behind massive energy cost increases: 'Prices are expected to continue rising'",
      "summary": "U.S. energy prices are expected to continue to go up next year, according to new data from the Energy Information Administration.\nWhy are rising energy costs concerning?\nFor Americans already dealing with higher prices for things like groceries and rent, higher energy costs are a punch in the gut.\nOne way to help protect yourself from rising energy prices is to invest in solar.\nTCD's Solar Explorer is a great resource to help you make sense of all the options available.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2025-12-21T07:20:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mjg=",
      "url": "https://www.yahoo.com/news/articles/viewers-laugh-watching-test-run-131500076.html",
      "title": "Viewers laugh after watching test run of Japan's new high-speed train — here's what happened",
      "summary": "Reporters stood by waiting to catch a glimpse of Japan's fast high-speed train on the new Chuo Shinkansen rail line, and if any of them blinked, they missed it.\nAccording to SupercarBlondie, what the reporters witnessed was a test run for Japan's next-gen rail system, currently in development.\nThe railway will eventually connect from Tokyo to Osaka with a ride time of about an hour, compared to the roughly 2.5 hours it currently takes on conventional high-speed rail.\nThe top speed of a train on the Chuo Shinkansen line is 314 mph.\nAdvertisement AdvertisementAdvertisement AdvertisementWhen finished, the Chuo Shinkansen line will run about 286 kilometers (177 miles).",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2025-12-21T13:15:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mjk=",
      "url": "https://hardware.slashdot.org/story/25/12/21/2337215/google-launches-co2-battery-plants-for-long-duration-storage-of-renewable-energy",
      "title": "Google Launches CO2 Battery Plants for Long-Duration Storage of Renewable Energy",
      "summary": "Want to read Slashdot from your mobile device?\nPoint it at m.slashdot.org and keep reading!",
      "category": "environment",
      "bias": "lean right",
      "publishedAt": "2025-12-22T01:34:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MzA=",
      "url": "https://uk.finance.yahoo.com/news/underfloor-heating-energy-savings-wunda-060043188.html",
      "title": "'We've all grown up with radiators - underfloor heating is a no-brainer'",
      "summary": "Sam Jump, pictured with Wunda's pioneering Rapid Response underfloor heating system, is the grandson of the entrepreneurial founders.\nWhen entrepreneurs Charles and Josephine Pugh rented a property with \"uncomfortable and uncontrollable\" underfloor heating (UFH), it sparked a move away from the made-to-order furniture world they had been invested in since the late 1970s.\nThe Pughs’ home heating issue had centred on underfloor screed — a level layer of concrete where piping has traditionally been embedded into — with pipe centres too far apart.\nWith no controls, there was a slow response time to heat and the floor became too hot.\nWunda Group founders Charles and Josephine Pugh, left, with daughter Josephine and grandson Sam.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2025-12-21T06:00:43Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzE=",
      "url": "https://www.yahoo.com/news/articles/us-authorities-stunning-discovery-inside-190000778.html",
      "title": "US authorities make stunning discovery inside footwear shipment from overseas: 'It's done'",
      "summary": "U.S. authorities detected Cesium-137 contamination in footwear manufactured at a facility in the Cikande area of Banten.\nAdvertisement AdvertisementAdvertisement AdvertisementThis shoe problem adds to the export troubles Indonesia has already faced.\nWhen safety systems fail and handling protocols break down, workers face exposure risks, and entire communities can suffer.\nCustoms in the Netherlands found the radioactive problem in Indonesian sneakers before the shrimp issue became widely known.\nIf you buy products made overseas, you can check for safety recalls through the FDA's website or the Consumer Product Safety Commission.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2025-12-20T19:00:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzI=",
      "url": "https://www.windowscentral.com/gaming/a-kinect-style-console-outsold-xbox-and-nexs-ceo-breaks-down-the-strategy-that-made-it-a-surprise-hit-nintendo-expanded-the-audience",
      "title": "Why this Kinect-style console beat Xbox in sales",
      "summary": "You may or may not have heard of the Nex Playground, a small Kinect-inspired, Wii-like device that has made headlines after outselling Xbox hardware in the U.S. during November.\nThis is a particularly telling moment for console sales, given the impact of Black Friday and Cyber Monday.\nLikely helped by weaker Xbox performance overall due to its lack of sales, Nex Playground edged past Xbox Series X|S to claim third place in units sold for the month, I’m sure in part thanks to its $250 price tag.\nDavid Lee, CEO of NEXThe Nex Playground has since found success with younger audiences, offering games based on popular IP such as Bluey, Peppa Pig, Fruit Ninja, and more.\nGet the Windows Central Newsletter All the latest news, reviews, and guides for Windows and Xbox diehards.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2025-12-20T15:08:17Z",
      "source": "Windows Central"
    }
  },
  {
    "article": {
      "id": "MzM=",
      "url": "https://tech.yahoo.com/transportation/articles/aviation-startup-shares-incredible-video-090000938.html",
      "title": "Aviation startup shares incredible video of prototype EV's maiden takeoff flight: 'A major milestone'",
      "summary": "Austrian aviation company CycloTech recently began flight testing its personal electric vertical takeoff and landing — or eVTOL — aircraft prototype.\nIn a video documenting the flight, CycloTech chief technology officer Tahsin Kart said it took 11 months to bring the BlackBird from concept to first flight.\nAdvertisement AdvertisementAdvertisementThe BlackBird prototype uses six CycloRotors — four mounted horizontally and two vertically — to facilitate vertical takeoff and landing.\nAdvertisement AdvertisementAdvertisementSimilar to electric vehicles, eVTOL aircraft offer a promising path to more practical and efficient sustainable transportation.\nIn the wake of the successful demo flight, CycloTech said it is now accelerating its flight test program and refining the tech for use in the CruiseUp.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2025-12-22T09:00:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzQ=",
      "url": "https://www.space.com/space-exploration/satellites/satellites-reveal-heat-leaking-from-largest-us-cryptocurrency-mining-center",
      "title": "Satellites reveal heat leaking from largest US cryptocurrency mining center",
      "summary": "The image reveals the thermal footprint of a major Bitcoin-mining data center in Rockdale, Texas, which has been widely criticized for its electricity consumption and carbon footprint.\nThe satellite image reveals in a resolution of 11.5 feet (3.5 meters) where and how much heat leaks into the environment from the plant.\n\"Thermal data gives an objective view of operational activity as it occurs — not weeks later through reports or announcements.\"\nWith the newly released image, the company shows how satellites could keep an objective eye on a fast-growing and controversial sector.\nA labeled image taken from Earth satellite company SatVu.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2025-12-22T15:00:00Z",
      "source": "Space.com"
    }
  },
  {
    "article": {
      "id": "MzU=",
      "url": "https://www.scientificamerican.com/article/will-there-be-a-white-christmas-this-year-it-depends-on-where-you-live/",
      "title": "Will There Be a White Christmas This Year? It Depends on Where You Live",
      "summary": "Are you dreaming of a white Christmas?\nFor some of us in the U.S., it’s a lock; for others, the odds are sadly slim.\nAnd in many places, they are getting slimmer as global temperatures rise and winter weather gets wetter.\nBroadly, the first day of snow is falling later than it used to across the U.S., and the odds of a white Christmas are shrinking.\nAs for this year, current forecasts aren’t in favor of a snowy Christmas for most of the country.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2025-12-22T12:00:00Z",
      "source": "Scientific American"
    }
  },
  {
    "article": {
      "id": "MzY=",
      "url": "https://www.sciencedaily.com/releases/2025/12/251219093325.htm",
      "title": "Scientists found climate change hidden in old military air samples",
      "summary": "The research shows that moss spores are now released several weeks earlier than they were in the past, highlighting how quickly natural systems can adjust as the climate warms.\nAir sampling in Sweden began in the 1960s as part of efforts to monitor radioactive fallout from nuclear weapons testing.\nOn average, mosses now begin releasing spores about four weeks earlier than they did in 1990, and the peak of spore dispersal arrives roughly six weeks sooner.\nLast year's climate matters more than spring weatherThe findings point to warmer autumns as a key driver of the shift.\nBecause air samples have been collected from locations across Sweden, researchers can reconstruct ecological shifts over decades and compare trends from north to south.",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2025-12-21T06:10:14Z",
      "source": "Science Daily"
    }
  },
  {
    "article": {
      "id": "Mzc=",
      "url": "https://gothamist.com/news/ny-climate-advocates-celebrate-rare-good-news-in-gov-hochuls-gas-hook-up-veto",
      "title": "NY climate advocates celebrate rare good news after Gov. Hochul nixes gas hook-up rule",
      "summary": "Climate advocates in New York are celebrating some rare positive news after Gov.\nKathy Hochul signed a law that will likely curb the proliferation of new gas hook-ups statewide.\nIt meant developers of new homes could pass the cost of gas hook-ups to all utility customers, rather than pay for it themselves.\n“This is a massive win for New York’s gas customers, and for clean air and a livable climate.”The victory comes after a tough year for climate priorities in New York.\nBut according to the Public Utility Law Project the rule was adding $600 million a year to utility costs for all New York homeowners and renters.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2025-12-20T18:18:00Z",
      "source": "Gothamist"
    }
  },
  {
    "article": {
      "id": "Mzg=",
      "url": "https://www.bbc.com/news/articles/cwyg2629g7do",
      "title": "Napier Barracks in Folkestone used for housing asylum seekers shuts",
      "summary": "Barracks used for housing asylum seekers closesThe site closed on Friday and will be handed over to a property developer for housing.\nNapier Barracks in Folkestone - a former military site - opened as accommodation for migrants in 2020.\nAn army barracks in Kent which has been used to house asylum seekers has closed, according to the Home Office.\nThe government had previously announced discussions had begun to use barracks in Crowborough in East Sussex and Inverness in Scotland to house about 900 male asylum seekers in total.\nNapier Barracks housed more than 300 asylum seekers at its peak, but was believed to have fewer than 100 residents ahead of its closure.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2025-12-20T08:57:03Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Mzk=",
      "url": "https://www.yahoo.com/news/articles/ice-says-agent-fired-shots-223429583.html",
      "title": "ICE says an agent fired shots at a migrant who hit him and another agent with his SUV in Minnesota",
      "summary": "Last week, ICE agents and protesters clashed in neighboring Minneapolis.\nSt. Paul police said in a statement that they were called to the area by reports of shots being fired, only to learn that the ICE agent had fired the shots.\nICE agents saw the man getting into his SUV and approached the vehicle, McLaughlin said, identifying themselves as ICE agents.\nHe rammed his SUV into an ICE vehicle, striking the second agent, prompting the shots, which did not hit him, she said.\nAfter ramming another ICE vehicle, the man got out of his SUV and attempted to flee into his apartment, but agents brought him to the ground, McLaughlin said.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2025-12-21T22:34:29Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDA=",
      "url": "https://abcnews.go.com/US/wireStory/ice-agent-fires-shots-man-after-hit-suv-128604749",
      "title": "ICE agent fires shots at man after being hit by SUV",
      "summary": "The man also bit an ICE agent as officers subdued him outside his apartment.\nSt. Paul police said in a statement that they were called to the area by reports of shots being fired, only to learn that the ICE agent had fired the shots.\nICE agents saw the man getting into his SUV and approached the vehicle, McLaughlin said, identifying themselves as ICE agents.\nHe rammed his SUV into an ICE vehicle, striking the second agent, prompting the shots, which did not hit him, she said.\nAfter ramming another ICE vehicle, the man got out of his SUV and attempted to flee into his apartment, but agents brought him to the ground, McLaughlin said.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2025-12-21T23:09:55Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NDE=",
      "url": "https://www.yahoo.com/news/articles/trump-set-expand-immigration-crackdown-110305167.html",
      "title": "Trump set to expand immigration crackdown in 2026 despite brewing backlash",
      "summary": "Trump has already surged immigration agents into major U.S. cities, where they swept through neighborhoods and clashed with residents.\nThe expanded deportation plans come despite growing signs of political backlash ahead of next year’s midterm elections.\nOther local elections and polling have suggested rising concern among voters wary of aggressive immigration tactics.\nThe Trump administration has taken aim at legal immigrants as well.\nAdministration officials earlier this year exempted such businesses from enforcement on Trump’s orders, then quickly reversed, Reuters reported at the time.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2025-12-22T10:27:05Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDI=",
      "url": "https://uk.news.yahoo.com/pope-leos-us-bishops-critics-140243897.html",
      "title": "Pope Leo's new US bishops are critics of Trump's migrant crackdown",
      "summary": "In his first seven months as pope, Leo has appointed new Catholic bishops in cities across the U.S., from San Diego to Austin to Pittsburgh.\nHe reiterated an earlier endorsement of a November statement by the U.S. bishops' conference, which decried Trump's immigration crackdown.\nTrump, who once called the late Pope Francis \"disrespectful\" for criticizing the president's immigration policies, has not responded ⁠directly to Leo's criticisms.\nBISHOPS ATTEND PROTESTS, ACCOMPANY IMMIGRANTS TO COURTFour of Leo's choices as U.S. bishops are ‍immigrants themselves.\nAdvertisement AdvertisementAdvertisement AdvertisementPittsburgh Bishop Mark Eckman, appointed by Leo in June, called immigration policies \"cruel and inhumane\" ‌in a November open letter.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2025-12-22T14:06:36Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDM=",
      "url": "https://www.yahoo.com/news/articles/federal-judge-decide-whether-kilmar-050513736.html",
      "title": "Judge allows Kilmar Abrego Garcia to remain free while she considers immigration issues",
      "summary": "(AP) — A federal judge on Monday questioned whether government officials could be trusted to follow orders barring them from taking Kilmar Abrego Garcia into immigration custody or deporting him.\nAbrego Garcia's mistaken deportation and imprisonment in El Salvador in March has galvanized both sides of the immigration debate.\nAdvertisement AdvertisementAdvertisement AdvertisementXinis ordered Abrego Garcia released from immigration custody on Dec. 11 after determining that the government had no viable plan for deporting him.\nInside the courtroom, Abrego Garcia sat with at least half a dozen defense team members while a lone government attorney sat across from them.\nAdvertisement AdvertisementAdvertisement AdvertisementIn addition to the Maryland case, Abrego Garcia is fighting the human smuggling charges in Tennessee.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2025-12-22T05:05:13Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDQ=",
      "url": "https://www.bbc.com/news/articles/cy7v3862vpvo",
      "title": "Port of Dover Christmas getaway delays due to IT issues in Calais",
      "summary": "The delays, which lasted into the afternoon, were described as \"absolute chaos\" by one traveller, and images of the port showed a long line of vehicles queuing at a standstill.\nEurotunnel was also experiencing lengthy delays at its Folkestone terminal on Saturday - at the start of a weekend which is expected to see the Christmas getaway reach its peak.\nThe Port of Dover reported that traffic was free-flowing just before 15:00 GMT, after several hours of delays.\nOne traveller had posted earlier on X: \"Horrible experience at Port of Dover this morning.\nA port spokesperson asked all port-bound traffic to remain on main roads \"to allow the Dover community to travel to festive events and finish their Christmas shopping in the town\".",
      "category": "international",
      "bias": "center",
      "publishedAt": "2025-12-20T10:27:14Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NDU=",
      "url": "https://www.businessinsider.com/us-visa-requirements-social-media-review-what-to-know-h1b-2025-12",
      "title": "US Reviewing Socials of Some Visa Applicants. What You Should Know.",
      "summary": "Impact LinkThe United States is reviewing the social media accounts of some visa applicants, adding another hurdle for workers and other visitors to clear under the Trump administration.\nThe State Department said in June that certain visa applicants would have their online activity vetted as part of its screening process.\nConsular offices began conducting online presence reviews for H-1B applicants on December 15, but they're not the only ones affected.\nThose companies and many others are still smarting after Trump imposed the $100,000 fee on new H-1B visa applicants in September.\nThe widespread panic in corporate America forced the Trump administration to clarify that the fee would only apply to new visa applicants, not existing visa holders.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2025-12-20T23:09:52Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NDY=",
      "url": "https://www.businessinsider.com/google-microsoft-apple-h1b-visa-delay-warnings-memos-2025-12",
      "title": "Read the memos Google, Apple, Microsoft, and ServiceNow sent visa workers warning them not to travel",
      "summary": "Google, Apple, Microsoft, and ServiceNow have all sent advisories to visa-holding employees in recent days, warning them against international travel and describing appointment delays stretching up to a year.\nIf their visa stamp expires and they travel abroad, they must obtain a new stamp at a consulate before re-entering the US.\nBelow are the full texts of the internal memos sent to employees at these companies, obtained by Business Insider, which reveal how corporate America is responding to the visa processing slowdown.\nWe don't know if rescheduling is ongoing, for those whose original visa appointments have not been changed.\nThank you, BALAppleApple also sent memos to visa-holding workers warning them of extended delays in visa processing.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2025-12-22T00:41:07Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NDc=",
      "url": "https://www.yahoo.com/news/articles/chinese-workers-return-africa-lucrative-093000949.html",
      "title": "Chinese workers return to Africa as lucrative job opportunities beckon",
      "summary": "Chinese workers are returning to Africa in their thousands, reversing a decade-long decline and signalling a renewed focus on strategic mega-projects across the continent.\nNow, as investment flows accelerate, mostly driven by Chinese state-owned enterprises, worker numbers are once again increasing in key countries across Africa.\nShe noted that the high number of Chinese workers for Tanzania was likely related to the ongoing construction of the Standard Gauge Railway.\nIt required a workforce of about 50,000 Chinese workers when it was first built in the 1970s, marking the beginning of China's long-term infrastructure legacy in Africa.\nChinese construction firms have increasingly relied on local African labour rather than importing Chinese workers,\" Xue said.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2025-12-21T09:30:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDg=",
      "url": "https://www.cbsnews.com/news/dhs-undocumented-migrants-self-deportation-offer-increased/",
      "title": "DHS increases offer for undocumented migrants to $3,000 if they voluntarily leave by end of 2025",
      "summary": "The smartphone app is modeled off the Biden administration's CBP One platform.\nUnder the Trump administration's policy, migrants are instructed to use the platform to signal their intent to depart.\nAs of May 2025, U.S. Immigration and Customs Enforcement estimated the average cost to arrest, detain and remove an undocumented migrant is approximately $17,000.\nIn October, the U.S. government announced plans to grant migrant teenagers a $2,500 stipend if they choose to return to their home countries voluntarily, CBS News previously reported.\nDHS says that since January 2025, 1.9 million undocumented immigrants have \"voluntarily self-deported,\" with \"tens of thousands\" doing so through the CBP Home program specifically.",
      "category": "immigration",
      "bias": "lean right",
      "publishedAt": "2025-12-22T12:00:00Z",
      "source": "CBS News"
    }
  },
  {
    "article": {
      "id": "NDk=",
      "url": "https://www.bbc.com/news/articles/ckgmd132ge4o",
      "title": "Trump says US needs Greenland after naming special envoy",
      "summary": "Trump says US 'has to have' Greenland after naming special envoy16 hours ago Share Save James Landale , Diplomatic correspondent and Rachel Hagan Share SaveWatch: BBC asks Trump what the new appointment to Greenland entailsDonald Trump has sparked a fresh row with Denmark after appointing a special envoy to Greenland, the vast Arctic island he has said he would like to annex.\nLandry, he said, would \"lead the charge\" as special envoy to Greenland, a semi-autonomous part of the Kingdom of Denmark.\nSince returning to the White House in January, Trump has revived his long-standing interest in Greenland, citing its strategic location and mineral wealth.\n\"We need Greenland for national security, not minerals.\"\nWriting on social media earlier, the US president said Landry understood how \"essential Greenland is to our national security\" and would advance US interests.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2025-12-22T12:25:59Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NTA=",
      "url": "https://www.yahoo.com/news/articles/denmark-insists-respect-territorial-integrity-085016399.html",
      "title": "Trump's appointment of envoy to Greenland sparks new tension with Denmark",
      "summary": "The leaders of Denmark and Greenland insisted Monday that the United States won't take over Greenland and demanded respect for their territorial integrity after President Donald Trump ‍​announced ​the appointment of a ‌special envoy to the semi-autonomous territory.\nJeff Landry would be the envoy prompted a new flare-up of tensions over Washington's interest in the vast territory of Denmark, a NATO ally.\nDenmark's foreign minister told Danish broadcasters that he would summon the U.S. ambassador to his ministry.\nIn March, Vice President JD Vance visited a remote U.S. military base in Greenland and accused Denmark of under-investing there.\n“We need Greenland for national security,” Trump told reporters on Monday at his Mar-a-Lago resort in Florida, when asked about Landry's appointment.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2025-12-22T08:50:16Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTE=",
      "url": "https://finance.yahoo.com/news/europe-stumbles-attempt-sidestep-trump-090000409.html",
      "title": "Europe Stumbles in Its Attempt to Bypass Trump’s World Order",
      "summary": "Ursula von der Leyen was supposed to sign the European Union’s largest free-trade agreement on Saturday, proving the bloc’s standing as a geoeconomic force.\nBrazilian President Luiz Inacio Lula da Silva said earlier this week the time was now or never.\nOfficials say they will try again to sign the deal on Jan. 12, but there’s no guarantee.\nIt especially wants to prove it can move outside the orbit of China and the US, which have increasingly antagonistic trade relationships with Europe.\n“This is Europe’s independence moment,” von der Leyen said earlier this week, ahead of a summit when EU leaders would tackle funding options for Ukraine as well as Mercosur.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2025-12-20T09:00:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTI=",
      "url": "https://www.yahoo.com/news/articles/turkeys-top-officials-visit-syria-141513568.html",
      "title": "Clashes flare as top Turkish officials visit Syria ahead of a deadline for Kurdish integration",
      "summary": "DAMASCUS, Syria (AP) — Clashes erupted between Syrian security forces and Kurdish fighters on Monday as top Turkish officials visited Damascus ahead of a deadline to implement a deal between the government and Kurdish-led forces in the country’s northeast.\nThe Kurdish-led Syrian Democratic Forces, or SDF, said 17 people were wounded and a woman was killed.\nSyria’s Civil Defense agency said two of its emergency responders were wounded after fighters with the Kurdish-led SDF opened fire on their vehicle.\nA statement from the Kurdish-led forces accused Syrian government forces of opening fire on a Kurdish checkpoint, while government officials accused the SDF of attacking first.\nThe Turkish military has also provided support to the new Syrian army, including training cadets and officers.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2025-12-22T14:15:13Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTM=",
      "url": "https://www.aljazeera.com/video/talk-to-al-jazeera/2025/12/20/uruguays-fm-on-us-claims-to-police-latin-america-and-rising-tensions",
      "title": "Uruguay’s FM on US claims to police Latin America and rising tensions",
      "summary": "Mario Lubetkin on Washington’s revived sphere-of-influence doctrine, Venezuela, and China’s growing footprint.\nThe United States is reviving a policy first set out in the 1800s that treats Latin America as its strategic sphere of influence.\nAs Washington expands maritime operations in the Caribbean and eastern Pacific, critics warn of legal violations and rising regional instability.\nUruguay’s Foreign Minister Mario Lubetkin joins Talk to Al Jazeera to discuss US strikes, Venezuela, migration pressures, and China’s growing role in the region — and whether diplomacy can still prevent escalation in a hemisphere shaped once again by power politics.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2025-12-20T09:04:57Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTQ=",
      "url": "https://www.aljazeera.com/news/2025/12/22/fresh-clashes-erupt-on-thai-cambodia-border-as-asean-convenes-peace",
      "title": "Clashes erupt on Thailand-Cambodia border as ASEAN convenes peace talks",
      "summary": "The conflict, since it resumed on December 8, has killed at least 40 people and displaced nearly one million people on both sides of the border.\nEarlier on Monday, Cambodian Prime Minister Hun Manet’s office announced that as of Sunday evening, an estimated 525,000 civilians have been displaced on their side of the border.\nAn ASEAN team is expected to present satellite-monitoring data provided by the US, alongside field observations.\nASEAN must do whatever is necessary to maintain regional peace and stability,” Hasan said in ⁠opening remarks to ministers.\nIt said it welcomed “ASEAN leaders coming together this week to support Cambodia and Thailand fully honoring their commitments to end this conflict”.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2025-12-22T03:39:41Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTU=",
      "url": "https://www.aljazeera.com/opinions/2025/12/22/is-the-us-making-a-great-gamble-to-reshape-iraq",
      "title": "Is the US making a great gamble to reshape Iraq?",
      "summary": "The Trump administration seeks to recalibrate US influence in the Middle East and wants to ‘make Iraq great again’.\nAt the centre of Trump’s ambitious goal is what the new US envoy to Iraq, Mark Savaya, described as his goal to “make Iraq great again”.\nIt could be the “great gamble” for Trump, who seeks an Iraq that serves as a stable, sovereign regional hub rather than a battleground for foreign interests.\nSavaya’s communal and ethnic ties have given him significant access to Iraqi power centres that traditional diplomats often lack.\nThis move clearly signals Iran’s deep and enduring interest in shaping Iraq’s political alignment and its future path.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2025-12-22T07:37:30Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTY=",
      "url": "https://www.rt.com/africa/629871-russia-china-remain-pretoria-strategic-partners/",
      "title": "Russia and China remain our strategic partners – South African deputy FM",
      "summary": "“China and Russia continue to be regarded as strategic partners of the country of South Africa,” she stated, adding that Pretoria “will continue to engage with Russia, China and other progressive forces in the world.”The deputy foreign minister noted Moscow’s role in supporting South Africa’s anti-apartheid struggle.\n“Russia has always been there for the South African government and the South African people when it fought against the apartheid regime.”Moraka also defended South Africa’s outspoken position on the Palestinian issue, including its legal case against Israel at the International Court of Justice.\n“We will continue to speak against any injustice… be it the Palestinian people in Gaza or whoever.”Addressing concerns from the Western partners, Moraka reaffirmed that non-alignment remains the cornerstone of South African foreign policy.\n“American markets need African countries,” especially for minerals and agriculture, she said.\nThe Russian delegation was led by Foreign Minister Sergey Lavrov, who held around 20 bilateral meetings with his African counterparts.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2025-12-22T12:16:12Z",
      "source": "RT"
    }
  },
  {
    "article": {
      "id": "NTc=",
      "url": "https://news.slashdot.org/story/25/12/22/042225/the-us-could-ban-chinese-made-drones-used-by-police-departments",
      "title": "The U.S. Could Ban Chinese-Made Drones Used By Police Departments",
      "summary": "I've got a bad feeling about this.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2025-12-22T04:05:00Z",
      "source": "Slashdot.org"
    }
  }
]