[
  {
    "article": {
      "id": "MA==",
      "url": "https://www.wired.com/story/the-political-war-over-prediction-markets-is-just-getting-started/",
      "title": "The War Over Prediction Markets Is Just Getting Started",
      "summary": "The other insists they are just giving people access to legitimate financial markets already subject to adequate government oversight.\nOnce a niche financial experiment, prediction markets have rapidly become entrenched in mainstream culture, a transformation that has brought vast sums of money into play.\nBut critics say that prediction markets, at least in their current form, are exploitative.\nAttorneys general and gambling regulators in many states say sports contracts on prediction markets should follow state gambling laws.\nFederal lawmakers have also started weighing in; earlier this month, 23 Democratic senators voiced support for efforts to push prediction markets to abide by state gambling laws.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-20T10:30:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MQ==",
      "url": "https://www.businessinsider.com/economy-job-market-divide-k-shape-economy-2026-2",
      "title": "The economy grew strongly last year, but hiring stagnated. It's making the gap between the rich and everyone else worse.",
      "summary": "The data is in, and last year presents an economic conundrum: Overall growth was relatively strong, but job growth was virtually nonexistent.\nZipRecruiter economist Nicole Bachaud thinks the job market could be at a \"pivot point\" after stronger hiring in January.\nThey don't have to worry as much about rising prices of necessities and slowing wage growth.\n\"They're also enjoying faster wage growth, while lower-income families are seeing reduced wage growth, near-zero real wage growth, and not much wealth appreciation outside of real estate, if they have that.\"\nLower-income wage growth surged between 2021 and 2022, but has since cooled down a lot from the late 2022 peak.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-22T10:12:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mg==",
      "url": "https://www.businessinsider.com/us-economy-outlook-joseph-stiglitz-recession-inflation-job-market-tariffs-2026-2",
      "title": "3 Signs US Economy Will 'Get Worse,' According to Joseph Stiglitz",
      "summary": "Joseph Stiglitz, a Nobel laureate and Columbia economist, said he believes the US economy would continue to weaken when speaking to CNBC about his macro outlook on Thursday.\n\"Not great right now, and the prospects are that we're just going to get worse,\" Stiglitz said of his economic outlook.\nBut there are a few under-the-surface details that suggest the economy isn't on a good path, Stiglitz suggested.\nBloomberg/Getty ImagesStiglitz also pointed to the push from the Trump administration to lower interest rates.\nIn that scenario, the economy could grow without stoking inflation, meaning the US could have room to lower interest rates more than markets expect.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-20T10:15:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mw==",
      "url": "https://abcnews.com/Business/us-economy-expected-slowed-end-2025/story?id=130296352",
      "title": "US economy slowed more than expected at end of 2025",
      "summary": "US economy slowed more than expected at end of 2025A shopper selects items at a grocery store on Feb. 10, 2026, in Chicago.\nA shopper selects items at a grocery store on Feb. 10, 2026, in Chicago.\nA shopper selects items at a grocery store on Feb. 10, 2026, in Chicago.\nA shopper selects items at a grocery store on Feb. 10, 2026, in Chicago.\nThe U.S. economy slowed more than expected over the final months of 2025, federal government data on Friday showed.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-20T13:50:41Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "NA==",
      "url": "https://www.npr.org/2026/02/20/nx-s1-5718214/economy-gdp-tariffs-inflation-consumer-spending",
      "title": "The economy slowed in the last 3 months of the year — but was still solid in 2025",
      "summary": "The economy slowed in the last 3 months of the year — but was still solid in 2025toggle caption Jeremy Weine/Getty ImagesThe U.S. economy slowed in the final months of last year, but it continued to expand, thanks to robust consumer spending and business investment in artificial intelligence.\n(Both measures compare the size of the economy at year's end to where it was 12 months earlier.)\nConsumer spending is the biggest driver of the U.S. economy, and that trend continued in the final months of last year.\nThat made GDP look weaker in the early months of the year.\nThat subtracted from fourth-quarter growth, although much of that will be made up in the early months of 2026.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-20T13:52:51Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NQ==",
      "url": "https://www.businessinsider.com/finding-job-search-struggles-savings-americans-federal-reserve-amazon-tech-2026-2",
      "title": "Job Searches Lengthen, Savings Dwindle for Americans",
      "summary": "Joanelle Cobos (left), Clair Todd (right)Job searches are taking longer, and some Americans' savings aren't keeping up.\nWilke's experience underscores how quickly a prolonged job search can unravel someone's finances — especially for workers without much savings to fall back on.\nBusiness Insider is speaking with workers who've found themselves at a corporate crossroads — whether due to a layoff, resignation, job search, or shifting workplace expectations.\nMany Americans aren't prepared financially for unemploymentAs unemployment spells lengthen, the financial risks of a prolonged job search are rising for many Americans.\nBut if her job search stretches on, she knows that sense of security will gradually fade.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-22T10:05:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Ng==",
      "url": "https://finance.yahoo.com/video/oil-prices-fair-target-amid-173000986.html",
      "title": "Oil prices: This would be a 'fair target' amid US–Iran tensions",
      "summary": "Mish, and I want to get to that too because I know you've been watching it.\nUm, you know, piled into all of the other stuff affecting inflation, we now have a potential conflict with Iran to contend with and the effect that that could have on oil prices.\nSo we've got oil prices that have now climbed over the past few sessions on concerns around that.\nSo, right now, I think $66 is a good pivotal area if you're looking at WTI oil.\nI think that's a fair target.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-20T19:00:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Nw==",
      "url": "https://environment.ec.europa.eu/news/new-law-more-sustainable-circular-and-safe-batteries-enters-force-2023-08-17_en",
      "title": "New law on more sustainable, circular and safe batteries enters into force",
      "summary": "A new law to ensure that batteries are collected, reused and recycled in Europe is entering into force today.\nThis will support the shift to a circular economy, increase security of supply for raw materials and energy, and enhance the EU’s strategic autonomy.\nThe Batteries Regulation will ensure that batteries placed on the EU single market will only be allowed to contain a restricted amount of harmful substances that are necessary.\nBackgroundSince 2006, batteries and waste batteries have been regulated at EU level under the Batteries Directive.\nSuch exponential growth in demand for batteries will lead to an equivalent increase in demand for raw materials, hence the need to minimise their environmental impact.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-02-21T08:28:42Z",
      "source": "Europa.eu"
    }
  },
  {
    "article": {
      "id": "OA==",
      "url": "https://www.businessinsider.com/ai-job-market-english-majors-humanities-demand-2026-2",
      "title": "AI Is Giving English Majors Some Unexpected Leverage in the Job Market",
      "summary": "Pre-pandemic, the number of English majors at the university was shrinking, part of a broader decline in English across the country, he said.\nBut there's been a rebound, with the number of English majors rising 9% since 2021.\nCourtesy of CU BoulderDerided by some as useless, the utility of the English major has long been questioned.\nThat means that, after years of mocking, English majors are finally getting recognized for their usefulness.\nStill, it's a dreary labor market for everyone — English majors includedThere are signs of employment hope for the English majors.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-22T09:50:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "OQ==",
      "url": "https://doempke.com/what-happened-to-software-is-happening-to-finance-and-accounting/",
      "title": "What Happened to Software is Happening to Finance and Accounting",
      "summary": "What happened to software is now happening to finance.\nWhat happened to software is now happening to finance.\nSo I became a finance person who codes — a weird niche that turned out to be excellent preparation for what's happening right now.\nIf you're already deep in this: I'd love to see what you're building.\nI'm thinking of putting together a mini hackathon for people building at this intersection — finance, AI, automation.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-21T10:45:52Z",
      "source": "Doempke.com"
    }
  },
  {
    "article": {
      "id": "MTA=",
      "url": "https://www.backyardgardenlover.com/not-all-cars-are-money-pits-10-cars-that-are-worth-more-used-than-new/",
      "title": "Not All Cars Are Money Pits: 10 Cars That Are Worth More Used Than New",
      "summary": "Yet, this isn’t always the case: some used models often sell for above the MSRP of their newer rivals.\nThis used car has an astonishingly high price difference over a new model: around 12.3% and an average $4,038 increase.\nIt is clearly a very popular used car choice.\nToyota RAV4 PrimeThe Toyota RAV4 Prime is the plug-in hybrid version of America’s perennial SUV bestseller.\nNot all used RAV4 Hybrid pricing comes from electrified variants: the standard RAV4 Hybrid also appears above new MSRP in some used listings.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-20T12:00:57Z",
      "source": "Backyardgardenlover.com"
    }
  },
  {
    "article": {
      "id": "MTE=",
      "url": "https://news.slashdot.org/story/26/02/20/2134238/goldman-sachs-launches-ai-free-index",
      "title": "Goldman Sachs Launches AI-Free Index",
      "summary": "Can anyone remember when the times were not hard, and money not scarce?",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-20T23:20:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MTI=",
      "url": "https://www.businessinsider.com/financial-independence-in-new-york-city-early-retirement-investment-portfolio-2026-2",
      "title": "How One Couple Hit Financial Independence Living in New York City",
      "summary": "The couple went from pricey New York City rent to a monthly mortgage, and, eventually, to an incredibly low housing payment when they paid off their mortgage early in 2024.\nBusiness Insider reviewed public records filed with the New York City Register that confirm the couple's mortgage was paid off in September 2024.\nSimplified investingBefore hiring a financial planner, Chang and Nathanson were saving, but without a clear plan.\nAvoiding lifestyle creepEarning two professional salaries in New York City can create pressure to spend accordingly.\nFor Nathanson and Chang, avoiding lifestyle inflation has been central to reaching financial independence.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-20T10:30:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTM=",
      "url": "https://www.aljazeera.com/news/2026/2/22/iran-us-tensions-what-would-blocking-strait-of-hormuz-mean-for-oil-lng",
      "title": "Iran-US tensions: What would blocking Strait of Hormuz mean for oil, LNG?",
      "summary": "Whenever tensions rise between Iran and the United States, one narrow waterway moves to the centre of global attention – the Strait of Hormuz.\nIranian authorities carried out live-fire military drills in the corridor, through which about 20 percent of global oil supplies are shipped.\nThe EIA estimated that in 2024, 84 percent of crude oil and condensate shipments transiting the strait headed to Asian markets.\nAdvertisementAny coordinated pressure on the Strait of Hormuz and Bab al-Mandab Strait would amplify risks for global shipping, energy markets and international trade.\nAlmost half of India’s crude oil imports and about 60 percent of its natural gas supplies move through the Strait of Hormuz.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-22T13:36:24Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "MTQ=",
      "url": "https://www.theverge.com/transportation/882364/uber-autonomous-solutions-training-data-partners",
      "title": "Uber launches robotaxi support project to aid AV partners",
      "summary": "Now, the ridehail giant is launching a new initiative to support its third-party robotaxi partners called Uber Autonomous Solutions.\nIt’s an acknowledgement that many AV developers aren’t as cash rich as Waymo, Tesla, and other leading AV developers.\nUber says this data can help its partners improve their own autonomous vehicles as they seek to scale their robotaxi business more quickly.\nEssentially, Uber is telling its AV partners to stick to the important stuff — developing software to power autonomous driving — and it will take care of the rest.\nThe company has said it wants to use its reach and scale to help autonomous vehicles proliferate across the globe.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-21T19:31:36Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTU=",
      "url": "https://www.wired.com/story/leading-us-research-lab-appears-to-be-squeezing-out-foreign-scientists/",
      "title": "Leading US Research Lab Appears to Be Squeezing Out Foreign Scientists",
      "summary": "One of the US government’s top scientific research labs is taking steps that could drive away foreign scientists, a shift lawmakers and sources tell WIRED could cost the country valuable expertise and damage the agency’s credibility.\nThe National Institute of Standards and Technology (NIST) helps determine the frameworks underpinning everything from cybersecurity to semiconductor manufacturing.\nMany of the agency’s thousands of employees, postdoctoral scientists, contractors, and guest researchers are brought in from around the world for their specialized expertise.\nThe staffer, who spoke on the condition of anonymity because they were not authorized to speak to the media, says the Department of Commerce, which oversees NIST, originally pushed for banning all foreign researchers.\nNIST spokesperson Rich Press said the agency would respond to the lawmakers' letter \"through the appropriate channels.\"",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-20T10:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MTY=",
      "url": "https://it.slashdot.org/story/26/02/20/003230/how-private-equity-debt-left-a-leading-vpn-open-to-chinese-hackers",
      "title": "How Private Equity Debt Left a Leading VPN Open To Chinese Hackers",
      "summary": "Can anyone remember when the times were not hard, and money not scarce?",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-20T13:00:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MTc=",
      "url": "https://www.businessinsider.com/pwc-engineers-launch-ai-agent-enterprise-grade-spreadsheets-big-four-2026-2",
      "title": "PwC engineers built an AI agent to tackle the corporate world's least sexy task: spreadsheets",
      "summary": "PwC, like many consulting firms, is investing heavily in engineering talent.\nArtur Widak/NurPhoto via Getty ImagesPwC, like many consulting firms, is investing heavily in engineering talent.\nThese files often underpin business-critical decisions, yet PwC \"found that even today's modern AI was very poorly suited to managing these big enterprise spreadsheets,\" Wood said.\nIn January, PwC launched a dedicated tech engineering career track to attract more technical talent, saying it wants to become \"a destination for top engineering talent.\"\nThe second reimagines professional services from scratch: \"If you were to start from a blank piece of paper, what would professional services look like in an AI agent world?\"",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-20T10:33:45Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTg=",
      "url": "https://www.wired.com/story/how-to-hide-google-ai-overviews-from-your-search-results/",
      "title": "How to Hide Google’s AI Overviews From Your Search Results",
      "summary": "While there’s no off switch to avoid this smorgasbord of AI tools entirely, there is one keyboard trick you can use to dodge Google’s AI Overviews for a brief respite.\nIt’s an option WIRED readers highlighted under a recent article about scams found in Google’s AI Overviews.\n“People find Search more helpful with AI Overviews, and they're coming back to search more as a result,” a Google spokesperson tells WIRED.\nThe exception seems to be on Android—at least on a Google Pixel phone we tested with, using “–ai” removed AI Overviews.\nWhen Google launched AI Overviews in 2024, it was a major turning point for the search engine.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-22T11:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MTk=",
      "url": "https://www.anthropic.com/news/claude-code-security",
      "title": "Making frontier cybersecurity capabilities available to defenders",
      "summary": "Claude Code Security, a new capability built into Claude Code on the web, is now available in a limited research preview.\nClaude Code Security is intended to put this power squarely in the hands of defenders and protect code against this new category of AI-enabled attack.\nHow Claude Code Security worksStatic analysis—a widely deployed form of automated security testing—is typically rule-based, meaning it matches code against known vulnerability patterns.\nNothing is applied without human approval: Claude Code Security identifies problems and suggests solutions, but developers always make the call.\nClaude Code Security is one step towards our goal of more secure codebases and a higher security baseline across the industry.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-20T18:03:19Z",
      "source": "Anthropic.com"
    }
  },
  {
    "article": {
      "id": "MjA=",
      "url": "https://yro.slashdot.org/story/26/02/21/2140216/americas-peace-corps-announces-tech-corps-volunteers-to-help-bring-ai-to-foreign-countries",
      "title": "America's Peace Corps Announces 'Tech Corps' Volunteers to Help Bring AI to Foreign Countries",
      "summary": "Want to read Slashdot from your mobile device?\nPoint it at m.slashdot.org and keep reading!",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-02-21T21:43:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MjE=",
      "url": "https://www.businessinsider.com/mark-cuban-two-types-of-people-using-ai-learning-lazy-2026-2",
      "title": "Mark Cuban on 2 Types of AI Users: Learners and Non-Learners",
      "summary": "Mark Cuban said people who use AI either use it to learn everything or to avoid learning.\nMark Cuban said people who use AI either use it to learn everything or to avoid learning.\nTom Williams/CQ-Roll Call, Inc via Getty ImagesMark Cuban said people who use AI either use it to learn everything or to avoid learning.\nlighning bolt icon An icon in the shape of a lightning bolt.\nBill Gurley, a partner at the Silicon Valley venture capitalist firm Benchmark, agrees \"100%\" with Cuban that there are two types of AI users.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-20T00:07:49Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjI=",
      "url": "https://www.businessinsider.com/deepmind-ceo-demis-hassabis-ai-lazy-way-hurts-thinking-skills-2026-2",
      "title": "DeepMind's CEO says using AI can make you a genius — or hurt your critical thinking skills",
      "summary": "The Google DeepMind CEO said that AI is just like the internet when it comes to learning.\nIn a Thursday interview with entrepreneur Varun Mayya on the sidelines of the India AI Impact Summit, the Google DeepMind CEO said that AI is just like the internet.\n\"With AI, if you use it in a lazy way, it will make you worse at critical thinking and so on,\" he said.\nIt merged with Google Brain in 2023 to form Google DeepMind, the lab behind tools such as Gemini and Nano Banana.\nAt a June conference, the CEO of French AI lab Mistral said that a risk of using AI for everything is that humans will stop trying.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-20T05:01:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjM=",
      "url": "https://www.businessinsider.com/scott-adams-death-ai-avatar-resurrection-ethics-debate-family-backlash-2026-2",
      "title": "Scott Adams' AI Resurrection Sparks Backlash and an Ethics Debate",
      "summary": "\"The real Scott Adams gave explicit permission on the record multiple times for people to create and operate an AI version of him,\" the AI Adams said in a post on February 5.\nThe Adams estate did not respond to requests for comment from Business Insider.\n\"It's my belief this is something that he wanted,\" John Arrow, an AI venture capitalist who created the digital Adams, said.\nThe AI Adams identifies itself as artificial intelligence at the start of its clips and does not appear to solicit money.\nFor now, the AI \"Scott Adams\" fight is one family's public line-drawing exercise.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-20T09:14:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjQ=",
      "url": "https://www.yahoo.com/news/articles/india-brazil-sign-mining-pact-122938477.html",
      "title": "India, Brazil sign mining pact as Modi targets $20 billion trade in five years",
      "summary": "Advertisement AdvertisementBrazil is among the world's top producers of iron ore and holds large reserves of minerals critical to steelmaking.\nINFRASTRUCTURE INVESTMENTThe cooperation will ⁠focus on attracting investment in exploration, mining and steel sector infrastructure, the statement said.\n\"We are committed to taking bilateral trade much beyond $20 billion in the next five years,\" Modi said.\n\"Our nations will also work closely in areas such as technology, innovation, digital public infrastructure, AI, semiconductors and more,\" ‌Modi said.\nLula on Thursday advocated for Brazil and India to conduct trade in their own currencies ​rather than settling transactions in ‌U.S.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-21T12:29:38Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MjU=",
      "url": "https://slashdot.org/story/26/02/22/1632217/ai-now-helps-manage-16-of-americas-apartments",
      "title": "AI Now Helps Manage 16% of America's Apartments",
      "summary": "Can anyone remember when the times were not hard, and money not scarce?",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-22T18:34:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MjY=",
      "url": "https://taalas.com/the-path-to-ubiquitous-ai/",
      "title": "The path to ubiquitous AI",
      "summary": "The path to ubiquitous AIBy Ljubisa BajicMany believe AI is the real deal.\nAbout TaalasFounded 2.5 years ago, Taalas developed a platform for transforming any AI model into custom silicon.\nAI inference is the most critical computational workload that humanity has ever faced, and the one that stands to gain the most from specialization.\nThe Silicon Llama is aggressively quantized, combining 3-bit and 6-bit parameters, which introduces some quality degradations relative to GPU benchmarks.\nOur first products, beginning with our hard-wired Llama and rapidly expanding to more capable models, eliminate high latency and cost, the core barriers to ubiquitous AI.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-20T10:32:52Z",
      "source": "Taalas.com"
    }
  },
  {
    "article": {
      "id": "Mjc=",
      "url": "https://www.bbc.com/news/articles/c4g8r23yv71o",
      "title": "Why fake AI videos of UK urban decline are taking over social media",
      "summary": "\"If people saw it and they immediately knew it was fake, then they would just scroll.\nThe selling point of generative AI models is that they look real,\" RadialB tells me over the phone.\nHe refuses to share his real name but reveals he is in his 20s and from the north-west of England.\nHe has never been to Croydon.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-21T06:04:41Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Mjg=",
      "url": "https://www.scientificamerican.com/article/trump-administration-slashes-mercury-regulations-from-coal-plants/",
      "title": "Trump administration slashes mercury regulations from coal plants",
      "summary": "Mercury pollution from coal plants has been tied to serious neurological problems, especially in children and babiesOn Friday the Trump administration officially rolled back a series of Biden-era environmental regulations on coal plants, including some intended to clamp down on mercury pollution.\nThose earlier rules allowed power plants that burned a particularly dirty form of coal called lignite coal to emit more mercury than plants that burned other forms of the fossil fuel.\nThe move is the latest in a string of actions by the Trump administration to prop up what has long been viewed as a moribund coal industry in the U.S.\nThe administration has ordered the Department of State to run military facilities on coal power, funded renovations for coal-powered plants and even blocked plants from shutting down.\n“And once again, the Trump administration is doing so at the expense of people’s health.”Coal-fired power plants are the leading source of mercury emissions in the U.S., according to the EPA.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2026-02-20T17:30:00Z",
      "source": "Scientific American"
    }
  },
  {
    "article": {
      "id": "Mjk=",
      "url": "https://news.slashdot.org/story/26/02/21/1932253/codeorg-president-steps-down-citing-upending-of-cs-by-ai",
      "title": "Code.org President Steps Down Citing 'Upending' of CS By AI",
      "summary": "Want to read Slashdot from your mobile device?\nPoint it at m.slashdot.org and keep reading!",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-21T20:35:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MzA=",
      "url": "https://www.wired.com/story/sony-wh-ch720n-deal-february-2026/",
      "title": "Sony’s WH-CH720N headphones offer excellent value at full price, but right now they're a steal.",
      "summary": "We've tested oodles of noise-canceling headphones and the Sony WH-CH720N might have an unfortunate name, but they're the best budget-friendly pair we've tried.\nThey usually offer good value when selling for the full $178 MSRP, but right now they've fallen to $95 shipped on Amazon and $100 on Best Buy.\nThese headphones are well-built and well-designed, with great active noise cancellation and robust sound.\nMoreover, if you want a pair of over-hear wireless headphones with active noise cancellation, it's very difficult to get that in a package this affordable.\nCheck those stories out if you're on the hunt for wireless gaming earbuds or open earbuds.",
      "category": "technology",
      "bias": "right",
      "publishedAt": "2026-02-21T20:30:46Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MzE=",
      "url": "https://www.businessinsider.com/lucid-layoffs-read-memo-us-workforce-tesla-rival-2026-2",
      "title": "Read the memo: Tesla rival Lucid cuts 12% of its US workforce as EV winter takes hold",
      "summary": "Tesla rival Lucid is slashing its workforce as the EV winter tightens its grip.\nEV startup Lucid is cutting 12% of US employees, according to an email interim CEO Marc Winterhoff sent to unaffected employees on Friday, which Business Insider has seen.\nWinterhoff said the cuts would exclude hourly production employees in manufacturing, logistics, and quality.\nIt comes as Lucid faces a difficult environment for EV makers amid an industry-wide downturn, with EV sales plummeting industry-wide in the US following the end of the $7,500 tax credit in September.\nWe have implemented a 12% reduction of our U.S. workforce, excluding hourly production employees in manufacturing, logistics, and quality.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-20T16:29:05Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzI=",
      "url": "https://www.theregister.com/2026/02/20/spacex_falcon_europe_breakup_lithium_plume/",
      "title": "Euro boffins track lithium plume from Falcon 9 burn-up",
      "summary": "The SpaceX Falcon 9 rocket that burned up over Europe last year left a massive lithium plume in its wake, say a group of scientists.\nThe measurements stem from a SpaceX Falcon 9 upper stage that sprung an oxygen leak about a year ago, sending it into an uncontrolled re-entry.\nA single Falcon 9 upper stage, like the one that broke up over Poland and released the lithium plume, is estimated to contain 30 kg of lithium just in the alloy used in tank walls.\n\"The consequences of increasing pollution from re-entering space debris on radiative transfer, ozone chemistry, and aerosol microphysics remain largely unknown.\"\n\"Using the upper atmosphere as an incinerator\" is a massive blind spot, McDowell told us in a discussion last year.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-02-20T19:55:33Z",
      "source": "Theregister.com"
    }
  },
  {
    "article": {
      "id": "MzM=",
      "url": "https://www.businessinsider.com/sam-altman-elon-musk-data-centers-space-timeline-2026-2",
      "title": "Sam Altman says Elon Musk's idea of putting data centers in space is 'ridiculous'",
      "summary": "Lighning bolt icon An icon in the shape of a lightning bolt.\nOrbital data centers are not something that's going to matter at scale this decade.\"\nIn February, SpaceX said its goal is to launch a \"constellation of a million satellites that operate as orbital data centers.\"\nTech and AI companies rely on data centers to power their products, like large language models and chatbots.\nThose data centers, however, can deplete water resources, strain power grids, increase pollution, and decrease the overall quality of life.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-21T22:57:42Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzQ=",
      "url": "https://grist.org/equity/jesse-jacksons-vision-for-america-embraced-environmental-justice/",
      "title": "Jesse Jackson’s vision for America embraced environmental justice",
      "summary": "Peggy Shepard walked into her living room on Tuesday morning when her husband told her Jesse Jackson, the civil rights titan from South Carolina, had died.\n“Immediately tears started coming,” said Shepard, co-founder and executive director of WE ACT for Environmental Justice, a New York City-based nonprofit.\nJackson made environmental justice, a term Americans were largely unfamiliar with at the time, a key plank of his second presidential run.\nHere's HowJackson marched with Dr. Martin Luther King Jr., transformed American politics with his two historic presidential campaigns, and inspired countless organizers — including environmental justice advocates — along the way.\nToday she’s remembered as “the mother of the environmental justice movement.” Cheryl Johnson never worked directly with Jackson on environmental issues in Chicago, but the two “would have discussions on the phone,” she said.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2026-02-20T09:30:00Z",
      "source": "Grist"
    }
  },
  {
    "article": {
      "id": "MzU=",
      "url": "https://www.businessinsider.com/americas-hottest-nimby-issue-data-centers-sanders-desantis-2026-2",
      "title": "Politicians can't ignore data centers anymore",
      "summary": "National and local politicians are calling for data centers to pay their fare share of rising utility costs.\nUntil recently, most states have courted data centers, enticed by promises that they will create jobs and sprout long-term revenue from vacant land.\nThere's still about a fifth of people in the middle who don't have feelings on data centers yet, but their numbers are shrinking.\nIf data centers don't start footing the bill for higher energy use, voters are likely to keep turning on them.\nIn Virginia, home to the world's largest concentration of data centers, aka Data Center Alley, backlash has been mounting for several years.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-22T09:13:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzY=",
      "url": "https://www.rockpapershotgun.com/climate-change-isnt-about-ai-itself-its-about-progress-11-bit-talk-frostpunk-1886-and-questions-of-scale",
      "title": "\"Climate change isn’t about AI itself, it's about progress\" - 11 Bit talk Frostpunk: 1886 and questions of scale",
      "summary": "I wonder aloud if 11 Bit have considered making a Frostpunk game with a population size parked between Frostpunk and This War of Mine.\nImage credit: 11 bit studiosSułecki is happy to speculate on the subject.\nDiscussing the game's creation, 11 Bit have elsewhere tethered these events to on-going conversations about the workplace impacts of generative AI.\nFrostpunk 1866 will make use of the technology, though 11 Bit have yet to specify how.\nPerhaps that's something 11 Bit should investigate in the third Purpose path.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-02-20T10:26:32Z",
      "source": "Rock Paper Shotgun"
    }
  },
  {
    "article": {
      "id": "Mzc=",
      "url": "https://www.wired.com/story/the-supreme-courts-tariff-ruling-wont-bring-car-prices-back-to-earth/",
      "title": "The Supreme Court’s Tariff Ruling Won’t Bring Car Prices Back to Earth",
      "summary": "Now, despite a US Supreme Court ruling that will nix some of those Trump tariffs, car buyers will likely get no respite.\nAutomakers have actually done an OK job shielding consumers from the effects of tariffs, Caldwell says.\nEven as retailers have blamed tariffs for steadily rising prices of consumer goods like electronics and appliances, car prices are up just 1 percent since this time last year, the firm’s data shows.\nBut as the tariff regime drags on, that could change in ways that make new-car buyers even less happy.\n“If cost pressures continue to build, automakers may have less room to shield shoppers from higher prices,” Caldwell says, “but for now, the broader market impact is still playing out.”",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-21T00:10:01Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "Mzg=",
      "url": "https://www.bbc.com/news/articles/c5yvvjw8pdvo",
      "title": "From Venezuela to immigration, Project 2025 provided Trump's roadmap",
      "summary": "The 2025 US National Security Strategy identifies China as a leading adversary and, in a section on the Western Hemisphere, states: \"The choice all countries should face is whether they want to live in an American-led world of sovereign countries and free economies or in a parallel one in which they are influenced by countries on the other side of the world.\"",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-22T00:02:26Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Mzk=",
      "url": "https://abcnews.com/Politics/americans-oppose-tactics-ice-enforce-immigration-laws-21/story?id=130280899",
      "title": "Americans oppose the tactics ICE is using to enforce immigration laws by 2:1 margin: Poll",
      "summary": "By a 2-to-1 margin, Americans oppose the tactics ICE is using to enforce immigration laws, 62% to 31%.\nBy a 13-point margin, Americans oppose abolishing ICE, 50% to 37%.\nOpinions are polarized: 7 in 10 Democrats support abolishing ICE, while 8 in 10 Republicans oppose it.\nMore than 4 in 10 Americans say they are \"not concerned\" or \"concerned but not upset\" over the situation in Minnesota.\nEvan Vucci/APBy an 8-point margin, Americans oppose denying federal funds to so-called sanctuary cities that limit their cooperation with ICE, 46% to 38%.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-02-20T11:03:50Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "NDA=",
      "url": "https://www.npr.org/2026/02/22/nx-s1-5722854/pakistan-border-strikes-afghanistan-70-killed",
      "title": "Pakistan claims to have killed at least 70 militants in strikes along Afghan border",
      "summary": "Pakistan claims to have killed at least 70 militants in strikes along Afghan bordertoggle caption Hedayat Shah/APKABUL, Afghanistan — Pakistan's military killed at least 70 militants in strikes along the border with Afghanistan early Sunday, targeting what it described as hideouts of Pakistani militants it blamed for recent attacks inside the country, the deputy interior minister said.\nTalal Chaudhry, Pakistan's deputy interior minister, told Geo News that at least 70 militants were killed in the strikes.\nClearing rubble and burying the deadAfghanistan's Ministry of Foreign Affairs summoned Pakistan's ambassador to Kabul and handed him a note of protest over the Pakistani strikes.\nHabib Ullah, a local tribal elder, said those killed in the strikes were not militants.\nHours before the Pakistani strikes, a suicide bomber targeted a security convoy in the border district of Bannu in Pakistan's northwest, killing two soldiers, including a lieutenant colonel.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-22T15:55:39Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDE=",
      "url": "https://guessingheadlights.com/ice-agent-stopped-for-dui-asks-deputy-are-you-haitian-then-things-got-worse/",
      "title": "ICE Agent Stopped for DUI Asks Deputy: ‘Are You Haitian?’—Then Things Got Worse",
      "summary": "‘Are You Haitian?’: Agent Questions Deputy’s Nationality During StopThe encounter was already tense from the first words captured on bodycam.\nStruggling Sobriety Tests and a Plea Over CustodyThe video shows Deiseroth struggling with basic coordination tasks like walking in a straight line and reciting numbers.\nDeiseroth was booked into the Monroe County Jail on misdemeanor charges of driving under the influence and resisting without violence.\nAt the time the footage was released, Deiseroth remained on administrative leave pending the outcome of that review.\nSources: WPEC, NBC 6 South Florida, Florida Keys Weekly Newspapers",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-02-20T16:15:58Z",
      "source": "Guessingheadlights.com"
    }
  },
  {
    "article": {
      "id": "NDI=",
      "url": "https://www.11alive.com/video/news/protests-grow-after-savannah-teacher-killed-in-ice-involved-car-chase/85-38b6a548-b918-4b85-8b8d-951c41ba4954",
      "title": "Protests grow after Savannah teacher killed in ICE-involved car chase",
      "summary": "Next up in 5Example video title will go here for this video",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-02-20T14:41:58Z",
      "source": "11Alive.com WXIA"
    }
  },
  {
    "article": {
      "id": "NDM=",
      "url": "https://www.yahoo.com/news/articles/ice-begins-purchase-warehouses-owners-130708782.html",
      "title": "ICE begins to purchase warehouses, but some owners are backing out of deals",
      "summary": "In some cases, warehouse owners are refusing to sell.\nFloridaA TV reporter in Orlando spotted private contractors and federal officials last month touring a 439,945-square-foot (40,872-square-meter) industrial warehouse.\nAdvertisement AdvertisementPlans also are in the works to convert a warehouse in Oakwood into an ICE processing facility, Republican U.S. Rep. Andrew Clyde said in a statement, although no deed has been filed.\nKelly Ayotte sparred with federal officials after ICE disclosed plans to spend $158 million to convert a warehouse in Merrimack into a 500-bed processing center.\nThe announcement came just two days after ICE said it had made a “mistake” when it previously announced the purchase.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-02-21T13:07:08Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDQ=",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/2/21/videos-show-aftermath-of-deadly-israeli-attacks-in-lebanon",
      "title": "Videos show aftermath of deadly Israeli attacks in Lebanon",
      "summary": "NewsFeed Videos show aftermath of deadly Israeli attacks in LebanonIsrael’s military has carried out air attacks on eastern Lebanon’s Bekaa Valley, with local media reporting at least 10 people killed and dozens wounded.\nEarlier, another attack hit Ein el-Hilweh, the country’s largest Palestinian refugee camp near Sidon, killing at least two people.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-21T08:25:34Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NDU=",
      "url": "https://abcnews.com/Politics/gov-shapiro-blasts-trumps-tariff-policy-after-supreme/story?id=130382811",
      "title": "Gov. Shapiro blasts Trump’s tariff policy after Supreme Court rebuke",
      "summary": "“I wish [Trump] would just adhere to the Supreme Court's ruling,” Shapiro said.\nAfter the Supreme Court invalidated most of President Donald Trump's sweeping tariff policy, Pennsylvania Democratic Gov.\nShapiro, who was at the White House for a governor's meeting when the court's decision was released, said he witnessed Trump's first reaction.\nAsked if he supported abolishing ICE, Shapiro did not say directly whether he does or not.\nHe casts some votes and takes some positions that I strongly disagree with, but at the end of the day, my job is to serve the people of Pennsylvania,\" Shapiro said.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-22T15:05:35Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "NDY=",
      "url": "https://www.cbsnews.com/news/asylum-seeker-work-permits-trump-administration-restrictions/",
      "title": "Trump administration unveils plans to dramatically restrict work permits for asylum-seekers",
      "summary": "The Trump administration on Friday formally proposed a regulation that would dramatically restrict work permits for asylum-seekers, confirming a CBS News report about a plan to upend longstanding U.S. immigration policy.\nThat has generally allowed asylum applicants to request a work permit 150 days after they make their claim.\nBut a proposed Trump administration regulation unveiled Friday would suspend the acceptance of asylum work permit applications until U.S.\nCBS News revealed in June 2025 that Trump administration officials were developing a regulation to pause asylum-related work permits and impose stricter eligibility requirements for them.\nUnder the Trump administration, USCIS has severely tightened immigration programs, affecting broad swaths of immigrants, legal and illegal alike.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-02-20T20:17:27Z",
      "source": "CBS News"
    }
  },
  {
    "article": {
      "id": "NDc=",
      "url": "https://www.slashgear.com/2104134/us-gas-station-convenience-store-chain-owned-by-mexico/",
      "title": "The US Gas Station Convenience Stores You Might Not Know Are Owned By Mexico",
      "summary": "A transaction in October of 2024, between an American company and a Mexican one, resulted in a chain of U.S.-located gas station convenience stores being owned by the Mexican firm.\nThese retail operations consisted of 249 convenience stores that operated under the DK brand, located in New Mexico, Arkansas, and Texas.\nAs an oil products producer, it has a refining capacity of 302,000 barrels each day.\nThe Mexican company that bought the convenience stores at Delek's gas stations is called FEMSA.\nIt's a huge conglomerate that includes the OXXO chain of 28,800 convenience stores located in Mexico, Chile, Peru, Brazil, and Colombia.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-02-22T17:45:00Z",
      "source": "SlashGear"
    }
  },
  {
    "article": {
      "id": "NDg=",
      "url": "https://www.npr.org/2026/02/21/nx-s1-5720226/kenya-ukraine-russia-war",
      "title": "'Given a gun and sent to die': Kenyans lured to fight for Russia in Ukraine",
      "summary": "'Given a gun and sent to die': Kenyans lured to fight for Russia in Ukrainetoggle caption Simon Maina/AFP via Getty ImagesNAIROBI, Kenya — In Sikonga village, Kisii County, a mother's wails fill the house.\nAccording to the intelligence report, 89 Kenyans remain on the frontline, 39 have been hospitalized, and 28 are missing in action.\nSponsor Message\"More telling is the collusion by officers at the Russian Embassy and the Kenyan Embassy in Moscow,\" Ichung'wah told Parliament.\nOpposition MP Joseph Makilap, who pushed for the intelligence report to be released, said the scale of the recruitment was staggering.\nAccording to the Kenyan intelligence report the recruitment networks involve both Kenyan and foreign actors.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-21T11:20:58Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDk=",
      "url": "https://www.wired.com/story/they-bet-against-trumps-tariffs-now-they-stand-to-make-millions/",
      "title": "They Bet Against Trump’s Tariffs. Now They Stand to Make Millions",
      "summary": "Investment firms are on track for an enormous payday after the Supreme Court of the United States (SCOTUS) struck down President Donald Trump’s signature tariff policy on Friday.\nWhen Trump introduced sweeping tariffs on foreign goods last April, hedge funds and specialist investment firms began to bet on the possibility that the courts might rule that he had violated the law.\nEven then, he says, the administration may choose to challenge any lower court ruling that requires the government to refund tariff payments.\nThe prevailing uncertainty leaves the investment firms holding refund claims with a dilemma: Should they bank some winnings by flipping the claims to another buyer, or wait out the legal wrangling?\n“Trump is Trump is Trump, man,” says Braziel.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-20T21:05:44Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "NTA=",
      "url": "https://www.npr.org/2026/02/21/nx-s1-5720966/trump-iran",
      "title": "With U.S. forces in position, Trump mulls his options for Iran",
      "summary": "With U.S. forces in position, Trump mulls his options for Irantoggle caption Saul Loeb/AFP via Getty ImagesPresident Trump says he hasn't decided whether he'll launch a military strike on Iran.\nSome days he sounds like he would be satisfied with a negotiated deal on the country's nuclear program.\n\"There is no military solution for Iran's nuclear program,\" he told the MS NOW program Morning Joe.\nTrump wants Iran to effectively give up its nuclear program.\nHowever, Trump has so far not made a major speech to the American people about the prospect of a new Middle East war.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-21T11:00:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTE=",
      "url": "https://indianexpress.com/article/cities/lucknow/yogi-to-leave-for-4-day-visit-to-singapore-japan-expansion-on-agenda-10545313/",
      "title": "Yogi to leave for 4-day visit to Singapore, Japan today; investment diplomacy boost, industrial expansion on agenda",
      "summary": "Yogi Adityanath has departed for a four-day visit to Singapore and Japan to attract investments and deepen industrial partnerships.\n(File Photo)Uttar Pradesh Chief Minister Yogi Adityanath will leave on Sunday evening for his four-day visit to Singapore and Japan aimed at strengthening the state’s investment diplomacy and industrial expansion.\nThis will be his first foreign visit after his Myanmar trip in 2017.\nA key highlight of the visit will be Government-to-Business (G2B) meetings and roundtable interactions, where CM Adityanath will engage directly with the investors.\nActing in the role of the state’s CEO, he will also present Uttar Pradesh’s industrial roadmap, policy stability, and business potential.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-22T03:56:59Z",
      "source": "The Indian Express"
    }
  },
  {
    "article": {
      "id": "NTI=",
      "url": "https://petapixel.com/2026/02/20/us-supreme-court-rules-trumps-tariffs-are-illegal/",
      "title": "US Supreme Court Rules Trump’s Tariffs Are Illegal",
      "summary": "The United States Supreme Court has struck down President Trump’s controversial global tariffs in a 6-3 ruling.\nEvery lower court that had considered Trump’s use of tariffs had ruled against him.\nToday, the Supreme Court has validated what we’ve been saying all along: these tariffs were unlawful from the start.\n“Small businesses are rightfully worried that the Administration will respond to this legal defeat by simply reimposing the same tariff policy through other means.\nTariffs imposed under IEEPA crippled small businesses; tariffs reimposed under different statutory approaches would have the same destructive effect.",
      "category": "economics",
      "bias": "right",
      "publishedAt": "2026-02-20T15:49:58Z",
      "source": "PetaPixel"
    }
  },
  {
    "article": {
      "id": "NTM=",
      "url": "https://www.businessinsider.com/who-is-susan-rice-netflix-board-member-trump-wants-fired-2026-2",
      "title": "Who is Susan Rice, the former national security advisor in Trump's crosshairs?",
      "summary": "President Donald Trump has demanded that Netflix remove former US ambassador and national security advisor Susan Rice from its board, stepping up his criticism of the streaming giant as it seeks to merge with Warner Bros.\nRice, who served in senior roles in the Obama and Biden administrations, recently warned companies against aligning with Trump.\nIn some situations, national security officials argue that knowing the person's identity is necessary to interpret and assess the intelligence information.\nAs UN Ambassador, Rice supported US intervention against Muammar Gaddafi.\nIn a 2025 column in The New York Times, Rice accused members of Trump's national security team of \"reckless negligence\" after they discussed sensitive national security matters on Signal.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-22T14:54:15Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NTQ=",
      "url": "https://www.businessinsider.com/coo-job-is-especially-challenging-with-tariff-uncertainty-scotus-2026-2",
      "title": "COO's Jobs Are Especially Challenging Due to Tariff Uncertainty",
      "summary": "Friday's tariff ruling has once again put America's supply-chain bosses in a bind.\n\"Tariffs are written in DC, and they're felt in the COO's inbox,\" Jason Schloetzer, a professor at Georgetown's McDonough School of Business, told Business Insider.\nMany companies are still grappling with the impact of actions they took last year to cope with Trump's tariff hikes, said Rob Lalka, who teaches entrepreneurship at Tulane University.\nNow, with the fate of Trump's tariffs up in the air, COOs are experiencing the kind of whiplash that can be debilitating, said Lalka, especially for those at startups and small businesses with limited resources.\nOmni, which imports goods from Spain and exports to Canada, lost sales last year due to the Trump administration's tariffs, Smith said.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-21T10:39:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NTU=",
      "url": "https://slate.com/news-and-politics/2026/02/supreme-court-analysis-john-roberts-trump-tariffs-fail.html",
      "title": "John Roberts’ Rebuke of Trump’s Tariffs Is Withering, Confident, and Genuinely Encouraging",
      "summary": "The Supreme Court struck down Donald Trump’s sweeping “emergency” tariffs on Friday, ruling 6–3 that they far exceed what federal law allows.\nIn truth, Trump’s tariffs were always on shaky legal ground, no matter how confidently the White House insisted they were permissible.\nBut IEEPA does not mention tariffs, duties, taxes, or anything else that would hint at Congress’ desire to delegate tariff authority to the executive branch.\nRoberts, joined by Gorsuch and Barrett, invoked the “major questions doctrine” to bolster their conclusion that IEEPA does not cover tariffs.\nAdvertisementTrump’s Justice Department argued that the doctrine does not apply to “foreign affairs,” attempting to gerrymander a massive exception to accommodate its trade policy.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-20T17:07:07Z",
      "source": "Slate Magazine"
    }
  },
  {
    "article": {
      "id": "NTY=",
      "url": "https://news.slashdot.org/story/26/02/22/0213244/f-35-software-could-be-jailbreaked-like-an-iphone-dutch-defense-minister",
      "title": "F-35 Software Could Be Jailbreaked Like an IPhone: Dutch Defense Minister",
      "summary": "Can anyone remember when the times were not hard, and money not scarce?",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-22T15:34:00Z",
      "source": "Slashdot.org"
    }
  }
]