[
  {
    "article": {
      "id": "MA==",
      "url": "https://www.businessinsider.com/k-shaped-economy-wealth-gap-gary-cohn-trump-economic-advisor-2026-2",
      "title": "Trump's former chief economic advisor says workers are 'suffering' in America's K-shaped economy",
      "summary": "Gary Cohn, a former economic advisor to Trump and the vice chairman of IBM.\nGary Cohn, a former economic advisor to Trump and the vice chairman of IBM.\nPATRICK T. FALLON/AFP via Getty ImagesGary Cohn, a former economic advisor to Trump and the vice chairman of IBM.\nGary Cohn, Trump's former chief economic advisor, said both these realities are true right now in America.\nThat's when people at the top see profound economic growth, while those at the bottom, who are more sensitive to economic shifts, face financial stress.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-01T19:49:55Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MQ==",
      "url": "https://www.bbc.com/news/articles/ce3k4xdqyp1o",
      "title": "Rachel Reeves defends 'fair and reasonable' student loans system",
      "summary": "Pierre said people going to university aged 17 or 18 are advised \"this is a loan you're not going to notice\", with low rates of interest that won't affect you getting a mortgage, \"but it turns out, it does,\" he said.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-01-31T11:12:38Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Mg==",
      "url": "https://www.theatlantic.com/newsletters/2026/01/markets-response-trump-investors-chaos/685844/",
      "title": "The Markets Are Getting Used to Trump",
      "summary": "Lately, investors seem to be holding something back—amid a barrage of potentially seismic decisions from the White House, markets have barely budged.\nThe “TACO” theory (short for “Trump Always Chickens Out”) emerged as a way to describe his tendency to overpromise.\nThe economists I spoke with stressed that although these three cases are distinct, on the whole, markets have become more inured to the Trump administration’s actions.\nFinancial markets are in the business of pricing threats—and Trump will surely keep them coming.\nPresident Trump said he will nominate Kevin Warsh, a former Federal Reserve governor, to succeed Jerome Powell as Fed chair when Powell’s term ends in mid-May.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-31T01:10:00Z",
      "source": "The Atlantic"
    }
  },
  {
    "article": {
      "id": "Mw==",
      "url": "https://thenextweb.com/news/the-rise-of-subscription-economy",
      "title": "The rise of the always-on economy: subscriptions beyond streaming",
      "summary": "Despite how modern it seems to be, the truth is that the subscription economy has been around for some time, surprisingly dating back to around 1800, with the first magazine subscriptions, or the subscriptions for fresh British milk, around 1860.\nOver the years, the of subscription-based companies has turned the subscription model into an ideal business strategy since it provides unique benefits.\nSoftware as a service (SaaS) remains the biggest part of the subscription market with a revenue of more than $250B by 2022.\nFrom education to parasocial relationshipsThe subscription economy has expanded to other services, such as education.\nThe next phase will likely combine hybrid subscription models with usage-based pricing and data-driven personalization.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-31T15:37:56Z",
      "source": "The Next Web"
    }
  },
  {
    "article": {
      "id": "NA==",
      "url": "https://www.businessinsider.com/jpmorgan-beauty-banker-rhode-sale-fei-fei-zhang-2026-2",
      "title": "This JPMorgan banker sold Hailey Bieber's skincare brand for $1 billion. Here's how she spots winners.",
      "summary": "Fei-Fei Zhang, a managing director at JPMorgan Chase, helped steer the firm's work on the $1 billion sale of Rhode, the beauty brand co-founded by Hailey Bieber.\nFei-Fei Zhang, a managing director at JPMorgan Chase, helped steer the firm's work on the $1 billion sale of Rhode, the beauty brand co-founded by Hailey Bieber.\nCourtesy of JPMorganFei-Fei Zhang, a managing director at JPMorgan Chase, helped steer the firm's work on the $1 billion sale of Rhode, the beauty brand co-founded by Hailey Bieber.\nZhang was a senior leader on the team behind the $1 billion sale of Rhode, the skincare brand cofounded by Hailey Bieber, to e.l.f.\nWithin weeks, British skincare brand Medik8 was sold to cosmetics giant L'Oreal for more than $1 billion, which Zhang advised on.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-01T11:54:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NQ==",
      "url": "https://indianexpress.com/article/business/in-headwinds-union-budget-2026-27-stays-the-course-batters-markets-with-tax-10508114/",
      "title": "In headwinds, Budget stays the course, batters markets with tax",
      "summary": "Union Minister for Finance Nirmala Sitharaman poses with her team for a photo op before leaving to present the Budget in New Delhi on Sunday.\n(Express Photo by Tashi Tobgyal) Union Minister for Finance Nirmala Sitharaman poses with her team for a photo op before leaving to present the Budget in New Delhi on Sunday.\nStory continues below this adUnion Finance Minister Nirmala Sitharaman presents Union Budget 2026, in New Union Finance Minister Nirmala Sitharaman presents Union Budget 2026, in New Delhi , on Sunday.\nUnion Finance Minister Nirmala Sitharaman during the post-Budget press conference in New Delhi on Sunday.\n(Express Photo: Tashi Tobgyal) Union Finance Minister Nirmala Sitharaman during the post-Budget press conference in New Delhi on Sunday.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-02T00:00:03Z",
      "source": "The Indian Express"
    }
  },
  {
    "article": {
      "id": "Ng==",
      "url": "https://finance.yahoo.com/news/flooded-cheap-chinese-goods-latin-045553078.html",
      "title": "Flooded by cheap Chinese goods, Latin America is fighting back to protect its industries",
      "summary": "“Latin America has a solid middle class, relatively high purchasing power and real demand,” said Margaret Myers, director of the Asia and Latin America program at the Inter-American Dialogue think tank in Washington.\nChinese autos make inroads in Brazil and MexicoMexico and Brazil -- Latin America’s regional auto manufacturing centers -- also are under pressure from rising imports of low-priced Chinese cars.\nChinese automakers such as BYD and GWM see huge growth opportunities in Latin America.\nCommodity-rich Latin America has limited leverage on ChinaChina needs Latin America's vast natural resources for its hungry industries, from lithium in Brazil to copper in Chile and fishmeal in Peru.\nOther countries may follow suit, as some analysts expect more protectionist measures including tariffs and stiffer regulations coming out of Latin America.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-02-02T04:55:53Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Nw==",
      "url": "https://www.aljazeera.com/features/2026/1/31/gazas-collapsing-economy-drives-youth-to-create-unconventional-solutions",
      "title": "Gaza’s collapsing economy drives youth to create unconventional solutions",
      "summary": "Innovation becomes a go-to strategy for Gaza’s youth as they battle unemployment in a hostile economic environment.\nAhmed Fares Abu Zayed, CEO of Abu Zayed General Trading, described how his company’s operations came to a halt when the war began.\nThe situation was extremely difficult.”AdvertisementRather than shutting down entirely, Abu Zayed began searching for alternatives.\n“When traditional jobs are absent, innovation becomes a means to create opportunities instead of waiting for them,” she said.\nAbu Zayed noted that his electricity project did more than solve his own problem.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-01-31T07:38:21Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "OA==",
      "url": "https://www.businessinsider.com/flew-9-hours-europe-best-airline-economy-cabin-turkish-food-2026-1",
      "title": "Flew 9 Hours in Europe's 'Best' Airline Economy Cabin; Food Impressed",
      "summary": "I flew on Turkish Airlines for nine hours to see what Europe's 'best' airlines has to offer.\nI flew on Turkish Airlines for nine hours to see what Europe's 'best' airlines has to offer.\nTaylor Rains/Business InsiderI flew on Turkish Airlines for nine hours to see what Europe's 'best' airlines has to offer.\nTaylor Rains/Business Insiderlighning bolt icon An icon in the shape of a lightning bolt.\nThe airline was named Europe's best economy class in the 2025 Skytrax awards, which evaluate cabin service, seating, and catering.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-01-31T10:35:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "OQ==",
      "url": "https://finance.yahoo.com/video/why-openai-needs-to-raise-equity-and-a-lot-of-it-200000171.html",
      "title": "Why OpenAI needs to raise equity, and 'a lot of it'",
      "summary": "Well, they're going to need to raise a lot of equity.\nI think the recent equity raise which was very successful by Anthropic makes me feel better about it.\nBut I hope uh this works because man, a lot of folks are dependent on Open AI raising equity.\nDo they have another opportunity even besides that working with Open AI to monetize their own AI intentions.\nI would think that it could be a good deal for both sides, but I think it's particularly important for Open AI.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-01T20:00:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTA=",
      "url": "https://www.buzzfeed.com/alexalisitza/tracking-trump-economy-december",
      "title": "Keeping Track Of Trump's Economy: December 2025",
      "summary": "Gas is a sensitive topic for Economy Hate Watch readers.\nSome people are seeing numbers that start with a six, and others — the lucky souls — are seeing twos.\nWhat I will say is that our last edition got a comment that begged me to reiterate that gas prices are cyclical.\nPeople go outside and travel more during the summer, and tend to stay inside more during the winter.\nFor now, at $3.024 a gallon, we may be seeing the winter price ahead of a summer boom.",
      "category": "economics",
      "bias": "right",
      "publishedAt": "2026-02-01T14:45:01Z",
      "source": "Buzzfeed"
    }
  },
  {
    "article": {
      "id": "MTE=",
      "url": "https://www.aljazeera.com/news/2026/2/1/indias-budget-bets-on-infrastructure-manufacturing-amid-global-trade-war",
      "title": "India’s budget bets on infrastructure, manufacturing amid global trade war",
      "summary": "Indian Prime Minister Narendra Modi’s government has unveiled its annual budget, aiming for steady growth in an uncertain global economy rocked by recent tariff wars.\nFinance Minister Nirmala Sitharaman presented the budget for the 2026-2027 financial year in Parliament on Sunday, prioritising infrastructure and domestic manufacturing, with a total expenditure estimated at $583bn.\nIndia’s economy has so far weathered punitive tariffs of 50 percent imposed by United States President Donald Trump over New Delhi’s imports of Russian oil.\nDespite the past year’s challenges, the Indian economy has remained one of the world’s fastest growing.\nIt is a shade softer than this year’s projected 7.4 percent but still outpaces estimates by global institutions such as the World Bank.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-01T11:34:47Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "MTI=",
      "url": "https://indianexpress.com/article/cities/ahmedabad/fund-cuts-in-sectors-that-affect-most-needy-people-chavda-on-union-budget-10508055/",
      "title": "Fund cuts in sectors that affect most needy people: Chavda on Union Budget",
      "summary": "“The economy is continuously collapsing, the rupee is continuously devaluing.\nThe budget does not show any concrete plan to combat the continuous rise in inflation, unemployment, economic inequality, and declining income,” Chavda said.\nGujarat Pradesh Congress Committee president Amit Chavda on Sunday criticised the Union Budget 2026-27, saying that thousands of crores of rupees have been cut in sectors such as health, education, social welfare, agriculture, rural and urban development.\n“What is disturbing is that these cuts have been made in sectors that affect the most needy people.\nThe government is proud of the fiscal deficit of 4.4 per cent, but this figure has been achieved at the cost of people’s health, education and future.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-02-01T19:24:38Z",
      "source": "The Indian Express"
    }
  },
  {
    "article": {
      "id": "MTM=",
      "url": "https://www.theregister.com/2026/02/02/oracle_cloud_expansion_investment_plan/",
      "title": "Oracle seeks $45-$50 billion to fund cloud expansion",
      "summary": "One is issuing bonds, a move Big Red thinks will win it about half the cash it wants.\nOracle also says these are the only bonds it will issue in 2026.\nThe company will also issue mandatory convertible preferred securities that it says will deliver “a modest portion of the overall equity funding.” The rest will come from “a newly authorized at-the-market equity program of up to $20 billion.”Some investors weren’t entirely happy last year when Oracle used bonds to raise $18 billion to fund cloud builds, arguing that the debt might create risk.\nBig Red’s bulletin twice mentions that it can raise this lot of cash while its stock remains “investment-grade” – an admission that some investors might worry that raising this much cash might be a risky move given the uncertainty surrounding AI.\nInvestors are also likely aware that Oracle’s cloudy competitors – the likes of Microsoft, Google, and Amazon – all win $250 billion-plus of annual revenue, compared to Oracle’s $57 billion, and are spending a lot more than Big Red on datacenter infrastructure.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-02T05:01:47Z",
      "source": "Theregister.com"
    }
  },
  {
    "article": {
      "id": "MTQ=",
      "url": "https://www.businessinsider.com/laid-off-amazon-tech-worker-job-search-challenges-advice-2026-1",
      "title": "I was laid off by Amazon and am struggling to find work. The job market feels like a brick wall, and I'm worried about my finances.",
      "summary": "While my final paychecks from Amazon I received through this month have helped cushion the transition, the slow progress in my job search has left me increasingly worried about my finances.\nBusiness Insider is speaking with workers who've found themselves at a corporate crossroads — whether due to a layoff, resignation, job search, or shifting workplace expectations.\nIn 2024, I transferred to a similar role on a fully remote team, which allowed me to return home to Michigan.\nMy advice for people who have been laid offI'm super stressed about my job search and recently applied for unemployment benefits.\nWhile it's important to stay consistent in your job search, I'd also recommend taking some time to rest — apply steadily, not at full throttle.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-01-31T10:05:02Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTU=",
      "url": "https://cheezburger.com/44162821/im-two-days-in-and-the-red-flag-list-is-already-a-mile-long-designer-wants-to-quit-job-2-days-in",
      "title": "‘I’m two days in, and the \"red flag\" list is already a mile long’: Designer wants to quit job 2 days in after 8 months of unemployment",
      "summary": "Employee uses loophole in company's half day policy, ends up working just one hour a day every Friday: 'Half days entirely depend on the set lunch time?\nAlright then!'",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-01-31T14:00:00Z",
      "source": "Cheezburger.com"
    }
  },
  {
    "article": {
      "id": "MTY=",
      "url": "https://www.businessinsider.com/europe-defense-tech-startups-founders-vc-boom-funding-deployment-2026-2",
      "title": "Inside the Startup Rush for Europe's New War Chest",
      "summary": "A NATO member had agreed to buy airships for surveillance under an alliance program pushing Western militaries to adopt new tech.\nKelluu is trying to make it big in a market that hasn't been kind to small firms.\nAccording to the NATO Innovation Fund in February, venture capital investments in European defense tech reached $1 billion in 2024, up by four times since 2020.\nTo make it in the old defense world, small firms typically needed to be bought by a prime.\nRead this collection to get to know some of the startups seeking a slice of Europe's expanding war chest:",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-02T00:08:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTc=",
      "url": "https://slashdot.org/story/26/01/31/2344202/ai-use-at-work-has-increased-gallup-poll-finds",
      "title": "AI Use at Work Has Increased, Gallup Poll Finds",
      "summary": "What this country needs is a good five cent ANYTHING!",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-01-31T23:46:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MTg=",
      "url": "https://www.cnet.com/tech/services-and-software/nordvpn-anti-phishing-lab-test/",
      "title": "NordVPN Software Blocked 92% of Phishing Emails in Independent Testing",
      "summary": "NordVPN's anti-malware software Threat Protection Pro blocked 92% of phishing websites in an independent lab test of several antivirus products, browsers and VPNs in results released this week.\nAV-Comparatives, based in Austria, attacked 15 products with 250 websites -- all verified to be valid phishing URLs -- in a test that ran Jan. 7 to 19.\nThese phishing attempts might be sent in emails, but they also appear on websites, in texts and in voicemails.\nCNET offers tips for how to detect phishing attempts on even the most sophisticated of emails.\nIn the AV-Comparatives test, which evaluated phishing-page detection and false-positive rates, NordVPN's Threat Protection Pro ranked fourth among security products, blocking 92% of the 250 phishing URLs tested.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-01T18:20:43Z",
      "source": "CNET"
    }
  },
  {
    "article": {
      "id": "MTk=",
      "url": "https://www.businessinsider.com/tech-executives-share-how-they-reset-shift-deep-thinking-2026-2",
      "title": "3 tech executives share how they find time and space for deep thinking",
      "summary": "Left to right: Shishir Mehrotra at Superhuman, Joe Depa at EY, and Parker Harris at Slack.\nLeft to right: Shishir Mehrotra at Superhuman, Joe Depa at EY, and Parker Harris at Slack.\nThree executives from Slack, EY, and Superhuman shared how they reset to make room for deep thinking amid stacked calendars.\nParker Harris, CTO SlackParker Harris said he turns the sound off on his notifications when turning to deep thinking.\nJoe Depa, EY global chief innovation officerJoe Depa is the global chief innovation officer at EY.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-01T10:20:02Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjA=",
      "url": "https://www.bbc.com/news/articles/cg4ewrw2drpo",
      "title": "'I spoke to ChatGPT 8 times a day' - Gen Z's loneliness 'crisis'",
      "summary": "\"AI chatbots very rarely do that unless you really tell them to.\nAnd so there's a sort of sycophantic element of basically sort of talking to yourself in a way, like to a mirror.\nIt mirrors back what it thinks you want to hear.\"",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-31T02:39:24Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "MjE=",
      "url": "https://www.businessinsider.com/vibe-coding-team-embed-google-gemini-hackathon-singapore-2026-2",
      "title": "I embedded myself in a vibe coding team at Gemini's AI hackathon in Singapore. Building an app in 7 hours takes real work.",
      "summary": "I followed a hackathon team as they raced to vibe code an app in seven hours at Google's Gemini 3 Hackathon in Singapore.\nI followed a hackathon team as they raced to vibe code an app in seven hours at Google's Gemini 3 Hackathon in Singapore.\nLee Chong Ming/Business InsiderI followed a hackathon team as they raced to vibe code an app in seven hours at Google's Gemini 3 Hackathon in Singapore.\nHours later, they were racing to prototype it at Google's Gemini 3 Hackathon in Singapore.\nI embedded with the team at Google's developer space in Singapore in January to observe how a vibe-coding project comes together — or nearly falls apart — in seven hours.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-02T05:07:11Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjI=",
      "url": "https://hackaday.com/2026/01/31/surviving-the-ram-price-squeeze-with-linux-in-kernel-memory-compression/",
      "title": "Surviving The RAM Price Squeeze With Linux In-Kernel Memory Compression",
      "summary": "You’ve probably heard — we’re currently experiencing very high RAM prices due mostly to increased demand from AI data centers.\nUbuntu users should check out systemd-zram-generator instead, and be aware that zram might already be installed and configured by default on your Ubuntu Desktop system.\nIf you’re interested in the history of in-kernel memory compression LWN.net has an old article covering the technology as it was gestating back in 2013: In-kernel Memory Compression.\nFor those trying to get a grip on what has happened with RAM prices in recent history, a good place to track memory prices is memory.net and if you swing by you can see that a lot of RAM has gone up as much as four times in the last three or four months.\nIf you have any tips or hacks for memory compression on other platforms we would love to hear from you in the comments section!",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-01-31T09:00:06Z",
      "source": "Hackaday"
    }
  },
  {
    "article": {
      "id": "MjM=",
      "url": "https://www.businessinsider.com/big-four-ai-agents-creating-upskilling-challenge-2026-1",
      "title": "The Big Four's AI revolution has a problem: how junior staff actually learn",
      "summary": "Big Four leaders say agents will soon handle the grunt work, freeing up junior employees to focus on strategic work.\n\"This is the big question right now that I haven't been able to get anybody to answer for me,\" Yvonne Hinson, CEO of the American Accounting Association, told Business Insider.\nEntry-level hires complete a \"four-day AI immersion course\" that teaches them both how to work with AI and how to leverage human skills, the firm told Business Insider.\nErrol Gardner, global vice chair of consulting at EY, told Business Insider that the foundational skillset now includes developing judgment about where and how to use AI.\n\"AI actually gives us the opportunity to be more deliberate about development, helping early-career professionals move into higher-value work sooner,\" said PwC's Burke.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-31T11:10:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjQ=",
      "url": "https://www.theverge.com/tech/871641/spacex-fcc-1-million-solar-powered-data-centers-satellites-orbit",
      "title": "SpaceX wants to put 1 million solar-powered data centers into orbit",
      "summary": "SpaceX filed a request with the FCC on Friday seeking approval to put a constellation of one million data center satellites into orbit.\nThe filing proposes establishing a network of solar-powered data centers in low Earth orbit that communicate with one another via lasers.\nBut SpaceX argues that the orbital data centers would be a cheaper and more environmentally friendly alternative to land-based centers that form the backbone of the growing AI industry.\nThe backlash against data centers has been growing, and communities are increasingly winning their battles to block their construction.\nCorrection January 31st: An earlier version of this article stated that there were over 11,000 Starlink satellites in orbit.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-31T19:38:36Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjU=",
      "url": "https://www.businessinsider.com/moltbook-ai-agents-social-network-reddit-2026-2",
      "title": "A look inside Moltbook — the Reddit-style social media site for AI agents that is dividing humans",
      "summary": "Moltbook, a new Reddit-style social network made entirely for AI agents, can be read in a few different ways.\nThe post garnered the attention not just of thousands of other AI agents on the site, but also of the humans watching it all unfold.\nThe enthusiasm is notable, given that Karpathy said just last October on the Dwarkesh Podcast that he was utterly unimpressed with the state of AI agents.\nIn the near future, it will be common for certain AI agents, with unique identities, to become famous,\" Schlicht wrote on X.\nAs of February 1, the site says there are already more than 1,534,287 AI agents on the platform, and 85,017 comments.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-02T01:26:37Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjY=",
      "url": "https://www.androidcentral.com/streaming-tv/this-samsung-oled-tv-just-scored-a-whopping-usd1-100-discount-at-best-buy-just-in-time-for-super-bowl-sunday",
      "title": "This Samsung OLED TV just scored a whopping $1,100 discount at Best Buy, just in time for Super Bowl Sunday",
      "summary": "Super Bowl Sunday is nearly here, and TV deals are hitting retailers all across the web, ready to upgrade any party.\nFor example, Best Buy has slashed $1,100 off the price of this 65-inch Samsung 4K TV, marking over half off the normal sticker price and bringing it down to just $900.\nAdditionally, this Tizen TV comes with One UI, as well as more than 2,700 free channels, 400 premium Samsung TV Plus channels, and a long-term update promise that makes it more future-proof than many other TVs.\n$1,100 off Samsung 65-inch Class S84F OLED 4K TV: $1,999.99 $899.99 at Best Buy Best Buy's latest TV discount comes just ahead of Super Bowl Sunday, as the retailer has cut $1,100 off the price of the Class S84F 65-inch model.\nThe smart TV also runs a version of One UI that's well-liked by buyers, while purchase includes seven years of automatic OS upgrades.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-01T14:05:00Z",
      "source": "Android Central"
    }
  },
  {
    "article": {
      "id": "Mjc=",
      "url": "https://www.androidcentral.com/apps-software/ai/you-can-watch-a-video-overview-of-your-notebooklm-research-on-android-now-and-more",
      "title": "You can watch a 'Video Overview' of your NotebookLM research on Android now, and more",
      "summary": "What you need to knowNotebookLM's app on Android and iOS is reportedly receiving Video Overviews after waiting for some time.\nVideo Overviews are AI-generated slideshows, packed with visuals, controls, and more, all about the content you've given NotebookLM to help you learn and understand.\nA previous update for NotebookLM on mobile brought flashcards and quizzes to people looking to study new topics.\nNotebookLM has been slowly upgrading how it condenses and delivers heavy research notes to users, and this latest update on Android is adding what it's been missing.\nA post by 9to5Google highlights a recent update for NotebookLM that's started rolling out for Android and iOS devices, bringing videos.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-31T12:36:00Z",
      "source": "Android Central"
    }
  },
  {
    "article": {
      "id": "Mjg=",
      "url": "https://gyptazy.com/blog/fosdem-2026-opensource-conference-brussels/",
      "title": "FOSDEM 2026 – Open Source, Digital Sovereignty, and Europes Future",
      "summary": "FOSDEM 2026 – Open Source, Digital Sovereignty, and Europes Future2026-01-31FOSDEM, the Free and Open Source Developers’ European Meeting, is an annual pilgrimage for open source enthusiasts from all over the world.\nWhat started as a small gathering in 2000, originally named the Open Source Developers of Europe Meeting (OSDEM), has grown into one of the most significant conferences dedicated to free and open source software.\nFOSDEM 2026 - Sovereignty.\nMore people take open source seriously, more organizations depend on it, and more contributors want to get involved.\nNot every open source project exists to solve geopolitical problems, and not every contributor arrives with a policy agenda.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-01T10:30:41Z",
      "source": "Gyptazy.com"
    }
  },
  {
    "article": {
      "id": "Mjk=",
      "url": "https://www.businessinsider.com/drones-may-not-change-infantry-job-uk-officer-2026-2",
      "title": "Infantry will still be fighting in muddy holes even as drones change war, British officer says",
      "summary": "Dmytro Smolienko/Ukrinform/NurPhoto via Getty ImagesDrones are prolific in Ukraine, but much of traditional land warfare also remains.\nBut Lt. Col Ben Irwin-Clark, the commanding officer of its 1st Battalion, told Business Insider that he believes most of an infantryman's job likely won't change even as drone technology proliferates.\nUkraine is pioneering drone warfare, but has had to rely on it so heavily amid shortages of other weaponry.\nThe Irish Guards are using drones in their exercises and training their soldiers in drone warfare.\nSinéad BakerThe British officer isn't alone in his thinking on the impact of drones on war and the infantry.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-02-01T11:31:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzA=",
      "url": "https://www.businessinsider.com/elon-musk-inc-company-connections-tesla-spacex-xai-boring-2026-2",
      "title": "All the ways Elon Musk's companies are already intertwined, from a Tesla 'collab' with SpaceX to Grok in vehicles",
      "summary": "Elon Musk's companies have been swapping IP and cash.\nElon Musk's companies have been swapping IP and cash.\nHarun Ozalp/Anadolu via Getty ImagesElon Musk's companies have been swapping IP and cash.\nHere are some of the recent sharing agreements, purchases, and investments between Musk's companies.\nExecutives share overlapping functions on several of Musk's companies, too, according to insider org charts obtained by Business Insider.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-01T10:00:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzE=",
      "url": "https://www.businessinsider.com/electric-bills-surge-utilities-31b-rate-increases-2025-2026-1",
      "title": "Utilities want $31 billion more from customers, and your electric bill is about to feel it",
      "summary": "Electric and gas utilities asked state regulators to approve $31 billion in rate increases last year, more than double the $15 billion they sought in 2024, a new study from PowerLines, a nonprofit that advocates for utility customers, found.\nMuch of that came from Florida Power and Light's $9 billion rate hike request — nearly all of which regulators approved.\n\"I never want Americans to pay higher electricity bills because of data centers,\" Trump said in the post.\nPower demand forecastsSome power grid researchers are skeptical of the forecast demand.\nSteering utilities to first consider the latest electric grid-enhancing technologies before building new power plants to serve data centers could also help lower customer electric bills, Hua said.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-31T10:00:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzI=",
      "url": "https://finance.yahoo.com/news/investor-made-20-million-nvidia-010505225.html",
      "title": "Investor Who Made $20 Million on Nvidia Stock Reveals the Next Big Opportunity",
      "summary": "One young investor poured money into the stock during that period and turned it into a $20 million position.\nRecently, he shared how he spotted the opportunity — and where he believes the next big investing opportunity could be found.\nWhat To Look For in a StockThe Nvidia investor appeared in a Whop on the Street video in which host Josh Suggs asked Wall Street millionaires how to get rich.\nSome people knew that cracking the AI code could lead to tremendous riches, and instead of creating the next Nvidia, the investor bought Nvidia stock.\nHe cited a recent breakthrough by Google involving its Willow chip, which brought quantum computing closer to real-world applications.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-02T01:05:05Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzM=",
      "url": "https://hardware.slashdot.org/story/26/02/01/080244/99-of-new-us-energy-capacity-will-be-green-in-2026",
      "title": "99% of New US Energy Capacity Will Be Green in 2026",
      "summary": "What this country needs is a good five cent ANYTHING!",
      "category": "environment",
      "bias": "lean right",
      "publishedAt": "2026-02-01T12:34:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MzQ=",
      "url": "https://www.bbc.com/news/articles/c75xg17rr1xo",
      "title": "Ukrainians brace for -20C despite energy truce: 'It will be a catastrophe'",
      "summary": "\"Of course we are following the talks, we want some stability,\" Iryna tells me people here long for peace more than anyone.\n\"But how can we trust Russia not to stab us in the back?\"",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2026-01-31T07:47:58Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "MzU=",
      "url": "https://www.yahoo.com/news/articles/supply-popular-fruit-plummets-severe-190000539.html",
      "title": "Supply of popular fruit plummets as severe storms devastate crops: 'On course for its worst season'",
      "summary": "Advertisement AdvertisementFrequent extreme weather events, which have been increasing, damage agricultural yields.\nFood supply chains can be fragile as weather events cause downturns across continents.\nClimate-related threats to a stable and affordable food supply are local and global.\nDoing so stabilizes global temperatures and mitigates extreme weather events that ruin agriculture.\nThe current cherry season in Argentina has its setbacks.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-02-01T19:00:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzY=",
      "url": "https://www.businessinsider.com/western-forces-arctic-cold-is-one-of-their-toughest-enemies-2026-1",
      "title": "For Western Forces in Arctic, Cold Is One of Their Toughest Enemies",
      "summary": "Jake Epstein/Business InsiderIn Arctic warfare, surviving the elements is a fight all on its own.\nNATO soldiers training in Arctic warfare are learning that in a future conflict, fighting the enemy may be only half the battle.\nFinland's Jaeger Brigade teaches a monthlong course in Arctic warfare and cold-weather survival.\nJake Epstein/Business InsiderSoldiers learn skills such as navigating terrain, staying dry, and fighting in harsh conditions.\nJake Epstein/Business InsiderAs part of the course, soldiers participated in a combat exercise that included a ski assault.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-31T12:57:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mzc=",
      "url": "https://www.sintef.no/en/latest-news/2026/pretty-soon-heat-pumps-will-be-able-to-store-and-distribute-heat-as-needed/",
      "title": "Pretty soon, heat pumps will be able to store and distribute heat as needed",
      "summary": "“Think of it as a thermal battery, which stores the heat from the heat pump and can be used later.\nSimonsen is a member of the team that has developed the new thermal batteries.\nWith the new batteries, heat pumps combine storage and smart distribution of heat,” says Simonsen.\n“Specifically, we have designed and tested a type of heat sink that improves heat transfer in the thermal batteries,” says Simonsen.\n“Corrosion is particularly critical because salt hydrates are tough on aluminium, especially when impurities are present.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2026-02-01T18:15:40Z",
      "source": "Sintef.no"
    }
  },
  {
    "article": {
      "id": "Mzg=",
      "url": "https://newatlas.com/environment/cern-supercollider-waste-heat-homes/",
      "title": "CERN supercollider gets sustainable side hustle heating local homes",
      "summary": "How about a side hustle heating several thousand homes in the neighborhood?\nWith a circumference of 26.7 km (16.6 miles), the LHC it is the largest particle accelerator ever built.\nAside from generating electricity bills that would rival my overdraft, it also results in waste heat – lots of waste heat.\nThis building houses the connection between CERN's heat exchange system and the heating system for the new commercial and residential area of Ferney-Voltaire CERNThe system was inaugurated last December and is now becoming fully operational.\n\"In the new set-up, hot water initially passes through two 5-MW heat exchangers, which transfer thermal energy to the new heating network in Ferney-Voltaire.\"",
      "category": "environment",
      "bias": "right",
      "publishedAt": "2026-01-31T00:03:00Z",
      "source": "New Atlas"
    }
  },
  {
    "article": {
      "id": "Mzk=",
      "url": "https://www.designboom.com/architecture/reused-shipping-containers-high-tech-incubator-carquero-arquitectura-spain/",
      "title": "reused shipping containers form high-tech incubator by carquero arquitectura in spain",
      "summary": "Carquero arquitectura adapts industrial systems for reuseIncubazul Base Area by Carquero Arquitectura takes shape inside the Zona Franca de Cádiz, Spain, as a high-tech incubator designed to trigger the transformation of one of the most entrenched industrial zones in the city.\nThe project is structured around the reuse of shipping containers as a systemic decision.\nall images by Jesús Granadaurban acupuncture within cádiz’s zona franca, spainThe Cádiz-based team at Carquero Arquitectura frames Incubazul as a form of urban acupuncture.\nIts role is to activate the district that surrounds it, offering a recognizable and legible presence that draws attention to the broader regeneration of the Zona Franca.\nthe container-based building meets the industrial street edge while opening inwarda shaded courtyard emerges between reused containersred-painted ground surfaces and container walls define shared work areas",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-01T03:30:29Z",
      "source": "Designboom"
    }
  },
  {
    "article": {
      "id": "NDA=",
      "url": "https://www.businessinsider.com/american-moved-to-finland-lower-pay-better-work-life-balance-2026-1",
      "title": "I moved from the US to Finland for grad school and stayed to work. The pay is lower, but the work-life balance is great.",
      "summary": "Jordan Blake Banks said the work-life balance in Finland is much better than in the US.\nJordan Blake Banks said the work-life balance in Finland is much better than in the US.\nJordan Blake BanksJordan Blake Banks said the work-life balance in Finland is much better than in the US.\nJordan Blake BanksThis is an as-told-to essay based on a conversation with Jordan Blake Banks, an American and Finnish citizen who moved to Finland in 2019 for school and stayed to work.\nI graduated in May 2019 and moved to Finland about a month and a half later.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-31T09:14:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NDE=",
      "url": "https://www.space.com/space-exploration/satellites/what-actually-happens-to-a-spacecraft-during-its-fiery-last-moments-heres-why-esa-wants-to-find-out",
      "title": "What actually happens to a spacecraft during its fiery last moments? Here's why ESA wants to find out",
      "summary": "What actually happens to a spacecraft during its fiery last moments?\nThat's the key question for the European Space Agency's (ESA) Destructive Reentry Assessment Container Object (Draco) mission.\n\"They also deposit ablation products directly into the upper atmosphere,\" Boley said.\n\"In-situ measurements are one important piece of the puzzle missing to better understand destructive spacecraft re-entry and its effects on the atmosphere,\" he told Space.com.\nDraco will be a single spacecraft reentry, with a specific trajectory, mass, and design, Anselmo said.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-01-31T11:00:00Z",
      "source": "Space.com"
    }
  },
  {
    "article": {
      "id": "NDI=",
      "url": "https://terraformindustries.wordpress.com/2026/01/30/direct-current-data-centers/",
      "title": "Direct Current Data Centers",
      "summary": "In the limit, Earth-based AI compute will be a direct current (DC) solar array connected to a DC battery bank connected to a DC GPU rack.\nPlug in some assumptions around GPU cost, solar cost, battery cost, gas turbine cost, gas fuel cost, and amortization period, and you can produce this chart.\nAs a rough rule of thumb, this is where 1.3 x battery cost + solar cost < $500/kW(h).\nThe pure solar+battery data center is cheaper than a gas-assisted or pure gas data center if solar and battery costs per kW are <~10% of the turbine/gas generator cost.\nFinally, an application of space-based solar power that can justify something like the vision of Gerry O’Neill.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-31T00:06:06Z",
      "source": "Wordpress.com"
    }
  },
  {
    "article": {
      "id": "NDM=",
      "url": "https://skift.com/2026/01/31/warm-winters-are-breaking-the-ski-industry-and-artificial-snow-isnt-enough/",
      "title": "Warm Winters Are Breaking the Ski Industry — and Artificial Snow Isn’t Enough",
      "summary": "Aspen One, among the few U.S. ski companies with resorts that opened on time this winter, says snowmaking and glacier covers are only temporary defenses against years of record low snowfall.\nRapid global warming and higher temperatures are eroding the foundations of winter tourism, shortening ski seasons, reducing snow and making it less predictable.\n\"Snowmaking isn’t the core issue; the energy being used is,\" said Chris Miller, senior vice president of sustainability at Aspen One.\n\"We’re focused on tackling the root causes of climate change, not just adapting within resort boundaries.\"\nIts latest property, Limelight Mammoth in the Mammoth mountain ski area in California, is a fully electric hotel.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-01-31T13:00:00Z",
      "source": "Skift"
    }
  },
  {
    "article": {
      "id": "NDQ=",
      "url": "https://www.npr.org/2026/01/31/nx-s1-5695221/anti-ice-protesters-call-for-national-action-against-federal-immigration-tactics",
      "title": "Anti-ICE protesters call for national action against federal immigration tactics",
      "summary": "Anti-ICE protesters call for national action against federal immigration tacticstoggle caption Kristin Wright/NPRProtesters across the U.S. on Saturday demonstrated against the federal government's immigration enforcement tactics in Minneapolis.\nThe group 50501 called on communities to shut \"ICE Out of Everywhere\" in a national day of action.\nThe group is also requesting that the retailer publicly affirm solidarity with immigrants and opposition to ICE's recent immigration operations.\nThey carried signs and chanted \"boycott target,\" \"ice out,\" and \"I believe that we will win.\"\nHe says he just returned to D.C. from Minneapolis, where he joined faith leaders for a demonstration at Target's headquarters.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-01T02:27:55Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDU=",
      "url": "https://abcnews.go.com/Politics/trump-continues-defend-homan-noem-amid-immigration-enforcement/story?id=129731874",
      "title": "Trump continues to defend Homan, Noem amid immigration enforcement backlash",
      "summary": "President Donald Trump arrives for the premiere of first lady Melania Trump's movie \"Melania\" at The John F. Kennedy Memorial Center For The Performing Arts, Jan. 29, 2026, in Washington.\nPresident Donald Trump arrives for the premiere of first lady Melania Trump's movie \"Melania\" at The John F. Kennedy Memorial Center For The Performing Arts, Jan. 29, 2026, in Washington.\nPresident Donald Trump arrives for the premiere of first lady Melania Trump's movie \"Melania\" at The John F. Kennedy Memorial Center For The Performing Arts, Jan. 29, 2026, in Washington.\nPresident Donald Trump took to social media to show his support for two of his administration leaders amid the leadership shakeup following last week's fatal shooting in Minneapolis.\nBorder czar Tom Homan speaks during a news conference about ongoing immigration enforcement operations on January 29, 2026 in Minneapolis, Minnesota.",
      "category": "immigration",
      "bias": "lean right",
      "publishedAt": "2026-01-31T18:29:01Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NDY=",
      "url": "https://www.yahoo.com/news/articles/man-sentenced-4-years-prison-195240655.html",
      "title": "Man sentenced to 4 years in prison for throwing Molotov cocktail during LA immigration protest",
      "summary": "LOS ANGELES (AP) — A 23-year-old man was sentenced to four years in federal prison after he admitted throwing a Molotov cocktail at Los Angeles County sheriff’s deputies during protests against immigration raids across the region last spring.\nSheriff's deputies responded to a large protest that day at which demonstrators were throwing rocks and other items outside a Home Depot where U.S. Border Patrol agents had gathered.\nAdvertisement AdvertisementAccording to the plea agreement obtained by the Los Angeles Times, Galvez admitted that he went behind a wall, lit the Molotov cocktail and then hurled it toward where he had seen the deputies.\nThe incendiary device landed in a grassy area near the foot of a protester and about 15 feet (4.5 meters) from the deputies, according to the plea agreement.\nGalvez threw the device “intending to obstruct, interfere with, and impede the LASD deputies who were lawfully engaged in performance of official duties,” according to the agreement.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-01T19:52:40Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDc=",
      "url": "https://www.businessinsider.com/anti-ice-out-protests-national-shutdown-trump-administration-2026-1",
      "title": "Anti-ICE Protests Take Place Nationwide",
      "summary": "Protests across the nation took place amid the Trump administration's immigration enforcement efforts.\nProtests across the nation took place amid the Trump administration's immigration enforcement efforts.\nStephen Maturen/Getty ImagesProtests across the nation took place amid the Trump administration's immigration enforcement efforts.\nStephen Maturen/Getty Imageslighning bolt icon An icon in the shape of a lightning bolt.\nThe protests come amid growing tensions in communities where the Trump administration has deployed federal agents.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-01-31T01:36:49Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NDg=",
      "url": "https://www.businessinsider.com/ice-minneapolis-immigration-crackdown-rift-target-employees-leadership-ceo-2026-1",
      "title": "ICE Minneapolis Crackdown: Rift Between Target Employees, Leadership",
      "summary": "When Minneapolis became ground zero for the Trump administration's immigration crackdown, Suzie joined an informal mutual-aid network of Target employees.\nBack in 2020, after George Floyd was killed less than 4 miles from Target's Minneapolis headquarters, Target scaled up its DEI programs.\nChristopher Juhn/Anadolu via Getty ImagesAt the team level, employees say, there has been patience and flexibility from managers and coworkers.\nMany Target employees in Minneapolis say they're balancing their work lives with community work.\nAbbie Parr/AP PhotoSeveral other employees say they've lost their sense of pride in being Target employees since the company shifted to a more cautious approach.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-01-31T09:17:02Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NDk=",
      "url": "https://kottke.org/26/02/0048286-propublica-the-two-federa",
      "title": "ProPublica: “The two federal immigration agents who fired on...",
      "summary": "This site is made possible by member support.\n💞Big thanks to Arcustech for hosting the site and offering amazing tech support.\nWhen you buy through links on kottke.org, I may earn an affiliate commission.\nThanks for supporting the site!\nhome of fine hypertext products since 1998.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-02-01T21:22:13Z",
      "source": "kottke.org"
    }
  },
  {
    "article": {
      "id": "NTA=",
      "url": "https://www.businessinsider.com/tech-ai-boycott-february-protest-ice-scott-galloway-2026-2",
      "title": "'Unsubscribe' and 'opt out': A new Big Tech boycott to protest ICE has begun",
      "summary": "Thousands of protesters in Minneapolis demonstrated against ICE on January 31.\nJen Golbeck/SOPA Images/LightRocket via Getty ImagesThousands of protesters in Minneapolis demonstrated against ICE on January 31.\nThere may, however, be another way, according to Scott Galloway, a marketing professor at New York University famous for his critiques of Big Tech.\nScott Galloway is calling on Americans to \"unsubscribe\" and \"opt out\" in February.\nAnna Webber/Getty Images for Vox MediaThe anti-ICE movementRegular protests against the tactics of ICE and Border Patrol personnel have gripped the country for months.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-01-31T21:46:08Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NTE=",
      "url": "https://www.npr.org/2026/02/01/nx-s1-5689031/minnesota-citizens-detained-ice",
      "title": "Minnesota citizens detained by ICE are left rattled, even weeks later",
      "summary": "She said the ICE officers told her to move her car, but the scene was chaotic and she received multiple instructions at once.\nEven if a drawdown occurs, they'll leave behind a changed community, including many citizens questioned and detained by immigration officers in recent weeks.\nOlson says even if the Minnesota immigration crackdown eases, these same concerns could arise elsewhere.\nEven citizens who were not arrested but still questioned are rattled after run-ins with immigration officers.\ntoggle caption Jaida Grey Eagle for NPR\"I said, 'Sir, what happens if the immigration officers stop me?'",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-01T10:00:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTI=",
      "url": "https://www.npr.org/sections/the-picture-show/2026/01/30/g-s1-108087/photos-thousands-once-again-protest-ice-in-minneapolis-and-across-the-u-s",
      "title": "Photos: Thousands once again protest ICE in Minneapolis and across the U.S.",
      "summary": "Photos: Thousands once again protest ICE in Minneapolis and across the U.S.toggle caption Jaida Grey Eagle for NPRFor the second week in a row, thousands of people in downtown Minneapolis marched to protest the presence of immigration enforcement agents in their city.\nDemonstrations were also organized in other U.S. cities, including Los Angeles, Boston, New York, and Portland, Maine.\nThese protests came after the Department of Justice announced a civil rights probe into the shooting death of Minneapolis resident and ICU nurse Alex Pretti but not of Renee Macklin Good, a 37-year-old mother of three who was shot and killed by an ICE agent on January 7.toggle caption Jaida Grey Eagle for NPRtoggle caption Adam Gray/AP/FR172090 APtoggle caption Jaida Grey Eagle for NPRtoggle caption Joseph Prezioso/AFP via Getty Imagestoggle caption Spencer Platt/Getty Imagestoggle caption Jae C. Hong/APtoggle caption Frederic J. Brown/AFP via Getty Imagestoggle caption Jaida Grey Eagle for NPRtoggle caption Robert F. Bukaty/APtoggle caption Stephen Maturen/Getty Imagestoggle caption Stephen Maturen/Getty Imagestoggle caption Jaida Grey Eagle for NPR",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-31T02:20:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTM=",
      "url": "https://www.npr.org/2026/01/31/nx-s1-5695219/judge-wont-halt-immigration-enforcement-surge-minnesota",
      "title": "Judge says she won't halt the immigration enforcement surge as a lawsuit proceeds",
      "summary": "Judge says she won't halt the immigration enforcement surge as a lawsuit proceedstoggle caption Alex Brandon/APMINNEAPOLIS — A federal judge says she won't halt the immigration enforcement surge in Minnesota and the Twin Cities as a lawsuit over it proceeds.\nJudge Katherine M. Menendez on Saturday denied a preliminary injunction sought in a lawsuit filed this month by state Attorney General Keith Ellison and the mayors of Minneapolis and St. Paul.\nThe lawsuit sought a quick order to halt the enforcement action or limit its scope.\nIn her ruling, the judge relied heavily on whether that argument was likely to ultimately succeed in court.\nState and local officials argued that the surge is retaliation after the federal government's initial attempts to withhold federal funding to try to force immigration cooperation failed.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-31T17:58:41Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTQ=",
      "url": "https://www.yahoo.com/news/videos/john-fetterman-goes-off-anti-194504065.html",
      "title": "John Fetterman Goes Off on Anti-ICE Protesters on Fox News: 'Don't Ever Ever Dox People and Target Their Families'",
      "summary": "LIVE from San Francisco, Matt Harmon and Nate Tice kick off our Super Bowl week coverage with a special fantasy pod.\nThe two look at the path the New England Patriots and Seattle Seahawks took to the Super Bowl and how other teams can emulate their paths next year.\nIn the second half of the show we go through Nate Tice's latest mock draft and do a deep dive on the skill players and their fits with certain teams.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-02-01T19:45:04Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTU=",
      "url": "https://www.yahoo.com/news/videos/5-old-liam-conejo-ramos-180552481.html",
      "title": "5-year-old Liam Conejo Ramos and father return to Minnesota from Texas detention facility",
      "summary": "Five-year-old Liam Conejo Ramos and his father, who were detained by immigration officers in Minnesota and held at an ICE facility in Texas, have been released, following a judge’s order.\nThey have returned to Minnesota, according to Texas Rep. Joaquin Castro.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-01T18:05:52Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTY=",
      "url": "https://www.npr.org/2026/01/31/nx-s1-5694716/partial-government-shutdown",
      "title": "What to know about the partial government shutdown",
      "summary": "What to know about the partial government shutdowntoggle caption Rahmat Gul/APThe U.S. government has entered a partial shutdown after Congress failed to meet a deadline of midnight on Friday to complete work on a spending package to prevent funding from running out across multiple federal departments.\nThat two-week continuing resolution is designed to allow lawmakers to negotiate reforms at the agency after federal immigration officers in Minnesota killed two U.S. citizens this month.\nBut the House, which had previously approved a package to fund all six departments, needs to vote again on the amended package.\nWhat Democrats are asking forDemocrats are calling for broad changes to the way federal immigration officers carry out their work.\nThey also want to make it easier to pursue legal action against immigration officers and \"independent investigations\" into misconduct by federal officers.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-31T05:01:06Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTc=",
      "url": "https://www.bbc.com/news/articles/cnvgljj1dygo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
      "title": "Slovakia PM's national security adviser resigns over Epstein links",
      "summary": "Among them are images of the former Duke of York, who was stripped of his titles over his association with the disgraced financier, that appear to show the former prince kneeling on all fours over a female lying on the ground.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-01T08:37:29Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NTg=",
      "url": "https://www.businessinsider.com/moved-usa-to-malta-small-island-convenient-good-for-kids-2026-1",
      "title": "I moved my family from the US to Malta. Living on a small island has some unexpected conveniences.",
      "summary": "Christopher Mannino left the US and brought his family to the Mediterranean island Malta.\nCourtesy of Christopher ManninoChristopher Mannino left the US and brought his family to the Mediterranean island Malta.\nMannino and his family moved to Malta in June 2025.\nThere are some countries around the world, like Malta, where you can be a digital nomad.\nHere, we have really tried to make an effort to do a lot of family stuff.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-31T12:14:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NTk=",
      "url": "https://www.yahoo.com/news/articles/modi-ally-proposes-social-media-042835088.html",
      "title": "Modi ally proposes social media ban for India's teens as global debate grows",
      "summary": "\"Not only are our children becoming addicted to social media, but India is also ‌one of the world's largest producers of data for foreign platforms,\" lawmaker L.S.K.\nFrance's National Assembly ‍this week backed legislation to ban children under 15 from social media, while Britain, Denmark and Greece are studying the issue.\nFacebook operator Meta, YouTube-parent Alphabet and X did not respond on Saturday to emails seeking comment on the ​Indian legislation.\nDevarayalu's 15-page Social Media (Age Restrictions and Online Safety) Bill, which is not public but was ⁠seen by Reuters, says no one under 16 \"shall be permitted ​to create, maintain, or hold\" a social media account and ​those found to have one should have them disabled.\n\"We are asking that the entire onus of ensuring users' age be placed on the social media platforms,\" Devarayalu ‍said.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-31T04:30:52Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NjA=",
      "url": "https://sg.finance.yahoo.com/news/india-doubles-tax-holiday-gift-081541660.html",
      "title": "India doubles tax holiday for GIFT City businesses to 20 years",
      "summary": "The tax boost for GIFT City comes as it is attracting increased interest from large ⁠global reinsurers.\nAfter the end of 20 years these businesses will be taxed at a flat ​rate of 15%, the federal budget proposed.\nForeign ‌companies setting up units in Indian regions outside of Gujarat International Finance Tec‑City, or GIFT City, are taxed at a base rate of 35%.\n\"This will encourage both ⁠global and domestic institutions ​to structure international financial services ​business within India’s own financial hub,\" Dipesh Shah, executive director at ‍the regulator ⁠for financial services at GIFT City told Reuters.\n\"Today’s announcement will provide long-term tax ⁠certainty and predictability to the IFSC (international financial services ‌centre) ecosystem.\"",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-01T08:15:41Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NjE=",
      "url": "https://www.yahoo.com/news/articles/tens-thousands-czechs-rally-support-165426889.html",
      "title": "Tens of thousands of Czechs rally in support of President Pavel over dispute with foreign minister",
      "summary": "PRAGUE (AP) — Tens of thousands Czechs rallied Sunday in the capital and elsewhere to throw their weight behind President Petr Pavel in his dispute with the country’s foreign minister.\nMacinka accused the president of violating the country’s Constitution and threatened him with facing consequences if he fails to appoint his controversial associate.\nThe coalition has on its agenda to steer the country away from supporting Ukraine and reject some key European Union policies.\nUnlike the new government Pavel, a retired army general, is a staunch supporter of Ukraine in its fight against the Russian invasion.\nSmall rallies supporting Pavel took place in several other places across the country.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-01T16:54:26Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NjI=",
      "url": "https://www.aljazeera.com/features/2026/2/1/everyone-here-is-corrupt-what-fuels-the-balochistan-separatist-violence",
      "title": "‘Army alone can’t neutralise grievances’: What fuels Balochistan violence",
      "summary": "It was one of the biggest and most brazen attacks carried out by Baloch separatists, whose claim, however, of killing 84 Pakistani security personnel was dismissed by the authorities.\nYet, this narrative of dominance is punctuated by the sobering death toll: more than a dozen security personnel killed and civilian families caught in the crossfire.\nPakistan had released a video that appeared to show Jadhav confessing to facilitating attacks in Balochistan.\nGrievances fuelling rebellionOn the ground, the official Pakistani script reads differently.\nAs a security source told Al Jazeera: “A military can neutralise a militant, but it cannot neutralise a grievance.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-01T10:02:13Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NjM=",
      "url": "https://www.nature.com/articles/d41586-026-00196-6",
      "title": "China’s relationship with foreign scientific powers is changing rapidly",
      "summary": "He covered the subject in his PhD thesis1 and in a 2004 book called China’s Scientific Elite.\nBooming scienceThe authors point to China’s “worrisome” trend in undervaluing foreign education, a move “considered less conducive to institutional reforms and the attraction of talent from abroad”.\nBut they concede that this decline is because of China’s growing strength in higher education and research capabilities.\nThe CAS is the world’s leading institution in another Nature Index ranking of institutional output of scientific research in premier journals.\nA pattern of diminished international engagement, she adds, “would have implications not just for China, but for global scientific progress”.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-02T00:00:00Z",
      "source": "Nature.com"
    }
  },
  {
    "article": {
      "id": "NjQ=",
      "url": "https://indianexpress.com/article/health-wellness/budget-2025-centre-regional-medical-hubs-experts-reaction-clear-policy-10507445/",
      "title": "Budget 2026: Centre plans 5 Regional Medical Hubs, experts welcome move but urge clear policy",
      "summary": "Union Finance Minister Nirmala Sitharaman on Saturday announced a new initiative to position India as a global hub for medical tourism, proposing the establishment of five Regional Medical Hubs across the country.\nThe proposed Regional Medical Hubs will function as integrated healthcare complexes, bringing together medical services, education, and research under one umbrella.\nAccording to the finance minister, the hubs will include AYUSH centres, Medical Value Tourism Facilitation Centres, and supporting infrastructure for diagnostics, post-treatment care, and rehabilitation.\n“If the government promotes medical tourism in an official way, I am sure it would bring both global recognition and financial benefits,” he said.\nHe emphasised that further visa liberalisation would be critical to make India competitive with other medical tourism destinations like Thailand.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-01T11:23:19Z",
      "source": "The Indian Express"
    }
  },
  {
    "article": {
      "id": "NjU=",
      "url": "https://www.yahoo.com/news/articles/syria-arrests-group-behind-mezzeh-185900776.html",
      "title": "Syria arrests group behind Mezzeh airport attacks, weapons traced to Hezbollah",
      "summary": "DAMASCUS, Feb 1 (Reuters) - Syria said on Sunday it had detained a group behind recent rocket ​attacks on the Mezzeh military airport in Damascus, ‌with investigators tracing the weapons to Iran-backed Hezbollah.\nThe weapons used in the attacks originated from Lebanon’s Hezbollah, an ally of ‍former President Bashar al-Assad that once had a large military presence across Syria supporting Assad’s army, the ministry said.\nAdvertisement AdvertisementHezbollah denied ​the allegations and said it had no activity or ‌ties with any group inside Syria.\nThe ministry said only that the detainees had links to unidentified \"foreign entities,\" without mentioning ⁠Hezbollah or Iran.\nSecurity sources say Hezbollah left behind weapons stockpiles, ⁠including drones, in parts of Syria after withdrawing its forces following ‌the collapse of Assad’s rule.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-01T18:59:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NjY=",
      "url": "https://economictimes.indiatimes.com/markets/stocks/news/foreigners-get-a-direct-pass-to-indian-equity/articleshow/127849907.cms",
      "title": "Foreigners get a direct pass to Indian equity",
      "summary": "Live Eventsas a Reliable and Trusted News Source Addas a Reliable and Trusted News Source Add Now!\n(You can now subscribe to our(You can now subscribe to our ETMarkets WhatsApp channelIndia will open a new door to foreign retail money at a time when overseas fund managers are pulling out from local stocks.\nThe budget proposed allowing individuals residing outside India-beyond NRIs and overseas citizens of India (OCIs)-to buy listed stocks directly.Under the proposal, persons resident outside India (PROIs) can invest in listed companies through portfolio investment schemes (PIS), with the individual cap doubled to 10% and the aggregate limit for all PROIs raised to 24% from 10%.\nAnyone who does not qualify as an Indian resident under foreign exchange rules will be treated as a PROI.Overseas individuals currently bet on Indian markets mainly through pooled investment vehicles managed by foreign institutions, alternative investment funds (mainly category-III) or via limited NRI channels.\nThe biggest roadblocks could be the onerous KYC checks and client onboarding, including documentation that is compliant with the Foreign Exchange Management Act.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-02-02T00:36:03Z",
      "source": "The Times of India"
    }
  },
  {
    "article": {
      "id": "Njc=",
      "url": "https://indianexpress.com/article/technology/tech-news-technology/budget-2026-cloud-giants-cheer-tax-free-ride-data-centres-india-10507825/",
      "title": "Cloud giants cheer Budget 2026 proposal for tax-free ride to use data centres in India",
      "summary": "As a result, data centres sprawling acres of land have come to form the bedrock of the AI industry.\nHowever, the rapid growth of data centres in India could strain the country’s resources and negatively impact the environment.\nBy 2026, India’s total data centre capacity is projected to surpass 2 GW, up from a little over 1 GW.\nIt added that the 15 per cent on-cost safe harbour proposal ensures pricing certainty for routine infrastructure services.\nStory continues below this adAlso Read | Why does Elon Musk want to put AI data centers in space?",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-01T14:52:04Z",
      "source": "The Indian Express"
    }
  },
  {
    "article": {
      "id": "Njg=",
      "url": "https://www.nakedcapitalism.com/2026/01/how-a-us-israeli-strike-on-iran-could-ignite-a-wider-conflict.html",
      "title": "How a US/Israeli Strike on Iran Could Ignite a Wider Conflict",
      "summary": "In particular, this article underplays the possibility that Iran would close the Strait of Hormuz.\nThe Strait of Hormuz is an international sea passage and an essential trade corridor that supports regional economic prosperity.\nIran’s IRGC must do the same.\nThe US already has some 30,000 military personnel in the Middle East, with a carrier strike group now there as well.\nThe second is the big unknown when we look at how the IRGC and the Iranian military might react.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-31T11:51:59Z",
      "source": "Nakedcapitalism.com"
    }
  },
  {
    "article": {
      "id": "Njk=",
      "url": "https://www.aljazeera.com/news/2026/1/31/russia-ukraine-war-list-of-key-events-day-1437",
      "title": "Russia-Ukraine war: List of key events, day 1,437",
      "summary": "Russia-Ukraine war: List of key events, day 1,437These are the key developments from day 1,437 of Russia’s war on Ukraine.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-31T00:32:02Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NzA=",
      "url": "https://www.yahoo.com/news/articles/us-ambassador-arrives-venezuela-reopen-223545153.html",
      "title": "New US charge d’affaires arrives in Venezuela to reopen diplomatic mission after 7 years",
      "summary": "CARACAS (AP) — U.S. charge d’affaires Laura Dogu arrived in Caracas on Saturday to reopen the American diplomatic mission in Venezuela after seven years of severed ties.\n“My team and I are ready to work,” Dogu said in a message posted by the U.S. Embassy in Venezuela 's account on X.\nAdvertisement AdvertisementVenezuela and the United States broke off diplomatic relations in February 2019 in a decision by Maduro.\nThey closed their embassies mutually after Trump gave public support to lawmaker Juan Guaidó who claimed to be the nation’s interim president in January that year.\n___Follow AP’s coverage of Latin America and the Caribbean at https://apnews.com/hub/latin-america___This story has been corrected to show that Dogu's title is charge d’affaires, not ambassador.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-01-31T22:35:45Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NzE=",
      "url": "https://indianexpress.com/article/technology/tech-news-technology/india-hands-apple-a-win-by-letting-foreign-firms-fund-equipment-without-tax-risk-10508635/",
      "title": "India hands Apple a win by letting foreign firms fund equipment without tax risk",
      "summary": "File photo of the logo of Apple is illuminated at a store in the city center in Munich, Germany, on Dec. 16, 2020.\n(AP)India’s government on Sunday handed a major win to Apple by allowing foreign companies to provide machines to their contract manufacturers in certain areas for five years without any tax risk.\nApple has been growing in India in recent years as it diversifies beyond China.\nAnd while China still accounts for ‍75% ⁠of global iPhone shipments, India’s share has quadrupled to 25% since 2022.\nApple had been lobbying India’s government to modify its income tax laws to ensure the company is not taxed for ownership of the high-end iPhone machinery it provides to its contract manufacturers.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-02T05:05:32Z",
      "source": "The Indian Express"
    }
  }
]