[
  {
    "article": {
      "id": "MA==",
      "url": "https://www.wired.com/story/the-political-war-over-prediction-markets-is-just-getting-started/",
      "title": "The War Over Prediction Markets Is Just Getting Started",
      "summary": "The other insists they are just giving people access to legitimate financial markets already subject to adequate government oversight.\nOnce a niche financial experiment, prediction markets have rapidly become entrenched in mainstream culture, a transformation that has brought vast sums of money into play.\nBut critics say that prediction markets, at least in their current form, are exploitative.\nAttorneys general and gambling regulators in many states say sports contracts on prediction markets should follow state gambling laws.\nFederal lawmakers have also started weighing in; earlier this month, 23 Democratic senators voiced support for efforts to push prediction markets to abide by state gambling laws.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-20T10:30:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MQ==",
      "url": "https://www.businessinsider.com/us-economy-outlook-joseph-stiglitz-recession-inflation-job-market-tariffs-2026-2",
      "title": "3 Signs US Economy Will 'Get Worse,' According to Joseph Stiglitz",
      "summary": "Joseph Stiglitz, a Nobel laureate and Columbia economist, said he believes the US economy would continue to weaken when speaking to CNBC about his macro outlook on Thursday.\n\"Not great right now, and the prospects are that we're just going to get worse,\" Stiglitz said of his economic outlook.\nBut there are a few under-the-surface details that suggest the economy isn't on a good path, Stiglitz suggested.\nBloomberg/Getty ImagesStiglitz also pointed to the push from the Trump administration to lower interest rates.\nIn that scenario, the economy could grow without stoking inflation, meaning the US could have room to lower interest rates more than markets expect.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-20T10:15:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mg==",
      "url": "https://abcnews.com/Business/us-economy-expected-slowed-end-2025/story?id=130296352",
      "title": "US economy slowed more than expected at end of 2025",
      "summary": "US economy slowed more than expected at end of 2025A shopper selects items at a grocery store on Feb. 10, 2026, in Chicago.\nA shopper selects items at a grocery store on Feb. 10, 2026, in Chicago.\nA shopper selects items at a grocery store on Feb. 10, 2026, in Chicago.\nA shopper selects items at a grocery store on Feb. 10, 2026, in Chicago.\nThe U.S. economy slowed more than expected over the final months of 2025, federal government data on Friday showed.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-20T13:50:41Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "Mw==",
      "url": "https://uk.finance.yahoo.com/news/gold-prices-oil-pound-commodities-dollar-interest-rates-federal-reserve-uk-inflation-093233998.html",
      "title": "Gold price below $5,000 as investors wait on Fed guidance for clues",
      "summary": "Gold prices remained below the $5,000 threshold on Wednesday as investors awaited the release of minutes from the Federal Reserve’s January meeting for further guidance on the outlook for US interest rates.\n“Gold prices are taking support above $4,850 today... this is a technical bounce” after prices fell in the previous session on easing geopolitical tensions\", Ajay Kedia, director at Kedia Commodities, told Reuters.\nNon-yielding bullion typically benefits from lower interest rate environments.\nHowever, Fed governor Michael Barr said another rate cut could come somewhere well down the road, citing ongoing risks to the US inflation outlook.\n“Our primary interest here is we don't want Iran to get a nuclear weapon,” the vice president said during an interview with Fox News.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-18T09:32:33Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NA==",
      "url": "https://www.businessinsider.com/nevada-sues-kalshi-trump-cftc-with-prediction-markets-2026-2",
      "title": "Nevada sues Kalshi as federal regulators say back off",
      "summary": "Nevada gambling regulators sued the prediction markets company Kalshi on Tuesday, saying the platform's rapid growth forced their hand.\nA Kalshi spokesperson declined to comment on Tuesday afternoon, but the company swiftly asked a federal court to take over the new state case.\nThe CFTC on Tuesday sided with another events-contracts company that is fighting with Nevada regulators, and its chairman, Michael Selig, filmed a video statement defending the new platforms.\nEconomists and political scientists have long been fascinated by prediction markets as a way to channel the so-called wisdom of the crowds.\nLegal battles are pending on the East Coast as well, with regulators in Maryland and New Jersey having clashed with prediction markets.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-18T01:17:02Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NQ==",
      "url": "https://www.npr.org/2026/02/20/nx-s1-5718214/economy-gdp-tariffs-inflation-consumer-spending",
      "title": "The economy slowed in the last 3 months of the year — but was still solid in 2025",
      "summary": "The economy slowed in the last 3 months of the year — but was still solid in 2025toggle caption Jeremy Weine/Getty ImagesThe U.S. economy slowed in the final months of last year, but it continued to expand, thanks to robust consumer spending and business investment in artificial intelligence.\n(Both measures compare the size of the economy at year's end to where it was 12 months earlier.)\nConsumer spending is the biggest driver of the U.S. economy, and that trend continued in the final months of last year.\nThat made GDP look weaker in the early months of the year.\nThat subtracted from fourth-quarter growth, although much of that will be made up in the early months of 2026.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-20T13:52:51Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "Ng==",
      "url": "https://www.bbc.com/news/articles/c5y6g57j3meo",
      "title": "Plan to increase youth minimum wage could be delayed",
      "summary": "He argued that it was fair to pay a lower rate to young workers because \"if someone is less experienced and less well trained than someone who has been doing the job for a while they are not necessarily going to be as productive\".",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-18T07:33:24Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Nw==",
      "url": "https://www.businessinsider.com/federal-reserve-study-kalshi-economic-forecasting-2026-2",
      "title": "Kalshi may be more useful than some traditional economic forecasting methods, Fed researchers find",
      "summary": "Lighning bolt icon An icon in the shape of a lightning bolt.\n\"Our results suggest that Kalshi markets provide a high-frequency, continuously updated, distributionally rich benchmark that is valuable to both researchers and policymakers,\" the researchers wrote.\nThe researchers found that Kalshi actually beat traditional methods for two different purposes.\nThe researchers found that the median and mode of Kalshi's prediction markets have a \"perfect forecast record\" on the day before the Fed meeting, which is a \"statistically significant improvement\" over Fed Funds futures.\nKalshi is also useful because it provides real-time responses to events, offering more up-to-date information than typical survey and forecasting methods, according to the researchers.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-19T16:50:12Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "OA==",
      "url": "https://www.bbc.com/news/articles/c80jy2lkdg3o",
      "title": "Reform plans to keep UK's budget watchdog",
      "summary": "In January, Reform UK leader Nigel Farage told the Telegraph he had \"questioned the need\" for the OBR, which he accused of \"effectively dictating to elected politicians what they should or should not do\".",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-02-18T01:39:39Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "OQ==",
      "url": "https://www.businessinsider.com/prediction-markets-susquehanna-traders-options-betting-kalshi-wall-street-2026-2",
      "title": "A top options firm is hiring traders to bet on the weather and other 'event-driven outcomes'",
      "summary": "Lighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nThe roles will center on designing and implementing real-time models to assist with betting on the type of event-driven outcomes that made prediction markets popular, including what tomorrow's weather might be.\nOne of the biggest options trading firms in the world is hiring a Senior Trader for Prediction Markets.\nSusquehanna (SIG) is looking for someone to build real-time models for uncertain, event-driven outcomes (weather, probabilistic events, etc.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-19T18:42:43Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTA=",
      "url": "https://finance.yahoo.com/video/oil-prices-fair-target-amid-173000986.html",
      "title": "Oil prices: This would be a 'fair target' amid US–Iran tensions",
      "summary": "Mish, and I want to get to that too because I know you've been watching it.\nUm, you know, piled into all of the other stuff affecting inflation, we now have a potential conflict with Iran to contend with and the effect that that could have on oil prices.\nSo we've got oil prices that have now climbed over the past few sessions on concerns around that.\nSo, right now, I think $66 is a good pivotal area if you're looking at WTI oil.\nI think that's a fair target.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-20T19:00:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTE=",
      "url": "https://www.theverge.com/ai-artificial-intelligence/880513/nvidia-meta-ai-grace-vera-chips",
      "title": "Meta’s new deal with Nvidia buys up millions of AI chips",
      "summary": "Stevie started out at Laptop Mag writing news and reviews on hardware, gaming, and AI.\nMeta has struck a multiyear deal to expand its data centers with millions of Nvidia’s Grace and Vera CPUs and Blackwell and Rubin GPUs.\nWhile Meta has long been using Nvidia’s hardware for its AI products, this deal “represents the first large-scale Nvidia Grace-only deployment,” which Nvidia says will deliver “significant performance-per-watt improvements in [Meta’s] data centers.” The deal also includes plans to add Nvidia’s next-generation Vera CPUs to Meta’s data centers in 2027.\nNvidia is also dealing with concerns about depreciation and chip-back loans used to finance AI build-outs, as well as the pressure of competition.\nNvidia and Meta did not disclose how much the deal cost, but this year’s AI spending from Meta, Microsoft, Google, and Amazon is estimated to cost more than the entire Apollo space program.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-18T00:27:08Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTI=",
      "url": "https://environment.ec.europa.eu/news/new-law-more-sustainable-circular-and-safe-batteries-enters-force-2023-08-17_en",
      "title": "New law on more sustainable, circular and safe batteries enters into force",
      "summary": "A new law to ensure that batteries are collected, reused and recycled in Europe is entering into force today.\nThis will support the shift to a circular economy, increase security of supply for raw materials and energy, and enhance the EU’s strategic autonomy.\nThe Batteries Regulation will ensure that batteries placed on the EU single market will only be allowed to contain a restricted amount of harmful substances that are necessary.\nBackgroundSince 2006, batteries and waste batteries have been regulated at EU level under the Batteries Directive.\nSuch exponential growth in demand for batteries will lead to an equivalent increase in demand for raw materials, hence the need to minimise their environmental impact.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-02-21T08:28:42Z",
      "source": "Europa.eu"
    }
  },
  {
    "article": {
      "id": "MTM=",
      "url": "https://finance.yahoo.com/news/top-trump-advisor-furious-true-210501303.html",
      "title": "Top Trump advisor furious about true cost of tariffs being revealed, vows to punish New York Fed for ‘worst paper’ ever in history",
      "summary": "A top White House economic official on Wednesday blasted independent research on tariffs, dismissing its findings as inaccurate and misleading.\nMore from Yahoo Scout How does the White House defend current tariff policy?\nWhy did White House officials criticize Federal Reserve research?\nThe exact findings from the New York Fed show a dire scenario for Americans.\nThe New York Fed declined to comment.",
      "category": "economics",
      "bias": "right",
      "publishedAt": "2026-02-18T21:05:01Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTQ=",
      "url": "https://doempke.com/what-happened-to-software-is-happening-to-finance-and-accounting/",
      "title": "What Happened to Software is Happening to Finance and Accounting",
      "summary": "What happened to software is now happening to finance.\nWhat happened to software is now happening to finance.\nSo I became a finance person who codes — a weird niche that turned out to be excellent preparation for what's happening right now.\nIf you're already deep in this: I'd love to see what you're building.\nI'm thinking of putting together a mini hackathon for people building at this intersection — finance, AI, automation.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-21T10:45:52Z",
      "source": "Doempke.com"
    }
  },
  {
    "article": {
      "id": "MTU=",
      "url": "https://finance.yahoo.com/news/sam-altman-says-quiet-part-165405075.html",
      "title": "Sam Altman says the quiet part out loud, confirming some companies are ‘AI washing’ by blaming unrelated layoffs on the technology",
      "summary": "As debate continues over AI’s true impact on the labor force, OpenAI CEO Sam Altman said some companies are engaging in “AI washing” when it comes to layoffs, or falsely attributing workforce reductions to the technology’s impact.\n“I don’t know what the exact percentage is, but there’s some AI washing where people are blaming AI for layoffs that they would otherwise do, and then there’s some real displacement by AI of different kinds of jobs,” Altman told CNBC-TV18 at the India AI Impact Summit on Thursday.\nWhat is AI washing in corporate layoffs?\nHowever, prominent tech leaders like Anthropic CEO Dario Amodei have warned of a white-collar bloodbath, with AI potentially wiping out 50% of entry-level office jobs.\nAltman clarified he anticipates more job displacement as a result of AI, as well as the emergence of new roles complementing the technology.",
      "category": "technology",
      "bias": "right",
      "publishedAt": "2026-02-19T16:54:05Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTY=",
      "url": "https://www.wired.com/story/vibe-coding-startup-code-metal-raises-series-b-fundraising/",
      "title": "Code Metal Raises $125 Million to Rewrite the Defense Industry’s Code With AI",
      "summary": "Code Metal, a Boston-based startup that uses AI to write code and translate it into other programming languages, just closed a $125 million Series B funding round from new and existing investors.\nCode Metal is part of a new wave of startups aiming to modernize the tech industry by using AI to generate code and translate it across programming languages.\nCode Metal, which was founded in 2023, has focused its efforts on code translation and code verification for the defense industry.\nIt needs to be modernized.”“But in the course of translation,” Erlich added, “you might be inserting bugs—which is catastrophically problematic.”That’s where Code Metal says its proprietary tech comes in.\nWhen asked about Code Metal’s error rate for translation, Morales says it depends largely on how difficult the code conversion is, but that for the pipelines Code Metal currently runs, “there’s no way to generate an error.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-19T19:30:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MTc=",
      "url": "https://www.wired.com/story/leading-us-research-lab-appears-to-be-squeezing-out-foreign-scientists/",
      "title": "Leading US Research Lab Appears to Be Squeezing Out Foreign Scientists",
      "summary": "One of the US government’s top scientific research labs is taking steps that could drive away foreign scientists, a shift lawmakers and sources tell WIRED could cost the country valuable expertise and damage the agency’s credibility.\nThe National Institute of Standards and Technology (NIST) helps determine the frameworks underpinning everything from cybersecurity to semiconductor manufacturing.\nMany of the agency’s thousands of employees, postdoctoral scientists, contractors, and guest researchers are brought in from around the world for their specialized expertise.\nThe staffer, who spoke on the condition of anonymity because they were not authorized to speak to the media, says the Department of Commerce, which oversees NIST, originally pushed for banning all foreign researchers.\nNIST spokesperson Rich Press said the agency would respond to the lawmakers' letter \"through the appropriate channels.\"",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-20T10:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MTg=",
      "url": "https://www.wired.com/story/big-tech-says-generative-ai-will-save-the-planet-it-doesnt-offer-much-proof/",
      "title": "Big Tech Says Generative AI Will Save the Planet. It Doesn’t Offer Much Proof",
      "summary": "A few years ago, Ketan Joshi read a statistic about artificial intelligence and climate change that caught his eye.\nIn late 2023, Google began claiming that AI could help cut global greenhouse gas emissions by between 5 and 10 percent by 2030.\nJoshi, an energy researcher, was shocked by the massive numbers Google was touting—especially AI’s purported ability to effectively cut the equivalent of what the European Union emits each year.\n“I found [the emissions claim] really compelling because there's very few things that can do that,” he says.\nTech companies are locked in a battle to develop AI as fast as possible—one with potentially massive implications for climate change.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-18T15:17:31Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MTk=",
      "url": "https://blog.google/company-news/inside-google/message-ceo/sundar-pichai-ai-impact-summit-2026/",
      "title": "“No technology has me dreaming bigger than AI”",
      "summary": "Editor’s note: Today, Google CEO Sundar Pichai addressed world leaders gathered at the AI Impact Summit in New Delhi, India.\nNow, in that same city, Google is establishing a full-stack AI hub, part of our $15 billion infrastructure investment in India.\nAnd no technology has me dreaming bigger than AI.\nWe’ve trained 100 million people in digital skills, and our new Google AI Professional Certificate will help people master AI in their jobs, available globally.\nThere are glimmers of this from around the globe:From the Ugandan government using AI and satellite imagery to locate priority areas for electrification… to getting potholes fixed for residents more efficiently in Memphis, Tennessee by using AI scans of road surfaces from buses.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-19T04:30:00Z",
      "source": "Blog.google"
    }
  },
  {
    "article": {
      "id": "MjA=",
      "url": "https://www.businessinsider.com/millennials-gen-z-internet-simpler-times-old-technology-ai-rejection-2026-2",
      "title": "The Internet Is Pining for the Simpler Days of Old Technology",
      "summary": "De-digitalizing your life is the new status symbol in 2026.\nMat Szwajkos/Getty ImagesDe-digitalizing your life is the new status symbol in 2026.\nMat Szwajkos/Getty Imageslighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nIn an uncertain time, one thing that's sure in 2026: de-digitalizing your life is officially a status symbol.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-19T11:47:08Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjE=",
      "url": "https://it.slashdot.org/story/26/02/20/003230/how-private-equity-debt-left-a-leading-vpn-open-to-chinese-hackers",
      "title": "How Private Equity Debt Left a Leading VPN Open To Chinese Hackers",
      "summary": "Please create an account to participate in the Slashdot moderation system",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-20T13:00:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MjI=",
      "url": "https://www.businessinsider.com/pwc-engineers-launch-ai-agent-enterprise-grade-spreadsheets-big-four-2026-2",
      "title": "PwC engineers built an AI agent to tackle the corporate world's least sexy task: spreadsheets",
      "summary": "PwC, like many consulting firms, is investing heavily in engineering talent.\nArtur Widak/NurPhoto via Getty ImagesPwC, like many consulting firms, is investing heavily in engineering talent.\nThese files often underpin business-critical decisions, yet PwC \"found that even today's modern AI was very poorly suited to managing these big enterprise spreadsheets,\" Wood said.\nIn January, PwC launched a dedicated tech engineering career track to attract more technical talent, saying it wants to become \"a destination for top engineering talent.\"\nThe second reimagines professional services from scratch: \"If you were to start from a blank piece of paper, what would professional services look like in an AI agent world?\"",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-20T10:33:45Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjM=",
      "url": "https://www.anthropic.com/news/claude-code-security",
      "title": "Making frontier cybersecurity capabilities available to defenders",
      "summary": "Claude Code Security, a new capability built into Claude Code on the web, is now available in a limited research preview.\nClaude Code Security is intended to put this power squarely in the hands of defenders and protect code against this new category of AI-enabled attack.\nHow Claude Code Security worksStatic analysis—a widely deployed form of automated security testing—is typically rule-based, meaning it matches code against known vulnerability patterns.\nNothing is applied without human approval: Claude Code Security identifies problems and suggests solutions, but developers always make the call.\nClaude Code Security is one step towards our goal of more secure codebases and a higher security baseline across the industry.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-20T18:03:19Z",
      "source": "Anthropic.com"
    }
  },
  {
    "article": {
      "id": "MjQ=",
      "url": "https://www.theverge.com/podcast/880778/ai-talent-war-hiring-frenzy-openai-anthropic-ipo",
      "title": "Money no longer matters to AI’s top talent",
      "summary": "They’re really saying these things.\nI’ve been dying to really dig in and try to unpack what’s going on with all these talent moves in AI.\nAt the same time, the incentives of the AI companies themselves are going from raising money to making money.\nThe AI industry right now is full of drama.\nThere’s big characters, bitter rivalries, lots of money, and really, really long blog posts about the end of the world.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-19T14:49:05Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjU=",
      "url": "https://www.theverge.com/ai-artificial-intelligence/881574/cline-openclaw-prompt-injection-hack",
      "title": "The AI security nightmare is here and it looks suspiciously like lobster",
      "summary": "Is a London-based reporter at The Verge covering all things AI and Senior Tarbell Fellow.\nA hacker tricked a popular AI coding tool into installing OpenClaw — the viral, open-source AI agent OpenClaw that “actually does things” — absolutely everywhere.\nThe hacker used their access to slip through instructions to automatically install software on users’ computers.\nIt’s a sign of how quickly things can unravel when AI agents are given control over our computers.\nThey may look like clever wordplay — one group wooed chatbots into committing crimes with poetry — but in a world of increasingly autonomous software, prompt injections are massive security risks that are very difficult to defend against.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-19T18:58:56Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjY=",
      "url": "https://yro.slashdot.org/story/26/02/21/2140216/americas-peace-corps-announces-tech-corps-volunteers-to-help-bring-ai-to-foreign-countries",
      "title": "America's Peace Corps Announces 'Tech Corps' Volunteers to Help Bring AI to Foreign Countries",
      "summary": "Please create an account to participate in the Slashdot moderation system",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-02-21T21:43:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "Mjc=",
      "url": "https://www.businessinsider.com/miami-next-silicon-valley-weirder-palantir-zuck-2026-2",
      "title": "Miami isn't the next Silicon Valley. It's something much weirder.",
      "summary": "Is Miami the next Silicon Valley?\nBillboards went up in San Francisco featuring a mock tweet from then-Miami mayor Francis Suarez: \"Thinking about moving to Miami?\nHere's the thing: It's easy to fall for Miami when a big chunk of the workforce is stuck at home and online.\nSilicon Valley practically runs on a conveyor belt from Stanford and Caltech to Y Combinator's Dogpatch offices.\nBefore that, Adam Neumann, the ousted WeWork cofounder, debuted his Miami residential real-estate venture, Flow, at a $1 billion valuation in 2022.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-18T14:30:56Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mjg=",
      "url": "https://hbr.org/2026/02/when-every-company-can-use-the-same-ai-models-context-becomes-a-competitive-advantage",
      "title": "When Every Company Can Use the Same AI Models, Context Becomes a Competitive Advantage",
      "summary": "When Every Company Can Use the Same AI Models, Context Becomes a Competitive AdvantageAt a glance, the two large B2B companies were almost identical.\nBoth sell complex, multi-year technology services; they compete for many of the same enterprise customers.\nSales stages, forecasting cadence, and executive review rhythms were the same.\nGoing by their customer relationship management (CRM) systems, their processes looked indistinguishable.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-18T15:00:00Z",
      "source": "Harvard Business Review"
    }
  },
  {
    "article": {
      "id": "Mjk=",
      "url": "https://www.businessinsider.com/perplexity-shifts-to-subscriptions-business-growth-2026-2",
      "title": "Perplexity Doubles Down on Subscriptions, Eyes Business Growth",
      "summary": "One Perplexity executive said the startup is increasingly targeting large businesses.\nPerplexity will focus more on revenue and revenue retention than on other metrics, such as the number of questions it answers, the executive said.\nPerplexity generated over $150 million in annual recurring revenue by mid-last year, its head of communications Jesse Dwyer told Business Insider in August.\nThe news comes after several months of the AI startup lying low, as Perplexity said in a press invite.\nOne consistent issue with ads in AI-generated answers is that users won't believe them, the Perplexity executive said.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-18T01:47:44Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzA=",
      "url": "https://www.scientificamerican.com/article/trump-administration-slashes-mercury-regulations-from-coal-plants/",
      "title": "Trump administration slashes mercury regulations from coal plants",
      "summary": "Mercury pollution from coal plants has been tied to serious neurological problems, especially in children and babiesOn Friday the Trump administration officially rolled back a series of Biden-era environmental regulations on coal plants, including some intended to clamp down on mercury pollution.\nThose earlier rules allowed power plants that burned a particularly dirty form of coal called lignite coal to emit more mercury than plants that burned other forms of the fossil fuel.\nThe move is the latest in a string of actions by the Trump administration to prop up what has long been viewed as a moribund coal industry in the U.S.\nThe administration has ordered the Department of State to run military facilities on coal power, funded renovations for coal-powered plants and even blocked plants from shutting down.\n“And once again, the Trump administration is doing so at the expense of people’s health.”Coal-fired power plants are the leading source of mercury emissions in the U.S., according to the EPA.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2026-02-20T17:30:00Z",
      "source": "Scientific American"
    }
  },
  {
    "article": {
      "id": "MzE=",
      "url": "https://finance.yahoo.com/news/indonesia-tightens-control-nickel-us-041040093.html",
      "title": "Indonesia tightens control on nickel as the US and China scramble for critical minerals",
      "summary": "The move could still ripple through global EV supply chains as the United States and China compete for critical minerals.\nMore from Yahoo Scout How is Indonesia tightening control over global nickel supply?\nJakarta hoped that control over nickel would underpin a fully domestic EV industry, from mining and batteries to finished cars.\nChina has sourced nickel from Indonesia for decades, but the relationship deepened after Jakarta banned raw ore exports in 2020, drawing a surge of Chinese investment into smelters.\nNickel shipments to China jumped, with imports of nickel matte — a semiprocessed material used in battery chemicals and alloys — rising nearly 28-fold between 2020 and 2023, more than 90% of it from Indonesia, according to trade data.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-18T04:10:40Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzI=",
      "url": "https://science.slashdot.org/story/26/02/18/044252/air-pollution-emerges-as-a-direct-risk-factor-for-alzheimers-disease",
      "title": "Air Pollution Emerges As a Direct Risk Factor For Alzheimer's Disease",
      "summary": "Become a fan of Slashdot on Facebook",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-02-18T07:00:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MzM=",
      "url": "https://www.yahoo.com/news/articles/california-colorado-washington-sue-trump-200550952.html",
      "title": "California, Colorado and Washington sue Trump administration to unlock funding for clean energy projects",
      "summary": "SAN FRANCISCO, Feb 18 (Reuters) - California, Colorado and Washington are suing the federal government to force ‌it to pay out grants approved by Congress for ‌clean energy projects, the California attorney general's office said on Wednesday.\nStates, including California, have been among the main foils to various ⁠Trump administration policies, launching dozens of suits.\nThe new suit responds in part to California's loss of $1.2 billion in federal funding for ‌the Alliance for Renewable Clean Hydrogen ​Energy Systems, or ARCHES, Bonta ​said.\nAdvertisement AdvertisementFederal agencies must ​execute laws, California said.\n\"It's as simple as Congress has the power of the purse, not the executive ​branch, and Congress ‌already appropriated this funding,\" Bonta said in an ​interview on Tuesday, ahead of the announcement.",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2026-02-18T20:05:50Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzQ=",
      "url": "https://www.newscientist.com/article/2516338-atmospheric-pollution-caused-by-space-junk-could-be-a-huge-problem/",
      "title": "Atmospheric pollution caused by space junk could be a huge problem",
      "summary": "After a Falcon 9 rocket stage burned up in the atmosphere, vaporised lithium and other metals drifted over Europe.\nSeeing the news, Robin Wing at the Leibniz Institute of Atmospheric Physics in Germany and his colleagues turned on their lidar, an instrument for atmospheric sensing.\nTwenty hours later, it detected a 10-fold spike in lithium, a key component of rocket hulls, in the upper atmosphere as the plume of vaporised metal drifted over it.\nAtmospheric modelling suggested this plume had drifted 1600 kilometres from the area where the Falcon 9 re-entered the atmosphere.\nThe study is the first to trace high-altitude pollution to a specific spacecraft re-entry.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-02-19T16:00:19Z",
      "source": "New Scientist"
    }
  },
  {
    "article": {
      "id": "MzU=",
      "url": "https://news.slashdot.org/story/26/02/21/1932253/codeorg-president-steps-down-citing-upending-of-cs-by-ai",
      "title": "Code.org President Steps Down Citing 'Upending' of CS By AI",
      "summary": "Want to read Slashdot from your mobile device?\nPoint it at m.slashdot.org and keep reading!",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-21T20:35:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MzY=",
      "url": "https://www.scientificamerican.com/article/epa-faces-lawsuit-over-ending-the-endangerment-finding-pillar-climate-law/",
      "title": "EPA faces lawsuits over climate endangerment finding withdrawal",
      "summary": "Medical and environmental groups are challenging the EPA’s decision to break with the long-standing scientific evidence that climate change endangers human healthOn Wednesday prominent medical and environmental groups challenged the Trump administration’s decision to scrap a 2009 finding that climate change threatens human health.\nThe challenge comes days after EPA administrator Lee Zeldin announced that the agency would scrap the 2009 “endangerment finding,” breaking with the long-standing scientific consensus that global warming poses a risk to human health.\nThe new lawsuit could once more elevate the fight over whether climate change harms health to the Supreme Court.\nIn 2007 the Court decided in the case Massachusetts v. EPA that greenhouse gases, including carbon dioxide, qualified as air pollutants under the Clean Air Act.\nWhen contacted by Scientific American on Wednesday, the EPA declined to comment on the lawsuit, citing a long-standing practice of not commenting on current or pending litigation.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-02-18T15:00:00Z",
      "source": "Scientific American"
    }
  },
  {
    "article": {
      "id": "Mzc=",
      "url": "https://www.theregister.com/2026/02/19/ai_climate_crisis_claims/",
      "title": "Study questions claims AI will solve the climate crisis",
      "summary": "He reached two central conclusions after looking at 154 claims of AI climate benefits arising from eight sources (including the IEA, climate researchers, Microsoft, Google, and others).\nFirst off, there's a serious problem with the conflation of traditional AI, like predictive models and computer vision, with generative AI tools that chat, create images, and make music.\n\"This analysis found that the overwhelming majority of AI climate benefit claims relate to 'traditional' forms of AI rather than generative AI,\" Joshi wrote in the report.\n\"However, much of the projected energy consumption of AI will stem specifically from 'generative AI,' rather than more traditional forms of machine learning.\"\nThe evidence that isn'tAlong with conflating the potential climate benefits of using traditional AI with the far more energy-intensive and frequent deployments of generative AI datacenters, the report concludes that most of the evidence that even traditional AI would help with the climate crisis lacks support.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2026-02-19T18:23:34Z",
      "source": "Theregister.com"
    }
  },
  {
    "article": {
      "id": "Mzg=",
      "url": "https://www.bbc.com/weather/articles/cgrz24y2wvno",
      "title": "Flooding may worsen before it improves as more rain forecast for UK",
      "summary": "We have seen fluvial - or river - flooding, which is when rivers or streams burst their banks and flood surrounding areas.\nThere has also been pluvial - or surface water - flooding, which is a direct result of intense or prolonged rainfall that overwhelms drainage systems.\nHowever, a third type of flooding - groundwater flooding - has also been a widespread problem, especially in parts of southern England.\nLow lying river valleys and areas on chalk aquifers - such as the Salisbury Plains - are most prone to groundwater flooding.\nThe Environment Agency says groundwater flooding, external occurs when water under the ground (the water table) rises to the surface.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2026-02-18T14:54:18Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Mzk=",
      "url": "https://www.businessinsider.com/ukraine-attacked-russian-oil-depot-protected-by-anti-drone-nets-2026-2",
      "title": "Satellite images show Russia put up anti-drone nets to protect its fuel tanks. A Ukrainian attack punched through.",
      "summary": "Long-range Ukrainian drones struck an oil depot in Velikiye Luki, a city in western Russia's Pskov region, a source in the Security Service of Ukraine (SBU) said.\nThe source said protective anti-drone nets had been stretched above fuel tanks at the oil depot.\n- overnight, drones from the Special Operations Center \"Alpha\" of the Security Service of Ukraine successfully struck the Velikolukskaya oil depot.\nMoscow said its air defenses shot down roughly 300 Ukrainian drones over the past 24 hours.\nSince October, Ukrainian energy facilities have been the main target of Russian barrages, Britain's defense ministry said on Thursday.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-19T16:57:20Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NDA=",
      "url": "https://www.sciencedaily.com/releases/2026/02/260218031554.htm",
      "title": "A spinning gyroscope could finally unlock ocean wave energy",
      "summary": "Most existing wave energy devices perform well only under specific wave conditions, limiting their effectiveness in the constantly shifting environment of the open sea.\nA researcher at The University of Osaka has taken a close look at a new approach known as a gyroscopic wave energy converter (GWEC).\n\"Wave energy devices often struggle because ocean conditions are constantly changing,\" says Takahito Iida, author of the study.\nModeling Maximum Wave Energy EfficiencyTo better understand how the system behaves, the researcher used linear wave theory to model the interaction among ocean waves, the floating structure, and the gyroscope.\nBy clarifying how to fine tune the gyroscope's operating parameters, the research offers practical guidance for building more flexible and efficient wave energy systems.",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2026-02-18T14:33:28Z",
      "source": "Science Daily"
    }
  },
  {
    "article": {
      "id": "NDE=",
      "url": "https://www.cbc.ca/news/climate/epa-endangerment-9.7095596",
      "title": "U.S. environment agency sued over scrapping scientific rule behind climate protections",
      "summary": "The legal challenge, filed in the U.S. Court of Appeals for the District of Columbia Circuit, asserts that the EPA's rescission of the endangerment finding is unlawful.\nThe 2009 finding supported common-sense safeguards to cut climate pollution, including from cars and trucks, the lawsuit says.\nThe endangerment finding \"led to trillions of dollars in regulations that strangled entire sectors of the United States economy, including the American auto industry,\" Zeldin said.\nEnvironmental groups described the move as the single biggest attack in U.S. history against federal authority to address climate change.\nEvidence backing up the endangerment finding has only grown stronger in the 17 years since it was approved, they said.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-02-18T17:42:56Z",
      "source": "CBC News"
    }
  },
  {
    "article": {
      "id": "NDI=",
      "url": "https://www.npr.org/2026/02/19/g-s1-110721/trump-administration-refugees-memo-arrest",
      "title": "Refugees in the U.S. could be arrested under a new immigration memo",
      "summary": "Refugees must either get a green card within a year, or \"present themselves to the agency\" to avoid detention, according to a Feb. 18 memo from the U.S.\nCitizenship and Immigration Services and Immigration and Customs Enforcement.\nThe memo was filed as a part of documents submitted in a federal court case tied to refugees who were arrested in Minnesota.\nIt also states that refugees may be placed in immigration detention while their application for a green card is being considered.\nRefugees are required to apply for permanent residence, or a green card, after they've been in the country for at least a year.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-19T15:10:49Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDM=",
      "url": "https://www.wired.com/story/the-supreme-courts-tariff-ruling-wont-bring-car-prices-back-to-earth/",
      "title": "The Supreme Court’s Tariff Ruling Won’t Bring Car Prices Back to Earth",
      "summary": "Now, despite a US Supreme Court ruling that will nix some of those Trump tariffs, car buyers will likely get no respite.\nAutomakers have actually done an OK job shielding consumers from the effects of tariffs, Caldwell says.\nEven as retailers have blamed tariffs for steadily rising prices of consumer goods like electronics and appliances, car prices are up just 1 percent since this time last year, the firm’s data shows.\nBut as the tariff regime drags on, that could change in ways that make new-car buyers even less happy.\n“If cost pressures continue to build, automakers may have less room to shield shoppers from higher prices,” Caldwell says, “but for now, the broader market impact is still playing out.”",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-21T00:10:01Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "NDQ=",
      "url": "https://www.npr.org/2026/02/18/nx-s1-5699708/ice-observers-impeding-obstructing-interfering",
      "title": "The Trump administration is increasingly trying to criminalize observing ICE",
      "summary": "The Trump administration is increasingly trying to criminalize observing ICEtoggle caption Octavio Jones/AFP via Getty ImagesLike many people in the Twin Cities, Jess has been observing ICE officers: following them in her car and documenting their actions.\nEarlier this month, she was in North Minneapolis, when immigration agents told her and another observer they were impeding a federal investigation.\nFederal agents hopped out.\nNPR spoke with several other observers in Minnesota who said immigration officers told them they were impeding federal investigations.\nStancil has been public about following immigration officers, but he understands why others might feel intimidated.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-18T23:26:43Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDU=",
      "url": "https://abcnews.com/Politics/americans-oppose-tactics-ice-enforce-immigration-laws-21/story?id=130280899",
      "title": "Americans oppose the tactics ICE is using to enforce immigration laws by 2:1 margin: Poll",
      "summary": "By a 2-to-1 margin, Americans oppose the tactics ICE is using to enforce immigration laws, 62% to 31%.\nBy a 13-point margin, Americans oppose abolishing ICE, 50% to 37%.\nOpinions are polarized: 7 in 10 Democrats support abolishing ICE, while 8 in 10 Republicans oppose it.\nMore than 4 in 10 Americans say they are \"not concerned\" or \"concerned but not upset\" over the situation in Minnesota.\nEvan Vucci/APBy an 8-point margin, Americans oppose denying federal funds to so-called sanctuary cities that limit their cooperation with ICE, 46% to 38%.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-02-20T11:03:50Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "NDY=",
      "url": "https://www.businessinsider.com/moved-family-to-canada-little-planning-things-wish-i-knew-2026-2",
      "title": "My family moved to Canada with only 3 weeks of planning. It was chaotic, but we're still here 6 years later.",
      "summary": "Just a few weeks earlier, Hurricane Dorian had slammed into our home in the Bahamas, a country I'd lived in my entire life.\nMy family had spent 24 hours trapped in our attic, praying the roof would hold before evacuating to nearby Florida.\nHowever, in the wake of the disaster, the US authorities limited many Bahamians to stays of only a few weeks, our family among them.\nSix years later, I'm confident this move was the best decision we could have made for ourselves and our family.\nHowever, I still tell people, \"Don't move to a new country with only three weeks of planning!\"",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-02-18T16:24:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NDc=",
      "url": "https://www.thedailybeast.com/ice-barbie-kristi-noem-makes-stunning-claim-in-bid-to-buy-luxury-jet-with-mile-high-privacy-chamber/",
      "title": "ICE Barbie’s Secret Mile-High Double Bed Pictured",
      "summary": "New images have revealed the plush queen-size bed in a private cabin aboard the luxury aircraft Kristi Noem has been using to jet around the country with her alleged lover-slash-adviser.\nSix pillows sit atop the vast mattress, with an armchair and what appears to be a mirrored wardrobe to the right of the bedside.\nNoem is understood to use the aircraft to jet around the country with her alleged lover, Lewandowski.\nNBC NewsDHS officials have reportedly told OMB that if the application is approved, the aircraft will be used for both deportations and official Cabinet business.\nAlong with the bedroom and queen-size bed, the plane also features a kitchen, living space, bar, showers, and several large TV sets.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-02-19T12:38:17Z",
      "source": "Daily Beast"
    }
  },
  {
    "article": {
      "id": "NDg=",
      "url": "https://guessingheadlights.com/ice-agent-stopped-for-dui-asks-deputy-are-you-haitian-then-things-got-worse/",
      "title": "ICE Agent Stopped for DUI Asks Deputy: ‘Are You Haitian?’—Then Things Got Worse",
      "summary": "‘Are You Haitian?’: Agent Questions Deputy’s Nationality During StopThe encounter was already tense from the first words captured on bodycam.\nStruggling Sobriety Tests and a Plea Over CustodyThe video shows Deiseroth struggling with basic coordination tasks like walking in a straight line and reciting numbers.\nDeiseroth was booked into the Monroe County Jail on misdemeanor charges of driving under the influence and resisting without violence.\nAt the time the footage was released, Deiseroth remained on administrative leave pending the outcome of that review.\nSources: WPEC, NBC 6 South Florida, Florida Keys Weekly Newspapers",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-02-20T16:15:58Z",
      "source": "Guessingheadlights.com"
    }
  },
  {
    "article": {
      "id": "NDk=",
      "url": "https://www.11alive.com/video/news/protests-grow-after-savannah-teacher-killed-in-ice-involved-car-chase/85-38b6a548-b918-4b85-8b8d-951c41ba4954",
      "title": "Protests grow after Savannah teacher killed in ICE-involved car chase",
      "summary": "Next up in 5Example video title will go here for this video",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-02-20T14:41:58Z",
      "source": "11Alive.com WXIA"
    }
  },
  {
    "article": {
      "id": "NTA=",
      "url": "https://www.yahoo.com/news/articles/ice-begins-purchase-warehouses-owners-130708782.html",
      "title": "ICE begins to purchase warehouses, but some owners are backing out of deals",
      "summary": "In some cases, warehouse owners are refusing to sell.\nFloridaA TV reporter in Orlando spotted private contractors and federal officials last month touring a 439,945-square-foot (40,872-square-meter) industrial warehouse.\nAdvertisement AdvertisementPlans also are in the works to convert a warehouse in Oakwood into an ICE processing facility, Republican U.S. Rep. Andrew Clyde said in a statement, although no deed has been filed.\nKelly Ayotte sparred with federal officials after ICE disclosed plans to spend $158 million to convert a warehouse in Merrimack into a 500-bed processing center.\nThe announcement came just two days after ICE said it had made a “mistake” when it previously announced the purchase.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-02-21T13:07:08Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTE=",
      "url": "https://www.aljazeera.com/opinions/2026/2/19/migrants-are-not-responsible-for-the-uks-healthcare-crisis",
      "title": "Migrants are not responsible for the UK’s healthcare crisis",
      "summary": "This follows new data released by the Centre for Migration Control, suggesting that 752,000 migrants joined the GP register last year.\nBy 1971, about 31 percent of NHS doctors in England were born and qualified overseas.\nIn the 2010s, successive Conservative governments, while overseeing years of austerity and historically low funding growth in the health service, blamed migrants for its woes.\nThus, migrants do pay more to use the National Health Service.\nPerhaps when Britain releases itself from the idea that it is competing with migrants for care, it will realise that migrants are the care.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-02-19T10:19:23Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTI=",
      "url": "https://www.rt.com/africa/632775-eu-states-considering-deportation-hubs-africa/",
      "title": "EU states to establish deportation centers in Africa – Greek official",
      "summary": "Asylum seekers whose claims have been rejected will be transferred to the “return hubs,” Migration Minister Thanos Plevris has saidGreece is working with four European allies to establish migrant deportation centers outside the European Union (EU), with Africa the preferred destination, the country’s migration minister has said.\nGreek Migration Minister Thanos Plevris has said that Athens is coordinating with Germany, the Netherlands, Austria, and Denmark to create “return hubs” for asylum seekers whose claims have been rejected.\nEU member states have increasingly explored measures to curb irregular migration, including proposed deals involving Rwanda, which have sparked political and legal scrutiny.\nIn December 2025, 19 EU member states, including Greece, urged the European Commission to help fund “return hubs” outside the bloc, describing them as “innovative solutions” to address the influx.\nSimilar arrangements have also been pursued by the US, with the Trump administration deporting migrants to African countries including Cameroon, Eswatini, South Sudan and Ghana.",
      "category": "immigration",
      "bias": "right",
      "publishedAt": "2026-02-19T13:13:43Z",
      "source": "RT"
    }
  },
  {
    "article": {
      "id": "NTM=",
      "url": "https://www.courier-journal.com/story/news/local/2026/02/19/haucks-corner-chef-in-ice-custody/88614238007/",
      "title": "Louisville chef taken into ICE custody during routine diversion meeting",
      "summary": "Feb. 19, 2026 Updated Feb. 20, 2026, 11:23 a.m.\nA Louisville attorney and owners of a Germantown restaurant are speaking out after a man was taken into U.S. Immigration and Customs Enforcement custody while at a routine probation meeting Feb. 10.\nAttorney Frank Mascagni said Aldo Renato Soto-Pantoja, 33, was meeting with a pretrial diversion program officer Feb. 10 when he was escorted into another room where ICE then placed him into custody.\nMascagni was first contacted about representing Soto-Pantoja by an employee at Hauck's Corner, a popular restaurant where Soto-Pantoja works as a chef.\nAlways eager to learn and better himself, all the man did was work and take care of his family,\" Rosenberg said.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-02-19T23:46:46Z",
      "source": "Courier Journal"
    }
  },
  {
    "article": {
      "id": "NTQ=",
      "url": "https://www.businessinsider.com/ukrainian-soldiers-carry-scissors-to-cut-fiber-optic-drone-cables-2026-2",
      "title": "Ukrainian soldiers armed with scissors say they cut any fiber-optic drone cable they see — even if it might be their own",
      "summary": "Fiber-optic drones can't be jammed, but can be stopped by destroying the cables that control them.\nFiber-optic drones can't be jammed, but can be stopped by destroying the cables that control them.\nJose Colon/Anadolu via Getty ImagesFiber-optic drones can't be jammed, but can be stopped by destroying the cables that control them.\nAn analyst with Ukraine's Unmanned Systems Forces said he carries scissors to cut the cables of fiber-optic drones he comes across.\nFiber-optic drones are a relatively new feature in this war that have not previously been fielded at this scale.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-19T13:08:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NTU=",
      "url": "https://www.npr.org/2026/02/21/nx-s1-5720226/kenya-ukraine-russia-war",
      "title": "'Given a gun and sent to die': Kenyans lured to fight for Russia in Ukraine",
      "summary": "'Given a gun and sent to die': Kenyans lured to fight for Russia in Ukrainetoggle caption Simon Maina/AFP via Getty ImagesNAIROBI, Kenya — In Sikonga village, Kisii County, a mother's wails fill the house.\nAccording to the intelligence report, 89 Kenyans remain on the frontline, 39 have been hospitalized, and 28 are missing in action.\nSponsor Message\"More telling is the collusion by officers at the Russian Embassy and the Kenyan Embassy in Moscow,\" Ichung'wah told Parliament.\nOpposition MP Joseph Makilap, who pushed for the intelligence report to be released, said the scale of the recruitment was staggering.\nAccording to the Kenyan intelligence report the recruitment networks involve both Kenyan and foreign actors.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-21T11:20:58Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTY=",
      "url": "https://www.wired.com/story/they-bet-against-trumps-tariffs-now-they-stand-to-make-millions/",
      "title": "They Bet Against Trump’s Tariffs. Now They Stand to Make Millions",
      "summary": "Investment firms are on track for an enormous payday after the Supreme Court of the United States (SCOTUS) struck down President Donald Trump’s signature tariff policy on Friday.\nWhen Trump introduced sweeping tariffs on foreign goods last April, hedge funds and specialist investment firms began to bet on the possibility that the courts might rule that he had violated the law.\nEven then, he says, the administration may choose to challenge any lower court ruling that requires the government to refund tariff payments.\nThe prevailing uncertainty leaves the investment firms holding refund claims with a dilemma: Should they bank some winnings by flipping the claims to another buyer, or wait out the legal wrangling?\n“Trump is Trump is Trump, man,” says Braziel.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-20T21:05:44Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "NTc=",
      "url": "https://www.npr.org/2026/02/21/nx-s1-5720966/trump-iran",
      "title": "With U.S. forces in position, Trump mulls his options for Iran",
      "summary": "With U.S. forces in position, Trump mulls his options for Irantoggle caption Saul Loeb/AFP via Getty ImagesPresident Trump says he hasn't decided whether he'll launch a military strike on Iran.\nSome days he sounds like he would be satisfied with a negotiated deal on the country's nuclear program.\n\"There is no military solution for Iran's nuclear program,\" he told the MS NOW program Morning Joe.\nTrump wants Iran to effectively give up its nuclear program.\nHowever, Trump has so far not made a major speech to the American people about the prospect of a new Middle East war.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-21T11:00:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTg=",
      "url": "https://www.bbc.com/news/articles/cp81kw4pzd2o",
      "title": "US and EU trade deals put India on global stage but challenges remain",
      "summary": "March has not even begun and Delhi has concluded the \"mother of all trade deals\" with the European Union and also what's now being termed the \"father of all trade deals\" with the United States - even though grave concerns remain about the asymmetric nature of the interim agreement which, many say, is stacked heavily in favour of the US.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-18T00:02:20Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NTk=",
      "url": "https://abcnews.com/International/us-ukraine-russia-peace-talks-geneva-expected-resume/story?id=130256516",
      "title": "Day 2 of US-Ukraine-Russia peace talks in Geneva conclude, official says",
      "summary": "Day 2 of US-Ukraine-Russia peace talks in Geneva conclude, official saysProtesters hold placards and Ukrainian flags amid talks between Russian, Ukrainian and U.S. negotiators in Geneva, Switzerland, on Feb. 17, 2026.\nProtesters hold placards and Ukrainian flags amid talks between Russian, Ukrainian and U.S. negotiators in Geneva, Switzerland, on Feb. 17, 2026.\nProtesters hold placards and Ukrainian flags amid talks between Russian, Ukrainian and U.S. negotiators in Geneva, Switzerland, on Feb. 17, 2026.\nProtesters hold placards and Ukrainian flags amid talks between Russian, Ukrainian and U.S. negotiators in Geneva, Switzerland, on Feb. 17, 2026.\nProtesters hold placards and Ukrainian flags amid talks between Russian, Ukrainian and U.S. negotiators in Geneva, Switzerland, on Feb. 17, 2026.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-02-18T09:21:37Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "NjA=",
      "url": "https://petapixel.com/2026/02/20/us-supreme-court-rules-trumps-tariffs-are-illegal/",
      "title": "US Supreme Court Rules Trump’s Tariffs Are Illegal",
      "summary": "The United States Supreme Court has struck down President Trump’s controversial global tariffs in a 6-3 ruling.\nEvery lower court that had considered Trump’s use of tariffs had ruled against him.\nToday, the Supreme Court has validated what we’ve been saying all along: these tariffs were unlawful from the start.\n“Small businesses are rightfully worried that the Administration will respond to this legal defeat by simply reimposing the same tariff policy through other means.\nTariffs imposed under IEEPA crippled small businesses; tariffs reimposed under different statutory approaches would have the same destructive effect.",
      "category": "economics",
      "bias": "right",
      "publishedAt": "2026-02-20T15:49:58Z",
      "source": "PetaPixel"
    }
  },
  {
    "article": {
      "id": "NjE=",
      "url": "https://www.businessinsider.com/coo-job-is-especially-challenging-with-tariff-uncertainty-scotus-2026-2",
      "title": "COO's Jobs Are Especially Challenging Due to Tariff Uncertainty",
      "summary": "Friday's tariff ruling has once again put America's supply-chain bosses in a bind.\n\"Tariffs are written in DC, and they're felt in the COO's inbox,\" Jason Schloetzer, a professor at Georgetown's McDonough School of Business, told Business Insider.\nMany companies are still grappling with the impact of actions they took last year to cope with Trump's tariff hikes, said Rob Lalka, who teaches entrepreneurship at Tulane University.\nNow, with the fate of Trump's tariffs up in the air, COOs are experiencing the kind of whiplash that can be debilitating, said Lalka, especially for those at startups and small businesses with limited resources.\nOmni, which imports goods from Spain and exports to Canada, lost sales last year due to the Trump administration's tariffs, Smith said.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-21T10:39:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NjI=",
      "url": "https://www.project-syndicate.org/commentary/trump-administration-financial-reforms-could-have-far-reaching-consequences-by-dambisa-moyo-2026-02",
      "title": "Five US Policy Shifts Could Reshape Financial Markets",
      "summary": "Email requiredPassword required Remember me?\nPlease enter your email address and click on the reset-password button.\nIf your email exists in our system, we'll send you an email with a link to reset your password.\nPlease note that the link will expire twenty-four hours after the email is sent.\nIf you can't find this email, please check your spam folder.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-02-18T15:03:30Z",
      "source": "Project Syndicate"
    }
  },
  {
    "article": {
      "id": "NjM=",
      "url": "https://www.theatlantic.com/national-security/2026/02/big-story-signalgate-one-year-later-jeffrey-goldberg/686072/",
      "title": "The Big Story: Signalgate, One Year Later",
      "summary": "On Tuesday, March 10, Atlantic editor in chief Jeffrey Goldberg will discuss the political fallout after publishing the Signal story last year.\nAt this virtual event just for subscribers, Goldberg and executive editor Adrienne LaFrance will offer insight into how the unprecedented security breach has influenced the Pentagon’s handling of the country’s sensitive information and restrictions on the press.\nThey’ll also highlight the real-world implications of the latest foreign-policy news from the Trump administration.\nSubscribers can submit questions in advance for Goldberg and LaFrance to answer live during the session.\nSubmit your questions here.",
      "category": "technology",
      "bias": "right",
      "publishedAt": "2026-02-20T15:48:00Z",
      "source": "The Atlantic"
    }
  }
]