[
  {
    "article": {
      "id": "MA==",
      "url": "https://www.businessinsider.com/ai-economy-jobs-unemployment-citrini-disruption-openai-anthropic-2026-02",
      "title": "Investors Face Harsh Reality: If AI Hype Is Real, so Are the Layoffs",
      "summary": "Thomas Fuller/NurPhoto via Getty ImagesYou know all that money and effort everyone's putting into AI because they're convinced it's a technology that will change everything?\nAnd now the blowback: AI boosters are calling the Citrini post \"AI doomerism\" and are poking at some of its doomsday scenarios.\nIt's what accounts for the enormous investments tech companies are making in AI, and the crazy valuations we're seeing for the likes of Anthropic ($380 billion) and OpenAI ($850 billion).\nBut a lot of the value will come from the fact that AI will let computers do lots of work humans do now.\nNor do you have to be an AI \"doomer\" to think this way — it's baked into the pitch of the biggest AI companies.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-24T19:02:50Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MQ==",
      "url": "https://www.businessinsider.com/economy-job-market-divide-k-shape-economy-2026-2",
      "title": "The economy grew strongly last year, but hiring stagnated. It's making the gap between the rich and everyone else worse.",
      "summary": "The data is in, and last year presents an economic conundrum: Overall growth was relatively strong, but job growth was virtually nonexistent.\nZipRecruiter economist Nicole Bachaud thinks the job market could be at a \"pivot point\" after stronger hiring in January.\nThey don't have to worry as much about rising prices of necessities and slowing wage growth.\n\"They're also enjoying faster wage growth, while lower-income families are seeing reduced wage growth, near-zero real wage growth, and not much wealth appreciation outside of real estate, if they have that.\"\nLower-income wage growth surged between 2021 and 2022, but has since cooled down a lot from the late 2022 peak.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-22T10:12:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mg==",
      "url": "https://www.businessinsider.com/supreme-court-trump-tariffs-ruling-impact-consumer-prices-goldman-sachs-2026-2",
      "title": "Sorry, shoppers: prices aren't coming down post-tariffs ruling, Goldman Sachs says",
      "summary": "Retail prices are unlikely to fall even after the Supreme Court struck down Trump's tariffs, Goldman Sachs says.\nRetail prices are unlikely to fall even after the Supreme Court struck down Trump's tariffs, Goldman Sachs says.\nMyung J Chun/Los Angeles Times/Getty ImagesRetail prices are unlikely to fall even after the Supreme Court struck down Trump's tariffs, Goldman Sachs says.\nImpact LinkDon't expect prices at the store to fall just because the Supreme Court struck down President Donald Trump's tariffs.\nBut they're unlikely to cut prices outright, economists at Goldman Sachs wrote in a note published Sunday.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-02-23T06:07:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mw==",
      "url": "https://www.businessinsider.com/finding-job-search-struggles-savings-americans-federal-reserve-amazon-tech-2026-2",
      "title": "Job Searches Lengthen, Savings Dwindle for Americans",
      "summary": "Joanelle Cobos (left), Clair Todd (right)Job searches are taking longer, and some Americans' savings aren't keeping up.\nWilke's experience underscores how quickly a prolonged job search can unravel someone's finances — especially for workers without much savings to fall back on.\nBusiness Insider is speaking with workers who've found themselves at a corporate crossroads — whether due to a layoff, resignation, job search, or shifting workplace expectations.\nMany Americans aren't prepared financially for unemploymentAs unemployment spells lengthen, the financial risks of a prolonged job search are rising for many Americans.\nBut if her job search stretches on, she knows that sense of security will gradually fade.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-22T10:05:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NA==",
      "url": "https://www.businessinsider.com/economists-business-leaderss-react-citrini-report-ai-recession-stock-crash-2026-2",
      "title": "What smart people in economics and business are saying about a viral report warning of an AI-driven recession and stock crash",
      "summary": "A Wall Street trader works on the floor at the New York Stock Exchange.\nA Wall Street trader works on the floor at the New York Stock Exchange.\nBrendan McDermid/ReutersA Wall Street trader works on the floor at the New York Stock Exchange.\nBrendan McDermid/Reuterslighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-24T12:47:21Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NQ==",
      "url": "https://slashdot.org/story/26/02/23/2338242/viral-doomsday-report-lays-bare-wall-streets-deep-anxiety-about-ai-future",
      "title": "Viral Doomsday Report Lays Bare Wall Street's Deep Anxiety About AI Future",
      "summary": "Catch up on stories from the past week (and beyond) at the Slashdot story archive",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-24T00:45:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "Ng==",
      "url": "https://finance.yahoo.com/news/russian-economy-now-eating-itself-231031777.html",
      "title": "The Russian economy is eating its own muscle to survive as Putin’s war on Ukraine destroys future capacity, former central bank advisor says",
      "summary": "Four years after Vladimir Putin ordered an invasion of Ukraine, Russia’s economy has entered a “death zone,” said Alexandra Prokopenko, a fellow at the Carnegie Russia Eurasia Center.\nMore from Yahoo Scout What makes Russia's economy a 'death zone'?\nWhy can't monetary policies fix Russia's economic problems?\n“Russia’s economy is stuck in what might be described as negative equilibrium: holding itself together while steadily destroying its own future capacity,” she wrote.\nAnd rather than end the war, Putin insists on continuing as he waits to see if Ukraine or its Western backers crack first.",
      "category": "international",
      "bias": "right",
      "publishedAt": "2026-02-22T23:10:31Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Nw==",
      "url": "https://www.theverge.com/ai-artificial-intelligence/883707/anthropic-claude-cowork-updates",
      "title": "Anthropic’s Claude Cowork is plugging AI into more boring enterprise stuff",
      "summary": "On Tuesday, Anthropic announced updates to its Claude Cowork platform that allow the AI to help with a wider range of office tasks.\nClaude Cowork can now connect with several popular office apps, including Google Workspace, Docusign, and WordPress.\nNew pre-built plug-ins can also automate tasks in a range of fields, including HR, design, engineering, and finance.\nAdditionally, according to Anthropic, “Claude can now also handle multi-step tasks end-to-end across Excel and PowerPoint,” passing context between the two apps.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-24T16:50:31Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "OA==",
      "url": "https://environment.ec.europa.eu/news/new-law-more-sustainable-circular-and-safe-batteries-enters-force-2023-08-17_en",
      "title": "New law on more sustainable, circular and safe batteries enters into force",
      "summary": "A new law to ensure that batteries are collected, reused and recycled in Europe is entering into force today.\nThis will support the shift to a circular economy, increase security of supply for raw materials and energy, and enhance the EU’s strategic autonomy.\nThe Batteries Regulation will ensure that batteries placed on the EU single market will only be allowed to contain a restricted amount of harmful substances that are necessary.\nBackgroundSince 2006, batteries and waste batteries have been regulated at EU level under the Batteries Directive.\nSuch exponential growth in demand for batteries will lead to an equivalent increase in demand for raw materials, hence the need to minimise their environmental impact.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-02-21T08:28:42Z",
      "source": "Europa.eu"
    }
  },
  {
    "article": {
      "id": "OQ==",
      "url": "https://finance.yahoo.com/news/stocks-sell-off-traders-wake-111342816.html",
      "title": "Stocks sell off as traders wake up to the realization that Trump has ‘highly punitive’ options for new trade tariffs",
      "summary": "More from Yahoo Scout How do different tariff sections impact trade policy complexity?\nWhat caused global markets to decline after Trump's Supreme Court reaction?\nAt first glance, ending the tariffs looked broadly good for stocks because it makes international trade easier and cheaper for companies.\nAs UBS’s Paul Donovan put it, “Welcome back uncertainty.”BNP analyst William Bratton published a research note summarizing Trump’s options.\nSection 232 tariffs also “have no upper limit and can be expanded in scope once implemented.",
      "category": "economics",
      "bias": "right",
      "publishedAt": "2026-02-23T11:13:42Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTA=",
      "url": "https://interestingengineering.com/ai-robotics/chinese-humanoid-robots-global-push-challenge",
      "title": "US AI firm accelerates international rollout of Chinese humanoid robots",
      "summary": "As Chinese humanoid robot manufacturers ramp up international ambitions, OpenMind is positioning itself as a gateway to global markets.\nHe added that OpenMind is already collaborating with several Chinese firms – including Unitree Robotics, UBTech Robotics, AgiBot, LimX Dynamics, Booster Robotics and Engine AI – as they expand their focus beyond the Chinese market.\nSilicon Valley sees growing presence of Chinese robotics Chinese robotics companies have established a significant footprint in Silicon Valley, reflecting their growing engagement with the US technology ecosystem, Liphardt added.\nIn addition to leading OpenMind, Liphardt serves as a professor of bioengineering at Stanford University.\nAlthough several Chinese robotics firms are entering Western markets, many struggle to build brand recognition or cultivate a dedicated following outside Asia, Wong noted.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-22T20:13:08Z",
      "source": "Interesting Engineering"
    }
  },
  {
    "article": {
      "id": "MTE=",
      "url": "https://www.businessinsider.com/ai-job-market-english-majors-humanities-demand-2026-2",
      "title": "AI Is Giving English Majors Some Unexpected Leverage in the Job Market",
      "summary": "Pre-pandemic, the number of English majors at the university was shrinking, part of a broader decline in English across the country, he said.\nBut there's been a rebound, with the number of English majors rising 9% since 2021.\nCourtesy of CU BoulderDerided by some as useless, the utility of the English major has long been questioned.\nThat means that, after years of mocking, English majors are finally getting recognized for their usefulness.\nStill, it's a dreary labor market for everyone — English majors includedThere are signs of employment hope for the English majors.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-22T09:50:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTI=",
      "url": "https://doempke.com/what-happened-to-software-is-happening-to-finance-and-accounting/",
      "title": "What Happened to Software is Happening to Finance and Accounting",
      "summary": "What happened to software is now happening to finance.\nSo I became a finance person who codes — a weird niche that turned out to be excellent preparation for what's happening right now.\nAnd they do it well — if you give them the right context and guardrails.\nIf you're already deep in this: I'd love to see what you're building.\nI'm thinking of putting together a mini hackathon for people building at this intersection — finance, AI, automation.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-21T10:45:52Z",
      "source": "Doempke.com"
    }
  },
  {
    "article": {
      "id": "MTM=",
      "url": "https://www.businessinsider.com/jamie-dimon-banks-doing-dumb-things-2008-credit-crisis-warning-2026-2",
      "title": "Jamie Dimon on the loan rush: 'I see a couple of people doing some dumb things'",
      "summary": "Jamie Dimon said he sees echoes of pre-2008 excess as competition heats up.\nJamie Dimon said he sees echoes of pre-2008 excess as competition heats up.\nFabrice Coffrini/AFP/Getty ImagesJamie Dimon said he sees echoes of pre-2008 excess as competition heats up.\nFabrice Coffrini/AFP/Getty Imageslighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-24T05:01:12Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTQ=",
      "url": "https://www.theverge.com/tech/883307/google-producerai-deal-music",
      "title": "This Chainsmokers-approved AI music producer is joining Google",
      "summary": "ProducerAI, an AI-powered music-making platform, is joining Google.\nAs part of the deal, Google will fold ProducerAI under the Labs umbrella and power the tool with a preview version of its new Lyria 3 music-making AI model.\nProducerAI is a music-making platform that allows users to work with an AI agent to generate sounds, workshop lyrics, remix songs, and even create new instruments based on a prompt.\nThe platform launched in July 2025 as a successor to the AI music-making tool Riffusion, and initially used the startup’s own AI model to help you generate songs and tweak existing ones.\nProducerAI will remain a standalone service after joining Labs, adding yet another platform to Google’s growing AI toolset.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-23T23:36:06Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTU=",
      "url": "https://www.theverge.com/tech/883661/adt-smart-home-security-origin-wireless-ai-wi-fi-motion-presence-sensing",
      "title": "ADT just bought the company that invented Wi-Fi motion sensing",
      "summary": "ADT, the 150-year-old company best known for home security, has acquired Origin Wireless in a $170 million deal to expand the capabilities of its security and smart home offerings.\nOrigin Wireless developed algorithms that analyze how wireless RF signals bounce around a space to detect the presence and movements of people and objects without the need for additional sensors.\nADT plans to integrate Original Wireless’ technology into its smart home and security systems to add more context when security alarms are triggered, and potentially reduce false alarms.\nBy leveraging existing technologies like Wi-Fi, future ADT systems may also require fewer sensors around a home, streamlining installation.\nADT said it will continue to license Origin Wireless’ technology to Verisure, a security system provider in Europe and South America, and other existing partners, while also evaluating new ones.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-24T15:20:07Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTY=",
      "url": "https://www.businessinsider.com/cybersecurity-ai-astelia-ceo-interview-vc-seed-funding-advice-2",
      "title": "Cybersecurity Firm Astelia Raises $35M, Founder Says AI Changed the Game",
      "summary": "Noy is the CEO and cofounder of Astelia, a cybersecurity startup that uses AI to analyze an enterprise's systems, identify the tiny fraction of vulnerabilities that attackers can exploit, and help plug those holes in its defenses.\nNoy's cofounders, Nadav Ostrovsky and Roy Rajwan, also worked on Israel's National Red Team, mimicking attackers to test the country's critical infrastructure defenses.\nAstelia combines AI agents with network and environment analysis of a customer's systems to pinpoint the 1% or 2% of vulnerabilities that are genuinely risky, he said.\n\"Astelia cuts through vulnerability noise by grounding decisions in real exposure, and we believe this team is redefining how enterprises operationalize security,\" he added.\nHe also offered advice to young people worried about an affordability crisis and AI replacing humans in many jobs.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-02-24T14:00:16Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTc=",
      "url": "https://www.businessinsider.com/jpmorgan-tech-budget-ai-20-billion-jamie-dimon-2026-2",
      "title": "JPMorgan will spend almost $20 billion on technology this year",
      "summary": "JPMorgan plans to boost its technology budget by almost $2 billion this year, to $19.8 billion — a roughly 10% increase compared to 2025.\nAnswering a question from Wells Fargo analyst Mike Mayo, who pressed him on the bank's technology spend on a recent earnings call, Dimon said that time saved is often \"too vague\" to measure concretely.\nA slide from the company update presentation breaks down technology spending.\nJPMorgan isn't the only bank spending big on technology.\nBank of America said it plans to spend around $14 billion on technology this year.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-24T00:04:03Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTg=",
      "url": "https://www.businessinsider.com/anthropic-ai-software-claude-microsoft-powerpoint-excel-slack-2026-2",
      "title": "Anthropic pushes Claude into Excel and PowerPoint, escalating AI battle with Microsoft and OpenAI",
      "summary": "Anthropic is pushing deeper into the enterprise, embedding its AI model Claude directly into the workplace software employees use every day.\nOn Tuesday, the AI startup unveiled \"Cowork & Plugins for the Enterprise,\" a package of AI tools that get Claude operating inside popular work applications, such as Microsoft Excel and PowerPoint.\n\"Until now, enterprise AI has followed a persistent pattern: you go to the AI, get an answer, then go back to your actual tools to do the work,\" Anthropic wrote in its announcement on Tuesday.\nThe launch signals Anthropic's clearest attempt yet to challenge Microsoft and OpenAI for control of the digital workplace in the era of AI.\nWith this launch, Anthropic is making clear that it no longer wants to be known primarily as a tool for developers.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-24T14:30:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTk=",
      "url": "https://www.wired.com/story/how-to-hide-google-ai-overviews-from-your-search-results/",
      "title": "How to Hide Google’s AI Overviews From Your Search Results",
      "summary": "While there’s no off switch to avoid this smorgasbord of AI tools entirely, there is one keyboard trick you can use to dodge Google’s AI Overviews for a brief respite.\nIt’s an option WIRED readers highlighted under a recent article about scams found in Google’s AI Overviews.\n“People find Search more helpful with AI Overviews, and they're coming back to search more as a result,” a Google spokesperson tells WIRED.\nThe exception seems to be on Android—at least on a Google Pixel phone we tested with, using “–ai” removed AI Overviews.\nWhen Google launched AI Overviews in 2024, it was a major turning point for the search engine.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-22T11:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MjA=",
      "url": "https://www.theverge.com/ai-artificial-intelligence/883243/anthropic-claude-deepseek-china-ai-distillation",
      "title": "Anthropic accuses DeepSeek and other Chinese firms of using Claude to train their AI",
      "summary": "Anthropic claims DeepSeek and two other Chinese AI companies misused its Claude AI model in an attempt to improve their own products.\nIn an announcement on Monday, Anthropic says the “industrial-scale campaigns” involved the creation of around 24,000 fraudulent accounts and more than 16 million exchanges with Claude, as reported earlier by The Wall Street Journal.\nThe three companies — DeepSeek, MiniMax, and Moonshot — are accused of “distilling” Claude, or training a smaller AI model based on a more advanced one.\nDeepSeek, which caused a stir in the AI industry for its powerful but more efficient models, held over 150,000 exchanges with Claude and targeted its reasoning capabilities, according to Anthropic.\nAnthropic is calling on other members in the AI industry, cloud providers, and lawmakers to address distillation, adding that “restricted chip access” could limit model training and “the scale of illicit distillation.”",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-23T20:22:55Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjE=",
      "url": "https://www.theverge.com/ai-artificial-intelligence/882891/ai-pdf-parsing-failure",
      "title": "Why is AI so bad at reading PDFs?",
      "summary": "In a half-joking timeline of AI development, the researcher Pierre-Carl Langlais placed “PDF parsing is solved!” shortly before AGI.\nThis has begun to change, partly because AI developers are increasingly desperate for high-quality data, and PDFs contain a disproportionate amount of it.\nA PDF reading AI doesn’t capture the spotlight like those models, Soldaini said, but people are actually using it.\nAbraham cofounded the company as a service that managed customers’ long-term histories with language models, similar to the “memory” feature that is now standard in chatbots.\nA vision language model then takes a pass on the output to correct errors.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-02-23T11:04:40Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjI=",
      "url": "https://www.theverge.com/tech/883015/microsoft-xbox-new-ceo-shakeup-notepad",
      "title": "Inside Microsoft’s big Xbox leadership shake-up",
      "summary": "Phil Spencer, Microsoft’s long-term Xbox chief, made the decision to resign from Microsoft last year after a tough few years for Xbox.\nSix months after Bond’s promotion, Xbox executive Kareem Choudhry, who reported directly to Bond, departed Microsoft and triggered another shake-up of some teams inside Xbox.\nThe message was that “you don’t need an Xbox to play Xbox,” because games were available through Xbox Cloud Gaming on TVs.\nPhil Spencer’s retirement has seemed inevitable to Xbox employees, particularly over the past year.\nSome Xbox employees worry she’ll force AI into everything Xbox does, but Sharma was clearly ready for that reaction.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-23T15:06:05Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjM=",
      "url": "https://yro.slashdot.org/story/26/02/21/2140216/americas-peace-corps-announces-tech-corps-volunteers-to-help-bring-ai-to-foreign-countries",
      "title": "America's Peace Corps Announces 'Tech Corps' Volunteers to Help Bring AI to Foreign Countries",
      "summary": "Slashdot is powered by your submissions, so send in your scoop",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-21T21:43:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MjQ=",
      "url": "https://www.theverge.com/ai-artificial-intelligence/883615/seedance-bytedance-tom-cruise-brad-pitt-jia-zhangke",
      "title": "Seedance 2.0 might be gen AI video’s next big hope, but it’s still slop",
      "summary": "When Irish filmmaker Ruairi Robinson began uploading a series of short clips created with Seedance 2.0 — TikTok developer ByteDance’s newest video generation model — it was hard to deny that the footage was much more impressive than what we’ve seen from other gen AI outfits.\nBut the fact that churning out very polished ripoffs is the new model’s main claim to fame makes Seedance 2.0 just another slop generator — albeit a more fancy one.\nWhen we refer to gen AI video as “slop,” we are usually commenting on aesthetics and presentation.\nJia Zhangke’s Dance is a shining example of how filmmakers can make passable things with gen AI provided that they’re skilled enough to know how to work around the technology’s limitations.\nBut until we start seeing quality work coming out of this new wave of AI programs, it’s going to be slop all the way down.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-24T18:28:51Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjU=",
      "url": "https://finance.yahoo.com/news/last-accenture-trained-550-000-163301915.html",
      "title": "Last year, Accenture trained 550,000 workers in AI—now it’s warning senior staff to use it or don’t get promoted",
      "summary": "Bosses have long warned staffers who are slacking in AI adoption that they will get overtaken by their tech-savvy coworkers—and now, having the skill can make or break a career.\nMore from Yahoo Scout What training has Accenture provided for AI skill development?\nWhat other major companies are tying AI skills to performance?\nEmployers set a new standard: Workers need AI skills to succeedAccenture isn’t the only one setting a new AI benchmark for promotions.\nLast year, fellow consulting giant KPMG announced that bosses will assess employees’ use of AI tools as part of their annual performance reviews, according to Bloomberg.",
      "category": "technology",
      "bias": "right",
      "publishedAt": "2026-02-23T16:33:01Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MjY=",
      "url": "https://www.yahoo.com/news/articles/sam-altman-defends-ai-energy-163832426.html",
      "title": "Sam Altman defends AI’s energy toll by saying it also takes a lot to ‘train a human’",
      "summary": "The OpenAI boss, Sam Altman, has tried to ease concerns about how much power is used by artificial intelligence models by comparing it to the amount of energy required by human development.\n“People talk about how much energy it takes to train an AI model – but it also takes a lot of energy to train a human,” Altman told the Indian Express recently while in India for the AI Impact summit.\nDatacenters accounted for about 1.5% of global electricity consumption in 2024, according to the International Energy Agency.\nAt the AI conference, Altman also downplayed concerns about the water datacenters require.\nWe used to do evaporative cooling in datacenters, but now … we don’t do that,” Altman said.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-02-23T17:40:08Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mjc=",
      "url": "https://www.bbc.com/news/articles/cqj9y9xw5v8o",
      "title": "Government relaunches green payment scheme for farmers after sudden closures",
      "summary": "Reynolds said the illegal dumping of waste - described by one farmer as \"a travesty of justice that surely must be righted\" - was an issue that had been \"seized\" by the prime minister, with more resources being given to the Environment Agency.",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2026-02-24T17:59:27Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Mjg=",
      "url": "https://www.businessinsider.com/sam-altman-ai-energy-use-training-human-water-chatgpt-2026-2",
      "title": "Sam Altman says concerns of ChatGPT's energy use are overblown: 'It also takes a lot of energy to train a human'",
      "summary": "OpenAI CEO Sam Altman said it's unfair to compare the energy AI uses to that of humans unless you account for someone's entire early life.\nOpenAI CEO Sam Altman said it's unfair to compare the energy AI uses to that of humans unless you account for someone's entire early life.\nMandel Ngan/AFP/Getty ImagesOpenAI CEO Sam Altman said it's unfair to compare the energy AI uses to that of humans unless you account for someone's entire early life.\n\"But it also takes a lot of energy to train a human.\"\n\"It takes a lot of energy to train a human,\" he said, prompting some laughter in the crowd.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-23T18:02:00Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mjk=",
      "url": "https://hackaday.com/2026/02/23/a-candle-powered-light/",
      "title": "A Candle-Powered Light",
      "summary": "For a little over two thousand years, the primary light sources after the sun had set were oil lamps and candles.\nThis was well before the age of fossil fuels, so these oil lamps were often fueled with a labor-intensive agricultural product like olive oil.\nLabor and materials costs aside, though, there’s a surprising amount of energy in these fuels and [Maciej Nowak Projects] has a generator that help these ancient light sources generate some electricity on the side.\nThe generator is based around a piece of technology called a thermoelectric generator (TEG), which produces a voltage potential when placed in a temperature gradient.\nIt would make a fitting addition to anyone’s emergency power outage kit as it really increases the amount of available light produced from any given candle.",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2026-02-23T09:00:52Z",
      "source": "Hackaday"
    }
  },
  {
    "article": {
      "id": "MzA=",
      "url": "https://slashdot.org/story/26/02/23/1430235/sam-altman-would-like-to-remind-you-that-humans-use-a-lot-of-energy-too",
      "title": "Sam Altman Would Like To Remind You That Humans Use a Lot of Energy, Too",
      "summary": "Want to read Slashdot from your mobile device?\nPoint it at m.slashdot.org and keep reading!",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-23T14:40:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MzE=",
      "url": "https://www.theverge.com/tech/883006/kohler-anthem-evocycle-smart-shower-system-water-recirculate-filter-recycle",
      "title": "Kohler’s new shower reuses dirty water to get you clean",
      "summary": "Kohler claims its new Anthem EvoCycle smart shower system can deliver “up to 80% water savings” without the use of showerheads that limit flow or pressure.\nPricing starts at $7,500, or $5,625 with discounts, but you’ll need to buy fixtures and the $825 water tank base separately.\nSwitching to “Cycle Mode” mixes a half gallon of that fresh water with dirty used water that’s sent through a closed loop filtration system before being pumped up to the showerhead.\nThe system not only reduces water usage, but it can also potentially reduce energy usage by using the hot water heater less.\nThe EvoCycle smart shower connects to Kohler’s mobile app so you can track water savings and activate a self-cleaning mode.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2026-02-23T16:17:26Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MzI=",
      "url": "https://www.yahoo.com/news/articles/putin-tells-fsb-better-protect-140100982.html",
      "title": "Putin tells FSB to better protect energy sector, warns foes against pushing Moscow too far",
      "summary": "MOSCOW, Feb 24 (Reuters) - President Vladimir Putin on Tuesday ordered the FSB security service to step ‌up protection of Russia's energy and transport infrastructure in ‌response to Ukrainian attacks that he said were conducted with the ​help of Western intelligence.\nPutin, speaking on the fourth anniversary of the war, said Russia's enemies would regret it if they pushed Moscow too far.\nUkraine has repeatedly attacked Russian oil depots, refineries and ports in the course of the ‌war, and Moscow blames it for ​a series of assassinations of ​senior military figures.\nPutin, in ​televised remarks, suggested that Russian energy pipelines ‌under the Black Sea could ​be targeted.\nHe issued ​an order to \"strengthen the anti-terrorist protection of energy and transport infrastructure and public gathering places, provide maximum ​coverage for critical ‌facilities, and, if necessary, equip them with additional ​security measures.\"",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-24T14:01:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzM=",
      "url": "https://9to5mac.com/2026/02/24/apple-vision-pro-team-talks-process-behind-designing-newest-visionos-26-environment/",
      "title": "Apple Vision Pro team talks process behind designing newest visionOS 26 Environment",
      "summary": "Apple Vision Pro has the power to transport users from their physical surroundings into a variety of immersive Environments, whether it’s the shores of Mount Hood or the surface of the Moon looking back at Earth.\nWith visionOS 26, Apple expanded its library with another planetary view that takes the immersive experience even further.\nNow, two of the people behind the work are revealing new details about the intricate design process required to bring these virtual spaces to life.\nTo ensure the scale and “feel” were correct, they designed the environments while wearing the Vision Pro itself.\n“The composition of what you’re seeing here was all done through me guiding an artist while inside headset,” Dessero explains.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-02-24T18:57:31Z",
      "source": "9to5Mac"
    }
  },
  {
    "article": {
      "id": "MzQ=",
      "url": "https://www.businessinsider.com/what-country-richest-people-moving-2026-2",
      "title": "The mega-rich are moving. Here's where they're going.",
      "summary": "In 2018, only 108,000 extremely wealthy individuals emigrated to a new country.\nSwitzerland, for example, has a lump-sum tax scheme that uses a taxpayer's lifestyle expenses as a surrogate tax base, rather than taxing global income and assets.\nThe UAE doesn't levy income tax; instead, it relies on a 5% value-added tax.\nMany of the global wealthy are relocating to cities that offer entrepreneurial freedom, often lacking in more bureaucratic regions.\nWith growing restrictions on travel to many countries, wealthy individuals are applying for second residencies or even multiple citizenships as a safeguard.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-23T08:33:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzU=",
      "url": "https://www.yahoo.com/news/articles/india-brazil-sign-mining-pact-122938477.html",
      "title": "India, Brazil sign mining pact as Modi targets $20 billion trade in five years",
      "summary": "Advertisement AdvertisementBrazil is among the world's top producers of iron ore and holds large reserves of minerals critical to steelmaking.\nINFRASTRUCTURE INVESTMENTThe cooperation will ⁠focus on attracting investment in exploration, mining and steel sector infrastructure, the statement said.\n\"We are committed to taking bilateral trade much beyond $20 billion in the next five years,\" Modi said.\n\"Our nations will also work closely in areas such as technology, innovation, digital public infrastructure, AI, semiconductors and more,\" ‌Modi said.\nLula on Thursday advocated for Brazil and India to conduct trade in their own currencies ​rather than settling transactions in ‌U.S.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-21T12:29:38Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzY=",
      "url": "https://www.npr.org/2026/02/23/nx-s1-5719485/italy-migrants-milan",
      "title": "In the shadow of the Olympics, migrants search for a welcome in Milan",
      "summary": "In the shadow of the Olympics, migrants search for a welcome in Milantoggle caption Valerio Muscella for NPRMILAN — Three Afghan men stand together in the freezing fog outside of Milan's central train station on a recent night — their first moments in Italy.\ntoggle caption Valerio Muscella for NPR\"Milan is and wants to be an open city — open to the world and to change,\" says Lamberto Bertolé, Milan's commissioner for health and welfare.\ntoggle caption Valerio Muscella for NPRThese efforts have reduced the number of people arriving in Italy by sea compared to 2023.\ntoggle caption Valerio Muscella for NPRFor some in the room this is a second attempt at settling in a European country.\ntoggle caption Valerio Muscella for NPRtoggle caption Valerio Muscella for NPRtoggle caption Valerio Muscella for NPR\"Imagine, after taking a very long time to get to your dream country and, to be told that you will be deported back to your home country after fighting for years to get here,\" she says.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-23T13:25:36Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "Mzc=",
      "url": "https://www.wired.com/story/the-supreme-courts-tariff-ruling-wont-bring-car-prices-back-to-earth/",
      "title": "The Supreme Court’s Tariff Ruling Won’t Bring Car Prices Back to Earth",
      "summary": "Now, despite a US Supreme Court ruling that will nix some of those Trump tariffs, car buyers will likely get no respite.\nAutomakers have actually done an OK job shielding consumers from the effects of tariffs, Caldwell says.\nEven as retailers have blamed tariffs for steadily rising prices of consumer goods like electronics and appliances, car prices are up just 1 percent since this time last year, the firm’s data shows.\nBut as the tariff regime drags on, that could change in ways that make new-car buyers even less happy.\n“If cost pressures continue to build, automakers may have less room to shield shoppers from higher prices,” Caldwell says, “but for now, the broader market impact is still playing out.”",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-02-21T00:10:01Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "Mzg=",
      "url": "https://www.bbc.com/news/articles/c5yvvjw8pdvo",
      "title": "From Venezuela to immigration, Project 2025 provided Trump's roadmap",
      "summary": "The 2025 US National Security Strategy identifies China as a leading adversary and, in a section on the Western Hemisphere, states: \"The choice all countries should face is whether they want to live in an American-led world of sovereign countries and free economies or in a parallel one in which they are influenced by countries on the other side of the world.\"",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-22T00:02:26Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Mzk=",
      "url": "https://www.bbc.com/news/articles/c4gj20xzw39o",
      "title": "Four years into its full-scale war in Ukraine, Russia is feeling the effects",
      "summary": "The Russian authorities do not release casualty figures for the so-called \"special military operation\".\nBut Russia is known to have suffered huge battlefield losses.\nSo many of the towns and villages I've visited in the last two years have had museums and monuments dedicated to soldiers killed in Ukraine, as well as separate sections for recent war dead at local cemeteries.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-23T06:01:59Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NDA=",
      "url": "https://www.npr.org/2026/02/22/nx-s1-5722854/pakistan-border-strikes-afghanistan-70-killed",
      "title": "Pakistan claims to have killed at least 70 militants in strikes along Afghan border",
      "summary": "Pakistan claims to have killed at least 70 militants in strikes along Afghan bordertoggle caption Hedayat Shah/APKABUL, Afghanistan — Pakistan's military killed at least 70 militants in strikes along the border with Afghanistan early Sunday, targeting what it described as hideouts of Pakistani militants it blamed for recent attacks inside the country, the deputy interior minister said.\nTalal Chaudhry, Pakistan's deputy interior minister, told Geo News that at least 70 militants were killed in the strikes.\nClearing rubble and burying the deadAfghanistan's Ministry of Foreign Affairs summoned Pakistan's ambassador to Kabul and handed him a note of protest over the Pakistani strikes.\nHabib Ullah, a local tribal elder, said those killed in the strikes were not militants.\nHours before the Pakistani strikes, a suicide bomber targeted a security convoy in the border district of Bannu in Pakistan's northwest, killing two soldiers, including a lieutenant colonel.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-22T15:55:39Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDE=",
      "url": "https://www.npr.org/2026/02/24/nx-s1-5723914/ice-iran-deporatation-adoption-adoptee-veteran",
      "title": "A U.S. veteran adopted an orphan from Iran. Decades later, ICE is trying to deport her",
      "summary": "Decades later, ICE is trying to deport hertoggle caption Stella Kalinina for NPRAdopted from Iran at age two, she takes great pride in her quintessential American upbringing.\ntoggle caption Stella Kalinina for NPRShe's terrified to be deported to Iran given her father's military service and her Christian faith.\nIt's unclear exactly how many adoptees are in the same vulnerable position as the California woman.\ntoggle caption Stella Kalinina for NPRAdoptees have been deported in the past, often because a crime triggered their removal.\nThe California woman firmly believes that her parents took the necessary steps to naturalize her.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-02-24T11:00:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDI=",
      "url": "https://www.yahoo.com/news/articles/ice-begins-purchase-warehouses-owners-130708782.html",
      "title": "ICE begins to purchase warehouses, but some owners are backing out of deals",
      "summary": "In some cases, warehouse owners are refusing to sell.\nFloridaA TV reporter in Orlando spotted private contractors and federal officials last month touring a 439,945-square-foot (40,872-square-meter) industrial warehouse.\nAdvertisement AdvertisementPlans also are in the works to convert a warehouse in Oakwood into an ICE processing facility, Republican U.S. Rep. Andrew Clyde said in a statement, although no deed has been filed.\nKelly Ayotte sparred with federal officials after ICE disclosed plans to spend $158 million to convert a warehouse in Merrimack into a 500-bed processing center.\nThe announcement came just two days after ICE said it had made a “mistake” when it previously announced the purchase.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-02-21T13:07:08Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDM=",
      "url": "https://www.aljazeera.com/features/2026/2/24/yemens-mogadishu-somali-refugees-face-poverty-instability-in-aden",
      "title": "Yemen’s ‘Mogadishu’: Somali refugees face poverty, instability in Aden",
      "summary": "Aden, Yemen – Lying on the outskirts of Yemen’s interim capital, Aden, al-Basateen district starts where the paved roads end, stretching into narrow, sandy alleyways.\nIt reveals a decades-old refugee story in which Arabic blends with Somali and the faces harbour memories of a different place, across the sea.\nToday, local sources estimate the district’s population at more than 40,000, with people of Somali origin making up the majority.\nSome arrived as children holding the hands of relatives, while others were born in Aden and have known no other home.\nA mother of four, she was born in Aden to Somali parents.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-02-24T19:12:47Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NDQ=",
      "url": "https://abcnews.com/US/maryland-sues-trump-administration-stop-construction-ice-detention/story?id=130426708",
      "title": "Maryland sues Trump administration to stop construction of ICE detention facility",
      "summary": "Maryland is suing the Trump administration to stop the construction of an immigration detention facility in the state, according to a complaint filed Monday.\n\"The Trump Administration will stop at nothing to pursue its extreme immigration agenda -- including breaking the law,\" Brown said in a statement.\nThe lawsuit says the purchase is part of a broader \"mass immigration detention scheme\" to convert warehouses across the country into detention centers as part of the administration's immigration crackdown.\n\"Defendants are purchasing warehouses across the country and seeking to retrofit them into immigration detention and processing centers that can hold tens of thousands of immigrants,\" the lawsuit states.\n“These will not be warehouses -- they will be very well-structured detention facilities meeting our regular detention standards,\" the statement said.",
      "category": "immigration",
      "bias": "right",
      "publishedAt": "2026-02-24T01:16:57Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "NDU=",
      "url": "https://www.yahoo.com/news/articles/maryland-sues-trump-administration-halt-212045952.html",
      "title": "Maryland sues Trump administration to halt construction of ICE facility",
      "summary": "By Jasper WardWASHINGTON, Feb 23 (Reuters) - Maryland Attorney General Anthony Brown said on Monday that the state had filed a lawsuit against the ‌Trump administration to halt construction of a new federal immigration detention center ‌in the state.\nAdvertisement AdvertisementThe Trump administration, according to Maryland's attorney general and government, purchased the property without conducting an environmental ‌review or receiving public input.\nThis would ​increase Immigration and Customs Enforcement's (ICE) total bed capacity ​to 92,600 at its detention ​centers.\nThere are currently more than 200 federal immigration detention centers in ‌the United States.\nThe move to increase ​detention centers in states ​across the U.S. states has been met with some bipartisan criticism.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-02-23T21:20:45Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDY=",
      "url": "https://www.aljazeera.com/news/2026/2/23/chad-shuts-border-with-sudan-after-clashes-from-conflict-kills-five-troops",
      "title": "Chad shuts border with Sudan after cross-border incursion kills soldiers",
      "summary": "Chad’s government says the border will remain ​closed until further ⁠notice, citing repeated violations by Sudan’s warring parties.\nChad has closed its eastern border with Sudan, the government says, after several Chadian soldiers and civilians were killed in recent days in clashes linked to the Sudanese civil war.\nTwo sources told Reuters that more Chadian soldiers were being deployed to the area.\nLast year, a drone attack killed two Chadian soldiers, according to local authorities and a security source, although it was unclear who carried out the attack.\nChad has reportedly served as a transit route for supplies, including weapons and drones, to the RSF although the Chadian government denies involvement.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-02-23T13:15:07Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NDc=",
      "url": "https://www.npr.org/2026/02/24/nx-s1-5711346/china-trump-us-foreign-aid-withdrawal",
      "title": "China and the US alter foreign aid strategies",
      "summary": "In those days, China itself was receiving aid from the Soviet Union, says Carrie Dolan, an expert on Chinese health aid at the College of William and Mary.\nChina framed its foreign aid as mutually beneficial with countries in the global south, promoting economic cooperation and increasing trade.\nU.S. foreign aid grants, Brazys says, also tended to focus on long-term solutions and came with conditions for governments, such as improving human rights, democracy and corruption.\nDolan's research in Kenya and Sierra Leone on the efficacy of Chinese aid showed mixed reactions from local medical officials, aid and health workers.\nHowever, it's clear that China will try to increase its influence through foreign aid, as the U.S presence appears to wane, she says.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-24T20:50:39Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDg=",
      "url": "https://www.npr.org/2026/02/21/nx-s1-5720226/kenya-ukraine-russia-war",
      "title": "'Given a gun and sent to die': Kenyans lured to fight for Russia in Ukraine",
      "summary": "'Given a gun and sent to die': Kenyans lured to fight for Russia in Ukrainetoggle caption Simon Maina/AFP via Getty ImagesNAIROBI, Kenya — In Sikonga village, Kisii County, a mother's wails fill the house.\nAccording to the intelligence report, 89 Kenyans remain on the frontline, 39 have been hospitalized, and 28 are missing in action.\nSponsor Message\"More telling is the collusion by officers at the Russian Embassy and the Kenyan Embassy in Moscow,\" Ichung'wah told Parliament.\nOpposition MP Joseph Makilap, who pushed for the intelligence report to be released, said the scale of the recruitment was staggering.\nAccording to the Kenyan intelligence report the recruitment networks involve both Kenyan and foreign actors.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-21T11:20:58Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDk=",
      "url": "https://www.yahoo.com/news/articles/canada-prepares-aid-package-cuba-174726102.html",
      "title": "Canada prepares aid package for Cuba as it faces fuel shortages worsened by US oil embargo",
      "summary": "TORONTO (AP) — Canada announced Monday that it is working on an aid package for Cuba as it faces blackouts and severe fuel shortages worsened by a U.S oil embargo.\nAdvertisement AdvertisementAir Canada and other airlines have canceled flights to the Caribbean island because of a shortage of aviation fuel on the island.\nGlobal Affairs Canada, a governmental office, has said Canada is Cuba’s second-largest source of direct investment to the island, particularly in the mining and tourism sectors.\nAdvertisement AdvertisementThe economic crisis gripping Cuba since 2020 has been compounded by intensified U.S. sanctions aimed at forcing a change in the island’s political model.\nBecause Cuba produces only 40% of its required fuel, it remains highly vulnerable to external blockades.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-02-23T17:47:26Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTA=",
      "url": "https://www.npr.org/2026/02/21/nx-s1-5720966/trump-iran",
      "title": "With U.S. forces in position, Trump mulls his options for Iran",
      "summary": "With U.S. forces in position, Trump mulls his options for Irantoggle caption Saul Loeb/AFP via Getty ImagesPresident Trump says he hasn't decided whether he'll launch a military strike on Iran.\nSome days he sounds like he would be satisfied with a negotiated deal on the country's nuclear program.\n\"There is no military solution for Iran's nuclear program,\" he told the MS NOW program Morning Joe.\nTrump wants Iran to effectively give up its nuclear program.\nHowever, Trump has so far not made a major speech to the American people about the prospect of a new Middle East war.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-21T11:00:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTE=",
      "url": "https://www.npr.org/2026/02/24/g-s1-111302/france-ups-the-ante-in-the-spat-with-us-ambassador-says-ministers-will-no-longer-meet-him",
      "title": "U.S. ambassador to France tries to defuse spat after being barred from government",
      "summary": "U.S. ambassador to France tries to defuse spat after being barred from governmenttoggle caption Christophe Ena/APPARIS — The U.S. ambassador to France sought Tuesday to smooth over a diplomatic spat with Paris, calling up the French foreign minister who had said earlier in the day that the U.S. diplomat would lose access to French government officials after he skipped a meeting.\nFrench authorities had summoned Ambassador Charles Kushner — the father of U.S. President Donald Trump 's son-in-law and adviser Jared Kushner — over comments from the Trump administration that France objected to.\nSponsor MessageBarrot reiterated to the ambassador that France cannot accept foreign interference, the minister's office said.\n\"When these explanations have taken place, then the U.S. ambassador in France will, naturally, regain access to members of the French government.\"\nLast August, Paris also summoned Kushner over a letter he wrote to French President Emmanuel Macron alleging that France did not do enough to combat antisemitism.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-24T06:29:28Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTI=",
      "url": "https://abcnews.com/Politics/trump-continues-lash-supreme-court-after-tariff-ruling/story?id=130407379",
      "title": "Trump continues to lash out at Supreme Court after tariff ruling",
      "summary": "Trump continues to lash out at Supreme Court after tariff rulingPresident Donald Trump arrives for an event to proclaim \"Angel Family Day\" in the East Room of the White House, Feb. 23, 2026.\n\"The supreme court (will be using lower case letters for a while based on a complete lack of respect!)\nTrump will face some of the Supreme Court justices in person on Tuesday night when he delivers his State of the Union address.\nThe Supreme Court will hear an expedited appeal of Trump's case seeking to effectively end birthright citizenship by executive order.\n\"But this supreme court will find a way to come to the wrong conclusion, one that again will make China, and various other Nations, happy and rich.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-02-23T17:20:21Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "NTM=",
      "url": "https://indianexpress.com/article/cities/lucknow/yogi-to-leave-for-4-day-visit-to-singapore-japan-expansion-on-agenda-10545313/",
      "title": "Yogi to leave for 4-day visit to Singapore, Japan today; investment diplomacy boost, industrial expansion on agenda",
      "summary": "Yogi Adityanath has departed for a four-day visit to Singapore and Japan to attract investments and deepen industrial partnerships.\n(File Photo)Uttar Pradesh Chief Minister Yogi Adityanath will leave on Sunday evening for his four-day visit to Singapore and Japan aimed at strengthening the state’s investment diplomacy and industrial expansion.\nThis will be his first foreign visit after his Myanmar trip in 2017.\nA key highlight of the visit will be Government-to-Business (G2B) meetings and roundtable interactions, where CM Adityanath will engage directly with the investors.\nActing in the role of the state’s CEO, he will also present Uttar Pradesh’s industrial roadmap, policy stability, and business potential.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-22T03:56:59Z",
      "source": "The Indian Express"
    }
  },
  {
    "article": {
      "id": "NTQ=",
      "url": "https://www.businessinsider.com/coo-job-is-especially-challenging-with-tariff-uncertainty-scotus-2026-2",
      "title": "COO's Jobs Are Especially Challenging Due to Tariff Uncertainty",
      "summary": "Friday's tariff ruling has once again put America's supply-chain bosses in a bind.\n\"Tariffs are written in DC, and they're felt in the COO's inbox,\" Jason Schloetzer, a professor at Georgetown's McDonough School of Business, told Business Insider.\nMany companies are still grappling with the impact of actions they took last year to cope with Trump's tariff hikes, said Rob Lalka, who teaches entrepreneurship at Tulane University.\nNow, with the fate of Trump's tariffs up in the air, COOs are experiencing the kind of whiplash that can be debilitating, said Lalka, especially for those at startups and small businesses with limited resources.\nOmni, which imports goods from Spain and exports to Canada, lost sales last year due to the Trump administration's tariffs, Smith said.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-02-21T10:39:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NTU=",
      "url": "https://abcnews.com/US/wireStory/us-military-boards-oil-tanker-indian-ocean-after-130441949",
      "title": "US military boards third oil tanker in Indian Ocean after tracking it from Caribbean",
      "summary": "U.S. Southern Command said in a post on X that U.S. forces boarded the Bertha overnight, conducting “a right-of-visit, maritime interdiction and boarding.\"\n“The vessel was operating in defiance of President Trump’s established quarantine of sanctioned vessels in the Caribbean and attempted to evade,” the post said.\n“From the Caribbean to the Indian Ocean, we tracked it and stopped it.”Venezuela had faced U.S. sanctions on its oil for several years, relying on a shadow fleet of falsely flagged tankers to smuggle crude into global supply chains.\nVideo posted by the Pentagon shows U.S. military helicopters flying toward the tanker.\nTrump's Republican administration has been seizing tankers as part of its broader efforts to take control of Venezuela's oil.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-24T13:10:28Z",
      "source": "Abcnews.com"
    }
  },
  {
    "article": {
      "id": "NTY=",
      "url": "https://alltoc.com/world/how-has-the-ukraine-war-reshaped-global-security",
      "title": "How has the Ukraine war reshaped global security?",
      "summary": "Four years in: how the conflict changed warfare and alliancesThe full‑scale invasion launched by Russia has entered its fifth year and, in that time, the war has produced deep and lasting shifts in military practice, alliance politics and global security thinking.\nTactical and technological changesWidespread use of drones: Both sides have deployed drones for reconnaissance, strike missions and improvisational air defenses.\nStrategic and geopolitical effectsNATO and European defense: The war renewed political will in Europe for higher defense spending, more integrated deterrence, and questions about deeper European security arrangements.\nHuman and economic toll: Population displacement, demographic impacts and the destruction of infrastructure pose long‑term reconstruction and economic challenges for Ukraine, while sanctions and disrupted trade have lasting global economic effects.\nWhy it matters nowThe war has altered how states prepare for and prosecute conflict in the 21st century.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-02-24T09:13:44Z",
      "source": "Alltoc.com"
    }
  }
]