[
  {
    "article": {
      "id": "MA==",
      "url": "https://www.bbc.com/news/articles/c0r9280gvelo",
      "title": "AI likely to displace jobs, says Bank of England governor",
      "summary": "AI likely to displace jobs, says Bank of England governorHowever, he warned that there was an issue with younger, inexperienced professionals finding it difficult to secure entry-level roles due to AI.\nAndrew Bailey said the UK needed to have the \"training, education, [and] skills in place\" so workers could shift into jobs that use AI.\nThe widespread adoption of artificial intelligence (AI) is likely to displace people from jobs in a similar way seen during the Industrial Revolution, the governor of the Bank of England has said.\nEntry-level professional jobs are thought to be most impacted by AI, particularly in sectors such as law, accountancy and administration.\nMr Bailey said AI was the \"most likely source of the next leg up\" for UK economic growth.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2025-12-19T06:00:08Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "MQ==",
      "url": "https://www.businessinsider.com/russia-economy-putin-direct-line-question-answer-ukraine-war-fatigue-2025-12",
      "title": "Putin's annual Q&A with Russians is back. 2 issues are front and center.",
      "summary": "Russian President Vladimir Putin is set to field questions from his countrymen about the war in Ukraine and the state of the economy.\nRussian President Vladimir Putin is set to field questions from his countrymen about the war in Ukraine and the state of the economy.\nGavriil Grigorov/Poll/AFP/Getty ImagesRussian President Vladimir Putin is set to field questions from his countrymen about the war in Ukraine and the state of the economy.\nRussian President Vladimir Putin is preparing for his annual televised Q&A session, and a new poll shows Russians remain focused on two issues: the war and the economy.\nThese two concerns have topped Levada's polls ahead of Putin's annual Q&A for three years.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2025-12-19T05:43:33Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mg==",
      "url": "https://www.cnn.com/2025/12/20/business/russia-economy-struggling-ukraine-war-intl",
      "title": "Russia’s economy is struggling. But that won’t bring Putin to the negotiating table for years",
      "summary": "But the gathering economic storm is unlikely to bring President Vladimir Putin to the negotiation table anytime soon to end the war in Ukraine.\n“Russian soldiers today are paid more than any Russian soldier in the history of Russian soldiers,” RUSI’s Connolly said.\nSome of Russia’s more deprived areas have experienced an uplift during the war, in part because of huge pay checks going to Russian soldiers and their families.\n“They (Russian oil producers) are rerouting oil exports through smaller Russian companies… That is all costing a lot of money,” she said.\nIf that is combined with stronger sanctions enforcement and increased pressure on India and China to stop buying Russian oil, the Kremlin could eventually change its calculus, she argued.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2025-12-20T08:00:00Z",
      "source": "CNN"
    }
  },
  {
    "article": {
      "id": "Mw==",
      "url": "https://www.bbc.co.uk/sounds/play/p0mpmfcp",
      "title": "Can Trump convince voters on the US economy?",
      "summary": "The timing of the president’s speech comes after polling suggests the Republican Party is losing support over the direction of the economy.\nWill Republicans be able to convince voters that they should still be trusted on the economy ahead of next year’s midterms?\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 Americast is part of the BBC News Podcasts family of podcasts.\nThe team that makes Americast also makes lots of other podcasts, including The Global Story, The Today Podcast, and of course Newscast and Ukrainecast.\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsd The Today Podcast: https://www.bbc.co.uk/sounds/brand/p0gg4k6r Newscast: https://www.bbc.co.uk/sounds/series/p05299nl Ukrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzmProgramme Website",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2025-12-19T11:42:00Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NA==",
      "url": "https://www.investopedia.com/how-trump-can-turbocharge-the-global-economy-and-crush-inflation-11871221",
      "title": "There's One Thing Trump Could Do To Turbocharge The Global Economy And Crush Inflation",
      "summary": "There's no indication that tariffs will suddenly be removed, but the paper highlighted the extreme impact they've had on the global economy.\nPresident Donald Trump could invigorate the global economy and stamp out inflation quickly.\nThat's a boost of 0.5 percentage points per year, all while reducing inflation for U.S. consumers.\n\"One year after \"liberation day,\" the U.S. administration starts lowering U.S. tariffs back to the levels at end-2024.\"\nLiberation from \"Liberation Day\" would not only reinvigorate global trade, but would help household budgets for U.S. consumers.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2025-12-21T11:20:00Z",
      "source": "Investopedia"
    }
  },
  {
    "article": {
      "id": "NQ==",
      "url": "https://www.calculatedriskblog.com/2025/12/ten-economic-questions-for-2026.html",
      "title": "Calculated Risk: Ten Economic Questions for 2026",
      "summary": "1) Economic growth: Economic growth was probably close to 2% Q4-over-Q4 in 2025.\n3) Unemployment Rate: The unemployment rate was at 4.6% in November, up from 4.2% in November 2024.\nWill the core inflation rate decrease further in 2026, and what will the YoY core inflation rate be in December 2026?\nCurrently the FOMC is projecting the unemployment rate will decrease to the 4.3% to 4.4% range in Q4 2026.\nLong term, the BLS is projecting the overall participation rate will decline to 61.1% by 2034 due to demographics.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2025-12-21T13:21:00Z",
      "source": "Calculatedriskblog.com"
    }
  },
  {
    "article": {
      "id": "Ng==",
      "url": "https://www.yahoo.com/news/articles/long-lines-food-pantry-inflation-100428499.html",
      "title": "Long lines at the food pantry: Inflation tests Trump’s base in Michigan",
      "summary": "CAPAC, Michigan, Dec 21 (Reuters) - On a recent snowy morning in a Trump-loving part of rural Michigan, three dozen cars idled outside a firehouse-turned-food pantry.\nLudwig said she had expected Trump to have made greater ​progress on inflation nearly a year into his presidency.\nBut now, persistent inflation is testing that pledge — and the patience of voters who helped put him in office.\nA dozen said they would still vote Republican, and three said they were unsure or did not share their voting plans.\nAdvertisement AdvertisementAdvertisement AdvertisementHe predicted Trump's tariffs would bring back high-paying manufacturing jobs and boost wages above the rate of inflation.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2025-12-21T10:04:28Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Nw==",
      "url": "https://finance.yahoo.com/video/consumer-sentiment-seen-substantial-decline-165016713.html",
      "title": "Consumer sentiment has seen a 'substantial decline' this year",
      "summary": "The final read on December consumer sentiment from the University of Michigan actually came in lower than the prior read and below where Wall Street had forecast those numbers.\nAt both the preliminary read and the final read that we released today, we saw very, very modest improvements from November that weren't actually outside the margin of error.\nUm, we have some, um, some aspects of the economy where consumers reported uh some small improvements.\n01:54 Joanne HsuThis is a very, very substantial decline over a relatively short period um of time.\nUm, even though their inflation expectations have come down, um, for for four straight months now, I think for for the short run inflation expectations, um, we're still, their inflation expectations still are higher than they were in 2024.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2025-12-19T16:50:16Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "OA==",
      "url": "https://www.theverge.com/science/848445/nuclear-energy-ndaa-defense-bill",
      "title": "Next-generation nuclear reactors could get a boost from the National Defense Authorization Act",
      "summary": "President Trump signed the National Defense Authorization Act (NDAA) for Fiscal Year 2026 Thursday with measures that further the bipartisan push for next-generation nuclear power plants.\nThe Trump administration has embraced the technology as a new energy source for data centers demanding greater amounts of electricity for AI.\nMany Democrats, meanwhile, have championed smaller and ostensibly cheaper and easier-to-build nuclear reactors as a carbon pollution-free energy source that can help fight climate change.\nThe International Nuclear Energy Act establishes working groups and boosts funding and interagency cooperation on the development and export of US nuclear technologies.\nThe bill also directs the Department of Defense to create an executive agent role “for installation and operational nuclear energy.”",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2025-12-19T22:04:48Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "OQ==",
      "url": "https://www.yahoo.com/news/articles/trumps-economy-collides-reality-pennsylvania-130334158.html",
      "title": "Trump's 'A+++++' economy collides with the reality in a Pennsylvania city critical to the midterms",
      "summary": "“It's worse than ever,” the 67-year-old retiree, who relies on Social Security, said when asked about the economy.\nIn our world, trust me, it’s not an ‘A.’ To me, it’s an ‘F,’ ‘F,’ ‘F,’ ‘F,’ ‘F,’ ‘F.’”Agreement that prices are too highWith a population of roughly 125,000 people, Allentown anchors the Lehigh Valley, which is Pennsylvania's third-largest metro area.\nAdvertisement AdvertisementAdvertisement Advertisement“Every race here, all the time,” Allentown’s mayor, Democrat Matt Tuerk, recalled of the frenzied race last year.\nBut as attention shifts to next year’s midterms, Allentown cannot escape its place as a political battleground.\nHarris' nearly 2.7 percentage point win in the county was the tightest margin for a Democratic presidential candidate since 2004.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2025-12-20T13:03:34Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTA=",
      "url": "https://www.calculatedriskblog.com/2025/12/schedule-for-week-of-december-21-2025.html",
      "title": "Calculated Risk: Schedule for Week of December 21, 2025",
      "summary": "----- Monday, December 22nd ---------- Tuesday, December 23rd -----Special Note: There is still uncertainty on when some economic reports will be released.\nFor example, we are still missing housing starts and new home sales for September, October and November.The key economic report this week is Q3 GDP.8:30 AM:for November.\nThis is a composite index of other data.8:30 AM:for November.\nThe consensus is for a 0.4% increase.8:30 AM:.\nThe consensus is that real GDP increased 3.2% annualized in Q3, down from 3.8% in Q2.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2025-12-20T12:37:00Z",
      "source": "Calculatedriskblog.com"
    }
  },
  {
    "article": {
      "id": "MTE=",
      "url": "https://www.yahoo.com/news/articles/bernie-sanders-calls-halt-ai-143107669.html",
      "title": "Bernie Sanders Calls For Halt On AI Data Center Construction, Alleges 'Very Very Rich Men' Like Musk, Bezos, Zuckerberg Want More Power And Wealth",
      "summary": "On Tuesday, Sen. Bernie Sanders (I-Vt.) called for a halt to new AI data center construction, warning that the rapid, billionaire-driven expansion of artificial intelligence is threatening jobs, democracy and public resources.\nSanders Says AI Boom Is Being Driven By Billionaires, Not Public InterestIn a video posted on X, Sanders said AI and robotics are moving faster than society can keep up.\nJob Losses And Social Impact Fuel Sanders' AI ConcernsThe senator pointed to comments from tech executives themselves, noting that Musk has said AI and robots could replace all jobs, making work optional.\nI will be pushing for a moratorium on the construction of data centers that are powering the unregulated sprint to develop & deploy AI.\nEnergy-Hungry Data Centers At Center Of Moratorium PushSanders' call for a moratorium focuses on the data centers that power AI systems.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2025-12-19T14:31:07Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTI=",
      "url": "https://www.businessinsider.com/how-to-invest-2026-stock-market-inflation-hot-economic-outlook-2025-12",
      "title": "'Run it hot': Wall Street is trotting out a new playbook for a high-growth, high-inflation economy in 2026",
      "summary": "Impact LinkThe US economy will keep burning hot in 2026, extending a yearslong run of dodging a recession.\n\"We say long commodities the best 'run it hot' trade in '26, and long despised oil/energy without question the best 'run-it-hot' contrarian trade.\"\nConsumer discretionary goodsMorgan Stanley thinks consumer discretionary goods investments fall into the \"run it hot\" investing playbook.\nThat dynamic is already playing out in the discretionary goods sector, strategists said.\nThis combination is especially impactful for the small cap earnings recovery we foresee into 2026,\" the bank's strategists added.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2025-12-19T16:26:33Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTM=",
      "url": "https://hardware.slashdot.org/story/25/12/20/0733202/ev-battery-swapping-startup-that-raised-330-million-files-for-bankruptcy",
      "title": "EV Battery-Swapping Startup That Raised $330 Million Files for Bankruptcy",
      "summary": "Catch up on stories from the past week (and beyond) at the Slashdot story archive",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2025-12-20T17:34:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MTQ=",
      "url": "https://finance.yahoo.com/video/25-shift-made-china-global-150807356.html",
      "title": "The 25-Year Shift That Made China a Global Superpower",
      "summary": "China's entry into the WTO in 2001 accelerated its rise as a global manufacturing and technology powerhouse, fueled export growth, and helped stabilize global demand during the financial crisis.\nAs China expanded Belt and Road investments, advanced in EVs and AI, and entered a sharper economic rivalry with the United States, its property slowdown and domestic inequality exposed new vulnerabilities.\nEnda Curran, Elizabeth Economy, and Afsaneh Beschloss explain China's past 25 years and what its next phase means for the global economy.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2025-12-20T15:08:07Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTU=",
      "url": "https://www.theverge.com/report/847956/robot-crime-wave-europe-police-prediction",
      "title": "Europol imagines robot crime waves in 2035",
      "summary": "The report continues in an increasingly theoretical manner, suggesting that future robots are likely to give police a tough time.\nAs far-fetched as some of these predictions sound, Europol doesn’t think they’re that far off the mark with their vision for 2035.\nIt also “depends also on the market, the cost, the ability to produce en masse,” all of which could prevent the kind of robotic uptake imagined in Europol’s report.\nThat said, Masala says he agrees with the overall recommendations of Europol’s researchers.\n“I’m more concerned about police and intelligence agencies exploiting robot vulnerabilities than terrorists, especially given the ongoing authoritarian shifts across the world.”",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2025-12-19T15:16:27Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTY=",
      "url": "https://www.yahoo.com/news/articles/russian-defense-firms-targeted-hackers-110543326.html",
      "title": "Russian defense firms targeted by hackers using AI, other tactics",
      "summary": "(Corrects spelling in story identifier to RUSSIA-CYBER/UKRAINE)By AJ VicensDec 19 (Reuters) - Russian technology companies working on air defense, sensitive electronics and other defense applications were targeted in recent weeks by a cyber espionage group using AI-generated decoy documents, according to ​a cybersecurity analyst.\nThe hacking campaign targeted several Russian companies, according to suspected AI-generated decoy documents discovered by Fishbein, who is the lead author of an ‍analysis prepared by Intezer.\nThe group's use of AI-generated decoy documents also demonstrates how \"accessible AI tools can be repurposed for malicious goals,\" Fishbein said.\nOthers, however, have suggested a link between the group and other ⁠known pro-Ukrainian hacking efforts.\nA September 2025 report published by Russian cybersecurity firm Kaspersky said Paper Werewolf has potential overlaps with Cloud Atlas, a pro-Ukrainian hacking group dating back more ‌than a decade.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2025-12-19T11:05:43Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTc=",
      "url": "https://www.theverge.com/report/848205/nuclear-fusion-energy-trump-media-tae",
      "title": "Don’t expect Trump Media’s nuclear fusion power plant to generate electricity soon",
      "summary": "Trump Media — yup, the parent company of Truth Social — is the latest entrant in the near century-long race to develop a nuclear fusion power plant.\nGoogle and Microsoft have announced agreements to purchase electricity from fusion power plants that other companies plan to complete by the late 2020s or 2030s.\nThere are no utility scale nuclear fusion power plants yet, despite the rush of initiatives to design one that might actually work.\nHow do we know TAE and Trump Media can actually make fusion power plants a reality?\nA laser fusion power plant would likely need to achieve a gain of 50 to 100.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2025-12-19T18:05:38Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTg=",
      "url": "https://www.businessinsider.com/nvidia-memo-capital-one-explores-aws-alternatives-ai-control-costs-2025-12",
      "title": "Capital One is wary about its rising Amazon cloud AI costs, Nvidia memo shows",
      "summary": "Capital One is concerned about AI costs rising via its cloud-computing relationship with Amazon and may be looking for alternatives, according to an internal Nvidia document obtained by Business Insider.\nNeoclouds are upstart cloud providers, often powered by Nvidia hardware, that focus on AI workloads, whereas AWS supports a much broader range of computing needs.\nCompanies are racing to adopt generative AI but also trying to mitigate rising cloud costs.\nForty-three percent of companies use more than two public cloud providers, according to a recent RBC Capital report.\nThe documents said that 90% of startups in Radical Ventures' portfolio were building primarily on rival clouds due to AWS costs.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2025-12-19T10:00:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTk=",
      "url": "https://finance.yahoo.com/news/google-cloud-lands-deal-palo-130205661.html",
      "title": "Google Cloud lands deal with Palo Alto Networks 'approaching $10 billion,' per source",
      "summary": "The contract comprises a commitment by Palo Alto to pay a sum \"approaching $10 ‌billion\" to Google Cloud over several years, according to the person with direct knowledge of the matter.\n\"AI has spawned a tremendous amount of demand for security,\" said Matt Renner, chief revenue officer for Google Cloud.\nBoth Google and Palo Alto have invested heavily into security ⁠software as enterprises seek to adopt AI.\nPalo Alto launched AI-driven offerings in October and announced plans to buy software company Chronosphere for $3.35 billion last month.\nPalo Alto CEO Nikesh Arora was a longtime Google executive, serving ‌as its chief business officer until 2014.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2025-12-19T13:02:05Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MjA=",
      "url": "https://developers.slashdot.org/story/25/12/19/236259/stanford-computer-science-grads-find-their-degrees-no-longer-guarantee-jobs",
      "title": "Stanford Computer Science Grads Find Their Degrees No Longer Guarantee Jobs",
      "summary": "The amount of weight an evangelist carries with the almighty is measured in billigrahams.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2025-12-20T01:00:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MjE=",
      "url": "https://hbr.org/2025/12/ai-tools-make-coders-more-important-not-less",
      "title": "AI Tools Make Coders More Important, Not Less",
      "summary": "Of all the possible applications of generative AI, the value proposition of using it to write code was perhaps the clearest.\nCoding can be slow and it requires expertise, both of which can be expensive.\nMoreover, the promise that anyone who could describe their idea in plain text could create apps, features, or other value-adding products meant that innovation would no longer be limited to those with the skills to execute, but could be done by anyone with an idea.\nThe strength of this promise has created a $7.37 billion market for these tools.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2025-12-19T14:00:00Z",
      "source": "Harvard Business Review"
    }
  },
  {
    "article": {
      "id": "MjI=",
      "url": "https://finance.yahoo.com/news/moore-threads-unveils-ai-chips-093000651.html",
      "title": "Moore Threads unveils new AI chips to challenge Nvidia",
      "summary": "Chinese chip designer Moore Threads Technology has unveiled a suite of new products, including its next generation of chip architecture and artificial intelligence chips as it looks to challenge US chip-making heavyweights Nvidia and AMD.\nThe launch marks Moore Threads' latest bid to challenge foreign rivals like Nvidia, and comes close on the heels of the company's blockbuster initial public offering on the Shanghai Stock Exchange on December 5.\nZhang Jianzhong, founder and CEO of Moore Threads, pictured in November 2023.\nPhoto: Handout alt=Zhang Jianzhong, founder and CEO of Moore Threads, pictured in November 2023.\nZhang, 59, an Nvidia veteran and former China market general manager who left to found Moore Threads in 2020, acknowledged that local AI developers had previously hesitated to use domestic chips to train their AI models, fearing subpar outcomes.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2025-12-21T09:30:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MjM=",
      "url": "https://tech.slashdot.org/story/25/12/19/1717228/uber-is-hiring-more-engineers-because-ai-is-making-them-more-valuable-ceo-says",
      "title": "Uber is Hiring More Engineers Because AI is Making Them More Valuable, CEO Says",
      "summary": "Catch up on stories from the past week (and beyond) at the Slashdot story archive",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2025-12-19T17:30:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MjQ=",
      "url": "https://www.wired.com/story/uncanny-valley-podcast-wired-roundup-tech-politics-trends-2025/",
      "title": "WIRED Roundup: The 5 Tech and Politics Trends That Shaped 2025",
      "summary": "Articles mentioned in this episode:You can follow Zoë Schiffer on Bluesky at @zoeschiffer and Brian Barrett on Bluesky at @brbarrett.\nToday on the show, we're wrapping up our news episode series by reflecting on the trends and stories that shaped 2025.\nAnd who better to do that with than Brian Barrett, our executive editor who works tirelessly in the shadows?\nBrian Barrett: Zoë, thank you.\nBrian Barrett: What a year it's been, and I'm so excited for it to be almost over.",
      "category": "technology",
      "bias": "right",
      "publishedAt": "2025-12-19T22:58:41Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MjU=",
      "url": "https://www.wired.com/story/scammers-in-china-are-using-ai-generated-images-to-get-refunds/",
      "title": "Scammers in China Are Using AI-Generated Images to Get Refunds",
      "summary": "Online shopping platforms have long depended on photos submitted by customers to confirm that refund requests are legitimate.\n“This is a ceramic cup, not a cardboard cup.\nWho could tear apart a ceramic cup into layers like this?” the seller wrote.\nThe buyer even sent videos showing the dead crabs being poked by a human finger.\nThe case drew widespread attention on Chinese social media, in part because it was the first known AI refund scam of its kind to trigger a regulatory response.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2025-12-19T19:31:43Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MjY=",
      "url": "https://www.cnet.com/tech/computing/we-may-not-know-how-strong-ai-humanoid-robots-really-are/",
      "title": "We May Not Know How Strong AI Humanoid Robots Really Are",
      "summary": "First in the spotlight is the robotics company Figure AI, which is facing a lawsuit from former safety engineer Robert Gruendel.\nThe lawsuit alleges the company's Figure 02 humanoid was shown in tests to be strong enough to \"fracture a human skull,\" and that Gruendel was fired after raising concerns.\nA recent lawsuit alleges the Figure 02 humanoid showed in testing was strong enough to \"fracture a human skull.\"\nEngine AI's T800 humanoid robot squares up.\nTaken together, these two parallel news stories raise questions about what kind of information humanoid robot developers should share so that the risks of this technology are properly understood.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2025-12-21T13:00:00Z",
      "source": "CNET"
    }
  },
  {
    "article": {
      "id": "Mjc=",
      "url": "https://www.businessinsider.com/former-tesla-waymo-employee-leadership-lessons-from-elon-musk-2025-12",
      "title": "I worked at Tesla and Waymo. Here are the leadership lessons I bring to my startup.",
      "summary": "My friends and family were telling me it was a big career mistake to work at Tesla.\nJust because it's a flat org structure, doesn't mean it's a horizontal power dynamic.\nIt's a very vertical org structure.\nEven though it's a very vertical org structure, it's a horizontal power structure.\nAt Tesla, it was very clear that Elon and his lieutenants were driving a lot of the decisions.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2025-12-20T09:52:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mjg=",
      "url": "https://www.androidcentral.com/apps-software/ai/gemini-can-now-tell-you-whether-a-video-was-generated-with-google-ai",
      "title": "Gemini can now tell you whether a video was generated with Google AI",
      "summary": "This tool can reveal whether a video was generated or modified with Google AI.\nStarting now, Gemini can verify the authenticity of videos using SynthID in the Gemini app.\nThis video checker can reveal if uploaded content was created or edited with Google AI in any way.\nGoogle says over 20 billion pieces of AI-generated content have been watermarked using SynthID, which digitally watermarks Google AI creations from Veo generations to AI edits in Google Photos.\nTo use the feature, upload a video to the Gemini app and ask a question like \"was this generated using Google AI?\"",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2025-12-19T17:11:00Z",
      "source": "Android Central"
    }
  },
  {
    "article": {
      "id": "Mjk=",
      "url": "https://www.androidcentral.com/phones/the-biggest-tech-stories-of-2025",
      "title": "From foldables to AI: How 2025 reshapes the smartphone landscape",
      "summary": "Trifold devices have arrived, ultra-thin designs are on the rise, and smart glasses are gaining popularity.\n(Image credit: Harish Jonnalagadda / Android Central)Essentially, making the form factor more valid and widely available to the broader smartphone market.\nTariffs, Tariffs and, more Tariffs(Image credit: Android Central)Well, all wasn't merry in the town of Tech.\nThat said, it created enough confusion for consumers and tech companies alike.\nGalaxy XR came built on Android XR, and with Google’s Gemini AI baked right in.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2025-12-20T19:15:00Z",
      "source": "Android Central"
    }
  },
  {
    "article": {
      "id": "MzA=",
      "url": "https://www.yahoo.com/news/articles/scientists-uncover-potentially-game-changing-235000029.html",
      "title": "Scientists uncover potentially game-changing universal new benefit after planting mushrooms: 'Unsung hero'",
      "summary": "As the BBC reported, the architecture firm Redhouse Studio developed a \"mycotecture\" method that uses fungal mycelium to break down toxic materials.\nRedhouse Studio is changing the way people think about toxic demolition debris, construction scrap materials, and polluted soils.\nThis news is encouraging because it offers a natural solution to address mounting construction waste as development demand steadily increases.\nRedhouse Studio has already been using its fungi technology to address housing and health crises in Cleveland, Ohio.\n\"Decades of racist city planning, banking, and industrial practices have poisoned communities and blighted neighborhoods,\" Redhouse Studio wrote.",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2025-12-19T23:50:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzE=",
      "url": "https://www.yahoo.com/news/articles/scientists-discover-concerning-phenomenon-could-011500264.html",
      "title": "Scientists discover concerning phenomenon that could cause devastating floods: 'Even more intense'",
      "summary": "Dr. Pepin explained, \"Mountains share many characteristics with Arctic regions and are experiencing similarly rapid changes.\"\nAdvertisement AdvertisementAdvertisement AdvertisementHe added that both areas are experiencing significant snow and ice loss, and it's changing the ecosystems.\nWhy is snow and ice loss in the mountains concerning?\nWhile the loss of snow and ice is harmful to mountain communities, it's not just those communities that suffer.\nDr. Pepin also noted, \"When you transition from snowfall to rain because it has become warmer, you're more likely to get devastating floods.",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2025-12-19T01:15:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzI=",
      "url": "https://www.yahoo.com/news/articles/government-research-exposes-culprits-behind-072000708.html",
      "title": "New government research exposes the culprits behind massive energy cost increases: 'Prices are expected to continue rising'",
      "summary": "U.S. energy prices are expected to continue to go up next year, according to new data from the Energy Information Administration.\nWhy are rising energy costs concerning?\nFor Americans already dealing with higher prices for things like groceries and rent, higher energy costs are a punch in the gut.\nOne way to help protect yourself from rising energy prices is to invest in solar.\nTCD's Solar Explorer is a great resource to help you make sense of all the options available.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2025-12-21T07:20:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzM=",
      "url": "https://finance.yahoo.com/news/boeing-seeks-faa-emissions-waiver-225330159.html",
      "title": "Boeing seeks FAA emissions waiver to sell 35 additional 777F freighters",
      "summary": "By David ShepardsonWASHINGTON, Dec 19 (Reuters) - Boeing (BA) on Friday asked the Federal Aviation Administration for a waiver of airplane emissions rules to allow it to ​sell another 35 Boeing 777F freighters, citing strong customer demand and a ‌delay in the next-generation plane's certification.\nBoeing said the waiver would allow it to meet anticipated customer demand for cargo planes prior to the 777-8F entering service.\nBoeing said large widebody freighters are crucial to the export of goods.\n\"Of ‌the $600 billion in goods exported by air cargo in 2024, more than $260 billion were transported on large widebody freighters,\" Boeing said.\nBoeing ⁠said the 777F is the most fuel-efficient airplane for ​the global freight market and the only large ​widebody freighter in production.",
      "category": "environment",
      "bias": "left",
      "publishedAt": "2025-12-19T22:53:30Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzQ=",
      "url": "https://www.npr.org/2025/12/19/nx-s1-5648270/trump-weather-climate-national-center-atmospheric-research-ncar",
      "title": "Scientists push back on Trump plan to break up a critical climate and weather center",
      "summary": "Scientists push back on Trump plan to break up a critical climate and weather centertoggle caption Chip Somodevilla/Getty ImagesThe White House plans to break up a key weather and climate research center in Colorado, a move experts say could jeopardize the accuracy of forecasting and prediction systems.\nIt's the latest climate-related move by President Trump, who has called climate change a hoax, cut funding for climate research, and removed climate and weather scientists from their posts across the federal government.\nAmerican Meteorological Society President David Stensrud says he has used NCAR weather models throughout his career.\nHe calls NCAR \"a world-envied research center for atmospheric science\" and \"a beating heart for the atmospheric science community.\"\nThe administration has also rolled back National Science Foundation funding for climate science.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2025-12-19T18:25:37Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "MzU=",
      "url": "https://www.businessinsider.com/ukraine-attacks-russian-shadow-fleet-tanker-in-mediterranean-first-time-2025-12",
      "title": "Ukrainian drones hit a Russian 'shadow fleet' tanker in the Mediterranean Sea for the first time, security official says",
      "summary": "The oil tanker Qendil in the Mediterranean Sea before the attack.\nThe oil tanker Qendil in the Mediterranean Sea before the attack.\nScreengrab via Security Service of Ukraine videoThe oil tanker Qendil in the Mediterranean Sea before the attack.\nScreengrab via Security Service of Ukraine videoUkrainian forces used long-range drones to strike an oil tanker said to be part of Russia's \"shadow fleet\" in the Mediterranean Sea for the first time, a security source told Business Insider on Friday.\nA source in the Security Service of Ukraine, the SBU, called the drone attack an \"unprecedented special operation\" that targeted and critically damaged the tanker Qendil.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2025-12-19T14:00:21Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzY=",
      "url": "https://uk.finance.yahoo.com/news/underfloor-heating-energy-savings-wunda-060043188.html",
      "title": "'We've all grown up with radiators - underfloor heating is a no-brainer'",
      "summary": "Sam Jump, pictured with Wunda's pioneering Rapid Response underfloor heating system, is the grandson of the entrepreneurial founders.\nWhen entrepreneurs Charles and Josephine Pugh rented a property with \"uncomfortable and uncontrollable\" underfloor heating (UFH), it sparked a move away from the made-to-order furniture world they had been invested in since the late 1970s.\nThe Pughs’ home heating issue had centred on underfloor screed — a level layer of concrete where piping has traditionally been embedded into — with pipe centres too far apart.\nWith no controls, there was a slow response time to heat and the floor became too hot.\nWunda Group founders Charles and Josephine Pugh, left, with daughter Josephine and grandson Sam.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2025-12-21T06:00:43Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mzc=",
      "url": "https://www.yahoo.com/news/articles/expert-issues-urgent-warning-disease-021500884.html",
      "title": "Expert issues urgent warning about disease-carrying insects lurking in US region: 'They were out and about'",
      "summary": "As Pennsylvania hunters gear up and head into the woods this fall, an expert has warned that the state is seeing more ticks than usual.\nAdvertisement AdvertisementAdvertisement AdvertisementThe lab has also found that tick-borne illnesses, such as Lyme disease, anaplasmosis, babesiosis, and Powassan virus, are on the rise.\nPennsylvania is not the only state to report an increase in tick-borne diseases in recent years.\nFor instance, Quebec officials announced the Canadian province's first case of Rocky Mountain spotted fever, a tick-borne disease.\nGenerally, though, reducing pollution to slow the rapid rise in global temperatures can help limit the length of the tick season.",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2025-12-19T02:15:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mzg=",
      "url": "https://www.yahoo.com/news/articles/chinas-heat-pump-tech-tokyo-093000465.html",
      "title": "China's heat pump tech, Tokyo clarifies Taiwan stance to Beijing: SCMP's 7 highlights",
      "summary": "For over a century, the dream of efficiently concentrating low-grade heat into high-temperature industrial energy has been constrained by a stubborn ceiling: 200 degrees Celsius (392 degrees Fahrenheit).\nThis article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century.\nFor more SCMP stories, please explore the SCMP app or visit the SCMP's Facebook and Twitter pages.\nCopyright © 2025 South China Morning Post Publishers Ltd. All rights reserved.\nSouth China Morning Post Publishers Ltd. All rights reserved.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2025-12-19T09:30:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mzk=",
      "url": "https://www.bbc.com/news/articles/cwyg2629g7do",
      "title": "Napier Barracks in Folkestone used for housing asylum seekers shuts",
      "summary": "Barracks used for housing asylum seekers closesThe site closed on Friday and will be handed over to a property developer for housing.\nNapier Barracks in Folkestone - a former military site - opened as accommodation for migrants in 2020.\nAn army barracks in Kent which has been used to house asylum seekers has closed, according to the Home Office.\nThe government had previously announced discussions had begun to use barracks in Crowborough in East Sussex and Inverness in Scotland to house about 900 male asylum seekers in total.\nNapier Barracks housed more than 300 asylum seekers at its peak, but was believed to have fewer than 100 residents ahead of its closure.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2025-12-20T08:57:03Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NDA=",
      "url": "https://www.jezebel.com/trump-admin-stops-reuniting-immigrant-children-families-orr-vetting-data-family-separation",
      "title": "Trump Admin Has Abruptly Stopped Reuniting Immigrant Children with Their Families",
      "summary": "Since the advent of the second Trump administration, though, that’s just what the ORR has increasingly become, according to former staffers.\nRoughly 2,400 kids are in ORR shelters of this sort at the moment, with the largest concentration of more than 800 in Texas.\nStill, up until November, kids were still being reunited with family members by ORR on a daily basis.\nEight immigration attorneys contacted for the piece agreed, saying that starting in early November, ORR stopped responding to letters and communications demanding the release of children to qualified sponsors.\nEven when threatened with litigation, ORR hasn’t explained to these attorneys why the kids aren’t being released.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2025-12-19T18:01:22Z",
      "source": "Jezebel"
    }
  },
  {
    "article": {
      "id": "NDE=",
      "url": "https://www.yahoo.com/news/videos/burundi-overwhelmed-tens-thousands-flee-170833505.html",
      "title": "Burundi 'overwhelmed' as tens of thousands flee eastern Congo",
      "summary": "Airbnb vs. hotel — which offers the better value?\nBefore you book your next trip, consider the accommodations that make the most sense for the way you want to travel.",
      "category": "immigration",
      "bias": "lean right",
      "publishedAt": "2025-12-19T17:08:33Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDI=",
      "url": "https://www.npr.org/2025/12/18/nx-s1-5648584/judge-hannah-dugan-guilty-obstruction-ice",
      "title": "A federal jury finds Milwaukee judge guilty of obstructing immigration agents",
      "summary": "A federal jury finds Milwaukee judge guilty of obstructing immigration agentstoggle caption Adela Tesnow/Pool via APMILWAUKEE — A federal jury found Milwaukee County Circuit Court Judge Hannah Dugan guilty Thursday of obstructing immigration agents as they attempted to arrest an undocumented immigrant defendant last April.\nFlores-Ruiz, a Mexican national, was arrested outside the courthouse after a short chase by the immigration agents and has since been deported.\nDuring the trial, federal agents testified Dugan seemed \"angry\" when she approached them in the public hallway where they were waiting to arrest Flores-Ruiz after his hearing.\nSponsor MessageDuring the government's closing argument, Assistant U.S. Attorney Kelly Watzka said Dugan conducted a \"round-up\" of federal agents and sent them to the chief judge's office.\nUntil President Trump's first term, courthouses were typically off-limits to federal authorities, including immigration agents.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2025-12-19T04:24:15Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDM=",
      "url": "https://www.npr.org/2025/12/19/nx-s1-5649339/trump-suspends-u-s-green-card-lottery-after-brown-university-and-mit-shootings",
      "title": "Trump suspends U.S. green card lottery after Brown University and MIT shootings",
      "summary": "Trump suspends U.S. green card lottery after Brown University and MIT shootingstoggle caption Mark Schiefelbein/APPresident Donald Trump suspended the green card lottery program on Thursday that allowed the suspect in the Brown University and MIT shootings to come to the United States.\nSponsor MessageNeves Valente, 48, is suspected in the shootings at Brown University that killed two students and wounded nine others, and the killing of an MIT professor.\nNearly 20 million people applied for the 2025 visa lottery, with more than 131,000 selected when including spouses with the winners.\nSponsor MessageTrump has long opposed the diversity visa lottery.\nHe has not been deterred if they are enshrined in law, like the diversity visa lottery, or the Constitution, as with a right to citizenship for anyone born on U.S. soil.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2025-12-19T07:24:46Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDQ=",
      "url": "https://www.desertsun.com/story/news/crime_courts/2025/12/19/indio-police-investigate-crash-involving-ice-agents-in-indio/87852401007/",
      "title": "ICE agents involved in crash in Indio, ICE also active in Palm Springs",
      "summary": "Federal agents conducting immigration enforcement recently swept across multiple Coachella Valley cities, officials said Friday, Dec. 19.\n\"ICE has been very active in our city over the last few days,\" Palm Springs Police Chief Andy Mills said in a video posted on social media.\n\"We've actually spoken with ICE agents and let them know we are not assisting them in any way shape or form.\"\nHe also specified that Indio Police was not involved in any ICE enforcement or investigative activity but merely had provided an emergency response to the crash.\nSam Morgen covers the city of Palm Springs for The Desert Sun.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2025-12-19T23:44:03Z",
      "source": "The Desert Sun"
    }
  },
  {
    "article": {
      "id": "NDU=",
      "url": "https://www.aljazeera.com/news/2025/12/19/tens-of-thousands-flee-dr-congo-to-burundi-after-rebel-takeover-of-key-city",
      "title": "Tens of thousands flee DR Congo to Burundi amid rebel takeover of key city",
      "summary": "UN refugee agency says women and children arriving ‘exhausted and severely traumatised’ after fleeing eastern DRC.\nThe UN refugee agency (UNHCR) said on Friday that Burundi had reached a “critical point” amid the influx of refugees and asylum seekers fleeing a surge in violence in the DRC’s South Kivu province.\nRefugees started crossing into Burundi on December 5, with numbers surging after M23 seized control of Uvira on December 10.\nIn Burundi, displaced families face difficult conditions at transit points and makeshift camps with minimal infrastructure, the UN said.\nThe rebel advance has given M23 control over substantial territory in the mineral-rich eastern DRC and severed a critical supply route for Congolese forces along the border with Burundi.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2025-12-19T14:35:00Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NDY=",
      "url": "https://www.theatlantic.com/family/2025/12/immigration-pronatalism-trump-vance/685275/",
      "title": "The Truth About Immigration That MAGA Doesn’t Acknowledge",
      "summary": "(My toddler son has only ever been cared for by immigrant women, myself among them.)\nWhen fewer immigrants are in the American workforce, economic research suggests, women may work less or have fewer babies—possibly both.\nSome researchers anticipate that the Trump administration’s ICE operations will affect immigrant child-care workers even more than Secure Communities did.\nThe relationship between affordable child care and fertility is fuzzy; many countries with subsidized day care and other benefits for parents nevertheless have low birth rates.\nBut some data suggest that as child care gets more expensive or less available, women have fewer kids.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2025-12-19T14:40:00Z",
      "source": "The Atlantic"
    }
  },
  {
    "article": {
      "id": "NDc=",
      "url": "https://www.businessinsider.com/us-visa-requirements-social-media-review-what-to-know-h1b-2025-12",
      "title": "US Reviewing Socials of Some Visa Applicants. What You Should Know.",
      "summary": "Impact LinkThe United States is reviewing the social media accounts of some visa applicants, adding another hurdle for workers and other visitors to clear under the Trump administration.\nThe State Department said in June that certain visa applicants would have their online activity vetted as part of its screening process.\nConsular offices began conducting online presence reviews for H-1B applicants on December 15, but they're not the only ones affected.\nThose companies and many others are still smarting after Trump imposed the $100,000 fee on new H-1B visa applicants in September.\nThe widespread panic in corporate America forced the Trump administration to clarify that the fee would only apply to new visa applicants, not existing visa holders.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2025-12-20T23:09:52Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NDg=",
      "url": "https://www.yahoo.com/news/articles/supreme-court-sides-immigration-judges-190757076.html",
      "title": "Supreme Court sides with immigration judges in speech case for now, rebuffing Trump administration",
      "summary": "WASHINGTON (AP) — The Supreme Court sided with immigration judges on Friday, rebuffing the Trump administration for now in a case with possible implications for federal workers as the justices weigh expanding presidential firing power.\nThe solicitor general asked the Supreme Court to quickly freeze the ruling as he pushes to have the immigration judges’ case removed from federal court.\n“The restrictions on immigration judges’ free speech rights are unconstitutional, and it’s intolerable that this prior restraint is still in place,” Krishnan said.\nIn recent months, the Trump administration's crackdown on immigration has included firing dozens of immigration judges who are seen by his allies as too lenient.\nThe court has sided with the Trump administration about two dozen times on issues ranging from immigration to federal funding.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2025-12-19T19:07:57Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDk=",
      "url": "https://abcnews.go.com/US/milwaukee-judge-found-guilty-felony-obstruction-helping-undocumented/story?id=128524404",
      "title": "Milwaukee judge found guilty of felony obstruction in helping undocumented man evade arrest",
      "summary": "Wisconsin-based Judge Hannah Dugan arrives for the first day of trial in Milwaukee, Wisconsin, December 15, 2025.\nWisconsin-based Judge Hannah Dugan arrives for the first day of trial in Milwaukee, Wisconsin, December 15, 2025.\nWisconsin-based Judge Hannah Dugan arrives for the first day of trial in Milwaukee, Wisconsin, December 15, 2025.\nWisconsin-based Judge Hannah Dugan arrives for the first day of trial in Milwaukee, Wisconsin, December 15, 2025.\nWisconsin-based Judge Hannah Dugan arrives for the first day of trial in Milwaukee, Wisconsin, December 15, 2025.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2025-12-19T03:12:11Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NTA=",
      "url": "https://www.nakedcapitalism.com/2025/12/ethnic-cleansing-trump-style-administration-moves-to-send-asylum-seekers-to-uganda-honduras-and-ecuador.html",
      "title": "Ethnic Cleansing, Trump Style: Administration Moves to Send Asylum Seekers to Uganda, Honduras and Ecuador",
      "summary": "Hellgate earlier reported on the new Trump administration tactic, which sets the stage for potential third-country removals on a large scale in the coming months.\n“The Department is moving to pretermit the respondent’s asylum application,” the Trump administration attorney said.\nNow, in order to keep their asylum claims alive, people will have to submit a written motion to the court.\nRemy called the latest Trump administration tactic “a slaughter,” saying it’s even worse than the masked federal agents stalking immigration court hallways arresting people seemingly at random.\nNow you’ve just seen asylum be completely cut off.”The jury is still out on how immigration judges will rule on the motions to pretermit asylum claims.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2025-12-19T14:57:02Z",
      "source": "Nakedcapitalism.com"
    }
  },
  {
    "article": {
      "id": "NTE=",
      "url": "https://www.yahoo.com/news/articles/trump-suspends-green-card-lottery-051548859.html",
      "title": "Trump suspends green card lottery program that let Brown University, MIT shootings suspect into US",
      "summary": "President Donald Trump suspended the green card lottery program on Thursday that allowed the suspect in the Brown University and MIT shootings to come to the United States.\nNearly 20 million people applied for the 2025 visa lottery, with more than 131,000 selected when including spouses with the winners.\nTrump has long opposed the diversity visa lottery.\nWhile pursuing mass deportation, Trump has sought to limit or eliminate avenues to legal immigration.\nHe has not been deterred if they are enshrined in law, like the diversity visa lottery, or the Constitution, as with a right to citizenship for anyone born on U.S. soil.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2025-12-19T05:15:48Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTI=",
      "url": "https://www.macrumors.com/2025/12/18/tiktok-sale-closing-january/",
      "title": "TikTok U.S. Sale to Oracle-Led Group Set to Close in January",
      "summary": "TikTok has agreed to sell its U.S. operations to an investment group that includes Oracle, Silver Lake, and UAE-based company MGX, reports Axios.\nThe \"TikTok USDS Joint Venture LLC\" that includes the three companies will own 45 percent of TikTok, while ByteDance will keep close to 20 percent.\nThe U.S. group will handle U.S. data protection and content moderation, while also maintaining algorithm security.\nWith the sale, TikTok will be able to continue operating in the United States while complying with the 2024 Protecting Americans From Foreign Adversary Controlled Applications Act.\nThe act required TikTok parent company ByteDance to sell TikTok's U.S. operations to a non-Chinese company or be banned from operating in the United States.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2025-12-19T00:41:45Z",
      "source": "MacRumors"
    }
  },
  {
    "article": {
      "id": "NTM=",
      "url": "https://www.bbc.com/news/articles/cj4qpwprw9vo",
      "title": "Probe ongoing after UK government hacked, says minister",
      "summary": "Inquiry ongoing after UK government hacked, says minister3 days ago Share Save Sam Francis Political reporter Share SaveGetty ImagesCyber security officials have confirmed they are aiding an investigation after a minister said the UK government had been hacked.\nTrade Minister Sir Chris Bryant said earlier that investigations were \"ongoing\" after an attack in October.\nThe UK government has not named who it thinks is responsible, with a spokesperson saying it has been \"working to investigate\" the incident.\nLast year, responding to the UK government's National Security Strategy, a spokesperson for the Chinese embassy in London said \"accusations such as Chinese espionage, cyber-attacks, and transnational repression against the UK are entirely fabricated, malicious slander\".\nEarlier this month, Sir Keir said UK government policy towards China could not continue to blow \"hot and cold\".",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2025-12-19T08:03:22Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NTQ=",
      "url": "https://www.yahoo.com/news/articles/syria-welcomes-permanent-repeal-sweeping-154748606.html",
      "title": "Syria welcomes the permanent repeal of sweeping US sanctions",
      "summary": "DAMASCUS, Syria (AP) — Syria’s government and its allies on Friday welcomed the final lifting of the most draconian sanctions imposed on the country in recent decades.\nThey argued that the sanctions were preventing international investors from launching reconstruction projects and blocking Syria from rebuilding its battered economy and infrastructure.\nSome lawmakers had pushed for making the repeal conditional on steps by the new Sunni Islamist-dominated Syrian government to protect religious minorities, among other measures.\nAl-Sharaa thanked the leaders of all three countries, along with Trump, in a speech celebrating the end of the sanctions.\nThe Saudi foreign ministry commended \"the significant and positive role played by US President Donald Trump” in lifting the sanctions.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2025-12-19T15:47:48Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTU=",
      "url": "https://www.yahoo.com/news/articles/china-still-targeting-us-based-093000574.html",
      "title": "China still targeting US-based researchers for 'malign' purposes, lawmakers warned",
      "summary": "The comments came during a House science committee hearing focused on protecting US research from China.\nShe and other witnesses stressed that US agencies had responded to outreach efforts from China by tightening vetting procedures for foreign researchers, but warned against measures that could deter legitimate international cooperation.\nDaniel Evans, a senior research official at Nasa, said concerns about China's \"malign\" foreign talent recruitment programmes should not obscure the parallel challenge of retaining foreign-born researchers trained in the US.\nThis article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century.\nFor more SCMP stories, please explore the SCMP app or visit the SCMP's Facebook and Twitter pages.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2025-12-19T09:30:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTY=",
      "url": "https://www.aljazeera.com/news/2025/12/19/five-key-takeaways-from-us-secretary-of-state-rubios-year-end-briefing",
      "title": "Five key takeaways from US State Secretary Rubio’s year-end briefing",
      "summary": "Top US diplomat Marco Rubio reiterates hard line against Venezuela’s Maduro, says Ukraine conflict is ‘not our war’.\nIn a two-hour briefing to reporters on Friday, the US secretary of state reiterated Trump’s hard line against Venezuela and defended cuts to foreign aid programmes.\nRubio’s comments come as the US continues to amass troops and military assets around Venezuela, raising speculation about plans to topple Maduro by force.\nRubio was asked on Friday how he would square Trump’s self-image as a peacemaker with the escalating military threats to Venezuela.\nAl Jazeera asked Rubio about Israel’s violations, but the secretary of state failed to address the premise of the question.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2025-12-19T23:17:59Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTc=",
      "url": "https://finance.yahoo.com/news/europe-stumbles-attempt-sidestep-trump-090000409.html",
      "title": "Europe Stumbles in Its Attempt to Bypass Trump’s World Order",
      "summary": "Ursula von der Leyen was supposed to sign the European Union’s largest free-trade agreement on Saturday, proving the bloc’s standing as a geoeconomic force.\nBrazilian President Luiz Inacio Lula da Silva said earlier this week the time was now or never.\nOfficials say they will try again to sign the deal on Jan. 12, but there’s no guarantee.\nIt especially wants to prove it can move outside the orbit of China and the US, which have increasingly antagonistic trade relationships with Europe.\n“This is Europe’s independence moment,” von der Leyen said earlier this week, ahead of a summit when EU leaders would tackle funding options for Ukraine as well as Mercosur.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2025-12-20T09:00:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTg=",
      "url": "https://www.aljazeera.com/video/talk-to-al-jazeera/2025/12/20/uruguays-fm-on-us-claims-to-police-latin-america-and-rising-tensions",
      "title": "Uruguay’s FM on US claims to police Latin America and rising tensions",
      "summary": "Mario Lubetkin on Washington’s revived sphere-of-influence doctrine, Venezuela, and China’s growing footprint.\nThe United States is reviving a policy first set out in the 1800s that treats Latin America as its strategic sphere of influence.\nAs Washington expands maritime operations in the Caribbean and eastern Pacific, critics warn of legal violations and rising regional instability.\nUruguay’s Foreign Minister Mario Lubetkin joins Talk to Al Jazeera to discuss US strikes, Venezuela, migration pressures, and China’s growing role in the region — and whether diplomacy can still prevent escalation in a hemisphere shaped once again by power politics.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2025-12-20T09:04:57Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTk=",
      "url": "https://www.theregister.com/2025/12/19/uk_foreign_office_hack/",
      "title": "Ministers confirm breach at UK Foreign Office",
      "summary": "The UK's Foreign Office is investigating a confirmed cyberattack it learned about in October, senior ministers say.\nThe tabloid claimed that Chinese state-sponsored attackers were behind the intrusion and stole details related to tens of thousands of visa applications.\nSir Chris told Sky News: \"We managed to close the hole, as it were, very quickly.\nOf the four major geopolitical adversaries, the UK has repeatedly singled out China as an \"epoch-defining challenge.\"\n\"China poses a genuine and increasing cyber risk to the UK,\" she said at the time.",
      "category": "technology",
      "bias": "right",
      "publishedAt": "2025-12-19T11:14:15Z",
      "source": "Theregister.com"
    }
  }
]