[
  {
    "article": {
      "id": "MA==",
      "url": "https://www.businessinsider.com/inflation-december-cpi-consumer-price-index-federal-reserve-interest-rates-2026-1",
      "title": "Inflation in December Held Steady: CPI Increased 2.7%",
      "summary": "The year-over-year inflation rate was 2.7% in December, the same as the forecast and November's increase, and down from the 2.9% a year ago.\nThe Federal Reserve will be able to use these economic reports to make its interest rate decision.\nCME FedWatch indicated a 95% chance after the CPI report that the Fed would hold interest rates steady.\nJerome Powell's term as Federal Reserve Chair ends in May, and his term on the Board of Governors ends in 2028.\n\"I have served at the Federal Reserve under four administrations, Republicans and Democrats alike,\" Powell said in a video statement.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-13T13:33:48Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MQ==",
      "url": "https://www.businessinsider.com/goldman-sachs-bears-are-wrong-us-stocks-will-rise-2026-1",
      "title": "Goldman Sachs breaks down what the doomsayers get wrong about the US economy in 8 charts",
      "summary": "And if you're in the wealth management business, like Goldman Sachs, it's your job to listen to these concerns.\nGoldman Sachs' wealth management unit did just that Monday, sending out a report to clients saying that the outlook for the US economy and stock market is bright — and that most of the concerns keeping investors awake at night are overblown.\nThe group puts the probability of a recession at 25%, down from last year's estimate of around 35%.\net cetera, we want to make a very strong stand and say, 'No, that is not the case,'\" Sharmin Mossavar-Rahmani, Chief Investment Officer of the Investment Strategy Group, said in a media appearance for the report's release.\nHere are some of the other takeaways from Goldman's Investment Strategy Group, and what they're telling wealthy clients to do with their money in 2026.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-14T10:33:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mg==",
      "url": "https://finance.yahoo.com/video/why-economists-reset-jobs-reports-193000001.html",
      "title": "Why economists need to 'reset' jobs reports expectations",
      "summary": "For the United States, our new estimate is 3.4%.\nand we see that in the United States that's happening globally also.\n00:58 Speaker BUm, it's going to be a slow level recovery, but this is really the demographic shifts that we've been talking about.\nSo we're going to see, we have to really reset what we're thinking about with regards to jobs because for the last four decades, 150, 200, 250,000 jobs was the norm every month.\nWell, for the foreseeable future, it's going to be 30, 40, 50,000 on average.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-13T19:30:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mw==",
      "url": "https://finance.yahoo.com/news/billionaire-warren-buffett-said-were-210108567.html",
      "title": "Billionaire Warren Buffett Said If He Were A Handy Guy, He'd 'Short the Dollar' By Buying Distressed Homes With A 30-Year Mortgage And Rent Them Out",
      "summary": "Buffett was spelling out a playbook: use low-interest 30-year fixed-rate debt, buy income-producing assets, and let inflation work in your favor.\nThen came the line that summed it all up: \"It's a way, in effect, to short the dollar.\"\nBuffett was asked what advice he'd give to a young investor choosing between buying their first home or investing in stocks.\nThe distressed deals Buffett referenced are harder to find, and for most buyers, the \"cheap asset\" moment has long passed.\nBuffett wasn't urging people to flip houses.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-12T21:01:08Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NA==",
      "url": "https://finance.yahoo.com/news/why-a-nasty-10-to-15-sell-off-in-the-stock-market-may-be-a-few-months-away-183449902.html",
      "title": "Why a 'nasty' 10% to 15% sell-off in the stock market may be a few months away",
      "summary": "But I will just say that I think stocks are fully priced.\nThis optimism has powered the S&P 500 (^GSPC) beyond 7,000 for the first time, with the Dow Jones Industrial Average (^DJI) knocking on the door of 50,000.\nS&P 500 earnings are estimated to increase by double-digit percentages in each quarter of 2026, according to FactSet data.\nMeanwhile, the bottom-up strategist's price target on the S&P 500 is a lofty 8,010 — up about 18% from current levels.\nIn turn, the forward price-to-earnings ratio (PE) for the S&P 500 is 22 times — well above the 10-year average of 18.7 times.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-13T18:34:49Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NQ==",
      "url": "https://www.jezebel.com/trump-declares-war-on-the-economy",
      "title": "Splinter: Trump Declares War on the Economy",
      "summary": "What can history teach us about what happens when a populist strongman with an idiosyncratic taste for low interest rates undermines central bank independence?\nYou may not care about interest rates, but they care about you.\nInterest rates are effectively a numerical representation of trust and the degree to which bond purchasers believe the people they’re lending money to will pay them back.\nThe bond market’s initial reaction to push interest rates higher also backs this inflationary fear up.\nTrump is attempting to destroy the financial world based on logic and reason, and replace it with one driven by his id.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-01-13T16:31:12Z",
      "source": "Jezebel"
    }
  },
  {
    "article": {
      "id": "Ng==",
      "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-fall-as-markets-react-to-doj-investigation-into-powell-001621567.html",
      "title": "Stock market today: Dow, S&P 500 eke out records, gold soars after Trump amps up fight with Fed, Powell",
      "summary": "Other pockets of markets showed more effects from the Fed fight, with gold (GC=F) and silver (SI=F) surging to records as investors flocked to safer havens.\nRattled markets took in the drama as Powell said the Justice Department has subpoenaed the Fed, threatening criminal charges over his testimony on building renovations.\nIn a strongly worded statement, Powell said the action is an escalation of President Trump's campaign to pressure the Fed into cutting interest rates.\nIn corporates, bank and other financial services stocks slumped thanks to a warning to credit card issuers from Trump.\nLenders will be \"in violation of the law\" if they don't cap interest rates at 10%, he told reporters on Sunday.",
      "category": "economics",
      "bias": "lean right",
      "publishedAt": "2026-01-12T00:16:21Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Nw==",
      "url": "https://finance.yahoo.com/news/godfather-ai-says-technology-create-184754671.html",
      "title": "‘Godfather of AI’ says the technology will create massive unemployment and send profits soaring — ‘that is the capitalist system’",
      "summary": "Pioneering computer scientist Geoffrey Hinton, whose work has earned him a Nobel Prize and the moniker “godfather of AI,” said artificial intelligence will spark a surge in unemployment and profits.\n“What’s actually going to happen is rich people are going to use AI to replace workers,” Hinton said in September.\n“It’s going to create massive unemployment and a huge rise in profits.\nHinton said earlier healthcare is the one industry that will be safe from the potential jobs armageddon.\nHinton has long warned about the dangers of AI without guardrails, estimating a 10% to 20% chance of the technology wiping out humans after the development of superintelligence.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-12T18:47:54Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "OA==",
      "url": "https://slashdot.org/story/26/01/12/2324253/european-firms-hit-hiring-brakes-over-ai-and-slowing-growth",
      "title": "European Firms Hit Hiring Brakes Over AI and Slowing Growth",
      "summary": "One way to make your old car run better is to look up the price of a new model.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-13T02:10:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "OQ==",
      "url": "https://www.businessinsider.com/creator-economy-mergers-acquisition-buyers-publicis-talent-influencer-marketing-2026-1",
      "title": "The creator economy's M&A rebound is in full swing. Here are the likely buyers in 2026.",
      "summary": "Impact LinkIs the creator economy in the midst of a comeback era?\nPublicis Groupe , the French advertising giant, acquired influencer-marketing platform Captiv8 and Brazilian influencer-marketing company BR Media Group .\n, the French advertising giant, acquired influencer-marketing platform and Brazilian influencer-marketing company .\nTo gain a better understanding of which companies are driving M&A in the creator economy, Quartermast analyzed the companies that have historically been the most active buyers.\n\"That's a sign that the creator economy is entering a new age of maturity and growth,\" Creech said.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-12T16:01:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTA=",
      "url": "https://www.businessinsider.com/creator-income-inequality-grows-top-earners-paydays-rise-2026-1",
      "title": "Creator Income Inequality Grows As Top Earners' Paydays Rise",
      "summary": "New data from the influencer-marketing platform CreatorIQ shows that the income gap in the creator economy is widening.\nThe top 10% of creators on CreatorIQ's platform received 62% of ad payments in 2025, up from 53% in 2023.\nBrands are shifting more of their marketing dollars to creators, with payments more than doubling over the last two years in CreatorIQ's dataset.\nCreatorIQ's report included additional data points that help explain the current dynamics of the creator economy.\nThat suggests that top creators are pulling the average higher, while the typical creator is earning less.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-14T05:01:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTE=",
      "url": "https://www.yahoo.com/news/articles/irans-traders-frustrated-economic-losses-160902483.html",
      "title": "Iran's traders, frustrated by economic losses, turn against clerics",
      "summary": "They only think about their own benefits,\" said a trader at Tehran’s centuries-old Grand Bazaar, speaking ‌on condition of anonymity.\nIran’s rulers, while acknowledging economic difficulties, have blamed their longtime foes the U.S. and Israel for fomenting the unrest.\nAdvertisement AdvertisementAdvertisement AdvertisementA combination of international sanctions and the Guards' sprawling economic empire has limited the government's ability to ease the dire economic situation.\nAdvertisement AdvertisementAdvertisement AdvertisementThe Guards now control vast sectors of the economy, from oil to transportation, communications, and construction.\nAnother trader said the crisis was not over, as the Guards have long proved adept at defending their economic interests.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-12T16:13:11Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTI=",
      "url": "https://slashdot.org/story/26/01/13/165244/jpmorgan-warns-10-credit-card-rate-cap-would-backfire-on-consumers-and-economy",
      "title": "JPMorgan Warns 10% Credit Card Rate Cap Would Backfire on Consumers and Economy",
      "summary": "One way to make your old car run better is to look up the price of a new model.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-13T16:05:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MTM=",
      "url": "https://www.businessinsider.com/citi-cfo-credit-card-cap-would-have-a-deleterious-impact-2026-1",
      "title": "Citi's Top Execs: the Bank Can't Support a Credit Card Cap",
      "summary": "Citi's top executives warned that President Donald Trump's proposed 10% cap on credit card interest rates could have dire consequences.\n\"An interest rate cap is not something that we would, or could, support, frankly,\" Chief Financial Officer Mark Mason said on a call with reporters ahead of the bank's fourth-quarter earnings call.\n\"At the end of the day, I think an interest rate cap would restrict access to credit to those who need it the most, and frankly would have a deleterious impact on the economy.\"\nMason said multiple times that he did not want to speculate on the impact of the potential cap, given the limited available information.\nIn a post on Truth Social on Friday, Trump said he would call for a one-year cap of 10% on credit card interest rates.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-14T14:52:08Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTQ=",
      "url": "https://www.businessinsider.com/russia-venezuela-oil-assets-roszarubezhneft-us-military-operation-trump-control-2026-1",
      "title": "Russian oil firm says it will keep its Venezuela assets after US military operation",
      "summary": "Lighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nRussia's state-owned oil company Roszarubezhneft sought to draw a line around its oil holdings in Venezuela after a US military operation on January 3 reshaped the South American country's political landscape.\nAfter the operation, President Donald Trump said the US could run Venezuela and touted plans for American oil companies to invest in the South American country's vast but rundown oil sector.\nRussian President Vladimir Putin has not commented publicly on the operation in Venezuela.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-01-14T06:56:11Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTU=",
      "url": "https://www.npr.org/2026/01/11/nx-s1-5674034/fed-powell-subpoena-doj-building-renovation",
      "title": "DOJ subpoenas the Federal Reserve in an escalating pressure campaign",
      "summary": "DOJ subpoenas the Federal Reserve in an escalating pressure campaigntoggle caption Andre Caballero-Reynolds/AFPThe Justice Department has subpoenaed the Federal Reserve for information on the central bank's headquarters renovation, according to a video statement released by Fed Chairman Jerome Powell on Sunday.\nIt's the latest escalation in the administration's pressure campaign to force the central bank to make bigger cuts in interest rates.\n\"This new threat is not about my testimony last June or about the renovation of the Federal Reserve buildings,\" Powell said.\n\"No one — certainly not the chair of the Federal Reserve — is above the law,\" Powell said.\nTrump, who wants much lower interest rates to goose the economy, has insisted he should have greater say in monetary policy.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-12T02:01:26Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "MTY=",
      "url": "https://abcnews.go.com/Business/inflation-expected-held-firm-posing-challenge-amid-doj/story?id=129127426",
      "title": "Inflation held firm in December, testing Fed amid DOJ probe into Powell",
      "summary": "To address pressure on both of its goals, the Fed primarily holds a single tool: interest rates.\nThe Fed cut interest rates at three consecutive meetings late last year in an effort to boost the flagging labor market.\nThe reduction of interest rates, however, risks spurring demand and hiking inflation.\nIn the event a central bank lacks independence, policymakers tend to favor lower interest rates as a means of boosting short-term economic activity, analysts previously told ABC News.\nStocks closed higher on Monday, shrugging off a dip earlier in the day after reports of the DOJ probe into Powell.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-01-13T13:44:52Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "MTc=",
      "url": "https://finance.yahoo.com/news/morning-bid-inflation-test-focuses-115830725.html",
      "title": "Morning Bid: Inflation test focuses Fed row",
      "summary": "Inflation and corporate earnings updates are coming down the pike on Tuesday.\nAnd listen to the latest ‌episode of the Morning Bid daily podcast.\nSubscribe to hear Reuters journalists discuss the biggest news in markets and finance seven days a week.\nBut ROI Finance Columnist Jamie McGeever asks how long Wall Street can keep looking the other way.\nInflation test focuses Fed rowA relatively modest market reaction to new threats on Federal Reserve independence this week owes much to the torrent ⁠of additional information hitting investors, with inflation and corporate earnings updates coming down the pike on Tuesday.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-13T11:58:30Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTg=",
      "url": "https://www.wired.com/story/book-excerpt-silicon-empires-nick-srnicek/",
      "title": "How AI Companies Got Caught Up in US Military Efforts",
      "summary": "At the start of 2024, Anthropic, Google, Meta, and OpenAI were united against military use of their AI tools.\nResearch on general-purpose technologies (the other GPTs) has often highlighted the importance of the defense sector as a way to overcome issues of adoption.\nGiven the need of AI startups, in particular, to secure large and patient investments, the turn to military funding was perhaps inevitable.\nThe Silicon Valley ConsensusUp until about the mid-2010s, the United States was dominated by what might be called the Silicon Valley Consensus.\nIn practice, this meant a free hand was given to the tech sector, with regulations either conspicuously absent or curiously facilitating.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-14T12:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MTk=",
      "url": "https://www.theverge.com/ai-artificial-intelligence/860989/apple-google-gemini-siri-ai-deal-what-it-means",
      "title": "What Apple and Google’s Gemini deal means for both companies",
      "summary": "For years, Apple and Google have had a will-they-won’t-they type of relationship, as far as which AI company Apple would pick to underpin its Siri virtual assistant and give it new AI-fueled personalization and agentic capabilities.\nApple has spent the last year or two playing the field, reportedly considering working with OpenAI or Anthropic to support the new Siri.\n“After careful evaluation, Apple determined that Google’s Al technology provides the most capable foundation for Apple Foundation Models and is excited about the innovative new experiences it will unlock for Apple users,” Google and Apple wrote in a joint statement.\nOn the surface, Apple and Google might appear to be rival tech giants, but the two companies have had a close, complex relationship for more than a decade.\nApple’s initial statement indicates that they will use Google’s technology as more of a white-labeled technology stack that they will customize and deploy as an Apple service.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-13T14:33:06Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjA=",
      "url": "https://www.macrumors.com/2026/01/13/apple-patents-declined-in-2025/",
      "title": "Apple's Patent Grants Declined in 2025 as Innovation Slows",
      "summary": "Apple's U.S. patent activity declined sharply in 2025 amid a broader slowdown in patent filings, according to newly released data from IFI CLAIMS Patent Services.\nTotal U.S. patent grants in 2025 fell to 323,272, a decline of less than 1% from the previous year, while U.S. patent applications dropped more steeply, falling 9% to 393,344.\nApple's decline occurred as several competitors either held steady or increased their patent output.\nSamsung retained the top position for the fourth consecutive year with 7,054 U.S. patent grants, accounting for more than 2% of all patents issued in the United States in 2025.\nApple chip supplier Taiwan Semiconductor Manufacturing Company (TSMC) ranked second with 4,194 grants, followed by Qualcomm in third place with 3,749.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-13T10:00:00Z",
      "source": "MacRumors"
    }
  },
  {
    "article": {
      "id": "MjE=",
      "url": "https://www.theverge.com/podcast/861148/lego-smart-brick-claude-code-vergecast",
      "title": "How Lego’s Smart Brick works",
      "summary": "The most interesting story at this year’s CES was just a little tiny bundle of technology.\nOne way to look at Lego’s new Smart Brick is as something like a Raspberry Pi, an endlessly remixable gizmo with infinite hacking potential — it can be anything, in the best possible way.\nOn this episode of The Vergecast, The Verge’s Sean Hollister explains how the Smart Brick works and why this tiny square feels so complicated.\nHe explains why Lego might want to make the Smart Brick an open platform and all the reasons it might not to do so.\nIf you want to know more about everything we discuss in this episode, here are some links to get you started:",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-01-13T14:06:13Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjI=",
      "url": "https://www.theverge.com/news/860446/google-ai-shopping-standard-buy-button-gemini",
      "title": "Google brings buy buttons to Gemini and AI search",
      "summary": "In other words, it sets up a common language for agents — AI tools capable of acting independently — and online shopping systems.\nUCP is open-source, meaning companies can freely use it rather than having to develop their own tools to deal with AI agents.\nMany of these partners are likely to — or already — partner with other AI companies as well.\nShopify merchants, for example, can sell in AI modes on Gemini, ChatGPT, and Microsoft Copilot, and PayPal has also partnered with OpenAI.\nAs well as the buy button on Gemini and the UCP standard, Google also said it is launching a business agent on Monday that will allow shoppers to chat with brands directly on Search.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-12T12:44:24Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjM=",
      "url": "https://www.businessinsider.com/four-day-workweek-might-incentivize-employees-embrace-ai-2026-1",
      "title": "One thing that might get workers to embrace AI? The 4-day workweek.",
      "summary": "Working fewer days might help create buy-in among workers for adopting AI, authors of a book on the four-day workweek suggest.\nWorking fewer days might help create buy-in among workers for adopting AI, authors of a book on the four-day workweek suggest.\nDrew Angerer/Getty ImagesWorking fewer days might help create buy-in among workers for adopting AI, authors of a book on the four-day workweek suggest.\nDrew Angerer/Getty ImagesBosses, if you're struggling to get your people excited about AI, here's one idea: Embrace the four-day workweek.\nThere hasn't yet been widespread adoption of the four-day workweek, likely in part because employers wield more power in many parts of the job market.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-14T10:19:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjQ=",
      "url": "http://coolhunting.com/design/bmws-designworks-studio-uses-ai-to-design-for-the-future/",
      "title": "BMW’s Designworks Studio Uses AI to Design for the Future",
      "summary": "Read Design BMW’s Designworks Studio Uses AI to Design for the Future The studio designs with the future in mind, treating AI as a world-building collaborator that helps define the environment a product will live in Alexandra Cheney Courtesy of BMWTo celebrate a half-century of its innovation in the U.S., BMW opened the doors of its Designworks studio in Santa Monica, California.\nFerraiolo emphasized that the studio is not using AI to design the product, but rather to imagine the future vision and world, then using that story to design a better product or service for that future.\nCourtesy of BMWAt the center of that future is Neue Klasse, BMW’s next generation vehicle platform and design philosophy.\nThe studio contributed to the Neue Klasse design language and in-car experience, while also supporting BMW’s “Design for Circularity” strategy.\nWhat makes Designworks unusual is that it still operates as both BMW’s internal design arm and an external-facing studio serving non-automotive clients.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-14T12:48:10Z",
      "source": "Cool Hunting"
    }
  },
  {
    "article": {
      "id": "MjU=",
      "url": "https://www.androidcentral.com/phones/google-pixel/apple-chooses-googles-gemini-to-transform-siri-starting-this-year",
      "title": "Apple partners with Google for Gemini: What this means for users",
      "summary": "What you need to knowApple and Google collaborate to integrate Gemini into Apple's next-gen devices for enhanced AI features.\nApple retains user privacy while leveraging Google’s AI technology for innovative advancements.\nAfter what is described as \"careful evaluation,\" Apple decided that \"Google's AI technology provides the most capable foundation, and is excited about the innovative new experiences it will unlock for Apple users.\"\nThat partnership gave Apple a fast way to catch up with GenAI; however, ChatGPT didn't become the foundation of Apple's devices.\nThings look different for Gemini as it now sits at the very core of Apple's AI strategy.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-12T17:22:38Z",
      "source": "Android Central"
    }
  },
  {
    "article": {
      "id": "MjY=",
      "url": "https://www.businessinsider.com/ben-horowitz-investing-teams-size-a16z-vc-venture-capital-2026-1",
      "title": "Ben Horowitz says that investing teams shouldn't be 'too much bigger than basketball teams'",
      "summary": "Ben Horowitz said investment teams should be the size of a playing five in basketball.\nBen Horowitz said investment teams should be the size of a playing five in basketball.\nPhillip Faraone/Getty Images for WIREDBen Horowitz said investment teams should be the size of a playing five in basketball.\nPhillip Faraone/Getty Images for WIREDBen Horowitz is a big fan of tiny teams.\n\"An investing team shouldn't be too much bigger than a basketball team,\" he said, referring to advice he got from famed American investor David Swensen in 2009.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-14T05:06:49Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mjc=",
      "url": "https://www.businessinsider.com/sandstone-raises-seed-funding-sequoia-legal-ai-2026-1",
      "title": "Ex-McKinsey Founder Wins Sequoia Funds for Legal AI Startup, Sandstone",
      "summary": "His startup, Sandstone, is aimed squarely at in-house legal teams instead of law firms, and Sequoia Capital is backing the idea.\nThe Brooklyn-based startup has raised $10 million in a seed funding round led by Sequoia Capital, Business Insider has learned.\nSandstone uses AI to help lawyers inside companies draft and review contracts based on how they've handled similar agreements in the past.\nHe landed on a team advising major law firms and worked closely with QuantumBlack, the firm's AI unit, including on a project with the American Arbitration Association to develop an \"AI arbitrator\" for construction disputes.\nHarvey got its start selling tools to elite law firms and has since expanded into large enterprises.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-13T10:00:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mjg=",
      "url": "https://www.businessinsider.com/in-house-legal-tech-ai-cost-cutting-2026-1",
      "title": "Corporate Legal Departments Are Cutting Costs With AI",
      "summary": "Legal bills from outside law firms are some of the biggest checks companies write each year.\nArtificial intelligence is suddenly giving in-house lawyers a way to shrink those costs.\nWhen Doug Mandell, the general counsel of chatbot-maker Inflection AI, was working on a new data security policy, he turned to a tool from the legal AI startup GC AI.\nThe more aggressive adoption is coming from in-house legal teams, where efficiency isn't a threat, but a mandate.\nAs in-house legal teams move faster, they're quietly resetting expectations for the law firms they hire.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-14T10:00:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mjk=",
      "url": "https://www.businessinsider.com/steve-cohens-point72-sells-parts-of-fintech-startups-2026-1",
      "title": "Point72 Ventures sells off stakes of fintech startups to Goldman Sachs and others",
      "summary": "Steve Cohen is the owner of the New York Mets.\nSteve Cohen is the owner of the New York Mets.\nJoe Raedle/Getty ImagesSteve Cohen is the owner of the New York Mets.\nSeparately, Portage will also manage some Point72 Ventures assets that are not part of the new fund.\nPoint72 declined to comment, while Goldman Sachs did not respond to a request to comment.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-01-14T13:00:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzA=",
      "url": "https://www.businessinsider.com/ben-horowitz-says-ai-is-bigger-than-internet-not-bubble-2026-1",
      "title": "Ben Horowitz Says AI Is Bigger Than the Internet — and Not a Bubble",
      "summary": "Ben Horowitz said fears of an AI bubble miss the point because unprecedented demand makes this tech boom unlike any before.\nBen Horowitz said fears of an AI bubble miss the point because unprecedented demand makes this tech boom unlike any before.\nMIKE BLAKE/ReutersBen Horowitz said fears of an AI bubble miss the point because unprecedented demand makes this tech boom unlike any before.\nMIKE BLAKE/ReutersSilicon Valley leaders have debated for months whether the AI boom is a bubble.\n\"But if you look at what's going on underneath in terms of the customer adoption, the revenue growth rates — we've never seen demand like this.\"",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-14T11:57:47Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzE=",
      "url": "https://www.theverge.com/news/861080/microsoft-ai-data-center-infrastructure-electricity-rates",
      "title": "Microsoft scrambles to quell fury around its new AI data centers",
      "summary": "It looks like the wave of campaigns against data centers are getting under big tech companies’ skin — and Microsoft is the latest giant to promise to address frustrations on the ground in communities around their data centers.\nThe company is also promising more transparency around where it plans to build data centers and how much energy it’s using.\nMeta similarly reiterated a pledge in December to restore water sources in places where it has data centers.\nAmazon commissioned a study late last year that says the company’s data centers generate more in revenue for utilities than it costs for utilities to serve those facilities.\nIn a Truth Social post yesterday, he says his team has been “working with” Microsoft and other tech companies to make sure Americans don’t “pick up the tab” for data center power consumption.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-13T15:33:41Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MzI=",
      "url": "https://tech.slashdot.org/story/26/01/13/2046204/global-tech-sector-layoffs-surpass-244000-in-2025",
      "title": "Global Tech-Sector Layoffs Surpass 244,000 In 2025",
      "summary": "One way to make your old car run better is to look up the price of a new model.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-14T00:02:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MzM=",
      "url": "https://thenextweb.com/news/ai-skills",
      "title": "AI Skills",
      "summary": "If models represent intelligence and agents represent coordination, Skills are where AI becomes operational and valuable in the real world.\nWhat they experience are Skills, because Skills are the part of AI that delivers outcomes.\nThe AI Stack: Where Skills FitTo understand why Skills matter, it helps to look at the modern AI stack.\nOne of the most important distinctions is that Skills encode procedural knowledge rather than descriptive knowledge.\nSkills Are Products, Not Just TechnologyAnother critical point is that Skills are products, not just technology.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-12T19:55:05Z",
      "source": "The Next Web"
    }
  },
  {
    "article": {
      "id": "MzQ=",
      "url": "https://www.yahoo.com/news/articles/california-wants-mix-hydrogen-gas-140733038.html",
      "title": "California wants to mix hydrogen with gas to cut climate pollution. Critics say that poses risks",
      "summary": "“I don't want to be anyone's experiment,\" said Figueroa, 60, a resident of Orange Cove in California's Central Valley.\nIt's part of a statewide effort to create safety rules for hydrogen blending.\nWhat is hydrogen blending?\n“I think the only reason they are wanting Orange Cove is because they don’t think there’s going to be pushback,” she said.\nOrange Cove resident Francisco Gonzalez has friends with asthma and siblings with respiratory issues, so he worries about the health risks.",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2026-01-12T14:07:33Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzU=",
      "url": "https://www.slashgear.com/2071415/china-wind-farm-ecosystem-study/",
      "title": "China's Wind Farms Are Doing A Lot More Than Generating Electricity",
      "summary": "One significant change that's taking place is shifting how some energy is produced.\nIn October 2025, the BBC reported that an Ember study revealed renewable resources had overtaken coal as the planet's most significant source of electricity.\nChina was an enormous part of this push: The outlet notes that, during the first half of 2025, its growth in wind and solar energy outpaced every other country in the world combined.\nChina has previously found that its enormous solar farm was doing a lot more than just producing energy, and this has also proven to be the case for its expansive efforts in wind.\nA December 2025 study titled \"Offshore wind farms can enhance the structural composition and functional dynamics of coastal waters,\" concluded that the wind farms in Chinese waters are making a positive change to the biodiversity of the regions where they were installed.",
      "category": "environment",
      "bias": "lean right",
      "publishedAt": "2026-01-13T13:15:00Z",
      "source": "SlashGear"
    }
  },
  {
    "article": {
      "id": "MzY=",
      "url": "https://www.bbc.com/news/articles/c5y5p9rzd4ko",
      "title": "Global temperatures dip in 2025 but more heat records on way, scientists warn",
      "summary": "Despite natural cooling from La Niña, 2025 was still much warmer than temperatures even a decade ago, as humanity's carbon emissions continue to heat the planet.\nThat will inevitably lead to further temperature records – and worsening weather extremes – unless emissions are sharply reduced, scientists warn.\nLast year might not have been the hottest on record worldwide but extreme weather events linked to global warming continued.\nEl Niño years tend to be warmer as a global average, while La Niña years are typically cooler.\nThe return of La Niña conditions is thought to have suppressed warmth in 2025.",
      "category": "environment",
      "bias": "lean right",
      "publishedAt": "2026-01-14T03:44:07Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Mzc=",
      "url": "https://www.bbc.com/news/articles/c4g0dp65v77o",
      "title": "Nuclear bunker nears collapse due to coastal erosion",
      "summary": "Nuclear bunker nears collapse due to erosion2 days ago Share Save Paul Murphy East Yorkshire and Lincolnshire climate and environment correspondent Share SaveWhen it was built in the late 1950s the bunker was more than 100 yards from the seaA nuclear bunker is \"just a few days\" away from falling into the sea due to coastal erosion.\nEast Yorkshire has some of the fastest eroding coastline in the UK, according to the Environment Agency.\nThe cold war structure is falling victim to rapid erosion on the East Yorkshire coastThe clifftop bunker is one of a number of nuclear monitoring posts around the UK coastline, according to the historical research group Subterranea Brittanica.\nThe bunker is precariously perched on the clifftops at TunstallThe Holderness coastline is eroding at an average annual rate of about 6.5ft (2m), according to the Environment Agency.\nRobinson said the Tunstall bunker \"adds a lot of meaning\" to this process.",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2026-01-13T17:21:48Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Mzg=",
      "url": "https://finance.yahoo.com/video/wallace-crypto-volumes-not-large-104414297.html",
      "title": "Wallace: Crypto Volumes Not Large in DIFC But Growing",
      "summary": "Dubai's financial regulator is rolling out major updates to its crypto-token framework to bolster & regulate its digital asset environment.\nElisabeth Wallace, Associate Director of Policy & Legal at the Dubai Financial Services Authority spoke to Bloomberg's Horizons Middle East and Africa anchor Joumanna Bercetche on how the new framework will help Dubai continue to function on par with International standards.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-12T10:44:14Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mzk=",
      "url": "https://www.newscientist.com/article/2511371-sooner-than-expected-climate-impacts-could-cost-the-world-trillions/",
      "title": "Sooner-than-expected climate impacts could cost the world trillions",
      "summary": "Decision-makers typically focus on the middle-ground estimates of climate impacts.\nBut they should be preparing for the worst-case scenarios instead, the report says, since impacts like short-term precipitation extremes in some regions are happening earlier than anticipated.\nThis would mean up to $25 trillion in economic losses annually due to climate-related impacts, says Trust.\nBut the network says it doesn’t foresee a recession, since it expects global economic growth to outpace those damages.\nBut in a positive sign, global emissions are not rising as quickly as they once were, and China’s emissions have flatlined.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-01-14T03:00:58Z",
      "source": "New Scientist"
    }
  },
  {
    "article": {
      "id": "NDA=",
      "url": "https://www.bbc.com/news/articles/c4gv27517yxo",
      "title": "Ukraine war: Last year was deadliest for civilians since 2022, UN says",
      "summary": "Last year was Ukraine's deadliest for civilians since 2022, UN says2 days ago Share Save Maia Davies Share SaveGetty Images2025 was the deadliest year for civilians in Ukraine since 2022, according to the United Nations (UN).\nThe number of injured civilians also increased sharply each year.\nThe year's deadliest attack killed at least 38 civilians in the western city of Ternopil in November, it reported, including eight children.\nThe total number of civilians killed and injured in 2025 represented a 31% increase on 2024, and 70% on 2023, according to the UN mission.\nIn November last year, it reported more than 14,534 civilians had been killed since the war began.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-01-13T18:43:30Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NDE=",
      "url": "https://www.bbc.co.uk/news/articles/cn9zyx150xdo",
      "title": "UK secures record supply of offshore wind but price rises",
      "summary": "Offshore wind is widely seen as the backbone of Great Britain's future clean electricity system, with plentiful wind resources off the country's coastlines.\nThe government wants at least 43 gigawatts (GW) of offshore wind by 2030 to help meet its clean power target.\nThat is a big step-up from its current offshore wind capacity, which stands at 16.6GW, with a further 11.7GW under construction, according to the government.\nBuilding offshore wind and connecting it to the grid takes time – and many analysts have viewed this auction as crucial to get enough wind to meet its target.\nThe 8.4GW secured at this latest auction just about keeps the offshore wind target in reach, several analysts have told the BBC.",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2026-01-14T11:21:15Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NDI=",
      "url": "https://www.bgr.com/2071457/nuclear-waste-dangerous-explained/",
      "title": "Is Nuclear Waste As Dangerous As People Think? Here's The Reality",
      "summary": "Nuclear energy is one of the most polarizing topics when it comes to ways of generating electricity.\nOn the other hand, there are people who warn about how nuclear waste is extremely dangerous, and the risk is too high to be allowed on larger scales.\nWhat's the truth behind it, and is nuclear waste really a huge problem?\nThe chance of mismanagement is still there, but managing nuclear power results in fewer deaths overall (both directly and indirectly) than other methods of generating power.\nNuclear waste still has its dangers, but they're not anywhere near as deadly as many might think.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-01-14T13:17:00Z",
      "source": "BGR"
    }
  },
  {
    "article": {
      "id": "NDM=",
      "url": "https://www.yahoo.com/news/videos/hungarys-lake-balaton-freezes-first-113040341.html",
      "title": "Hungary's Lake Balaton freezes for the first time in years",
      "summary": "Do movers charge extra for stairs and elevators, and how much does it cost?\nDealing with stairs is an inevitable part of working in the moving industry.\nWhile some movers won't charge you any extra for carrying your belongings up and down several flights of stairs, others will.\nHere's what you need to know.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-01-13T11:30:40Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDQ=",
      "url": "https://www.businessinsider.com/microsoft-energy-prices-data-centers-ai-trump-water-2026-1",
      "title": "Microsoft explains how it plans to keep energy prices down for Americans from its data center buildout",
      "summary": "Lighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nMicrosoft's AI data centers need a lot of energy — and it doesn't want Americans to foot the bill.\nData centers are essential for powering AI models, but they have been increasingly putting a strain on US infrastructure.\nHe added that Microsoft would be \"first up,\" suggesting that announcements from other tech companies may follow.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-13T14:17:23Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NDU=",
      "url": "https://finance.yahoo.com/news/kraken-robotics-tsxv-png-18-171414130.html",
      "title": "Kraken Robotics (TSXV:PNG) Is Up 18.7% After Securing US$35M in SeaPower Battery Orders",
      "summary": "Kraken Robotics Inc. recently announced US$35,000,000 in SeaPower battery sales to three unnamed customers, supplying high‑energy‑density systems for long-endurance unmanned underwater vehicle missions across defence, commercial, and marine research sectors.\nWe’ll now examine how this SeaPower battery order momentum shapes Kraken Robotics’ investment narrative, particularly around higher-value defence and subsea applications.\nWhat Is Kraken Robotics' Investment Narrative?\nTo own Kraken Robotics, you need to believe that its niche in subsea robotics and sensors can support premium pricing despite a rich valuation and a relatively new management bench.\nKraken Robotics' shares are on the way up, but could they be overextended?",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-01-13T17:14:14Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDY=",
      "url": "https://www.bbc.com/news/articles/c98pj370mjjo",
      "title": "Canada's Mark Carney faces delicate balancing act in China visit",
      "summary": "Canada's Mark Carney faces delicate balancing act in China visitSenior Canadian officials have described the trip, the first to China by a Canadian prime minister since 2017, as \"consequential and historic\" and part of a \"bold\" plan to double Canada's non-US exports over the next decade.\nBut with ongoing uncertainty over Canada's trade future with the US – its largest customer – the country now finds itself seeking to repair strained relations to protect its economy.\nCanada's Prime Minister Mark Carney is en route to China for a pivotal visit aimed at resetting ties with Beijing and finding new economic opportunities for his country outside the US.\nFor China, Canada is seen as an important trading partner, with trade between the two countries valued at around $118bn in 2024.\nOne big unknown about this visit is how the US would react to any deals struck between Canada and China.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-14T00:00:15Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NDc=",
      "url": "https://hackaday.com/2026/01/14/pushing-chinas-east-tokamak-past-the-greenwald-density-limit/",
      "title": "Pushing China’s EAST Tokamak Past The Greenwald Density Limit",
      "summary": "Recently Chinese researchers have reported that they managed to increase the plasma density in the EAST tokamak beyond the previously known upper Greenwald Density Limit (GDL), as this phenomenon is known.\nWe covered these details with nuclear fusion reactors in great detail last year, noting the importance of plasma edge stability, as this causes tokamak wall erosion as well as loss of energy.\nThe EAST tokamak (HT-7U) is a superconducting tokamak that was upgraded and resumed operations in 2014, featuring a 1.85 meter major radius and 7.5 MW heating power.\nAs a tokamak the issue of plasma and edge stability are major concerns, even in H-mode, requiring constant intervention.\nIt’s therefore not surprising that W7-X is so far the most efficient fusion reactor to achieve the highest triple product.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-01-14T12:00:34Z",
      "source": "Hackaday"
    }
  },
  {
    "article": {
      "id": "NDg=",
      "url": "https://www.theverge.com/tech/860616/insta360-link-2-2c-pro-face-tracking-webcam",
      "title": "Insta360’s face-tracking webcams get bigger sensors and more expensive",
      "summary": "Insta360 has announced new Pro versions of its Link 2 and Link 2C webcams that first launched in September 2024.\nBoth webcams are now available worldwide through Insta360’s online store and Amazon, but are slightly more expensive than the $199 Link 2 and $149 Link 2C.\nVideo resolutions stay the same, however, with both the Link 2 Pro and Link 2C Pro maxing out at 4K/30fps, or up to 60fps at 1080p.\nThe Insta360 Link 2C Pro is smaller than the Link 2 Pro but doesn’t have a two-axis gimbal to physically move its camera while tracking.\nThe Stream Deck support will also be coming to the Link 2 and Link 2C webcams.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-13T03:13:10Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "NDk=",
      "url": "https://www.wired.com/story/minnesota-sues-to-stop-ice-invasion/",
      "title": "Minnesota Sues to Stop ICE ‘Invasion’",
      "summary": "The 80-page complaint, filed in US district court in Minnesota, targets the US Department of Homeland Security and senior federal officials, including DHS secretary Kristi Noem.\nAt a press conference Monday afternoon, Minnesota attorney general Keith Ellison said the lawsuit is intended to stop what he described as an unlawful federal escalation.\nEllison said that the killing, along with subsequent federal rhetoric, left families and entire communities feeling unsafe in public spaces.\nShe was fatally shot by an ICE officer during a Minneapolis enforcement operation on January 7.\nPlaintiffs argue the federal operation violates the Tenth Amendment, federal administrative law, and long-standing limits on immigration enforcement.",
      "category": "immigration",
      "bias": "right",
      "publishedAt": "2026-01-12T22:42:45Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "NTA=",
      "url": "https://www.npr.org/2026/01/12/nx-s1-5675315/minnesota-sues-to-block-trump-immigration-crackdown",
      "title": "Minnesota officials sue to block Trump's immigration crackdown as enforcement intensifies",
      "summary": "Minnesota officials sue to block Trump's immigration crackdown as enforcement intensifiestoggle caption John Locher/APMINNEAPOLIS — State officials are suing the Trump administration over the widespread immigration operation taking place across the Minneapolis region.\nMore than 2,000 federal immigration agents are in Minnesota, and that number is expected to increase.\nSponsor MessageThose were some of the questions federal immigration agents asked Joel Keleekai as he was charging his Tesla in a parking lot.\nBut the Trump administration has appeared to have shifted its tactics and, in Minnesota, become even more aggressive with its immigration crackdown.\nIllinois and the city of Chicago also took legal action Monday against the Trump administration over its immigration enforcement actions.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-12T23:51:04Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTE=",
      "url": "https://www.yahoo.com/news/articles/opinion-immigration-policy-collides-schools-184542249.html",
      "title": "Opinion: When Immigration Policy Collides With Schools, Students and the Community Suffer",
      "summary": "The answer, according to new research, is that the fear is already everywhere — even in schools where no enforcement actions have occurred.\nThe results are staggering: 70% report that students from immigrant families are expressing fear about their safety and their families’ well-being.\nNearly two-thirds report students missing school due to immigration policies and rhetoric.\nMinneapolis just demonstrated what happens when immigration policy collides with the school day: canceled classes, traumatized students and staff, a community in crisis.\nWhat is America going to do to keep young people safe — and build schools into the communities of belonging that every student deserves?",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-01-12T18:45:42Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTI=",
      "url": "https://www.bbc.com/news/articles/c07xd024zexo",
      "title": "France bans 10 British 'far-right activists' over anti-migrant activity",
      "summary": "France bans 10 British 'far-right activists' over anti-migrant activity1 day ago Share Save Hafsa Khalil Share SavePA MediaTen British \"far-right activists\" have been banned from France after engaging in actions to stop migrants crossing the English Channel in small boats, the French interior ministry said on Wednesday.\nIt said the activists, who belonged to a group called Raise the Colours, had been searching for and destroying small boats along France's northern coast, and were involved in \"propaganda activity\".\nThe ministry said it became aware of the group's actions in December 2025 which were likely to cause \"serious disturbances to public order\".\nThe 10 British nationals are prohibited from entering and residing in France.\nIts website stated that it did not support \"vigilante behaviour, unauthorised activity, or attempts by individuals to take the law into their own hands\".",
      "category": "immigration",
      "bias": "right",
      "publishedAt": "2026-01-14T14:51:28Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NTM=",
      "url": "https://abcnews.go.com/US/driver-shot-portland-immigration-operation-charged-assault-doj/story?id=129135791",
      "title": "Driver shot during Portland immigration operation charged with assault: DOJ",
      "summary": "A photo posted to X by Attorney General Pamela Bondi, Jan. 12, 2025, with a caption stating that it is a damaged Border Patrol vehicle.\nA photo posted to X by Attorney General Pamela Bondi, Jan. 12, 2025, with a caption stating that it is a damaged Border Patrol vehicle.\nA photo posted to X by Attorney General Pamela Bondi, Jan. 12, 2025, with a caption stating that it is a damaged Border Patrol vehicle.\nA photo posted to X by Attorney General Pamela Bondi, Jan. 12, 2025, with a caption stating that it is a damaged Border Patrol vehicle.\nA Border Patrol agent then fired their service weapon twice at the driver of the truck, according to statements from Border Patrol agents, the complaint said.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-12T18:51:08Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NTQ=",
      "url": "https://abcnews.go.com/US/us-1st-time-50-years-experienced-negative-net/story?id=129175522",
      "title": "US, for 1st time in 50 years, experienced negative net migration in 2025: Report",
      "summary": "US, for 1st time in 50 years, experienced negative net migration in 2025: ReportUS Border patrol teams monitor the border with Mexico against any illegal crossings in El Paso, Texas, May 8, 2025.\nUS Border patrol teams monitor the border with Mexico against any illegal crossings in El Paso, Texas, May 8, 2025.\nUS Border patrol teams monitor the border with Mexico against any illegal crossings in El Paso, Texas, May 8, 2025.\nUS Border patrol teams monitor the border with Mexico against any illegal crossings in El Paso, Texas, May 8, 2025.\n\"Though a high degree of policy uncertainty remains, continued negative net migration for 2026 is also likely.\"",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-01-13T23:30:33Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NTU=",
      "url": "https://www.yahoo.com/news/articles/know-warrants-most-immigration-agents-001021882.html",
      "title": "What to know about the warrants most immigration agents use to make arrests",
      "summary": "At the heart of the debate is a legal distinction largely unfamiliar to the public but central to immigration enforcement.\nHere is what to know about the limitations on the warrants that authorize most immigration related arrests.\nTypically, arrests carried out by Department of Homeland Security agencies are authorized by administrative warrants — sometimes known as immigration warrants — not judicial warrants.\nThat means people can legally refuse federal immigration agents entry into private property if the agents only have an administrative warrant.\nThe trainings also typically emphasize that an immigrant can refuse to open the door if law enforcement only has an administrative warrant.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-01-13T00:10:21Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTY=",
      "url": "https://www.bbc.com/news/articles/cly9n3r2p7zo",
      "title": "Hungary grants asylum to Polish ex-justice minister Zbigniew Ziobro",
      "summary": "Hungary grants asylum to Polish ex-justice minister3 days ago Share Save Adam Easton BBC News Warsaw correspondent Share SaveReuters Zbigniew Ziobro says he is a victim of political persecutionHungary has granted political asylum to Poland's former Justice Minister Zbigniew Ziobro who is facing charges of embezzlement.\nZiobro was justice minister between 2015 and 2023 under the previous right-wing PiS-led government, which is politically aligned to Hungarian Prime Minister Viktor Orban.\nWriting on X, Ziobro said: \"I have decided to accept the asylum granted to me by the government of Hungary due to the political persecution in Poland.\"\nI stand in opposition to a creeping dictatorship,\" Ziobro added, accusing Prime Minister Donald Tusk of waging a \"vendetta\" against him.\nZiobro is also accused of awarding Justice Fund grants to fire stations and women's associations without proper competition to bolster support for the government.",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-12T13:57:56Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NTc=",
      "url": "https://www.aljazeera.com/news/2026/1/14/france-bans-10-far-right-uk-activists-for-targeting-migrant-boats",
      "title": "France bans 10 far-right UK activists for targeting migrant boats",
      "summary": "Minister says ‘violent or hate-inciting actions have no place’ in France as ‘Raise the Colours’ activists banned.\nFrance has banned 10 British anti-migrant activists for attempting to stop migrants and asylum seekers from crossing into the United Kingdom on small boats, the French Ministry of Interior has announced.\nIt issued a ban against 10 Raise the Colours activists on Tuesday, effectively banning them from entering and residing in France, the ministry said.\nFar-right activists in the UK have seized on years of migrant and asylum seeker crossings from France – via the English Channel – to advance a hardline, anti-immigration agenda.\nAdvertisementLast year, far-right groups rallied in cities and towns across the UK, demanding that Prime Minister Keir Starmer’s government stop housing asylum seekers at hotels.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-01-14T14:43:38Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTg=",
      "url": "https://www.wired.com/story/what-to-do-if-ice-invades-your-neighborhood/",
      "title": "What to Do if ICE Invades Your Neighborhood",
      "summary": "If federal immigration agents are coming to your area—or have already arrived—you may be frantically making plans to lay low at home, or perhaps grabbing your whistle and lacing up your sneakers to join a neighborhood watch.\nOn Wednesday, a federal agent shot and killed 37-year-old Minneapolis resident and US citizen Renee Nicole Good in her car during an Immigration and Customs Enforcement (ICE) operation.\n\"There are now more ICE agents in Minnesota than there are combined in Minneapolis police force and St. Paul police force,” Minnesota Senator Amy Klobuchar said on Friday.\nNumerous sources told WIRED that their trainings and materials about interacting with federal immigration agents are actively evolving to reflect the current moment.\nBut this type of information, while still accurate, does not fully account for the chaotic intensity of current US immigration enforcement.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-01-13T10:30:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "NTk=",
      "url": "https://www.npr.org/sections/the-picture-show/2026/01/12/g-s1-105725/in-photos-a-week-of-protests-against-ice",
      "title": "In photos: A week of protests against ICE",
      "summary": "In photos: A week of protests against ICEtoggle caption Ben Hovland/MPRFollowing last week's fatal shooting of Renee Macklin Good, a 37-year-old woman in Minneapolis by an Immigration and Customs Enforcement officer, protests have continued to grow across the United States.\nNPR station photographers and freelance photographer Evan Frost have been on the ground over the past week documenting actions in Minneapolis, as well as Washington, D.C., Texas, Connecticut, and Massachusetts.\ntoggle caption Ben Hovland/MPRtoggle caption Evan Frost for NPRtoggle caption Evan Frost for NPRtoggle caption Tyrone Turner/WAMUtoggle caption Tyrone Turner/ WAMUtoggle caption Tyrone Turner/WAMUtoggle caption Ben Hovland/MPRtoggle caption Ben Hovland/MPRtoggle caption Mark Mirko/Connecticut Publictoggle caption Mark Mirko/Connecticut Publictoggle caption Mark Mirko/Connecticut Publictoggle caption Mark Mirko/Connecticut Publictoggle caption Lorianne Willett/KUT Newstoggle caption Lorianne Willett/KUT Newstoggle caption Lorianne Willett/KUT Newstoggle caption Robin Lubbock/WBURtoggle caption Evan Frost for NPR",
      "category": "immigration",
      "bias": "center",
      "publishedAt": "2026-01-12T23:45:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NjA=",
      "url": "https://abcnews.go.com/US/mamdani-outraged-after-new-york-city-council-employee/story?id=129149275",
      "title": "Mamdani 'outraged' after New York City Council employee detained by ICE",
      "summary": "New York City Mayor Zohran Mamdani speaks during a press conference at Grand Army Plaza in the Brooklyn borough of New York, on Jan. 2, 2026.\nNew York City Mayor Zohran Mamdani speaks during a press conference at Grand Army Plaza in the Brooklyn borough of New York, on Jan. 2, 2026.\nNew York City Mayor Zohran Mamdani speaks during a press conference at Grand Army Plaza in the Brooklyn borough of New York, on Jan. 2, 2026.\nNew York City Mayor Zohran Mamdani speaks during a press conference at Grand Army Plaza in the Brooklyn borough of New York, on Jan. 2, 2026.\nA New York City Council employee was detained during a \"routine\" immigration appointment on Long Island on Monday, according to city officials, who called the incident an \"egregious government overreach.\"",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-01-13T01:01:26Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NjE=",
      "url": "https://www.bbc.com/sport/football/articles/c2051p7ej1vo",
      "title": "Fifa World Cup: What does president Donald Trump's foreign policy mean for USA 2026",
      "summary": "Some believe that, depending on Trump's next moves, the situation could become harder for sports bodies to navigate.\nIf, in a worst-case scenario, the US were to use force against Greenland - a Nato ally's territory - would those same principles apply?\nIf Denmark qualifies via the play-offs, would it boycott the World Cup?\nTrump's tougher immigration policies could also have an impact on the World Cup, which begins on 11 June.\nHowever the White House's World Cup Taskforce has not ruled out Immigration and Customs Enforcement (ICE) raids, external targeting undocumented immigrants at World Cup venues.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-13T18:34:08Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NjI=",
      "url": "https://parliamentnews.co.uk/uk-officials-could-face-us-entry-ban-over-x-policy",
      "title": "UK Officials Face US Entry Ban Over Possible X Block",
      "summary": "Ofcom launched an investigation into X over Grok AI deepfakes, amid transatlantic tensions on free speech and online safety.\nThe regulator described the incidents as “deeply troubling” and is assessing whether X violated UK laws under the Online Safety Act.\nShe urged X to remove harmful material, citing Online Safety Act provisions for blocking non-compliant services.\nKendall added,“I would remind xAI that the Online Safety Act Includes the power to block services from being accessed in the UK, if they refuse to comply with UK law.\nRepublican Congresswoman Anna Paulina Luna warned of legislation targeting the UK and Prime Minister Starmer if X faces a ban.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-14T11:47:27Z",
      "source": "Parliamentnews.co.uk"
    }
  },
  {
    "article": {
      "id": "NjM=",
      "url": "https://ca.news.yahoo.com/turkey-cautions-against-foreign-intervention-151432842.html",
      "title": "Turkey cautions against foreign intervention in Iran",
      "summary": "ANKARA, Jan 12 (Reuters) - Turkey said on Monday that any foreign intervention in neighbouring Iran would lead to greater crises in the country ​and the region, and it called for U.S. and Iranian negotiations ‌to resolve existing problems.\nIran is facing its biggest demonstrations since 2022 and U.S. President Donald Trump has ‌threatened to get involved if force is used against protesters.\nNATO member Turkey does not wish to see chaos in Iran despite \"certain problems within Iranian society and government\", Omer Celik, spokesperson for Turkey's ruling AK Party, said.\n\"We believe that foreign intervention will lead to even worse consequences, and that intervention provoked by Israel in particular will lead to even greater crises.\"\nTrump and Turkish President Tayyip Erdogan have close personal ties.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-12T15:24:18Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NjQ=",
      "url": "https://www.bbc.com/news/videos/cr57v8y9r77o",
      "title": "What message do Greenlanders have for Trump?",
      "summary": "The US Vice President JD Vance is hosting the Danish and Greenlandic foreign ministers, as well as their US counterpart, Marco Rubio in the White House on Wednesday.\nThe focus of the talks: the future status of the world's biggest island, Greenland, a semi-autonomous territory of Denmark in the Arctic.\nDonald Trump says he wants it for national security and he'll take it \"the easy way or the hard way\".\nSupported by major European powers, including the UK and France, Denmark insists Greenland is its sovereign territory.\nEurope editor Katya Adler is in the Greenlandic capital Nuuk, where she hears from Greenlanders who have a message for Donald Trump.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-01-13T22:09:42Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NjU=",
      "url": "https://www.bbc.com/news/articles/cr57vmznmd9o",
      "title": "More than 2,000 people reported killed at Iran protests as Trump says 'help is on its way'",
      "summary": "More than 2,000 people reported killed at Iran protests as Trump says 'help is on its way'1 day ago Share Save David Gritten and Paul Adams , Diplomatic correspondent Share SaveReuters Armed security forces were deployed at a pro-government rally in Tehran on MondayMore than 2,000 people have been killed during the violent crackdown by security forces on protests in Iran, a human rights group has said, as President Trump promised Iranians that help was \"on its way\".\nAn Iranian official also told Reuters that 2,000 people had been killed but that \"terrorists\" were to blame.\nTrump will attend a meeting about Iran on Tuesday evening, and has pledged to get \"accurate \" death toll figures.\n\"The killing looks like it's significant, but we don't know yet for certain,\" Trump told reporters while returning to the White House.\n\"My friend went there [Kahrizak] to look for his brother, and he forgot his own sorrow,\" an activist told BBC Persian on Monday.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-01-13T19:06:27Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NjY=",
      "url": "https://www.npr.org/2026/01/14/g-s1-105936/vance-to-meet-danish-greenland-officials",
      "title": "Vance to meet Danish and Greenlandic officials in Washington on Wednesday",
      "summary": "Trump said he wants to control Greenland at any cost and the White House has not ruled out taking the island by force.\nU.S. Vice President JD Vance will meet Denmark's foreign minister Lars Løkke Rasmussen and his Greenlandic counterpart Vivian Motzfeldt in Washington on Wednesday to discuss the Arctic island, which is a semiautonomous territory of the United States' NATO ally Denmark.\nSponsor MessageTuuta Mikaelsen, a 22-year-old student, told The Associated Press in Nuuk that she hoped American officials would get the message to \"back off.\"\nGreenland's Prime Minister Jens-Frederik Nielsen told a news conference in the Danish capital Copenhagen on Tuesday that, \"if we have to choose between the United States and Denmark here and now, we choose Denmark.\nWe choose NATO.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-14T06:33:10Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "Njc=",
      "url": "https://www.yahoo.com/news/articles/iranian-mp-warns-greater-unrest-094734513.html",
      "title": "Trump urges Iranians to keep protesting, says 'help is on its way'",
      "summary": "By Susan Heavey and Elwely ElwellyWASHINGTON, Jan 13 (Reuters) - U.S. President Donald Trump urged Iranians on Tuesday to keep protesting and said help was on the way, without giving details, as Iran's clerical establishment pressed its crackdown against the biggest demonstrations in years.\nHELP IS ON ITS WAY,\" Trump said ​in a post on Truth Social, adding he had canceled all meetings with Iranian officials until the \"senseless killing\" of protesters stopped.\nAdvertisement AdvertisementAdvertisement AdvertisementOn Monday evening, Trump announced 25% import tariffs on products from any country doing business with Iran - a major oil exporter.\nTrump has also said ⁠more military action is among options he is weighing to punish ‌Iran over the crackdown.\nIran's authorities have taken a dual approach, cracking down while also calling protests over ​economic problems legitimate.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-13T09:51:42Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Njg=",
      "url": "https://www.yahoo.com/news/articles/russias-lavrov-says-u-smashing-114300216.html",
      "title": "Russia's Lavrov says the U.S. is smashing the world around with its raid on Venezuela and threats to Iran",
      "summary": "\"We ‌are talking about a gross violation of international law,\" Lavrov said of the U.S. operation to capture Maduro.\nHe added that Russia remained committed to its agreements with Venezuela, a Russian ally.\nLavrov suggested that the United States, by abandoning the principles it had promoted for so long, was damaging its own image.\n\"Our American colleagues look unreliable when they act ⁠in this way,\" Lavrov told a news ​conference with his Namibian counterpart in Moscow.\nIt ⁠would, Lavrov said, be helpful if Washington briefed Moscow on the latest peace proposals for ‌Ukraine.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-14T11:43:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Njk=",
      "url": "https://www.yahoo.com/news/articles/german-foreign-minister-wadephul-says-221441384.html",
      "title": "German Foreign Minister Wadephul says there is more consensus than disagreement with the US",
      "summary": "By Alexander RatzWASHINGTON, Jan 13 (Reuters) - German Foreign Minister Johann Wadephul said on Tuesday ​that there is more consensus than disagreement ‌with the United States.\nAdvertisement AdvertisementAdvertisement AdvertisementWadephul reiterated that Greenland ​and Denmark should decide the future of ‌the island.\n\"Questions of sovereignty over the territory of the Kingdom of Denmark will be decided by Denmark, by no one else,\" he said.\n\"That shows the United States' broad interest — across party lines— in a close relationship with ⁠Germany and Europe,\" Wadephul said.\n(Reporting by Alexander Ratz in Washington; ‌Writing by Maria Martinez; Editing by Chris ‌Reese and Matthew Lewis)",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-13T22:14:41Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NzA=",
      "url": "https://www.project-syndicate.org/commentary/trump-donroe-doctrine-fuels-instability-and-jeopardizes-global-economy-by-jayati-ghosh-2026-01",
      "title": "A Gangster’s-Eye View of Global Power",
      "summary": "NEW DELHI – There is a method behind the apparent madness of US President Donald Trump’s transactional, spheres-of-influence approach to geopolitics and the global economy.\nAt the same time, the US reserves the right to advance its strategic interests wherever it sees fit, including Greenland.\nCan carving up the world among major powers deliver a more stable and dynamic capitalism at a time when the global economy appears increasingly volatile and rudderless?\nRelative stability, such as it was, rested on a combination of overwhelming military power and a framework of global rules and institutions designed to keep geopolitical rivalries in check.\nDisputes over access, borders, and control are therefore inevitable when one power attempts to assert dominance on every front, raising the likelihood of major wars.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-01-14T15:22:45Z",
      "source": "Project Syndicate"
    }
  },
  {
    "article": {
      "id": "NzE=",
      "url": "https://ca.finance.yahoo.com/news/trading-houses-beat-us-majors-115729637.html",
      "title": "Trading houses beat US majors to first deals for Venezuelan oil",
      "summary": "Trump met top oil executives at the White House on Friday as his administration outlines a long-term plan to raise $100 billion to boost Venezuelan oil output.\nThe U.S. government tapped the giant merchant houses because they were better suited to quickly get Venezuelan oil exports flowing again, four industry sources familiar with the negotiations said.\n\"Securing and marketing the initial barrels of Venezuelan crude oil was done at record speed to benefit both the American and Venezuelan people,\" a White House official told Reuters.\nGLOBAL NETWORK ADDED TO TRADERS' APPEALThe trading houses competed with Chevron to secure the supply deals.\nChevron is the only U.S. oil major that operates in Venezuela, as a minority partner in joint ventures with Venezuelan state oil firm PDVSA.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-12T11:57:29Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NzI=",
      "url": "https://www.thedailybeast.com/donald-trump-79-forgets-he-promised-voters-a-2000-check-from-tariff-revenues/",
      "title": "Trump, 79, Flat-Out Forgets Crucial Promise to Voters: ‘When Did I Do That?’",
      "summary": "President Donald Trump seemed to briefly power down when confronted by reporters over whether voters could still expect him to deliver on one of his boldest promises to date.\nDonald Trump seems to forget that he promised Americans $2,000 rebate checks from his tariffs while speaking with reporters.\nTariff revenue for 2025 stood at $195 billion, according to data collected by the Committee for a Responsible Federal Budget, a nonprofit that monitors fiscal policy policies.\nThat’s a 150 percent increase over duties collected the previous year, but at a minimum 90.25 percent less than the “Trillions” Trump claims his levies have generated.\nThe MAGA administration framed those funds as a “warrior dividend” from tariff revenue.",
      "category": "economics",
      "bias": "lean left",
      "publishedAt": "2026-01-12T19:03:34Z",
      "source": "Daily Beast"
    }
  }
]