[
  {
    "article": {
      "id": "MA==",
      "url": "https://www.businessinsider.com/charts-president-donald-trump-first-year-economy-tariffs-jobs-inflation-2026-1",
      "title": "The First Year of Donald Trump's Economy in 7 Charts",
      "summary": "The economy has changed a lot in the first year of Trump's second term.\nThe economy has changed a lot in the first year of Trump's second term.\nAlex Wong/Getty ImagesThe economy has changed a lot in the first year of Trump's second term.\nBusiness Insider looked back at the economy under Trump so far.\nThe charts below highlight how the economy evolved in Trump's first year.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-20T09:27:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MQ==",
      "url": "https://www.businessinsider.com/china-economy-great-people-shortage-hurt-global-economy-birth-rate-2026-1",
      "title": "China's Shrinking Population Is Getting Smaller. the Risks Are Growing.",
      "summary": "China's population is shrinking — and the decline is accelerating.\nIf things don't change, China's shrinking and aging population poses serious long-term risks for the country's economy.\nA smaller working-age population in China could also hurt the global economy, which has relied on China's booming productivity and economic growth.\nThe population of mainland China began shrinking in 2022, when it declined by 850,000 people after years of falling birth rates.\nThere is little evidence these efforts have been successful at lifting birth rates.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-01-19T19:06:00Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mg==",
      "url": "https://uk.finance.yahoo.com/news/gold-prices-greenland-trump-oil-pound-latest-112134371.html",
      "title": "Gold prices surge past $4,800 on jitters over Greenland dispute",
      "summary": "Gold prices extended recent gains on Wednesday morning, surging on concerns about escalating tensions over US president Donald Trump's push to take over Greenland.\nGold futures (GC=F) jumped 2% to $4,863.50 per ounce at the time of writing, while spot gold was up 2.1% at $4,862.20.\nRead more: Stocks muted as Trump arrives in Davos amid Greenland rowEscalating tensions over Trump's pursuit of Greenland has fuelled demand for so-called safe haven investments, seeing investors flock to gold (GC=F), driving prices higher.\nConcerns about the potential economic fallout of renewed geopolitical tensions also continued to weigh on oil prices on Wednesday morning.\nThe pound dipped 0.3% against the dollar (GBPUSD=X) on Wednesday morning, as the latest UK inflation reading came in higher than expected.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-21T11:21:34Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mw==",
      "url": "https://www.androidcentral.com/phones/oneplus/allegations-claim-the-oneplus-16-might-give-global-markets-the-cold-shoulder",
      "title": "OnePlus 16 may go exclusive to China, leaving global fans in the dark",
      "summary": "What you need to knowRumors claim that the OnePlus 16 might ditch global markets this year, though the reason is unclear.\nThe post states that the OnePlus 16 might \"be exclusive to China only\" this year.\nBrar's recent post on X goes over some alleged OnePlus 16 camera specs, which we've seen before.\nAs the publication reiterates, the OnePlus 16 is expected to debut later this year, potentially in Q4, which would line up with the OEM's typical cadence.\nFor now, we have some early OnePlus 16 rumors that claim the device could feature a 200MP sensor and a periscope telephoto lens.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-20T10:09:00Z",
      "source": "Android Central"
    }
  },
  {
    "article": {
      "id": "NA==",
      "url": "https://www.businessinsider.com/captialism-sink-or-swim-era-work-2026-1",
      "title": "America's new sink-or-swim era of work is here",
      "summary": "Reuters/Lucas JacksonTo be sure, employers' labor costs — typically their largest expense — are on the rise.\nEmployment experts say the uncertainty helps explain why the job market has been stuck in a low-hire, low-fire state.\nThe result is a labor market full of contradictions, said Nicole Bachaud, an economist at ZipRecruiter.\nStill, many professionals lack confidence in the job market as career opportunities in once-reliable sectors, such as technology and the federal government, have thinned.\nWorkers who understand AI are \"able to move faster, make better decisions, and take on higher-leverage work,\" he said.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-19T10:42:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NQ==",
      "url": "https://www.androidcentral.com/phones/oneplus/oneplus-isnt-going-away-but-it-may-not-have-quite-as-big-a-presence-in-2026",
      "title": "'We’re operating as usual and will continue to do so:' OnePlus India CEO says the brand isn't going anywhere",
      "summary": "And when it comes to other countries, OnePlus India CEO Robin Liu confirmed that there isn't any change in how OnePlus is conducting its business in the region:I wanted to address some misinformation that has been circulating about OnePlus India and its operations.\n(Image credit: Harish Jonnalagadda / Android Central)But this doesn't mean OnePlus itself is going away — far from it.\nThe brand isn't changing how it's doing business in India, and although sales in the country declined last year, it continues to have a sizable presence.\n(Image credit: Apoorva Bhardwaj / Android Central)There's no doubting that OnePlus doesn't have any of the freedom it enjoyed as a standalone entity under BBK.\nThat said, OPPO isn't willing to squander the cachet OnePlus built up in India over the course of the last decade.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-20T18:42:47Z",
      "source": "Android Central"
    }
  },
  {
    "article": {
      "id": "Ng==",
      "url": "https://it.slashdot.org/story/26/01/19/002212/young-college-graduates-suddenly-arent-finding-jobs-faster-than-non-college-graduates",
      "title": "Young US College Graduates Suddenly Aren't Finding Jobs Faster Than Non-College Graduates",
      "summary": "The trouble with computers is that they do what you tell them, not what you want.\n-- D. Cohen",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-19T00:04:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "Nw==",
      "url": "https://uk.finance.yahoo.com/news/mortgage-predictions-2026-interest-rates-bank-of-england-060057879.html",
      "title": "Eight mortgage predictions for 2026",
      "summary": "Last year was all about mortgage rates coming down, with four Bank of England cuts, taking the base rate from 4.75% at the beginning of the year, to 3.75% by December.\nFor the most part, mortgage lenders responded by reducing their rates too.\nWhat 2026 will hold for the mortgage market is more difficult to predict: will rates continue with their downward trajectory?\nHow will the mortgage market support first-time buyers?\nWe spoke to five mortgage experts to get their take on what will happen to products, rates and the market in general.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-19T06:00:57Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "OA==",
      "url": "https://www.wired.com/china-issue/",
      "title": "23 Ways You’re Already Living in the Chinese Century",
      "summary": "While the president of this country is promising to make America great again as he strips it for parts, Chinese business and political leaders have quietly seized the moment.\nThis is not to say that China’s economy, let alone its repressive totalitarian government, runs perfectly.\nBut today there’s almost no limit to what is created in China, then eagerly consumed by the rest of the world.\nWIRED’s reporters have chronicled the transformation in the Made in China newsletter—and now we’re bringing you this special issue.\nHere are 23 ways China is rewiring the future.",
      "category": "international",
      "bias": "right",
      "publishedAt": "2026-01-20T11:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "OQ==",
      "url": "https://www.aljazeera.com/news/2026/1/21/new-zealand-pm-christopher-luxon-calls-national-election-for-november-7",
      "title": "New Zealand PM Christopher Luxon calls national election for November 7",
      "summary": "New Zealanders are set to go to the polls later this year amid a sluggish economy and rising unemployment.\nNew Zealand will hold a national election on November 7, the country’s centre-right prime minister has said.\nChristopher Luxon announced the election date on Wednesday as he touted his government’s record on the economy and crime.\nLuxon’s National Party formed a coalition with the populist New Zealand First and pro-business ACT parties after delivering a crushing defeat to the centre-left Labour Party at the 2023 election.\nCoalition governments are the norm in New Zealand because of the country’s mixed-member proportional system, which replaced first-past-the-post voting in 1996.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-21T06:09:05Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "MTA=",
      "url": "https://www.businessinsider.com/hottest-housing-markets-highest-demand-competition-2026-1",
      "title": "Get ready to enter a bidding war in these 10 housing markets this year",
      "summary": "The Northeast made up more than half of the top 10 hottest metros for 2026.\nThe Northeast made up more than half of the top 10 hottest metros for 2026.\nBruce Peter Morin/Getty ImagesThe Northeast made up more than half of the top 10 hottest metros for 2026.\nAccording to Zillow, 55.6% of sales in San Jose, California, were over the list price as of November 2025 due to an inventory drop.\nHere are the top 10 metros that Zillow predicts to be in high demand in 2026.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-19T16:35:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MTE=",
      "url": "https://www.yahoo.com/news/articles/us-futures-sink-trump-warns-064219353.html",
      "title": "US futures sink after Trump warns of higher tariffs for 8 countries over Greenland issue",
      "summary": "BANGKOK (AP) — European shares mostly fell and U.S. stock futures skidded Monday after U.S. President Donald Trump threatened to slap a 10% extra tariff on imports from eight European countries because they oppose having America take control of Greenland.\nGermany's DAX lost 1.3% to close at 24,960.33 and the CAC 40 in Paris fell 1.9% to 8,101.96.\nStrong exports, despite Trump's higher tariffs on imports from China, helped to offset relatively weak domestic demand.\nAdvertisement AdvertisementAdvertisement AdvertisementThis week will bring a broader mix of earnings from airlines, industrial companies, and technology companies.\nThe price of gold resumed its upward climb, gaining 1.8%, while the price of silver jumped 6.2%.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-19T06:42:19Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTI=",
      "url": "https://www.aljazeera.com/economy/2026/1/20/trump-made-many-statements-on-us-economy-most-are-untrue",
      "title": "Trump made many statements on US economy. Most are untrue",
      "summary": "United States President Donald Trump has made a range of claims about the state of the US economy.\nAl Jazeera examined some of his statements on the economy:Core inflation has been at 1.6 percent for the past three months, and there is “no inflation”.\nIn 2024, Biden raised tariffs on Canadian lumber to 14.5 percent from 8.5 percent, continuing a Trump-era policy.\nTrump administration removed more than 270,000 bureaucrats from the federal government, but they are going to the private sector.\nOxford Economics, which tracks private construction on transportation equipment, found that “nominal spending” in 2025 was trending downwards after hitting a peak during the final year of the Biden administration.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-20T22:23:13Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "MTM=",
      "url": "https://finance.yahoo.com/news/us-futures-edge-higher-gold-045146410.html",
      "title": "US stocks recover half of the prior day's plunge after Trump calls off Greenland-related tariffs",
      "summary": "Besides the progress on Greenland, they also got help from a calming of yields in Japan’s jumpy bond market.\nOn one hand, the pattern has given rise to the “TACO” acronym suggesting “Trump Always Chickens Out” if financial markets react strongly enough.\nOn the other, Trump has ultimately struck deals that outsiders may have earlier considered unlikely, ones that he’s crowed about later.\nHelping to lead the U.S. stock market Wednesday was Halliburton.\nUnited Airlines climbed 2.2% after likewise reporting a better profit for the final three months of 2025 than analysts expected.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-21T04:51:46Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MTQ=",
      "url": "https://www.aljazeera.com/economy/2026/1/19/the-us-economy-seems-strong-after-a-year-of-trump-but-is-it-really",
      "title": "The US economy seems strong after a year of Trump, but is it really?",
      "summary": "Over the past year, United States President Donald Trump has unleashed a slew of policies that have upended businesses, supply chains and jobs.\nYet the US economy seems to be growing at a healthy clip, and the unemployment rate is in a safe zone.\nThe reality, experts say, is that the stock market boom has helped to mask deeper underlying problems in the economy.\n“The shock and awe we anticipated just didn’t materialise,” Bernard Yaros, lead US economist at Oxford Economics, told Al Jazeera.\n“The surge in policy uncertainty this year has had an outsize effect on smaller firms,” Oxford Economics said in a November report.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-19T16:51:42Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "MTU=",
      "url": "https://www.theverge.com/news/864622/ftc-meta-antitrust-ruling-appeal",
      "title": "FTC says it will appeal Meta antitrust loss",
      "summary": "She spent 5 years covering tech policy at CNBC, writing about antitrust, privacy, and content moderation reform.\nThe Federal Trade Commission will appeal its loss in a landmark antitrust case against Meta, the agency announced Tuesday.\nThe FTC argued that Meta’s dominance let it degrade the quality of its service without any real alternatives for consumers to flee to.\n“The U.S. economy thrives when competition can flourish and U.S. businesses compete fairly against one another,” FTC Bureau of Competition Director Daniel Guarnera said in a statement.\n“We will remain focused on innovating and investing in America.”Update, January 20th: Added Meta statement.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-20T22:21:31Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MTY=",
      "url": "https://www.wired.com/story/ai-super-pacs-trying-to-influence-midterms/",
      "title": "Pro-AI Super PACs Are Already All In on the Midterms",
      "summary": "Technology executives, investors, and companies tied to the AI boom are funding a new network of AI-focused super PACS, which is poised to make AI a major issue in this year’s state and federal elections races.\nThe election spending marks a sharp escalation of the AI regulation debate that has divided Silicon Valley for years.\nIn December, President Donald Trump signed an executive order directing Attorney General Pam Bondi to challenge state AI laws that conflict with less-strict federal policy, and urging Congress to establish a national AI framework that would preempt state regulations.\nThis new wave of political spending groups adds yet another layer of pressure on lawmakers advancing AI safety efforts.\nWhile super PACs typically don’t lay out their overarching strategies, the political group has been unusually outspoken about its goal to oppose candidates who champion state-level AI regulation.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-21T11:30:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MTc=",
      "url": "https://www.wired.com/story/china-ai-boom-algorithm-registry/",
      "title": "Thousands of Companies Are Driving China’s AI Boom. A Government Registry Tracks Them All",
      "summary": "Over time, the CAC has inadvertently created the most detailed map of a nation’s AI ecosystem anywhere in the world.\nScroll through the table and you’ll find an AI that manages homestays and an AI that drafts patents.\nA Broad View of the BoomNearly 80 percent of China’s generative AI registrations are clustered in and around its top tech hubs—Beijing, Shenzhen, Shanghai, and Hangzhou.\nChina’s six “AI tigers”—Moonshot, Minimax, Zhipu, Baichuan, 0.1AI, and Stepfun—are all backed by Alibaba or Tencent.\nByteDance’s Doubao surpassed DeepSeek as China’s most popular chatbot, but its spot at the top is not assured.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-20T11:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MTg=",
      "url": "https://www.wired.com/story/europe-race-us-deepseek-sovereign-ai/",
      "title": "The Race to Build the DeepSeek of Europe Is On",
      "summary": "With rare exceptions, US-based firms outstrip European competitors across the AI production line—from processor design and manufacturing, to data center capacity, to model and application development.\nIn early January, the head of Belgium’s national cybersecurity organization told the Financial Times that Europe had “lost the internet,” and should make peace with a degree of reliance on US infrastructure.\nAlready, they have committed hundreds of millions of dollars to minimizing their reliance on foreign AI suppliers.\nBy publishing models for anyone to use or modify, the theory goes, breakthroughs achieved by European labs will compound as they're further refined by collaborators.\nThe two sides have clashed particularly openly over the approach to policing American tech firms—especially X, the social media platform owned by Elon Musk.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-19T07:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "MTk=",
      "url": "https://www.businessinsider.com/ai-security-risks-worry-ey-kpmg-execs-cybersecurity-davos-2026-1",
      "title": "Execs at Davos say AI's biggest problem isn't hype — it's security",
      "summary": "AI cybersecurity is a top concern for some execs right now.\nAI cybersecurity is a top concern for some execs right now.\nDonato Fasano/Getty Imageslighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nRaj Sharma, EY's global managing partner of growth and innovation, said there's not enough talk about AI security — specifically, the management of AI agents and their lifecycle.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-20T07:53:40Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjA=",
      "url": "https://www.theverge.com/news/864843/elevenlabs-ai-music-eleven-album-release",
      "title": "ElevenLabs made an AI album to plug its music generator",
      "summary": "ElevenLabs has released an album of AI-generated songs in its latest attempt to separate itself from the ethical concerns surrounding AI music.\nThe Eleven Album aims to showcase “how artists can use AI to expand their creative range while maintaining full authorship and commercial rights,” according to ElevenLabs.\nElevenLabs is using the album to market its Eleven Music generator and Iconic Voices Marketplace platforms it launched last year, both of which are cleared for commercial use.\nDemitri LeriosEmily FalveySunsettoKondZillaChris LyonsKaiAngelbabyMichael FeinsteinYou can listen to the album — or to cite ElevenLabs, “experience the future of sound” — on Spotify or the ElevenLabs website.\nWithout compensation and ownership rights, those AI clones could impact their ability to make money, given that most people can’t distinguish between AI-generated and human-made music.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-21T15:44:08Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjE=",
      "url": "https://www.businessinsider.com/elon-musk-xai-hiring-elite-unit-recruit-top-engineers-grok-2026-1",
      "title": "xAI is hiring an 'elite unit' that reports directly to Elon Musk to recruit top engineers",
      "summary": "The AI startup is hiring a team of \"talent engineers\" to supercharge its hiring of top engineers as the AI boom fuels a red-hot race for talent.\nThe role, which pays $120,000-240,000 and is based in Palo Alto, California, is the latest novel approach taken by AI startups and Big Tech giants to snap up in-demand AI talent.\nMusk isn't the only top CEO to get personally involved in hiring top talent.\nOpenAI's chief research officer, Mark Chen, said in December that Mark Zuckerberg attempted to lure some OpenAI engineers to Meta by hand-delivering them soup.\nxAI's focus on hiring comes as the startup continues to grow despite being embroiled in controversy over its Grok chatbot.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-19T11:41:20Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjI=",
      "url": "https://www.businessinsider.com/emergent-vibe-coding-funding-khosla-softbank-2026-1",
      "title": "Emergent, Which Lets Anyone Build an App, Has Raised $70 Million.",
      "summary": "It was not long ago that building a sophisticated app required a team of experienced programmers hovering over their keyboards.\nNow, AI has made it possible for a novice with no coding knowledge to whip up high-quality apps from scratch.\nThe company recently raised $70 million in Series B funding from Khosla Ventures and SoftBank Vision Fund 2, with participation from Prosus, Lightspeed, Together, and Y Combinator.\nIn a sign of how quickly the hottest AI companies are raising funding in this bull market, it was only three months ago that Emergent raised $23 million in Series A funding.\nVibe coding is a crowded space for startups, and Emergent faces competition from Lovable, a Swedish vibe coding app that raised $330 million in Series B funding at a $6.6 billion valuation in December.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-20T11:00:01Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MjM=",
      "url": "https://slashdot.org/story/26/01/21/141239/ceos-say-ai-is-making-work-more-efficient-employees-tell-a-different-story",
      "title": "CEOs Say AI is Making Work More Efficient. Employees Tell a Different Story.",
      "summary": "The trouble with computers is that they do what you tell them, not what you want.\n-- D. Cohen",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-21T14:01:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "MjQ=",
      "url": "https://www.theverge.com/news/864229/openai-focus-practical-adoption-sarah-friar",
      "title": "OpenAI’s 2026 ‘focus’ is ‘practical adoption’",
      "summary": "As intelligence moves into scientific research, drug discovery, energy systems, and financial modeling, new economic models will emerge.\nSecuring world-class compute requires commitments made years in advance, and growth does not move in a perfectly smooth line.\nAt times, capacity leads usage.\nAt other times, usage leads capacity.\nThat lets us lean forward when growth is there without locking in more of the future than the market has earned.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-19T21:05:30Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MjU=",
      "url": "https://thenextweb.com/news/sequoia-joins-anthropics-25b-funding-round",
      "title": "Sequoia joins Anthropic’s $25B funding round valued at $350B",
      "summary": "Valuation fever and the AI arms raceA $350 billion valuation, even before a public listing, is eye-watering.\nThat dynamic is a symptom of a broader trend: a global AI capital rush that has persisted even amid concerns about a bust cycle or a funding slowdown in other tech segments.\nEurope has strong academic AI talent, an active startup ecosystem, and deep expertise in areas like robotics, industrial automation, and data privacy.\nYet venture capital density still trails the U.S., and marquee AI funding rounds of this scale are rare on the continent.\nEuropean AI talent has been moving among global hubs, and deals like this underline how strongly competitive pressures are shaping that movement.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-19T10:59:49Z",
      "source": "The Next Web"
    }
  },
  {
    "article": {
      "id": "MjY=",
      "url": "https://www.businessinsider.com/elon-musk-tesla-fsd-licensing-adas-autonomy-legacy-automakers-2026-1",
      "title": "Elon Musk said automakers don't want to license Tesla FSD. We're starting to see why.",
      "summary": "Tesla CEO Elon Musk said it's \"crazy\" that automakers don't want to license Tesla FSD.\nTesla CEO Elon Musk said it's \"crazy\" that automakers don't want to license Tesla FSD.\nMarc Piasecki/Getty ImagesTesla CEO Elon Musk said it's \"crazy\" that automakers don't want to license Tesla FSD.\nBecause automakers see vehicle tech as a brand-defining component, a Tesla license can become a hard sell.\nDuring a Q&A session at CES, Nvidia CEO Jensen Huang called Tesla FSD \"completely world-class,\" before drawing a distinction between Tesla's goals and Nvidia's.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-01-20T11:00:02Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Mjc=",
      "url": "https://slashdot.org/story/26/01/20/2234239/openai-and-servicenow-strike-deal-to-put-ai-agents-in-business-software",
      "title": "OpenAI and ServiceNow Strike Deal to Put AI Agents in Business Software",
      "summary": "The trouble with computers is that they do what you tell them, not what you want.\n-- D. Cohen",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-21T01:25:00Z",
      "source": "Slashdot.org"
    }
  },
  {
    "article": {
      "id": "Mjg=",
      "url": "https://www.theverge.com/tech/864768/instagram-adam-mosseri-ai-content-algorithm",
      "title": "Instagram’s top boss is missing the point about AI on the platform",
      "summary": "In a series of messages, Instagram’s top exec laid out his concerns for the platform in the coming year, largely around AI.\nWhich may be true, but I think Mosseri is missing the point: Instagram is already overrun by robotic, same-y looking content, and it’s not just made by AI.\nIt’s made by humans churning out post after post following the same formula; one designed to keep us scrolling, liking, and sharing.\nThroughout his post, Mosseri actually makes a few points I agree with.\nAgain and again, Mosseri mentions “authentic” content, implying something human-made versus inauthentic content created by AI.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-21T11:19:55Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "Mjk=",
      "url": "https://www.businessinsider.com/sapiens-author-ai-timeline-warning-lack-of-concern-2026-1",
      "title": "'Sapiens' author says the real AI timeline is 200 years — but the 'lack of concern' today is what scares him most",
      "summary": "Yuval Noah Harari said that AI's true consequences will unfold over the next 200 years.\nYuval Noah Harari said that AI's true consequences will unfold over the next 200 years.\nChris Jung/NurPhoto via Getty ImagesYuval Noah Harari said that AI's true consequences will unfold over the next 200 years.\nHarari warned that even if AI development were to stop today, its long-term effects would still be impossible to grasp.\nAI's social consequences, he said, will play out far beyond that horizon — whether the world is ready or not.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-20T17:01:19Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzA=",
      "url": "https://www.businessinsider.com/palantir-ceo-alex-karp-ai-humanities-jobs-doomed-2026-1",
      "title": "Palantir CEO Alex Karp Warns AI Will 'Destroy Humanities Jobs'",
      "summary": "Alex Karp, CEO of Palantir, said vocational skills will be in high demand in the AI era.\nAlex Karp, CEO of Palantir, said vocational skills will be in high demand in the AI era.\nFabrice COFFRINI / AFP via Getty ImagesAlex Karp, CEO of Palantir, said vocational skills will be in high demand in the AI era.\nFabrice COFFRINI / AFP via Getty ImagesAlex Karp, the billionaire co-founder and CEO of the AI defense technology company Palantir, had a top humanities-based education.\nAI \"will destroy humanities jobs,\" Karp said.",
      "category": "technology",
      "bias": "right",
      "publishedAt": "2026-01-20T17:21:28Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzE=",
      "url": "https://finance.yahoo.com/video/merck-ceo-us-business-life-100323926.html",
      "title": "Merck CEO on US Business, Life Sciences Innovation",
      "summary": "Merck KGaA Chief Executive Officer Belen Garijo says the company will continue to collaborate with the US and deliver life sciences innovation to patients.\nShe spoke to Bloomberg's Francine Lacqua on the sidelines of the 2026 World Economic Forum in Davos, Switzerland.",
      "category": "technology",
      "bias": "lean right",
      "publishedAt": "2026-01-20T10:03:23Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "MzI=",
      "url": "https://www.theverge.com/tech/864848/sony-linkbuds-clip-open-earbuds-wireless-headphones-bluetooth",
      "title": "Sony’s first clip-on open earbuds have a quiet mode so others can’t listen in",
      "summary": "Sony is the latest company to announce a pair of open-style wireless earbuds that clip onto the back of your ear instead of resting inside it.\nThe new Sony LinkBuds Clip Open earbuds are similar to the Bose Ultra Open Earbuds, JVC’s Nearphones, and Shokz’ OpenDots One, with a design that doesn’t block the ear canal so you can hear your environment, or conversations with people, alongside whatever you’re streaming from your phone.\nThe LinkBuds Clip Open are available starting today in black, greige (no, that’s not a typo), green, and lavender color options for $229.99.\nImage: SonyThe C-shaped design of the LinkBuds Clip Open doesn’t put any pressure on the inner ear, potentially making the earbuds comfortable to wear for longer periods.\nThere’s a 10-band EQ that can be used to adjust the LinkBuds Clip Open’s sound profile through Sony’s Sound Connect mobile app, plus three sound mode presets that can be accessed by tapping the headphones.",
      "category": "technology",
      "bias": "left",
      "publishedAt": "2026-01-21T15:13:13Z",
      "source": "The Verge"
    }
  },
  {
    "article": {
      "id": "MzM=",
      "url": "https://www.businessinsider.com/godfather-ai-geoffrey-hinton-on-ai-sad-dangerous-2026-1",
      "title": "The 'Godfather of AI' says he's 'very sad' about what his life's work has become",
      "summary": "Geoffrey Hinton said he feels deep sadness as the AI he helped create grows more dangerous and outpaces society's ability to control it.\nGeoffrey Hinton said he feels deep sadness as the AI he helped create grows more dangerous and outpaces society's ability to control it.\nJORGE UZON/AFP via Getty ImagesGeoffrey Hinton said he feels deep sadness as the AI he helped create grows more dangerous and outpaces society's ability to control it.\nHinton, who helped pioneer the neural networks that underpin modern artificial intelligence, has become one of the field's most outspoken critics as AI systems grow more powerful and widespread.\n\"The idea that you could just turn it off won't work,\" Hinton said, adding that a sufficiently advanced AI could persuade humans not to shut it down.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-21T12:00:58Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzQ=",
      "url": "https://nukeproof.org/",
      "title": "Manifesto for European Data Sovereignty",
      "summary": "It’s time to take back control togetherEurope has the talent, the technology and the willpower.\nWhat we lack is cohesive action.\nA patchwork of local providers, startups, MSPs, and telcos struggles to compete with global hyperscalers on scale, capability and cost.\nNukeProof exists to bring these players together, forming a coalition that enables Europe to stand strong on its own terms.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-01-21T11:44:48Z",
      "source": "Nukeproof.org"
    }
  },
  {
    "article": {
      "id": "MzU=",
      "url": "https://www.businessinsider.com/sapiens-author-yuval-noah-harari-ai-crises-every-country-2026-1",
      "title": "The author of 'Sapiens' says AI is about to create 2 crises for every country",
      "summary": "AI technology is about to create two crises for every country, says the author of the bestselling book \"Sapiens: A Brief History of Humankind.\"\n\"Those who are concerned about human immigrants usually argue that immigrants might take jobs, might change the local culture, might be politically disloyal.\nI'm not sure that's true of all human immigrants, but it will definitely be true of the AI immigrants,\" he said.\nHarari is not the first person to refer to \"AI immigrants.\"\nEarlier this month, the Nvidia CEO, Jensen Huang, referred to robots using the term, and said \"AI immigrants\" will help humans with work we no longer want to do, such as manufacturing jobs, AFP reported.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-20T17:12:48Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "MzY=",
      "url": "https://www.wired.com/story/china-renewable-energy-revolution/",
      "title": "China’s Renewable Energy Revolution Is a Huge Mess That Might Save the World",
      "summary": "If we could only harness the engine of the stars, it would uncork near limitless energy and neatly sweep away a whole mess of humanity’s problems.\nSolar panels and wind turbines capture the fusion of the sun and convert it to electricity.\nAcross the entire country, those 12 months saw some 50 gigawatts of new solar capacity added.\nIn China, the first three months of 2025 alone saw 60 gigawatts of new solar capacity added to the national grid.\nAny solar capacity that went in after May 2025, Beijing declared, would no longer get this deal.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-01-20T11:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "Mzc=",
      "url": "https://finance.yahoo.com/news/company-owned-president-trump-surprises-170000891.html",
      "title": "Company owned by President Trump surprises observers with unexpected partnership: 'To guarantee America's dominance'",
      "summary": "Photo Credit: Getty ImagesPresident Donald Trump's social media company, Trump Media & Technology Group, announced a shocking pivot into cleaner energy.\nTAE Technologies, a California-based nuclear fusion startup, is partnering with Trump Media & Technology Group in a deal valued at more than $6 billion.\nThe agreement would make the combined company one of the world's first publicly traded nuclear fusion firms.\nWhile the Trump administration views nuclear fusion as an economic opportunity more than a climate solution, the benefits to the environment could be substantial.\nEach side would own roughly half of the combined company, with Trump Media CEO Devin Nunes and Binderbauer serving as co-CEOs.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-20T17:00:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Mzg=",
      "url": "https://www.wired.com/story/chinese-ev-batteries/",
      "title": "Chinese EV Batteries Are Eating the World",
      "summary": "The city is now also the site of a battery factory, which would allow France to produce all parts of electric vehicles domestically.\nAccording to his calculations, 2024 was the first year Chinese EV and battery companies spent more money building factories outside of China than within.\n“We simply couldn’t.”So it’s perhaps no surprise that Chinese battery companies are dominant—and that the competition between them is fierce.\nWhen Apple built its technology empire on the backs of Chinese factories, the country had to reckon with whether it was benefiting from Apple’s victories or being exploited.\nAs China’s battery technology takes over the world, Chinese companies are the ones now raising these questions—of who ultimately benefits and who is exploiting whom.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-20T11:00:00Z",
      "source": "Wired"
    }
  },
  {
    "article": {
      "id": "Mzk=",
      "url": "https://www.npr.org/2026/01/20/nx-s1-5670378/trump-energy-promises-one-year",
      "title": "Trump promised to cut energy bills in half. One year later, has he delivered?",
      "summary": "Trump promised to cut energy bills in half.\ntoggle caption Joe Raedle/Getty ImagesOn the campaign trail, President Trump promised to cut Americans' energy bills in half — cheaper gasoline, cheaper electricity.\nKou says that for 2025, natural gas prices were the clear driver of increases.\nU.S. exports of natural gas have increased (one of API's requests), and sending more natural gas overseas means less is available domestically.\n\"It doesn't solve everything, but it provides some immediate relief … and that just has not been as much of a focus\" for the Trump administration, he says.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-20T10:00:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDA=",
      "url": "https://uk.news.yahoo.com/americans-more-energy-090800527.html",
      "title": "What would Americans do with more energy?",
      "summary": "Americans hit their daily energy low at 2:06 p.m., according to new survey data.\nA survey examining the energy levels and lifestyle goals of 2,000 people saw that on average, respondents said they’d need double their current energy levels to feel fully capable of keeping up with daily demands.\nNo wonder then that the majority of Americans surveyed felt added energy would be life-changing, not just for health and happiness boosts but also for their wallets.\nSeventy-four percent of respondents feel they’d be earning more if they had higher energy levels.\nWhen asked what they’d do with unlimited energy, the top response was spending more time with friends or family (18%).",
      "category": "environment",
      "bias": "right",
      "publishedAt": "2026-01-19T09:08:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDE=",
      "url": "https://www.bbc.com/news/articles/ckgj7me00p0o",
      "title": "UK households to get £15bn for solar and green tech to lower energy bills",
      "summary": "But for an average three bedroom semi-detached home, installing these three technologies, could save £500 annually on energy bills, it estimates.\n\"£15 billion is a substantial commitment, it provides certainty to investors and businesses in the energy market,\" said Dhara Vyas, chief executive of trade body Energy UK.\nTwo thirds (68%) of the solar panels imported by the UK came from China in 2024, according to HMRC trade data.\nUnlike insulation, he said heat pumps are a technology in its infancy, and needed government support to catalyse the industry.\nThe Warm Homes Plan will encourage households to opt for the trio of low carbon technologies - heat pumps, solar panels and batteries.",
      "category": "environment",
      "bias": "lean left",
      "publishedAt": "2026-01-20T22:32:47Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NDI=",
      "url": "https://www.theregister.com/2026/01/19/asia_tech_news_roundup/",
      "title": "Microsoft hiring energy strategists for Asian datacenters",
      "summary": "Asia In Brief Microsoft is hiring senior managers to ensure its datacenters in Asia can access the energy they need.\nMicrosoft’s expanding datacenter footprint is no secret, nor is the fact that datacenters used for AI applications are power-hungry.\nMicrosoft’s Asian outpost looks to be hiring to address those challenges, in its own facilities and third-party bit barns it rents.\nIf Viettel’s plans stay on track, the country will close that gap in 2027 when its fab starts work.\n“The time to first attack was less than one hour, and we averaged ~5,270 attacks every single day!” he wrote.",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-19T02:11:34Z",
      "source": "Theregister.com"
    }
  },
  {
    "article": {
      "id": "NDM=",
      "url": "https://www.techradar.com/pro/solving-ais-energy-challenge-sustainable-data-centers-for-a-competitive-uk-future",
      "title": "Solving AI's energy challenge: sustainable data centers for a competitive UK future",
      "summary": "The world is racing to harness AI's transformative potential, but this revolution comes with a stark reality: AI's energy appetite is enormous and growing rapidly.\nBut for data centers, I see a new mantra: move fast, but break nothing.\nLower energy consumption means reduced operational costs - critical when UK energy prices remain among the highest in Europe.\nA change of mindsetAchieving this virtuous circle for data centers demands a change of mindset.\nJust as failure is catastrophic in a power grid or transportation network, the same rigor must apply to AI's data infrastructure.",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2026-01-19T10:52:03Z",
      "source": "TechRadar"
    }
  },
  {
    "article": {
      "id": "NDQ=",
      "url": "https://www.nature.com/articles/d41586-026-00102-0",
      "title": "The US is quitting 66 global agencies: what does it mean for science?",
      "summary": "The United States is leaving some of the world’s oldest and most influential scientific networks involved in biodiversity research, climate science and conservation.\nThe United States is leaving the Intergovernmental Panel on Climate Change (IPCC), which advises countries on the latest climate science.\nThe statement adds that the IPCC will continue to “make decisions by consensus among its member governments at its regular plenary sessions”.\nMore than moneyThe United States contributes around one-fifth of the United Nations’ budget, a little less than its share of the world economy.\nThe United States will also remain part of UN conventions that regulate trade of endangered species and protect migratory animals.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-20T00:00:00Z",
      "source": "Nature.com"
    }
  },
  {
    "article": {
      "id": "NDU=",
      "url": "https://www.yankodesign.com/2026/01/20/winter-proof-luxury-this-tiny-house-brings-full-time-comfort-to-colorados-harsh-climate/",
      "title": "Winter-Proof Luxury: This Tiny House Brings Full-Time Comfort to Colorado’s Harsh Climate",
      "summary": "Living small is often romanticized as a sun-drenched, coastal fantasy or a nomadic life on the road, but tiny houses are increasingly proving their worth in far harsher environments.\nOne of the latest examples is a luxurious new model from Tru Form Tiny, designed specifically to handle brutal winters without compromising on comfort or aesthetics.\nDesigner: Tru Form TinyCold-climate performance was a driving force behind the design.\nTru Form Tiny has wrapped the structure in high-R-value insulation and fitted energy-efficient Low-E windows to reduce heat loss and solar gain.\nOn the opposite side of the house, the bathroom feels unusually generous for a tiny home.",
      "category": "environment",
      "bias": "center",
      "publishedAt": "2026-01-21T00:30:30Z",
      "source": "Yanko Design"
    }
  },
  {
    "article": {
      "id": "NDY=",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5640006/trump-has-rolled-out-many-of-the-project-2025-policies-he-once-claimed-ignorance-about",
      "title": "Trump has rolled out many of the Project 2025 policies he once claimed ignorance about",
      "summary": "Trump has rolled out many of the Project 2025 policies he once claimed ignorance abouttoggle caption Samuel Corum/Getty ImagesPresident Trump once insisted he had \"nothing to do with Project 2025,\" the right-wing policy plan that became a key flashpoint during the presidential campaign.\nSponsor MessageTrump soon unleashed a flurry of orders reshaping the government, many of which were outlined in Project 2025.\n\"I would say that Project 2025 was largely standard conservative fare, but with a bit more of a MAGA flavor than previously.\"\nPaul Dans, the director of project 2025, says he never took the attacks personally, which he chalked up to political calculus.\nHe boasted of meeting with \"Russ Vought, he of PROJECT 2025 Fame,\" while threatening to dismantle federal agencies.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-19T10:00:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NDc=",
      "url": "https://www.yahoo.com/news/articles/ice-says-immigrant-died-sprawling-155137623.html",
      "title": "ICE says an immigrant who died in a sprawling Texas detention facility killed himself",
      "summary": "EL PASO, Texas (AP) — An immigrant from Nicaragua was found dead at a Texas immigration detention facility last week, federal officials said.\nVictor Manuel Diaz appears to have killed himself Wednesday at the sprawling tent complex at the U.S. Army's Fort Bill base in El Paso, Immigration and Customs Enforcement said in a statement.\nIt's the same facility where ICE said another detainee died earlier this month as staff members tried to keep him from killing himself.\nDiaz was swept up on Jan. 6 in the federal crackdown on immigration in Minnesota and sent to Texas, ICE said.\nThe detainee said at least one of the guards squeezed an arm around Lunas Campos' neck.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-01-19T15:51:37Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDg=",
      "url": "https://www.yahoo.com/news/articles/trumps-ice-force-sweeping-america-123300893.html",
      "title": "Trump's ICE force is sweeping America. Billions in his tax and spending cuts bill are paying for it",
      "summary": "Swelling ranks of ICE officers, to 22,000, in an expanding national force bigger than most police departments in America.\n“Public sentiment is everything,\" said Rep. Nydia M. Velázquez, D-N.Y., at a press conference at the Capitol with lawmakers supporting legislation to impeach Homeland Security Secretary Kristi Noem.\nHouse Speaker Mike Johnson, R-La., has warned Democrats that this is \"no time to be playing games” by stirring up the opposition to immigration enforcement officers in Minneapolis and other places.\nNoem has said the immigration enforcement officers are acting lawfully.\nThe legislation essentially doubled annual Homeland Security funding, adding $170 billion to be used over four years.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-01-20T12:33:00Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NDk=",
      "url": "https://www.businessinsider.com/immigration-lawyer-ice-raids-advice-for-employers-minneapolis-2026-1",
      "title": "I'm an immigration lawyer in Minneapolis. People are scared — here's what employers and employees should know about their rights.",
      "summary": "There's a huge concentration of ICE enforcement right now in Minnesota, specifically here in the Twin Cities.\nLoan Huynh, an immigration attorney in Minneapolis, said that employees are scared due to ICE actions in the area, while employers are in a difficult position.\nOr if you get a call from one of your employees who says, 'I'm too scared to walk out of my car here.\nIndividuals have constitutional rights, and don't need to succumb to threatsWe're seeing situations where an individual will say, \"I don't want to speak with you,\" or, \"I have counsel.\nThey have constitutional rights that, just because they are being threatened by an individual, don't mean that they have to succumb to those threats or requests.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-01-20T18:32:35Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NTA=",
      "url": "https://gothamist.com/news/sign-of-the-times-ny-asylum-seekers-arrested-at-routine-immigration-appointments",
      "title": "'Sign of the times': NY asylum-seekers arrested at routine immigration appointments",
      "summary": "Rafael Andres Rubio Bohorquez, a data analyst, was taken into custody Jan. 12, when he appeared for a scheduled asylum interview with U.S.\nCitizenship and Immigration Services, the agency that “oversees lawful immigration to the United States,” according to a lawsuit petitioning for his release.\nBut instead of sitting for the interview, he was arrested by U.S. Immigration and Customs Enforcement officers and whisked into detention, court records show.\nOne of her clients was detained at the New York asylum office in October.\nIn the New York City area, 58% percent of the immigrants arrested by ICE under Trump through mid-October had no criminal history.",
      "category": "immigration",
      "bias": "lean right",
      "publishedAt": "2026-01-20T20:32:00Z",
      "source": "Gothamist"
    }
  },
  {
    "article": {
      "id": "NTE=",
      "url": "https://www.npr.org/2026/01/20/g-s1-106532/up-first-newsletter-trump-world-leaders-immigration-detention-college-football-champion",
      "title": "Trump leaks world leaders' messages. And, Indiana wins its first national title",
      "summary": "Trump leaks world leaders' messages.\nOvernight, Trump shared messages he received from world leaders, including one from France's President Emmanuel Macron, who tried flattery and then proposed discussing Greenland over dinner.\nNow, world leaders are meeting face-to-face at the World Economic Forum in Davos, where Trump is scheduled to speak on Wednesday.\nHowever, some world leaders do not see it the same way the Trump administration does, NPR's Danielle Kurtzleben tells Up First.\n➡️ State and city leaders say working with ICE undermines trust and cooperation between local law enforcement and immigrant communities, hindering crime prevention.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-20T12:19:41Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NTI=",
      "url": "https://abcnews.go.com/US/ice-detainee-dies-presumed-suicide-texas-detention-facility/story?id=129364093",
      "title": "ICE detainee dies of 'presumed suicide' at Texas detention facility, agency says",
      "summary": "The man was being held in a tent complex at the U.S. Army's Fort Bliss base.\nThis Aug. 7, 2025, satellite image shows construction of large white tents for a new immigrant detention center at Fort Bliss, a U.S. Army base outside El Paso, Texas.\nThis Aug. 7, 2025, satellite image shows construction of large white tents for a new immigrant detention center at Fort Bliss, a U.S. Army base outside El Paso, Texas.\nVictor Manuel Diaz, 36, of Nicaragua, died of a \"presumed suicide\" on Jan. 14 at Camp East Montana, a sprawling tent complex at the U.S. Army's Fort Bliss base in El Paso, ICE said Sunday.\nHe was pronounced dead following life-saving measures by on-site medical staff and El Paso emergency medical services personnel, according to ICE.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-01-20T01:20:29Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NTM=",
      "url": "https://www.businessinsider.com/elon-musk-political-spending-kentucky-nate-morris-2026-1",
      "title": "Elon Musk is spending big money on politics again",
      "summary": "Elon Musk's $10 million investment in a Kentucky Senate race would be his largest single political contribution since the 2024 election.\nElon Musk's $10 million investment in a Kentucky Senate race would be his largest single political contribution since the 2024 election.\nWin McNamee/Getty ImagesElon Musk's $10 million investment in a Kentucky Senate race would be his largest single political contribution since the 2024 election.\nWin McNamee/Getty ImagesJust months ago, Elon Musk seemed to swear off major political spending.\nMusk spending big on an election would mark something of a reversal from the middle of last year.",
      "category": "economics",
      "bias": "center",
      "publishedAt": "2026-01-20T15:57:26Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "NTQ=",
      "url": "https://abcnews.go.com/US/lawyers-allege-dept-homeland-security-denying-legal-counsel/story?id=129335914",
      "title": "Lawyers allege Dept. of Homeland Security is denying legal counsel to Minnesota detainees",
      "summary": "Detainees are being held at the Whipple Federal Building in Minneapolis.\n“ICE agents were physically restricting me from seeing them,” said one immigration attorney, who asked not to be identified.\nREUTERS/Leah Millis Leah Millis/ReutersThe Department of Homeland Security denied that any constitutional violations are taking place at the Whipple Federal Building.\nThe Whipple building has been a primary facility where people detained during DHS' “Operation Metro Surge” are being temporarily held.\nThe immigration attorney also said access to an attorney by phone is different from access to an attorney in person.",
      "category": "immigration",
      "bias": "lean right",
      "publishedAt": "2026-01-19T01:22:27Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NTU=",
      "url": "https://sg.finance.yahoo.com/news/exclusive-indias-central-bank-proposes-054224570.html",
      "title": "Exclusive-India's central bank proposes linking BRICS' digital currencies, sources say",
      "summary": "The Reserve Bank of India (RBI) has recommended ​to the government that a proposal connecting the central bank digital currencies (CBDCs) be included on the agenda for the 2026 BRICS summit, the sources said.\nIf the recommendation is accepted, a proposal to link the digital currencies of BRICS members would be put ‌forward for the first time.\nThe South African central bank declined to comment.\nThe RBI's proposal to link BRICS' CBDCs for cross-border trade finance and tourism has not been previously reported.\nWhile none of the BRICS members have fully launched their digital currencies, all five main members have been running pilot projects.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-19T05:42:24Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTY=",
      "url": "https://www.aljazeera.com/video/the-take-2/2026/1/19/aje-onl-tt_glb_omaryaghi_av_v2-190126",
      "title": "From a refugee family to Nobel Laureate: Omar Yaghi’s story",
      "summary": "Nobel laureate Omar Yaghi on how humble beginnings fueled breakthrough science against the climate crisis.\nNobel Laureate Dr. Omar Yaghi joins The Take after winning the 2025 Nobel Prize in Chemistry for developing metal-organic frameworks (MOFs), materials that can capture carbon and store hydrogen.\nBorn to a Palestinian refugee family in Amman, Yaghi tells the story of how hardship shaped his imagination, from getting fresh water only once a week to inventing systems that pull water from desert air.\nIn this episode:Dr. Omar Yaghi, Nobel Laureate in Chemistry, Professor at University of California, Berkeley and Atoco FounderEpisode credits:This episode was produced by Chloe K. Li and Melanie Marich with Phillip Lanos, Spencer Cline, Tamara Khandaker, Kylene Kiang, Sarí el-Khalili and our host, Malika Bilal.\nThe Take production team is Marcos Bartolomé, Sonia Bhagat, Spencer Cline, Sarí el-Khalili, Tamara Khandaker, Kylene Kiang, Phillip Lanos, Chloe K. Li, Melanie Marich, and Noor Wazwaz.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-01-19T18:47:06Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTc=",
      "url": "https://www.aljazeera.com/news/2026/1/21/us-justice-department-probes-minnesota-officials-amid-migration-raids",
      "title": "US Justice Department probes Minnesota officials amid migration raids",
      "summary": "The investigation will look into whether Minnesota officials blocked federal immigration agents from carrying out their duties.\nThe DOJ probe will review whether Minnesota state officials conspired to obstruct justice by preventing federal immigration officers from carrying out their duties, US broadcaster CBS News reported late on Tuesday.\nGovernor Walz confirmed the DOJ investigation in a statement on Tuesday, describing the move as “political theatre”.\n“This Justice Department investigation, sparked by calls for accountability in the face of violence, chaos and the killing of Renee Good, does not seek justice.\nMinneapolis Mayor Frey described the DOJ investigation as an attempt to intimidate state officials.",
      "category": "immigration",
      "bias": "left",
      "publishedAt": "2026-01-21T04:43:15Z",
      "source": "Al Jazeera English"
    }
  },
  {
    "article": {
      "id": "NTg=",
      "url": "https://www.yahoo.com/news/articles/judge-refuses-block-dhs-policy-231016110.html",
      "title": "Judge refuses to block new DHS policy limiting Congress members' access to ICE facilities",
      "summary": "WASHINGTON (AP) — A federal judge refused Monday to temporarily block the Trump administration from enforcing a new policy requiring a week's notice before members of Congress can visit immigration detention facilities.\nRather, she said, plaintiffs' attorneys representing several Democratic members of Congress used the wrong \"procedural vehicle\" to challenge it.\nShe ruled Dec. 17 that it is likely illegal for ICE to demand a week’s notice from members of Congress seeking to visit and observe conditions in ICE facilities.\nAdvertisement AdvertisementAdvertisement AdvertisementA law bars DHS from using appropriated general funds to prevent members of Congress from entering DHS facilities for oversight purposes.\nGovernment attorneys have said it’s merely speculative for the legislators to be concerned that conditions in ICE facilities change over the course of a week.",
      "category": "immigration",
      "bias": "lean left",
      "publishedAt": "2026-01-19T23:10:16Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NTk=",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5621791/winter-olympics-venues-milan-cortina",
      "title": "The 2026 Olympics are the most widespread in history. See what's happening where",
      "summary": "Here's a guide to the 2026 Olympic venues.\nAlpine skiing will take place at Tofane Alpine Skiing Centre, named after one of the most dramatic mountain groups in the Eastern Dolomites.\nThe Anterselva Biathlon Arena has the largest spectator capacity of any of this year's Olympic venues, set to accommodate up to 19,000 people per session.\nSponsor MessageMen's Alpine skiing, as well as the new sport of ski mountaineering, are happening in Bormio, a historic ski resort in the Italian Alps.\nOlympic events in the cluster are spread across two of its villages, Tesero and Predazzo.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-19T10:00:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NjA=",
      "url": "https://www.theregister.com/2026/01/21/palantir_ceo_karp_claims_ai/",
      "title": "Palantir CEO: With AI, economies won't need immigration",
      "summary": "This week, after promising not to go on one of his \"usual political screeds,\" the Palantir CEO went off on one, as the Brits like to say, launching into a speculative analysis of the impact of AI on immigration.\nHe was unlikely to have his worldview significantly challenged by his interviewer, BlackRock CEO Larry Fink, the septuagenarian billionaire Co-Chairman of the World Economic Forum.\nDuring the World Economic Forum session, Karp agreed that AI would lead to fewer white collar jobs.\nKarp admitted AI is a \"very low-trust environment,\" which is why Palantir needs very few salespeople.\nBut if [like Palantir] you've delivered stuff that does work, why do you need a salesforce?\"",
      "category": "technology",
      "bias": "center",
      "publishedAt": "2026-01-21T15:31:00Z",
      "source": "Theregister.com"
    }
  },
  {
    "article": {
      "id": "NjE=",
      "url": "https://www.npr.org/2026/01/20/nx-s1-5678927/trump-world-order-foreign-policy",
      "title": "As Trump dismantles the existing world order, his version is still taking shape",
      "summary": "As Trump dismantles the existing world order, his version is still taking shapetoggle caption Ariana Cubillos/APPresident Harry Truman led the construction of the global order from the smoldering ruins of World War II.\nSponsor MessageIn his first term, Trump sought to keep the U.S. out of foreign conflicts.\nIn his second term, Trump has often turned to military force.\nHe says that in several places, including Venezuela, \"I'm not sure what side of that divide President Trump is on.\nAs this old order breaks down, Trump's version is still taking shape.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-20T10:02:00Z",
      "source": "NPR"
    }
  },
  {
    "article": {
      "id": "NjI=",
      "url": "https://www.bbc.com/news/articles/c0lx7j1lrwro",
      "title": "Greenland: Europe is ditching its softly-softly approach to Trump",
      "summary": "Confronted over Greenland, Europe is ditching its softly-softly approach to Trump2 days ago Share Save Katya Adler Europe Editor Share SaveBBCSomething in Europe has snapped.\nEuropean leaders are telling President Trump they'll support him in prioritising Arctic security, so there's no need for him to go it alone over Greenland.\nCanada, which President Trump had threatened to make the 51st state of the US, has just agreed to a limited trade deal with Beijing.\nBut Tara Varma insists that the Peace Board isn't about peace.\nGetty Images Asked if he was prepared to use force to seize Greenland, President Trump said, \"No comment\", sending chills down the spine of many GreenlandersTransatlantic relations aren't broken yet, though they are damaged.",
      "category": "international",
      "bias": "right",
      "publishedAt": "2026-01-20T01:04:54Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NjM=",
      "url": "https://sg.news.yahoo.com/live/us-embassy-asks-singapore-businesses-for-larger-gifts-for-semiquincentennial-singapore-weighs-invitation-to-trumps-board-of-peace-singapore-live-news-040027365.html",
      "title": "US Embassy asks Singapore businesses for 'larger gifts' for Semiquincentennial; Singapore weighs invitation to Trump’s Board of Peace: Singapore live news",
      "summary": "Singapore has been invited to join US President Donald Trump’s proposed Board of Peace and is assessing the offer, the Ministry of Foreign Affairs (MFA) says.\n(Photo: REUTERS/Kevin Lamarque) (REUTERS / Reuters)Singapore has been invited to join US President Donald Trump’s proposed Board of Peace, the Ministry of Foreign Affairs confirmed.\nExplainer: Trump’s “Board of Peace”What is Trump’s “Board of Peace”?\nThe Board of Peace is a proposed international body initiated by former US President Donald Trump.\nUnder the proposed charter, he would hold significant authority over membership terms and expulsions, subject to a two-thirds board vote.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-01-20T04:00:27Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NjQ=",
      "url": "https://www.bbc.com/news/articles/cx2lej7d52po",
      "title": "Lyse Doucet: Trump is shaking the world order more than any president since WW2",
      "summary": "Lyse Doucet: Trump is shaking the world order more than any president since WW22 days ago Share Save Lyse Doucet Chief international correspondent Share SaveWatch: BBC asks Trump if breakup of Nato is price he is willing to pay for GreenlandOn day one, he put the world on notice.\nBut, in the past century, no American president has threatened to seize the land of a longtime ally and rule it against their people's will.\nNo US leader has so brutally broken political norms and threatened long-standing alliances which have underpinned the world order since the end of World War Two.\nRubio has been one of the principal voices trying to backpedal Trump's threats on Greenland, underlining that he wants to buy this vast strategic ice sheet, not invade it.\nPresident Trump now owns it, bolstered by his fervent backers on his team, with his belief that America can act at will in its backyard, and beyond, to protect American interests.",
      "category": "international",
      "bias": "lean right",
      "publishedAt": "2026-01-20T20:18:43Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NjU=",
      "url": "https://abcnews.go.com/Politics/1-year-trumps-2nd-term-seismic-shifts-foreign/story?id=129350162",
      "title": "1 year into Trump's 2nd term, here are some of the seismic shifts in foreign and domestic policies",
      "summary": "During every single day of the Trump administration, I will very simply put America First,\" Trump vowed during his inaugural address.\nPresident Donald Trump and Ukrainian President Volodymyr Zelensky meet in the Oval Office at the White House, Feb. 28, 2025.\nThey fell short of that goal, but the White House has since reached deals or frameworks with dozens of America's trading partners.\nThe White House has also made significant carve-outs for some goods that cannot be produced or grown in the U.S. such as coffee and bananas.\nChanges to the White HouseTrump has also made his mark on the physical space of the White House.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-01-20T10:15:40Z",
      "source": "ABC News"
    }
  },
  {
    "article": {
      "id": "NjY=",
      "url": "https://www.businessinsider.com/trump-tariffs-paid-almost-entirely-by-americans-german-study-2026-1",
      "title": "US tariffs are paid almost entirely by Americans, a German study finds",
      "summary": "The study, published Monday, said that the $200 billion increase in customs revenue that the US government raised in 2025 was a \"tax paid almost entirely by Americans.\"\nThe research contradicts Trump's messaging that tariff costs would not be paid by Americans, but by other countries and overseas exporters.\nAnalysts at Deutsche Bank and Bank of America also said last year that Americans were the ones paying for the tariffs.\nMany of Trump's tariff policies could also be undone.\nThe Supreme Court is expected to rule soon on the legality of a host of Trump's tariffs that were instituted under an emergency national security law.",
      "category": "economics",
      "bias": "left",
      "publishedAt": "2026-01-20T00:00:18Z",
      "source": "Business Insider"
    }
  },
  {
    "article": {
      "id": "Njc=",
      "url": "https://www.bbc.com/news/articles/c24g6pj2071o",
      "title": "Putin invited to join US-led Gaza 'Board of Peace', Trump says",
      "summary": "Putin invited to join US-led Gaza 'Board of Peace', Trump saysWashington has asked various world leaders to sit on the board.\nPresident Donald Trump has confirmed he invited Vladimir Putin to join a US-proposed Gaza \"Board of Peace\".\nThe Board of Peace will be made up of world leaders, with President Trump as its chairman, according to the White House.\nAsked on Monday if he had invited Putin to join the Board of Peace, Trump told reporters in Florida: \"Yes [...] these are world leaders.\n\"He'll join, but he doesn't have to join,\" Trump added.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-20T08:51:31Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "Njg=",
      "url": "https://ca.news.yahoo.com/china-distances-itself-greenland-issue-090031789.html",
      "title": "China distances itself from Greenland issue but warns against US dependence",
      "summary": "U.S. President Donald Trump's ambition to wrest sovereignty over Greenland from Denmark has rattled ‌NATO members and prompted a rethink of Europe's traditional security dependence on the United States.\nAdvertisement AdvertisementAdvertisement AdvertisementTrump has also threatened to rain trade tariffs on Europe if it resists his demand to acquire the Arctic ‍island.\nThe EU's foreign policy chief, Kaja Kallas, cautioned that transatlantic tariffs would play into the hands of China and Russia, both of which would benefit from \"divisions among allies\".\nYet Chinese state media did not hold back comments this week, urging Europe to reassess its dependence on the United States for security.\nThe Greenland crisis is a call for Europe to bolster strategic autonomy and diversify partnerships, it said.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-21T09:00:31Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "Njk=",
      "url": "https://www.bbc.com/news/articles/c4g5345ylk0o",
      "title": "Trump says he will '100%' carry out Greenland tariffs threat, as EU vows to protect its interests",
      "summary": "Trump says he will '100%' carry out Greenland tariffs threat, as EU vows to protect its interests2 days ago Share Save Thomas Mackintosh and Tabby Wilson Share SaveSean Gallup/Anna Moneymaker/Getty Images Kaja Kallas, the EU's foreign policy chief, said the bloc has \"no interest to pick a fight, but we will hold our ground\".\nDonald Trump has vowed to \"100%\" follow through on his threat to impose tariffs on European countries who oppose his demand to take control of Greenland.\nAsked if he would follow through on the tariff threat, Trump told NBC News: \"I will, 100%.\"\nDanish foreign minister Lars Løkke Rasmussen said that Europe had to show President Trump tariff threats were \"not the way forward\".\nGreenland is a part of the Kingdom of Denmark, and Norway fully supports the Kingdom of Denmark on this matter,\" Støre added.",
      "category": "international",
      "bias": "right",
      "publishedAt": "2026-01-19T21:46:09Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NzA=",
      "url": "https://www.yahoo.com/news/articles/irans-top-diplomat-issues-most-051608462.html",
      "title": "Iran offers first government-issued death toll from protest crackdown, one far lower than activists",
      "summary": "DUBAI, United Arab Emirates (AP) — Iran offered its first government-issued death toll Wednesday following a crackdown on nationwide protests, giving a far lower figure than activists abroad as the country’s theocracy tries to reassert control after unrest recalling the chaos surrounding its 1979 Islamic Revolution.\nThe U.S.-based Human Rights Activists News Agency said the death toll early Thursday was at least 4,902, with many more feared dead.\nAdvertisement AdvertisementAdvertisement AdvertisementThe Associated Press has been unable to independently assess the death toll, in part due to authorities cutting access to the internet and blocking international calls into the country.\nProtest death toll risesAdvertisement AdvertisementAdvertisement AdvertisementThe death toll exceeds that of any other round of protest or unrest in Iran in decades, and recalls the chaos surrounding the 1979 revolution that brought the Islamic Republic into being.\nComments from officials have led to fears of some of those detained being put to death in Iran, one of the world’s top executioners.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-21T05:16:08Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NzE=",
      "url": "https://www.yahoo.com/news/articles/vietnams-communist-party-begins-congress-001037451.html",
      "title": "Vietnam's Communist Party begins week-long congress to choose leader",
      "summary": "By Francesco GuarascioHANOI, Jan 19 (Reuters) - Hundreds of delegates from Vietnam's ruling Communist Party gathered on Monday under tight security for a congress that will select the single-party country's top leader and set economic goals for the remainder of the decade.\nLam, photographed smiling in state media as he entered the congress venue on Monday, is expected to address delegates on Tuesday.\nAdvertisement AdvertisementAdvertisement AdvertisementRISK-TAKING LEADERLam, 68, has launched several major reforms during his brief tenure as party chief, the country's most powerful job.\nECONOMIC GROWTH, SECURITY TOP NEXT FIVE-YEAR AGENDAThe congress' delegates represent 5.6 million party members in ​a country of 100 million.\nThe party intends to increase its defence forces, especially in border areas, the draft text says.",
      "category": "international",
      "bias": "left",
      "publishedAt": "2026-01-19T00:10:37Z",
      "source": "Yahoo Entertainment"
    }
  },
  {
    "article": {
      "id": "NzI=",
      "url": "https://www.bbc.com/news/articles/c1507x8njzwo",
      "title": "'Minor electrical issue' on Air Force One delays Trump Davos visit",
      "summary": "Air Force One was grounded due to a \"minor electrical issue\", according to the White House.\nThe plane returned to Joint Base Andrews in Maryland and Trump left for Switzerland on another aircraft.\nHe will travel onwards to the World Economic Forum in Davos, where he is expected to deliver a speech later.\nFollow live updatesAir Force One is technically a radio call signal and would be designated for any Air Force aircraft with the US president aboard, rather than a specific plane.\nCurrently, there are two Boeing 747-200B series in the Air Force passenger fleet, which have been in use since 1990.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2026-01-21T08:30:16Z",
      "source": "BBC News"
    }
  },
  {
    "article": {
      "id": "NzM=",
      "url": "https://www.vox.com/politics/475793/trump-and-greenland-latest-stories-and-updates",
      "title": "Trump and Greenland: Latest stories and updates",
      "summary": "President Donald Trump has again elevated Greenland to a central place in his foreign policy, renewing a long-running push that has unsettled US allies.\nDenmark and Greenland swiftly rejected the idea, issuing a joint statement underscoring that sovereignty and borders are protected by international law.\nOther European leaders, including French President Emmanuel Macron, voiced support for Denmark and Greenland.\nTrump has floated buying or annexing Greenland since his first term, but his rhetoric has intensified during his second.\nWhile US officials already enjoy close military cooperation with Greenland and Denmark, Trump’s approach has raised fresh concerns about relations with America’s allies.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2026-01-20T20:04:35Z",
      "source": "Vox"
    }
  }
]