[
  {
    "article": {
      "id": "MA==",
      "url": "https://www.yahoo.com/news/articles/scientists-disturbing-discovery-human-urine-000000754.html",
      "title": "Scientists make disturbing discovery in human urine samples: 'We urgently need to classify [this]'",
      "summary": "Over the course of the study, 150 urine samples were collected from three different populations across South China.\nWhy is the discovery of tire chemicals in urine important?\nWhat's being done about toxic tire chemicals?\n\"We urgently need to classify tire particles as a unique pollution category,\" Obanya wrote.\n\"This means the consequences of tire pollution can be unexpected and far reaching.\"",
      "category": "technology",
      "bias": "lean left",
      "publishedAt": "2025-12-20T06:00:00Z",
      "source": "Naturalnews.com"
    }
  },
  {
    "article": {
      "id": "MQ==",
      "url": "https://www.yahoo.com/news/articles/germany-charges-teens-alleged-wing-100848247.html",
      "title": "Germany charges teens in alleged right-wing extremist group with attempted murder",
      "summary": "BERLIN (AP) — Germany's federal prosecutor brought charges Thursday against eight suspects for their alleged membership in a “right-wing extremist terrorist” group that allegedly aimed to destabilize the country’s democratic system by carrying out attacks on migrants and political opponents.\nThe prosecutors also charged the seven alleged members and one supporter of the group, some of them teenagers, of attempted murder, conspiracy to commit murder, and grievous bodily harm.\nMost of the youths were arrested in May, when they were accused of involvement with a group calling itself “Last Defense Wave.\"\nAt the time, five suspects between 14 and 21 years old were arrested in the states of Mecklenburg-Western Pomerania, Brandenburg, and Hesse.\nSeveral members of the group were also accused of robbing and beating individuals, causing significant injuries, the prosecutor's statement said.",
      "category": "international",
      "bias": "center",
      "publishedAt": "2025-12-20T06:00:00Z",
      "source": "Naturalnews.com"
    }
  },
  {
    "article": {
      "id": "Mg==",
      "url": "https://www.bbc.com/news/articles/c2k422e7ykvo",
      "title": "US to strip alleged Bosnian war criminal's citizenship",
      "summary": "US to strip alleged Bosnian war criminal of citizenship2 days ago Share Save Jack Burgess Share SaveUS Immigration and Customs Enforcement A photo released by US Immigration and Customs Enforcement showing Kemal Mrndzic (right) on 2 November 1992The US justice department has launched a civil legal case against a man accused of being a Bosnian war criminal to revoke his citizenship.\nA UN war crimes tribunal found that people held in the camp during the Bosnian war were killed, tortured, sexually assaulted, beaten and subjected to cruel and inhuman treatment.\nUS President Donald Trump's administration would not allow people who \"persecute others\" to \"reap the benefits of refuge in the US\", justice department official Brett Shumate said.\nHe failed to disclose to immigration authorities the nature and timing of his military service, or that \"he persecuted Bosnian-Serb inmates as a prison guard\", the justice department said.\nUS Immigration and Customs Enforcement A set of photos that appear to show Kemal Mrndzic through the years, from 1992 to 2019, released by US officials",
      "category": "international",
      "bias": "center",
      "publishedAt": "2025-12-20T06:00:00Z",
      "source": "Naturalnews.com"
    }
  },
  {
    "article": {
      "id": "Mw==",
      "url": "https://www.rt.com/news/629840-orban-mocks-kallas-hitler/",
      "title": "Orban mocks Kallas with Hitler comparison",
      "summary": "Even Napoleon and Hitler didn’t succeed – now Kaja Kallas will, obviously,” he said, referring to the EU foreign policy chief’s hardline stance against Russia.\nOrban also warned against provoking Russia, arguing that the EU underestimates the nation’s historical memory of past conflicts.\nThis month, EU leaders failed to agree on tapping frozen Russian assets directly due to internal divisions.\nInstead, they opted to provide a €90 billion ($105 billion) loan to Ukraine to help cover the budget deficit in 2026-27.\nHungary is one of the EU members that opted out of the plan to finance Kiev.",
      "category": "international",
      "bias": "lean left",
      "publishedAt": "2025-12-20T06:00:00Z",
      "source": "Naturalnews.com"
    }
  }
]