[
  {
    "url": "https://finance.yahoo.com/news/the-2-fed-comments-that-are-boosting-odds-of-a-december-rate-cut-170420327.html",
    "title": "The 2 Fed comments that are boosting odds of a December rate cut",
    "summary": "Odds for another interest rate cut jumped Friday after New York Fed president John Williams signaled he could support a cut when the central bank meets in December.\nThough he still sees room to cut, Williams said he believes tariffs have temporarily stalled progress toward the Fed’s 2% inflation goal.\nHe estimates tariffs are contributing a half a percentage point to three-quarters of a percentage point to inflation.\nRead more: How the Fed rate decision affects your bank accounts, loans, credit cards, and investmentsAlso on Friday, Fed governor Stephen Miran said that if he were the marginal vote on whether to cut rates, he would vote for a 25 basis point rate cut instead of the 50 basis point cut he favors.\nMiran noted that he thought the September jobs report would tip anyone who wasn’t sure whether to cut rates toward doing so.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-11-21T17:04:20Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/sharp-disagreements-over-economy-threaten-212217466.html",
    "title": "Sharp disagreements over economy threaten Federal Reserve interest rate cut",
    "summary": "“It’s not surprising at all that there’s a wide divergence of opinions.”Fewer rate cuts by the Fed could leave borrowing costs for homes and cars elevated.\nMore expensive mortgages and auto loans contribute to the widespread view, according to polls, that the cost of living is too high.\nKrishna Guha, an analyst at Evercore ISI, said a decision to cut could lead to as many as four or five dissents, while a decision to keep rates unchanged could produce three.\nFed governor Christopher Waller on Monday noted that critics of the Fed often accuse it of “group think,” since many of its decisions are made unanimously.\nSeptember jobs data will finally be published Thursday, and are expected to show a small gain of 50,000 jobs that month and an unchanged unemployment rate at a still-low 4.3%.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-11-18T21:22:17Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/cp8y8g7djxlo",
    "title": "Funding NHS facilities with private finance a breach of manifesto, Labour MPs say",
    "summary": "Funding NHS facilities with private finance a breach of manifesto, Labour MPs sayA government spokesperson said funding for the health centres \"will build on lessons learnt from past and current models\".\nNearly 40 Labour MPs have warned the government would \"renege\" on its manifesto if it went ahead with proposals to use private finance to fund NHS facilities.\nThe Labour MPs say that, \"At a time when trust in politics is at its lowest, it would be very damaging for the government to renege on this promise\".\n\"We ask you to please drop any plans for new private finance in the NHS from the Autumn Budget and any future policy.\"\nIn its NHS 10 Year Plan the government said it would consider using private finance to build health centres and promised to \"learn from previous experience with the Private Finance Initiative (PFI)\".",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-11-21T06:01:22Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.theverge.com/podcast/823909/the-doordash-problem-ai-agents-web-amazon-perplexity-lawsuit",
    "title": "The DoorDash problem arrives for Amazon",
    "summary": "So what, exactly, is the DoorDash problem?\nNow, it’s time for us to really dive deep into the DoorDash problem.\nThat’s the DoorDash problem.\nSo at this point, you might be wondering: what does DoorDash think about the DoorDash problem?\nI don’t know how the industry solves the DoorDash problem.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-11-20T15:32:31Z",
    "source": "The Verge"
  },
  {
    "url": "https://finance.yahoo.com/video/3rs-seth-credit-markets-investments-042012216.html",
    "title": "3R's Seth on Credit Markets, Investments",
    "summary": "Neeraj Seth, Founder & CIO of 3R Investment Management, discusses the market outlook and investment strategies.\nHe speaks with David Ingles and Yvonne Man on the sidelines of Bloomberg's New Economy Forum in Singapore.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-11-21T04:20:12Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.theverge.com/features/825207/semiconductor-chip-manufacturing-new-silicon-valley",
    "title": "The new silicon valley (literally)",
    "summary": "The hiccups spurred a bipartisan mission to bring semiconductor manufacturing back to the US.\nThe Grand Canyon state’s history with the semiconductor industry initially made it attractive to companies.\nIn Phoenix, Intel and TSMC are each developing advanced processes for manufacturing chips, meant to improve transistor density and energy efficiency.\nThe semiconductor industry around Phoenix already employs more than 33,000 people, with about 4,000 of those added since 2020.\nToday, Silicon Valley is still studded with Superfund sites — places so contaminated they were put on a national priority list for cleanup.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-11-21T00:55:03Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/september-jobs-report-unemployment-rate-employment-federal-reserve-interest-rates-2025-11",
    "title": "September Jobs Report: Growth Above Forecast, Unemployment Rate Rose",
    "summary": "August's job growth was revised from a gain of 22,000 to a loss of 4,000, and July's growth was revised from a gain of 79,000 to 72,000.\nThe bulk of the job growth came from a handful of sectors.\nLeisure and hospitality added 47,000 jobs, healthcare and social assistance together added about 57,000 jobs, and state and local governments added about 25,000 jobs.\nThe longest government shutdown in US history delayed the release of the Bureau of Labor Statistics' jobs report, originally scheduled for October 3.\nStahle said he doesn't think the Fed's concern about the labor market's performance will dissipate just because of the strong job growth in September.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-11-20T13:36:24Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.oanda.com/us-en/trade-tap-blog/analysis/fundamental/sanctions-paradox-financial-fragmentation-dollar-dominance/",
    "title": "The sanctions paradox",
    "summary": "The international campaign of economic sanctions deployed against Russia following its 2022 invasion of Ukraine was the largest use of financial pressure ever by the US and its allies.\nInstead, these sanctions have caused a fundamental and likely permanent split in how the world's money systems work.\nThey have also been highly successful at getting around the sanctions, especially by using \"parallel imports\" (unofficial trade) through intermediary countries like China, Turkey, and Kazakhstan.\nThis shift, driven by sanctions and helped by cheaper Chinese financing, has significantly boosted the use of the Chinese yuan (RMB) in international trade.\nThis trend doesn't mean the US dollar will collapse immediately, but it is changing from a universal, trusted currency into one seen as having a high risk of sanctions in a new, split financial world.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2025-11-18T20:00:07Z",
    "source": "Oanda.com"
  },
  {
    "url": "https://www.businessinsider.com/ai-boom-bubble-power-utilities-forecasting-demand-2025-11",
    "title": "The AI bubble you haven't heard about",
    "summary": "Many utilities are citing sky-high estimates to justify new AI data centers from Georgia to Texas and up to Minnesota.\nData center operators submit electricity requests in multiple jurisdictions, hoping that one might pan out.\nThere aren't close to enough GPU chips in the world to use the power utilities say they need to provide.\nIf every permitted facility came online, their electricity demand could reach between 149.6 terawatt-hours and 239.3 terawatt-hours annually, Business Insider found.\n\"We're not convinced that that's going to increase actual data center demand,\" a Dominion representative said in the hearing.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-11-18T10:15:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/geoffrey-hinton-the-ceos-arent-ready-for-future-few-jobs-2025-11",
    "title": "The godfather of AI doesn't think CEOs have thought about one big thing that could happen if AI kills most jobs",
    "summary": "\"So you often see articles saying, 'oh, AI's not going to replace jobs, AI fails in lots of things,'\" Hinton said.\n\"I don't believe it's going to create as many new jobs as it replaces,\" Hinton added of AI later in the conversation.\n\"And we'll have, in a benign scenario, universal high income, not just universal basic income.\nUniversal high income, meaning anyone can have any products or services that they want, but there will be a lot of trauma and disruption along the way.\"\nAt the end of the discussion, Sanders asked the audience whether they think AI would benefit their future or harm their prospects.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-11-19T04:34:42Z",
    "source": "Business Insider"
  },
  {
    "url": "https://finance.yahoo.com/news/asian-shares-surge-nvidias-strong-044158428.html",
    "title": "Big swings keep rocking Wall Street as US stocks drop sharply after erasing a morning surge",
    "summary": "NEW YORK (AP) — Jarring swings keep rocking Wall Street, and U.S. stocks erased a big morning gain to drop on Thursday as the market remains skittish following weeks of doubts and erratic moves.\nBy delivering strong profits and indicating more are coming, Nvidia can justify its stock’s price gains and make it look less expensive.\nDespite Nvidia’s big numbers, worries about a potential AI bubble aren’t gone.\nThe concern among investors is that all the dollars pouring into AI chips and data centers may not ultimately produce the big profits and productivity for the economy that proponents have been promising.\nThat question — whether all the investment in AI will prove to be worth it in the end — is still unanswered.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-11-20T04:41:58Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/resilient-domestic-economy-gives-india-084120103.html",
    "title": "Resilient domestic economy gives India space to negotiate U.S. trade deal, sources say",
    "summary": "Indian exports to the U.S. dropped 8.6% year-on-year to $6.3 billion in October,‌ the second month that the 50% tariff on imports from the country was in place.\nNegotiations between New Delhi and Washington have dragged on even ‌as other Asian countries like Japan and South Korea have struck deals to bring down tariffs.\nIndian officials have publicly maintained that India will not rush to sign a deal.\nThe government is helping exporters diversify into new markets through recent new trade deals with the U.K., UAE and Australia,‌ tax cuts on raw materials and a $5.1 billion support package to boost exporters, officials said.\nThe government and the central bank have announced targeted relief, including short-term loan moratoriums, but avoided large fiscal easing.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-11-20T08:41:20Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/asian-markets-track-wall-st-031558753.html",
    "title": "Global stocks in red over worries about tech and Nvidia",
    "summary": "Investors are keenly awaiting the release of Nvidia's earnings this week (JUSTIN SULLIVAN)Stock markets slid across the board on Tuesday as investors worried about lofty tech valuations on the eve of earnings from AI chip titan Nvidia.\nBitcoin also briefly fell below the key $90,000 level for the first time in seven months before rising to around $93,000.\nMajor Wall Street indexes closed lower after a rough day of trading in Europe and a sharp sell-off in Asia, while Nvidia itself gave up 2.8 percent.\n\"The tech-focused sell-off seen in the US has evidently resulted in global contagion,\" said Joshua Mahony, chief market analyst at Scope Markets.\nInvestors will be looking for clues on the health of the industry when Nvidia releases its quarterly earnings on Wednesday.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-11-18T03:15:58Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://abcnews.go.com/Business/long-delayed-jobs-report-show-hiring-amid-wobbly/story?id=127668400",
    "title": "Jobs report blows past expectations, defying hiring slowdown",
    "summary": "In this Oct. 23, 2025, file photo, workers are shown at Anduril Industries Inc.'s Arsenal I factory under construction in Columbus, Ohio.\nIn this Oct. 23, 2025, file photo, workers are shown at Anduril Industries Inc.'s Arsenal I factory under construction in Columbus, Ohio.\nEmployers hired far more workers than expected in September, defying a sharp slowdown over the summer that appeared to cool off the labor market.\nThe report included a downward revision for the month of August, however, slashing performance from 22,000 jobs gained that month to 4,000 jobs lost.\nWhile the layoffs reflect a weakened labor market and AI adoption in some corners of the tech industry, they added, the prospect of wider job losses remains highly uncertain.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-11-20T10:10:58Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/hiltzik-trump-administrations-math-economic-110000261.html",
    "title": "Hiltzik: The Trump administration's math on economic policy doesn't add up",
    "summary": "But his casual retailing of obviously bogus arithmetic points to a broader issue with the numbers the Trump White House routinely injects into its policy statements.\nThe holder of a 50-year loan would have accumulated only about $22,000 in equity.\n\"Homeowners are not building much wealth with a 50-year mortgage,\" economist Dean Baker observes.\nThe White House still is trying to hide the effects of its economic policies on inflation — especially its tariffs.\nThe bottom line is that one shouldn't trust the math coming from this White House.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-11-18T11:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.usatoday.com/story/money/markets/2025/11/20/why-stocks-down-nov-20/87377901007/",
    "title": "Why were stocks down today? What to know as Dow gives up 700-point gain",
    "summary": "U.S. stocks whipsawed, with the blue-chip Dow swinging through 1,000 points, before closing lower.\nBolstered by strong earnings from artificial intelligence chip giant Nvidia and discount retailer Walmart, stocks opened higher and the Dow climbed 700 points.\nHowever, stocks slowly started losing ground after the delayed September jobs report appeared to dash hopes for another rate cut when the Federal Reserve meets next month.\nThe government said it wouldn't release an October jobs report ever because no data were collected last month due to the shutdown.\nNo one can say for certain if the market will rally again soon, but stocks have history on its side.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-11-20T21:58:05Z",
    "source": "USA Today"
  },
  {
    "url": "https://www.businessinsider.com/top-trump-economic-aide-attributing-labor-market-softness-to-ai-2025-11",
    "title": "Kevin Hassett, a top Trump economic advisor, said that AI is bringing about a 'quiet time' in the labor market",
    "summary": "Kevin Hassett said that AI is bringing about a \"quiet time\" in the labour market.\nKevin Hassett said that AI is bringing about a \"quiet time\" in the labour market.\nLeah Millis/REUTERSKevin Hassett said that AI is bringing about a \"quiet time\" in the labour market.\nLeah Millis/REUTERSA top Trump administration economic advisor has a theory on the labor market freeze.\nTrump has signed several executive orders aimed at easing regulations and expanding AI infrastructure, including initiatives to promote data center growth, such as the $500 billion Stargate Project.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-11-18T02:21:42Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/godfather-ai-geoffrey-hinton-warns-not-ready-for-whats-coming-2025-11",
    "title": "Key Takeaways From Geoffrey Hinton's Latest AI Warnings",
    "summary": "AI pioneer Geoffrey Hinton warned that rapid advances could upend jobs, power, and humanity itself.\nAI pioneer Geoffrey Hinton warned that rapid advances could upend jobs, power, and humanity itself.\nJORGE UZON/AFP via Getty ImagesAI pioneer Geoffrey Hinton warned that rapid advances could upend jobs, power, and humanity itself.\nImpact LinkGeoffrey Hinton, often referred to as the \"godfather of AI,\" helped pioneer the neural networks that power the artificial intelligence boom.\n\"If AI gets as smart as people — or smarter — any job they might do can be done by AI.\"",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-11-19T14:00:15Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.calculatedriskblog.com/2025/11/september-employment-report-119.html",
    "title": "Calculated Risk: September Employment Report: 119 thousand Jobs, 4.4% Unemployment Rate",
    "summary": "Private payrolls increased by 97 thousand, and public payrolls increased 22 thousand (Federal payrolls decreased 35 thousand).\nThe second graph shows the year-over-year change in total non-farm employment since 1968.In September, the year-over-year change was 1.31 million jobs.\nI'll have more later ... Year-over-year employment growth is slowing sharply.The third graph shows the employment population ratio and the participation rate.\nThe Labor Force Participation Rate increased to 62.4% in September, from 62.3% in August.\nThe first graph shows the jobs added per month since January 2021.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2025-11-20T13:30:00Z",
    "source": "Calculatedriskblog.com"
  },
  {
    "url": "https://www.cnn.com/2025/11/21/business/stock-market-dow",
    "title": "What on Earth just happened to the stock market?",
    "summary": "The Dow ended the day 493 points higher, or 1.08%, after gaining as much as 800 points earlier in the day.\nGoing into Thursday, the sagging stock market had two big questions it wanted answered: Is the artificial intelligence bubble about to burst, and will the Fed cut interest rates in December?\nThe market bet the Fed could be forced to lower rates next month to give the labor market a needed boost.\nhow the Fed can cut if jobs numbers are really better,” said Michael Block, market strategist at Third Seven Capital.\nAnd even if it doesn’t anytime soon, the AI market isn’t just Nvidia – other, less powerful companies could still be overinflated.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-11-21T12:48:23Z",
    "source": "CNN"
  }
]