[
  {
    "id": "MA==",
    "url": "https://www.yahoo.com/news/articles/economic-speeches-trump-claims-inflation-110129026.html",
    "title": "In economic speeches, Trump claims inflation victory nearly 20 times even as prices bite",
    "summary": "Advertisement AdvertisementOnly twice in the five speeches did Trump acknowledge that prices are still too high, but he blamed them on Biden.\nIn four of the speeches Trump repeatedly and haphazardly switches topics, often when he is in the middle of talking about the economy, the Reuters review found.\n\"But they have no memory of what Trump says about economic issues because of the volume of his own rhetoric.\"\nPrices remain high, even though the inflation rate has inched down since Trump took office, from 3% to 2.7%.\nIn ⁠some of the speeches Trump correctly identifies a drop in prices for a few everyday goods, including eggs and gas.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-08T09:50:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mg==",
    "url": "https://abcnews.go.com/US/consumer-sentiment-brightens-defying-economists-expectations/story?id=129917452",
    "title": "Consumer sentiment brightens, defying economists' expectations",
    "summary": "Customers shops for fruit in a supermarket in New York City, January 22, 2026.\nCustomers shops for fruit in a supermarket in New York City, January 22, 2026.\nCustomers shops for fruit in a supermarket in New York City, January 22, 2026.\nCustomers shops for fruit in a supermarket in New York City, January 22, 2026.\nThe reading exceeded economists' expectationsAt its low point in November, consumer sentiment fell close to its worst level since a pandemic-era bout of acute inflation.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-06T15:40:15Z",
    "source": "ABC News"
  },
  {
    "id": "NA==",
    "url": "https://www.wired.com/story/your-annual-personal-finance-checklist/",
    "title": "Your Annual Personal Finance Checklist",
    "summary": "Get on your path to better financial health by taking care of some routine personal finance tasks.\nAdjust Your Retirement and Savings PlansSet-it-and-forget-it retirement savings?\nCheck Your Credit ReportA credit report is a history of your financial accounts and a way to gauge your financial responsibility.\nChecking your credit report is a security task as much as a finance task.\nIf someone uses your identity to open a line of credit, the new account will appear on your credit report.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-07T10:00:00Z",
    "source": "Wired"
  },
  {
    "id": "Ng==",
    "url": "https://tech.slashdot.org/story/26/02/09/1548222/google-lines-up-100-year-sterling-bond-sale",
    "title": "Google Lines Up 100-Year Sterling Bond Sale",
    "summary": "Different all twisty a of in maze are you, passages little.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-09T17:01:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "OA==",
    "url": "https://www.businessinsider.com/prediction-markets-capitol-hill-lawmakers-concerns-2026-2",
    "title": "The DC lawmakers who think prediction markets are 'bad' and 'kind of sad'",
    "summary": "Sen. Chris Murphy of Connecticut is among the lawmakers sounding a note of deep skepticism about prediction markets.\nSen. Chris Murphy of Connecticut is among the lawmakers sounding a note of deep skepticism about prediction markets.\nNathan Posner/Anadolu via Getty ImagesAsk a member of Congress about the rise of prediction markets, and there's a decent chance they'll air some concerns.\nAnd many on Capitol Hill still have yet to make up their minds when it comes to prediction markets.\nTorres, who said that he monitored prediction markets during the 2024 election alongside polling, said he could see the potential in that respect.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2026-02-07T09:49:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MTA=",
    "url": "https://uk.finance.yahoo.com/news/silver-heads-towards-70-precious-metals-end-volatile-week-lower-105012693.html",
    "title": "Silver dips nearer $70 as precious metals end volatile week lower",
    "summary": "Gold (GC=F) and silver (SI=F)Silver prices took the headlines in precious metals on Friday, with a dip below the $74 per ounce mark and a 4.7% selloff for silver futures (SI=F) contracts.\nSilver is ending the week nearly 5.7% lower overall.\nMeanwhile, gold futures (GC=F) traded slightly lower, around the $4,880 per ounce mark, while spot prices were at $4,872.\nGold futures are set to end the week about 3.6% higher.\nOil prices headed for their first weekly dip of the year, despite an uptick on Friday, as the risk of a military conflict between Iran and the US waned.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-06T10:50:12Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MTE=",
    "url": "https://www.businessinsider.com/investment-banking-advising-secondaries-became-hottest-job-wall-street-2026-2",
    "title": "How this job went from the Wall Street equivalent of a used car dealer to the hottest gig for 2026",
    "summary": "In late January, JPMorgan Chase announced a new \"center of excellence\" in its investment bank: the Private Capital Advisory and Solutions group.\nMiller told Business Insider that the pace of the activity has become breathless.\nLast month, London-based banker Andrei Brougham joined Goldman Sachs from Rothschild to steer its EMEA secondaries advisory business.\nA February report from JPMorgan found that 76% of family offices still have no secondary private equity exposure, illustrating how much runway remains.\n\"I think it's a really big hiring story,\" she told Business Insider.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-09T10:34:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MTU=",
    "url": "https://www.businessinsider.com/giannis-antetokounmpo-kalshi-prediction-market-nba-gambling-2026-2",
    "title": "Giannis Antetokounmpo invests in Kalshi, a day after fans traded over $23 million on his NBA future",
    "summary": "\"I love the Kalshi markets and have been checking them often recently,\" Antetokounmpo said in a press release.\nKalshi users wagered on Giannis Antetokounmpo.\nKalshiSome Kalshi users, for instance, got a payday earlier this week by wagering on Antetokounmpo's future in the NBA.\nSome US lawmakers have also raised concerns that prediction markets veer too closely to traditional gambling, which is subject to stricter regulations.\nIn January, a lawmaker introduced a bill to ban government officials from engaging in insider trading in prediction markets.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-07T20:07:38Z",
    "source": "Business Insider"
  },
  {
    "id": "MTY=",
    "url": "https://www.businessinsider.com/kalshi-transfers-delayed-in-the-middle-of-super-bowl-2026-2",
    "title": "Some Kalshi transfers are delayed during the Super Bowl",
    "summary": "Kalshi said that some transfers on its prediction markets app are delayed because of the high volume of traffic during the Super Bowl.\n\"Some deposits are delayed because of the amount of traffic and deposits we're getting,\" Kalshi cofounder Luana Lopes Lara wrote on X on Sunday evening.\nOn X, some Kalshi users said that they felt relieved to receive an explanation for why their deposits did not go through.\nIn an X post, Kalshi said it saw over $325 million in volume less than an hour before the championship game started.\nKalshi, founded in 2018, lets users bet on the outcome of events such as elections, sports matches, and economic indicators.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-09T02:07:33Z",
    "source": "Business Insider"
  },
  {
    "id": "MTc=",
    "url": "https://www.theverge.com/policy/875665/live-nation-ticketmaster-settlement-doj-discussions-monopoly-trial",
    "title": "Live Nation’s monopoly trial is reportedly fracturing Trump’s Justice Department",
    "summary": "Posts from this author will be added to your daily email digest and your homepage feed.\nLive Nation executives have reportedly sidestepped the Justice Department’s antitrust division to negotiate directly with more sympathetic senior officials in the hopes of avoiding a monopoly trial.\nCiting “people familiar with the matter,” Semafor reports that some talks have excluded antitrust chief Gail Slater, who has pushed for a trial to take place in March after inheriting the case from the Biden administration.\n“This report contains misinformation about an ongoing matter that is confidential, but what can be said is that AAG Slater is very much involved” in the Live Nation matter, a Justice Department spokesman told Semafor.\nThis DOJ will always pursue what is in the best interest of the American people.”",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-09T12:22:41Z",
    "source": "The Verge"
  },
  {
    "id": "MTg=",
    "url": "https://finance.yahoo.com/news/tony-robbins-says-us-congress-120100463.html",
    "title": "Tony Robbins says US Congress quietly unlocked a door that America’s ultra-rich have used for decades. Capitalize now",
    "summary": "Those thresholds have historically restricted participation in private equity, venture capital and other alternative investments to institutions and high-net-worth households.\nHere's howBut according to best-selling author and motivational speaker Tony Robbins, that long-standing divide may soon be starting to close.\nVenture capital is where the early bets on future giants are placed.\nBut, for decades, venture capital has been one of the few remaining tables in finance where retail investors can’t get a seat.\nFundrise finally disrupted that dynamic a few years ago by launching a venture capital product with two goals.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-06T12:01:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MTk=",
    "url": "https://hbr.org/2026/02/do-you-know-what-your-customers-aspirations-are",
    "title": "Do You Know What Your Customers’ Aspirations Are?",
    "summary": "In his new book The Transformation Economy: Guiding Customers to Achieve Their Aspirations, B. Joseph Pine II argues that there is a new offering companies can provide: change.\nIn this adapted excerpt, he explores four types of aspirations people have and how companies can tap into them when creating their products, services, or experiences.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-06T14:00:00Z",
    "source": "Harvard Business Review"
  },
  {
    "id": "MjE=",
    "url": "https://www.cbc.ca/news/business/job-numbers-january-2026-9.7077050",
    "title": "Canada's economy lost 25,000 jobs in January, but unemployment rate ticked down to 6.5%",
    "summary": "The Canadian employment landscape was a mixed bag in January, with the economy losing 25,000 jobs but the unemployment rate cooling to 6.5 per cent, Statistics Canada said on Friday.\nWATCH | The Canadian employment landscape was a mixed bag last month: Canada's economy loses 25,000 jobs in January | Duration 3:27 Canada's economy lost 25,000 jobs in January, mostly due to a decline in part-time work, Statistics Canada said Friday.\nThe unemployment rate ticked down to 6.5 per cent — the lowest since September 2024 — as a result of fewer people actively searching for work.\n\"Is this bad news (drop in employment, with notable weakness in manufacturing) or good news (bigger drop in the unemployment rate, and a rise in hours worked)?\nMeanwhile, Alberta gained 20,000 jobs, Saskatchewan gained 6,100 jobs and Newfoundland and Labrador gained 3,800 jobs.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-06T13:39:37Z",
    "source": "CBC News"
  },
  {
    "id": "Mjg=",
    "url": "https://www.businessinsider.com/angel-investor-mentor-startups-became-better-founder-2026-2",
    "title": "I left Amazon and became an angel investor. Mentoring startups for 6 years made me a better founder.",
    "summary": "This as-told-to essay is based on a conversation with William Tunstall-Pedoe, 56, an angel investor and founder based in the UK.\nThat gave me the capital to invest in the next generation of startups when I left Amazon in 2016.\nI leaned into that opportunity, becoming both a mentor and a very active angel investor.\nI started saying yes to thingsWhen I left Amazon, I suddenly found myself with an empty calendar.\nWhen I later raised a friends-and-family round, it was largely made up of prominent angel investors I'd met through mentoring and angel investing.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-06T08:58:01Z",
    "source": "Business Insider"
  },
  {
    "id": "NDY=",
    "url": "https://www.businessinsider.com/nominations-entry-form-most-innovative-cmo-list-2026-2",
    "title": "Seeking nominations for Business Insider's most innovative CMOs of 2026 list — submit entries by March 27",
    "summary": "Business Insider is seeking nominations for our 11th annual list of the most innovative CMOs in the world.\nWe want to showcase the CMOs who are leading from the top and inspiring the next generation of marketers.\nWhile information about the individual's broader career history will be helpful context, the entries should focus on the impact nominees have had over the past 12 months.\nBusiness Insider's editorial team will judge and determine the list based on the nominations we receive and our own reporting.\nWe may contact you with follow-up questions or invitations for your nominee to be interviewed for additional articles and features.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2026-02-09T13:56:11Z",
    "source": "Business Insider"
  }
]