[
  {
    "url": "https://www.bbc.com/news/articles/cly147075p2o",
    "title": "First-year resident doctors back strike action over jobs shortage",
    "summary": "First-year resident doctors back strike action over jobs shortageSome 97% of those who voted back strike action on a turnout of 65%.\nBut by formally gaining a mandate for strike action it opens up a new avenue for industrial action.\nThe British Medical Association (BMA) union says thousands of resident doctors are ending up without speciality training places when they finish year two of training.\nNewly-qualified doctors in their first year of practice in England have voted in favour of strike action in a row over a shortage of jobs.\nDr Jack Fletcher, chair of the BMA's resident doctors committee, said: \"Doctors have spoken clearly - they won't accept that they face a career of insecurity at a time when the demand for doctors is huge.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-10-06T16:28:08Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/recession-consumer-spending-uneployment-jobs-business-investment-real-estate-2025-10",
    "title": "America Are Spending, but Weak Job Market Could Still Cause Recession",
    "summary": "It's true that consumer spending represents a significant share of the economy, accounting for roughly two-thirds of the country's GDP.\nThe notion that consumer spending can save the country from a recession contradicts several historical trends.\nAmerica's job market is looking weakThe better indicator to watch, if you were trying to anticipate a recession, is the labor market.\nWhile consumer spending has been doing quite well in recent years, the job market has been cooling.\nAnd even as this asset-driven boom has marched on, that has not kept broader labor market conditions from continuing to worsen.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-10-07T08:08:02Z",
    "source": "Business Insider"
  },
  {
    "url": "https://abcnews.go.com/Business/government-shutdown-halts-data-stokes-risk-economy-wobbles/story?id=126259604",
    "title": "Government shutdown halts data, stokes risk as economy wobbles, experts say",
    "summary": "The government shutdown halted the release of key economic data, choking off the flow of information as some experts warn the economy may be slipping toward a recession, some economists told ABC News.\nThe absence of government data heightens uncertainty at a fraught moment for the U.S. economy, potentially hamstringing responses from consumers, businesses and policymakers, some economists told ABC News.\n\"It adds to risk and uncertainty at a most inopportune time,\" Mark Hamrick, senior economic analyst at Bankrate, told ABC News.\nSome experts noted the continued availability of private sector data sources, though observers typically view such data as inferior to government statistics.\nAn absence of economic data could make it more difficult for observers to identify the economic impact of the shutdown, some experts said.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-06T17:44:02Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.macrumors.com/2025/10/05/remembering-steve/",
    "title": "Remembering Steve Jobs",
    "summary": "Today marks the 14th anniversary of Steve Jobs passing away, at the age of 56.\nCook also reflected on Jobs while opening Apple's first-ever event at Steve Jobs Theater in 2017.\nAt that event, Apple unveiled the iPhone X, which was a major update to the smartphone that Jobs had famously unveiled in 2007.\nThe Steve Jobs Archive website contains a collection of quotes, photos, videos, and emails from Jobs, and offers fellowships to young creators to follow in his footsteps.\nApple still has a \"Remembering Steve\" page on its website.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-05T14:22:02Z",
    "source": "MacRumors"
  },
  {
    "url": "https://finance.yahoo.com/news/america-economy-sugar-high-warns-103054042.html",
    "title": "America’s economy is on a ‘sugar high’ warns Ken Griffin, and investors retreating to gold is one sign of a comedown",
    "summary": "Citadel founder and CEO Ken Griffin cautioned that America’s market rally is being propped up by policies better suited to a recession than a growing economy.\nSpeaking in New York, he said fiscal and monetary policies have created a “sugar high” that masks underlying risks like inflation and dollar weakness.\nDespite booming equities, Griffin pointed to gold’s record surge—up more than 50% this year—as evidence investors are quietly hedging against U.S. sovereign risk.\nMoreover, consumer spending is continuing to hold up despite sticky inflation and a weaker job market, providing a steady foundation for growing business confidence.\nThis environment means “we’re definitely on a bit of a sugar high in the U.S. economy right now,” according to Griffin.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-07T10:30:54Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/cg5e9zlpz6eo",
    "title": "British parts found in Russian drones, Zelesnky says",
    "summary": "British parts found in Russian drones, Zelensky says\"We take reports of goods from UK companies being found in Russian weaponry incredibly seriously,\" a government spokesperson said.\nThe Ukrainian president called for further \"effective\" sanctions after saying parts originating in allied countries including Germany, Japan and the US have been identified in Russian weapons.\nBritish microcomputers were among more than 100,000 foreign-made parts contained in Russian missiles and drones used in Sunday's deadly strikes on Ukraine , Volodymyr Zelensky has said.\nComponents originating in China, Taiwan and the Netherlands have also been identified in Russian weapons, he continued.\nSince Russia launched its full-scale invasion of Ukraine in February 2022, it has become the most-sanctioned nation in the world.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-10-06T18:03:55Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/saved-over-100000-working-two-remote-jobs-same-time-2025-10",
    "title": "I saved over $100,000 by working two full-time remote jobs for a year. It was chaos at times but worth it.",
    "summary": "When I picked up the second job, it was always meant to be short-term.\nThe second job was always the one I planned to leaveI didn't care about it.\nI think you can have 10 jobs if you want to — if you're willing to get the work done.\nThat's when I started thinking: If I have two jobs and one lets me go, I'll still have a job.\nI quit the second job after 12 months, and now I have a different job, but I'm happy with just the one.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-06T09:05:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://finance.yahoo.com/news/strong-buy-stocks-october-6th-094200682.html",
    "title": "New Strong Buy Stocks for October 6th",
    "summary": "Here are five stocks added to the Zacks Rank #1 (Strong Buy) List today:Pagaya Technologies Ltd. PGY: This product-focused technology company has seen the Zacks Consensus Estimate for its current year earnings increasing 12.3% over the last 60 days.\nSumitomo Mitsui Financial Group Inc Price and ConsensusSumitomo Mitsui Financial Group Inc Price and ConsensusSumitomo Mitsui Financial Group Inc price-consensus-chart | Sumitomo Mitsui Financial Group Inc QuoteHF Sinclair Corporation DINO: This independent energy company has seen the Zacks Consensus Estimate for its current year earnings increasing 24.8% over the last 60 days.\nTPG Inc. Price and ConsensusTPG Inc. Price and ConsensusTPG Inc. price-consensus-chart | TPG Inc. QuoteOkeanis Eco Tankers Corp. ECO: This shipping company has seen the Zacks Consensus Estimate for its current year earnings increasing 13.9% over the last 60 days.\nOkeanis Eco Tankers Corp. Price and ConsensusOkeanis Eco Tankers Corp. Price and ConsensusOkeanis Eco Tankers Corp. price-consensus-chart | Okeanis Eco Tankers Corp. QuoteYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nToday, you can download 7 Best Stocks for the Next 30 Days.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-06T09:42:00Z",
    "source": "Yahoo Entertainment"
  }
]