[
  {
    "url": "https://gizmodo.com/welcome-to-the-jobless-growth-economy-2000673236",
    "title": "Welcome to the ‘Jobless Growth’ Economy",
    "summary": "America is entering an era of “jobless growth,” according to analysts at Goldman Sachs.\nThe memo, written by economists David Mericle and Pierfrancesco Mei and spotted by Fortune, warns that the current market of “modest job growth alongside robust GDP growth” is likely the new normal going forward.\nThe thing about senior roles is that you need people with experience to fill them.\nThat hasn’t materialized even a little thus far, but the idea that it will has severely messed up the job market.\nOne thing is for sure: AI is going to be transformative for the economy.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-17T12:30:59Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://uk.finance.yahoo.com/news/imf-global-debt-reeves-jobs-economy-weekend-budget-125851835.html",
    "title": "The Weekend: IMF warns of global debt emergency as Reeves grapples with slowing jobs market",
    "summary": "There was a stark warning from the IMF this week as it predicted government debt across the world would hit the highest level since the aftermath of World War Two by the end of the decade.\nThe report comes ahead of the government's autumn budget, where chancellor Rachel Reeves is expected to raise the tax burden on families and businesses.\nThe official figures showed pay growth slowing and unemployment edging higher in the three months to August.\nPerhaps Reeves could find inspiration in the work of Joel Mokyr, Philippe Aghion and Peter Howitt, who were this week awarded the 2025 Nobel economics prize for \"having explained innovation-driven economic growth\".\nThe American, French and Canadian economists \"have taught us that sustained growth cannot be taken for granted,” the prize-awarding body said.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-10-18T12:58:51Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/work-wages-living-comfortably-financially-struggling-jobs-gallup-2025-10",
    "title": "One Chart Shows How America's Workforce Is Doing Financially",
    "summary": "Newly released survey results show the financial security of working adults in the US.\nNewly released survey results show the financial security of working adults in the US.\nEzra Bailey/Getty ImagesNewly released survey results show the financial security of working adults in the US.\nEzra Bailey/Getty ImagesA lot of people working in the information sector feel good about their finances, while those in warehousing are struggling.\nFinancial security varies among Americans across different industries, but no field had a majority of people feeling like they were living comfortably.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-16T15:35:47Z",
    "source": "Business Insider"
  },
  {
    "url": "https://gizmodo.com/ai-wont-replace-jobs-tech-bros-want-you-terrified-2000670808",
    "title": "AI Won’t Replace Jobs, but Tech Bros Want You to Be Afraid It Will",
    "summary": "During her tenure in the Biden administration, Khan was known for her firm regulatory stance against big tech monopolies.\n“The way that tech bosses motivated tech workers was appealing to their sense of mission,” Doctorow said.\nMeanwhile, big tech companies are spending big and making record profits.\nThe AI bubble is worse than 2008If Doctorow’s estimates are true, then AI won’t take over any jobs.\n“There have been increasing discussion about how we may actually be just seeing a big AI bubble,” the former FTC chair said.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-15T14:20:54Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.yahoo.com/news/articles/kremlin-rejects-trumps-view-russian-112721598.html",
    "title": "Kremlin rejects Trump's view that the Russian economy could collapse",
    "summary": "By Guy Faulconbridge, Olesya Astakhova and Gleb StolyarovMOSCOW (Reuters) -The Kremlin on Wednesday pushed back at U.S. President Donald Trump's warning that the Russian economy was going to collapse, saying that Russia had considerable reserves and was strong enough to allow President Vladimir Putin to achieve his goals.\nTrump on Tuesday said that Putin should settle the war in Ukraine which was making Russia look bad.\nHe also mentioned \"long lines waiting for gasoline\" and said the Russian \"economy is going to collapse\".\n\"As for the Russian economy, it has a sufficient and considerable margin of safety to allow the country's leadership and all of us to implement the plans that we set for ourselves,\" Peskov told reporters.\nDuring Putin's first two terms as president from 2000 to 2008, Russia's economy soared to $1.7 trillion from less than $200 billion in 1999.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-15T11:27:21Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.macrumors.com/2025/10/15/steve-jobs-coin-design/",
    "title": "Steve Jobs to Be Featured on U.S. Commemorative $1 Coin in 2026",
    "summary": "The United States Mint will soon begin producing a new $1 American Innovation Coin featuring Steve Jobs, and the design for the coin was previewed today.\nThe $1 Steve Jobs Coin features a young Steve Jobs in a turtleneck, jeans, and sneakers.\nWhen it launches in 2026, the Steve Jobs coin will be purchasable from the U.S. Mint website.\nThe Steve Jobs coin is part of a multi-year series that started in 2018.\nCalifornia Governor Gavin Newsom recommended Apple co-founder Steve Jobs for the coin earlier this year.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-15T20:05:57Z",
    "source": "MacRumors"
  },
  {
    "url": "https://slashdot.org/story/25/10/17/0836202/only-40-of-workers-have-high-quality-jobs-gallup-finds",
    "title": "Only 40% of Workers Have High-Quality Jobs, Gallup Finds",
    "summary": "Want to read Slashdot from your mobile device?\nPoint it at m.slashdot.org and keep reading!",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-10-17T14:00:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://www.calculatedriskblog.com/2025/10/2009-calling-bottom-for-economy.html",
    "title": "Calculated Risk: 2009: Calling the Bottom for the Economy",
    "summary": "In early 2009, many analysts were predicting the 2nd Great Depression.\nHowever I started seeing some positive signs ... and I was able to call the end of the recession in mid-2009.\nFrom January 2009: Vehicle SalesDavid Rosenberg at Merrill Lynch wrote a research piece last week: \"Not Your Father’s Recession ...(But Maybe Your Grandfather’s)\" (no link)Needless to say, the piece wasn't too upbeat.\nBut I was intrigued by some of the comments on vehicle sales.\nEven though most of the economic news will be ugly in 2009, my guess is all three of these series will find a bottom (or at least the pace of decline will slow significantly).",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2025-10-15T12:11:00Z",
    "source": "Calculatedriskblog.com"
  },
  {
    "url": "https://www.businessinsider.com/best-advice-i-ever-got-about-work-life-balance-came-from-partners-mom-2025-10",
    "title": "The best advice I ever got about work-life balance came from a past boyfriend's mom. It's shaped my life for 2 decades.",
    "summary": "I didn't realize how much one piece of advice could shift my mindset on how to prioritize my career and my personal life.\nI didn't realize how much one piece of advice could shift my mindset on how to prioritize my career and my personal life.\nShe smiled gently and told me, \"You need to work to live, not live to work.\"\nA career didn't mean much if I wasn't enjoying my life in between shifts.\nSo I left the profession and started working from home, again finding a balance between work and life.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-18T13:35:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/news/801257/amazon-nuclear-energy-reactor-first-look",
    "title": "Amazon shares a ‘first look’ at new nuclear facility",
    "summary": "Amazon shared some new details about its plans to help deploy more nuclear energy across Washington State, where the company is headquartered.\nA rendering of the Cascade Advanced Energy Facility.\nA rendering of the Cascade Advanced Energy Facility.\nCalled the Cascade Advanced Energy Facility, it’ll include three sections with a combined capacity of 960 megawatts, about enough electricity to power 770,000 homes in the US.\nImage: X-energy via AmazonAmazon’s blog post today says that the Cascade facility should create about 100 permanent jobs, as well as more than 1,000 construction jobs.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-16T22:35:54Z",
    "source": "The Verge"
  }
]