[
  {
    "id": "MA==",
    "url": "https://www.businessinsider.com/charts-president-donald-trump-first-year-economy-tariffs-jobs-inflation-2026-1",
    "title": "The First Year of Donald Trump's Economy in 7 Charts",
    "summary": "The economy has changed a lot in the first year of Trump's second term.\nThe economy has changed a lot in the first year of Trump's second term.\nAlex Wong/Getty ImagesThe economy has changed a lot in the first year of Trump's second term.\nBusiness Insider looked back at the economy under Trump so far.\nThe charts below highlight how the economy evolved in Trump's first year.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-20T09:27:01Z",
    "source": "Business Insider"
  },
  {
    "id": "NA==",
    "url": "https://www.businessinsider.com/captialism-sink-or-swim-era-work-2026-1",
    "title": "America's new sink-or-swim era of work is here",
    "summary": "Reuters/Lucas JacksonTo be sure, employers' labor costs — typically their largest expense — are on the rise.\nEmployment experts say the uncertainty helps explain why the job market has been stuck in a low-hire, low-fire state.\nThe result is a labor market full of contradictions, said Nicole Bachaud, an economist at ZipRecruiter.\nStill, many professionals lack confidence in the job market as career opportunities in once-reliable sectors, such as technology and the federal government, have thinned.\nWorkers who understand AI are \"able to move faster, make better decisions, and take on higher-leverage work,\" he said.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-19T10:42:01Z",
    "source": "Business Insider"
  },
  {
    "id": "Ng==",
    "url": "https://it.slashdot.org/story/26/01/19/002212/young-college-graduates-suddenly-arent-finding-jobs-faster-than-non-college-graduates",
    "title": "Young US College Graduates Suddenly Aren't Finding Jobs Faster Than Non-College Graduates",
    "summary": "The trouble with computers is that they do what you tell them, not what you want.\n-- D. Cohen",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-19T00:04:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "Nw==",
    "url": "https://uk.finance.yahoo.com/news/mortgage-predictions-2026-interest-rates-bank-of-england-060057879.html",
    "title": "Eight mortgage predictions for 2026",
    "summary": "Last year was all about mortgage rates coming down, with four Bank of England cuts, taking the base rate from 4.75% at the beginning of the year, to 3.75% by December.\nFor the most part, mortgage lenders responded by reducing their rates too.\nWhat 2026 will hold for the mortgage market is more difficult to predict: will rates continue with their downward trajectory?\nHow will the mortgage market support first-time buyers?\nWe spoke to five mortgage experts to get their take on what will happen to products, rates and the market in general.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-19T06:00:57Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MTA=",
    "url": "https://www.businessinsider.com/hottest-housing-markets-highest-demand-competition-2026-1",
    "title": "Get ready to enter a bidding war in these 10 housing markets this year",
    "summary": "The Northeast made up more than half of the top 10 hottest metros for 2026.\nThe Northeast made up more than half of the top 10 hottest metros for 2026.\nBruce Peter Morin/Getty ImagesThe Northeast made up more than half of the top 10 hottest metros for 2026.\nAccording to Zillow, 55.6% of sales in San Jose, California, were over the list price as of November 2025 due to an inventory drop.\nHere are the top 10 metros that Zillow predicts to be in high demand in 2026.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-19T16:35:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MTI=",
    "url": "https://www.aljazeera.com/economy/2026/1/20/trump-made-many-statements-on-us-economy-most-are-untrue",
    "title": "Trump made many statements on US economy. Most are untrue",
    "summary": "United States President Donald Trump has made a range of claims about the state of the US economy.\nAl Jazeera examined some of his statements on the economy:Core inflation has been at 1.6 percent for the past three months, and there is “no inflation”.\nIn 2024, Biden raised tariffs on Canadian lumber to 14.5 percent from 8.5 percent, continuing a Trump-era policy.\nTrump administration removed more than 270,000 bureaucrats from the federal government, but they are going to the private sector.\nOxford Economics, which tracks private construction on transportation equipment, found that “nominal spending” in 2025 was trending downwards after hitting a peak during the final year of the Biden administration.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-20T22:23:13Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MTM=",
    "url": "https://finance.yahoo.com/news/us-futures-edge-higher-gold-045146410.html",
    "title": "US stocks recover half of the prior day's plunge after Trump calls off Greenland-related tariffs",
    "summary": "Besides the progress on Greenland, they also got help from a calming of yields in Japan’s jumpy bond market.\nOn one hand, the pattern has given rise to the “TACO” acronym suggesting “Trump Always Chickens Out” if financial markets react strongly enough.\nOn the other, Trump has ultimately struck deals that outsiders may have earlier considered unlikely, ones that he’s crowed about later.\nHelping to lead the U.S. stock market Wednesday was Halliburton.\nUnited Airlines climbed 2.2% after likewise reporting a better profit for the final three months of 2025 than analysts expected.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-21T04:51:46Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MTQ=",
    "url": "https://www.aljazeera.com/economy/2026/1/19/the-us-economy-seems-strong-after-a-year-of-trump-but-is-it-really",
    "title": "The US economy seems strong after a year of Trump, but is it really?",
    "summary": "Over the past year, United States President Donald Trump has unleashed a slew of policies that have upended businesses, supply chains and jobs.\nYet the US economy seems to be growing at a healthy clip, and the unemployment rate is in a safe zone.\nThe reality, experts say, is that the stock market boom has helped to mask deeper underlying problems in the economy.\n“The shock and awe we anticipated just didn’t materialise,” Bernard Yaros, lead US economist at Oxford Economics, told Al Jazeera.\n“The surge in policy uncertainty this year has had an outsize effect on smaller firms,” Oxford Economics said in a November report.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-19T16:51:42Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "Mzk=",
    "url": "https://www.npr.org/2026/01/20/nx-s1-5670378/trump-energy-promises-one-year",
    "title": "Trump promised to cut energy bills in half. One year later, has he delivered?",
    "summary": "Trump promised to cut energy bills in half.\ntoggle caption Joe Raedle/Getty ImagesOn the campaign trail, President Trump promised to cut Americans' energy bills in half — cheaper gasoline, cheaper electricity.\nKou says that for 2025, natural gas prices were the clear driver of increases.\nU.S. exports of natural gas have increased (one of API's requests), and sending more natural gas overseas means less is available domestically.\n\"It doesn't solve everything, but it provides some immediate relief … and that just has not been as much of a focus\" for the Trump administration, he says.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-20T10:00:00Z",
    "source": "NPR"
  },
  {
    "id": "NDY=",
    "url": "https://www.npr.org/2026/01/19/nx-s1-5640006/trump-has-rolled-out-many-of-the-project-2025-policies-he-once-claimed-ignorance-about",
    "title": "Trump has rolled out many of the Project 2025 policies he once claimed ignorance about",
    "summary": "Trump has rolled out many of the Project 2025 policies he once claimed ignorance abouttoggle caption Samuel Corum/Getty ImagesPresident Trump once insisted he had \"nothing to do with Project 2025,\" the right-wing policy plan that became a key flashpoint during the presidential campaign.\nSponsor MessageTrump soon unleashed a flurry of orders reshaping the government, many of which were outlined in Project 2025.\n\"I would say that Project 2025 was largely standard conservative fare, but with a bit more of a MAGA flavor than previously.\"\nPaul Dans, the director of project 2025, says he never took the attacks personally, which he chalked up to political calculus.\nHe boasted of meeting with \"Russ Vought, he of PROJECT 2025 Fame,\" while threatening to dismantle federal agencies.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-19T10:00:00Z",
    "source": "NPR"
  },
  {
    "id": "NTM=",
    "url": "https://www.businessinsider.com/elon-musk-political-spending-kentucky-nate-morris-2026-1",
    "title": "Elon Musk is spending big money on politics again",
    "summary": "Elon Musk's $10 million investment in a Kentucky Senate race would be his largest single political contribution since the 2024 election.\nElon Musk's $10 million investment in a Kentucky Senate race would be his largest single political contribution since the 2024 election.\nWin McNamee/Getty ImagesElon Musk's $10 million investment in a Kentucky Senate race would be his largest single political contribution since the 2024 election.\nWin McNamee/Getty ImagesJust months ago, Elon Musk seemed to swear off major political spending.\nMusk spending big on an election would mark something of a reversal from the middle of last year.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-20T15:57:26Z",
    "source": "Business Insider"
  },
  {
    "id": "NjY=",
    "url": "https://www.businessinsider.com/trump-tariffs-paid-almost-entirely-by-americans-german-study-2026-1",
    "title": "US tariffs are paid almost entirely by Americans, a German study finds",
    "summary": "The study, published Monday, said that the $200 billion increase in customs revenue that the US government raised in 2025 was a \"tax paid almost entirely by Americans.\"\nThe research contradicts Trump's messaging that tariff costs would not be paid by Americans, but by other countries and overseas exporters.\nAnalysts at Deutsche Bank and Bank of America also said last year that Americans were the ones paying for the tariffs.\nMany of Trump's tariff policies could also be undone.\nThe Supreme Court is expected to rule soon on the legality of a host of Trump's tariffs that were instituted under an emergency national security law.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-20T00:00:18Z",
    "source": "Business Insider"
  }
]