[
  {
    "id": "MA==",
    "url": "https://www.wired.com/story/the-political-war-over-prediction-markets-is-just-getting-started/",
    "title": "The War Over Prediction Markets Is Just Getting Started",
    "summary": "The other insists they are just giving people access to legitimate financial markets already subject to adequate government oversight.\nOnce a niche financial experiment, prediction markets have rapidly become entrenched in mainstream culture, a transformation that has brought vast sums of money into play.\nBut critics say that prediction markets, at least in their current form, are exploitative.\nAttorneys general and gambling regulators in many states say sports contracts on prediction markets should follow state gambling laws.\nFederal lawmakers have also started weighing in; earlier this month, 23 Democratic senators voiced support for efforts to push prediction markets to abide by state gambling laws.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-20T10:30:00Z",
    "source": "Wired"
  },
  {
    "id": "MQ==",
    "url": "https://www.businessinsider.com/us-economy-outlook-joseph-stiglitz-recession-inflation-job-market-tariffs-2026-2",
    "title": "3 Signs US Economy Will 'Get Worse,' According to Joseph Stiglitz",
    "summary": "Joseph Stiglitz, a Nobel laureate and Columbia economist, said he believes the US economy would continue to weaken when speaking to CNBC about his macro outlook on Thursday.\n\"Not great right now, and the prospects are that we're just going to get worse,\" Stiglitz said of his economic outlook.\nBut there are a few under-the-surface details that suggest the economy isn't on a good path, Stiglitz suggested.\nBloomberg/Getty ImagesStiglitz also pointed to the push from the Trump administration to lower interest rates.\nIn that scenario, the economy could grow without stoking inflation, meaning the US could have room to lower interest rates more than markets expect.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-20T10:15:01Z",
    "source": "Business Insider"
  },
  {
    "id": "Mg==",
    "url": "https://abcnews.com/Business/us-economy-expected-slowed-end-2025/story?id=130296352",
    "title": "US economy slowed more than expected at end of 2025",
    "summary": "US economy slowed more than expected at end of 2025A shopper selects items at a grocery store on Feb. 10, 2026, in Chicago.\nA shopper selects items at a grocery store on Feb. 10, 2026, in Chicago.\nA shopper selects items at a grocery store on Feb. 10, 2026, in Chicago.\nA shopper selects items at a grocery store on Feb. 10, 2026, in Chicago.\nThe U.S. economy slowed more than expected over the final months of 2025, federal government data on Friday showed.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-20T13:50:41Z",
    "source": "Abcnews.com"
  },
  {
    "id": "Mw==",
    "url": "https://uk.finance.yahoo.com/news/gold-prices-oil-pound-commodities-dollar-interest-rates-federal-reserve-uk-inflation-093233998.html",
    "title": "Gold price below $5,000 as investors wait on Fed guidance for clues",
    "summary": "Gold prices remained below the $5,000 threshold on Wednesday as investors awaited the release of minutes from the Federal Reserve’s January meeting for further guidance on the outlook for US interest rates.\n“Gold prices are taking support above $4,850 today... this is a technical bounce” after prices fell in the previous session on easing geopolitical tensions\", Ajay Kedia, director at Kedia Commodities, told Reuters.\nNon-yielding bullion typically benefits from lower interest rate environments.\nHowever, Fed governor Michael Barr said another rate cut could come somewhere well down the road, citing ongoing risks to the US inflation outlook.\n“Our primary interest here is we don't want Iran to get a nuclear weapon,” the vice president said during an interview with Fox News.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-18T09:32:33Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NA==",
    "url": "https://www.businessinsider.com/nevada-sues-kalshi-trump-cftc-with-prediction-markets-2026-2",
    "title": "Nevada sues Kalshi as federal regulators say back off",
    "summary": "Nevada gambling regulators sued the prediction markets company Kalshi on Tuesday, saying the platform's rapid growth forced their hand.\nA Kalshi spokesperson declined to comment on Tuesday afternoon, but the company swiftly asked a federal court to take over the new state case.\nThe CFTC on Tuesday sided with another events-contracts company that is fighting with Nevada regulators, and its chairman, Michael Selig, filmed a video statement defending the new platforms.\nEconomists and political scientists have long been fascinated by prediction markets as a way to channel the so-called wisdom of the crowds.\nLegal battles are pending on the East Coast as well, with regulators in Maryland and New Jersey having clashed with prediction markets.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-18T01:17:02Z",
    "source": "Business Insider"
  },
  {
    "id": "NQ==",
    "url": "https://www.npr.org/2026/02/20/nx-s1-5718214/economy-gdp-tariffs-inflation-consumer-spending",
    "title": "The economy slowed in the last 3 months of the year — but was still solid in 2025",
    "summary": "The economy slowed in the last 3 months of the year — but was still solid in 2025toggle caption Jeremy Weine/Getty ImagesThe U.S. economy slowed in the final months of last year, but it continued to expand, thanks to robust consumer spending and business investment in artificial intelligence.\n(Both measures compare the size of the economy at year's end to where it was 12 months earlier.)\nConsumer spending is the biggest driver of the U.S. economy, and that trend continued in the final months of last year.\nThat made GDP look weaker in the early months of the year.\nThat subtracted from fourth-quarter growth, although much of that will be made up in the early months of 2026.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-20T13:52:51Z",
    "source": "NPR"
  },
  {
    "id": "Ng==",
    "url": "https://www.bbc.com/news/articles/c5y6g57j3meo",
    "title": "Plan to increase youth minimum wage could be delayed",
    "summary": "He argued that it was fair to pay a lower rate to young workers because \"if someone is less experienced and less well trained than someone who has been doing the job for a while they are not necessarily going to be as productive\".",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-18T07:33:24Z",
    "source": "BBC News"
  },
  {
    "id": "Nw==",
    "url": "https://www.businessinsider.com/federal-reserve-study-kalshi-economic-forecasting-2026-2",
    "title": "Kalshi may be more useful than some traditional economic forecasting methods, Fed researchers find",
    "summary": "Lighning bolt icon An icon in the shape of a lightning bolt.\n\"Our results suggest that Kalshi markets provide a high-frequency, continuously updated, distributionally rich benchmark that is valuable to both researchers and policymakers,\" the researchers wrote.\nThe researchers found that Kalshi actually beat traditional methods for two different purposes.\nThe researchers found that the median and mode of Kalshi's prediction markets have a \"perfect forecast record\" on the day before the Fed meeting, which is a \"statistically significant improvement\" over Fed Funds futures.\nKalshi is also useful because it provides real-time responses to events, offering more up-to-date information than typical survey and forecasting methods, according to the researchers.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-19T16:50:12Z",
    "source": "Business Insider"
  },
  {
    "id": "OA==",
    "url": "https://www.bbc.com/news/articles/c80jy2lkdg3o",
    "title": "Reform plans to keep UK's budget watchdog",
    "summary": "In January, Reform UK leader Nigel Farage told the Telegraph he had \"questioned the need\" for the OBR, which he accused of \"effectively dictating to elected politicians what they should or should not do\".",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2026-02-18T01:39:39Z",
    "source": "BBC News"
  },
  {
    "id": "MTM=",
    "url": "https://finance.yahoo.com/news/top-trump-advisor-furious-true-210501303.html",
    "title": "Top Trump advisor furious about true cost of tariffs being revealed, vows to punish New York Fed for ‘worst paper’ ever in history",
    "summary": "A top White House economic official on Wednesday blasted independent research on tariffs, dismissing its findings as inaccurate and misleading.\nMore from Yahoo Scout How does the White House defend current tariff policy?\nWhy did White House officials criticize Federal Reserve research?\nThe exact findings from the New York Fed show a dire scenario for Americans.\nThe New York Fed declined to comment.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2026-02-18T21:05:01Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MjQ=",
    "url": "https://www.theverge.com/podcast/880778/ai-talent-war-hiring-frenzy-openai-anthropic-ipo",
    "title": "Money no longer matters to AI’s top talent",
    "summary": "They’re really saying these things.\nI’ve been dying to really dig in and try to unpack what’s going on with all these talent moves in AI.\nAt the same time, the incentives of the AI companies themselves are going from raising money to making money.\nThe AI industry right now is full of drama.\nThere’s big characters, bitter rivalries, lots of money, and really, really long blog posts about the end of the world.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-19T14:49:05Z",
    "source": "The Verge"
  },
  {
    "id": "NDM=",
    "url": "https://www.wired.com/story/the-supreme-courts-tariff-ruling-wont-bring-car-prices-back-to-earth/",
    "title": "The Supreme Court’s Tariff Ruling Won’t Bring Car Prices Back to Earth",
    "summary": "Now, despite a US Supreme Court ruling that will nix some of those Trump tariffs, car buyers will likely get no respite.\nAutomakers have actually done an OK job shielding consumers from the effects of tariffs, Caldwell says.\nEven as retailers have blamed tariffs for steadily rising prices of consumer goods like electronics and appliances, car prices are up just 1 percent since this time last year, the firm’s data shows.\nBut as the tariff regime drags on, that could change in ways that make new-car buyers even less happy.\n“If cost pressures continue to build, automakers may have less room to shield shoppers from higher prices,” Caldwell says, “but for now, the broader market impact is still playing out.”",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-21T00:10:01Z",
    "source": "Wired"
  },
  {
    "id": "NTY=",
    "url": "https://www.wired.com/story/they-bet-against-trumps-tariffs-now-they-stand-to-make-millions/",
    "title": "They Bet Against Trump’s Tariffs. Now They Stand to Make Millions",
    "summary": "Investment firms are on track for an enormous payday after the Supreme Court of the United States (SCOTUS) struck down President Donald Trump’s signature tariff policy on Friday.\nWhen Trump introduced sweeping tariffs on foreign goods last April, hedge funds and specialist investment firms began to bet on the possibility that the courts might rule that he had violated the law.\nEven then, he says, the administration may choose to challenge any lower court ruling that requires the government to refund tariff payments.\nThe prevailing uncertainty leaves the investment firms holding refund claims with a dilemma: Should they bank some winnings by flipping the claims to another buyer, or wait out the legal wrangling?\n“Trump is Trump is Trump, man,” says Braziel.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-20T21:05:44Z",
    "source": "Wired"
  },
  {
    "id": "NjA=",
    "url": "https://petapixel.com/2026/02/20/us-supreme-court-rules-trumps-tariffs-are-illegal/",
    "title": "US Supreme Court Rules Trump’s Tariffs Are Illegal",
    "summary": "The United States Supreme Court has struck down President Trump’s controversial global tariffs in a 6-3 ruling.\nEvery lower court that had considered Trump’s use of tariffs had ruled against him.\nToday, the Supreme Court has validated what we’ve been saying all along: these tariffs were unlawful from the start.\n“Small businesses are rightfully worried that the Administration will respond to this legal defeat by simply reimposing the same tariff policy through other means.\nTariffs imposed under IEEPA crippled small businesses; tariffs reimposed under different statutory approaches would have the same destructive effect.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2026-02-20T15:49:58Z",
    "source": "PetaPixel"
  },
  {
    "id": "NjE=",
    "url": "https://www.businessinsider.com/coo-job-is-especially-challenging-with-tariff-uncertainty-scotus-2026-2",
    "title": "COO's Jobs Are Especially Challenging Due to Tariff Uncertainty",
    "summary": "Friday's tariff ruling has once again put America's supply-chain bosses in a bind.\n\"Tariffs are written in DC, and they're felt in the COO's inbox,\" Jason Schloetzer, a professor at Georgetown's McDonough School of Business, told Business Insider.\nMany companies are still grappling with the impact of actions they took last year to cope with Trump's tariff hikes, said Rob Lalka, who teaches entrepreneurship at Tulane University.\nNow, with the fate of Trump's tariffs up in the air, COOs are experiencing the kind of whiplash that can be debilitating, said Lalka, especially for those at startups and small businesses with limited resources.\nOmni, which imports goods from Spain and exports to Canada, lost sales last year due to the Trump administration's tariffs, Smith said.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-21T10:39:01Z",
    "source": "Business Insider"
  },
  {
    "id": "NjI=",
    "url": "https://www.project-syndicate.org/commentary/trump-administration-financial-reforms-could-have-far-reaching-consequences-by-dambisa-moyo-2026-02",
    "title": "Five US Policy Shifts Could Reshape Financial Markets",
    "summary": "Email requiredPassword required Remember me?\nPlease enter your email address and click on the reset-password button.\nIf your email exists in our system, we'll send you an email with a link to reset your password.\nPlease note that the link will expire twenty-four hours after the email is sent.\nIf you can't find this email, please check your spam folder.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2026-02-18T15:03:30Z",
    "source": "Project Syndicate"
  }
]