[
  {
    "id": "MA==",
    "url": "https://www.businessinsider.com/k-shaped-economy-wealth-gap-gary-cohn-trump-economic-advisor-2026-2",
    "title": "Trump's former chief economic advisor says workers are 'suffering' in America's K-shaped economy",
    "summary": "Gary Cohn, a former economic advisor to Trump and the vice chairman of IBM.\nGary Cohn, a former economic advisor to Trump and the vice chairman of IBM.\nPATRICK T. FALLON/AFP via Getty ImagesGary Cohn, a former economic advisor to Trump and the vice chairman of IBM.\nGary Cohn, Trump's former chief economic advisor, said both these realities are true right now in America.\nThat's when people at the top see profound economic growth, while those at the bottom, who are more sensitive to economic shifts, face financial stress.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-01T19:49:55Z",
    "source": "Business Insider"
  },
  {
    "id": "MQ==",
    "url": "https://www.bbc.com/news/articles/ce3k4xdqyp1o",
    "title": "Rachel Reeves defends 'fair and reasonable' student loans system",
    "summary": "Pierre said people going to university aged 17 or 18 are advised \"this is a loan you're not going to notice\", with low rates of interest that won't affect you getting a mortgage, \"but it turns out, it does,\" he said.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-01-31T11:12:38Z",
    "source": "BBC News"
  },
  {
    "id": "Mg==",
    "url": "https://www.theatlantic.com/newsletters/2026/01/markets-response-trump-investors-chaos/685844/",
    "title": "The Markets Are Getting Used to Trump",
    "summary": "Lately, investors seem to be holding something back—amid a barrage of potentially seismic decisions from the White House, markets have barely budged.\nThe “TACO” theory (short for “Trump Always Chickens Out”) emerged as a way to describe his tendency to overpromise.\nThe economists I spoke with stressed that although these three cases are distinct, on the whole, markets have become more inured to the Trump administration’s actions.\nFinancial markets are in the business of pricing threats—and Trump will surely keep them coming.\nPresident Trump said he will nominate Kevin Warsh, a former Federal Reserve governor, to succeed Jerome Powell as Fed chair when Powell’s term ends in mid-May.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-31T01:10:00Z",
    "source": "The Atlantic"
  },
  {
    "id": "NA==",
    "url": "https://www.businessinsider.com/jpmorgan-beauty-banker-rhode-sale-fei-fei-zhang-2026-2",
    "title": "This JPMorgan banker sold Hailey Bieber's skincare brand for $1 billion. Here's how she spots winners.",
    "summary": "Fei-Fei Zhang, a managing director at JPMorgan Chase, helped steer the firm's work on the $1 billion sale of Rhode, the beauty brand co-founded by Hailey Bieber.\nFei-Fei Zhang, a managing director at JPMorgan Chase, helped steer the firm's work on the $1 billion sale of Rhode, the beauty brand co-founded by Hailey Bieber.\nCourtesy of JPMorganFei-Fei Zhang, a managing director at JPMorgan Chase, helped steer the firm's work on the $1 billion sale of Rhode, the beauty brand co-founded by Hailey Bieber.\nZhang was a senior leader on the team behind the $1 billion sale of Rhode, the skincare brand cofounded by Hailey Bieber, to e.l.f.\nWithin weeks, British skincare brand Medik8 was sold to cosmetics giant L'Oreal for more than $1 billion, which Zhang advised on.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-01T11:54:01Z",
    "source": "Business Insider"
  },
  {
    "id": "NQ==",
    "url": "https://indianexpress.com/article/business/in-headwinds-union-budget-2026-27-stays-the-course-batters-markets-with-tax-10508114/",
    "title": "In headwinds, Budget stays the course, batters markets with tax",
    "summary": "Union Minister for Finance Nirmala Sitharaman poses with her team for a photo op before leaving to present the Budget in New Delhi on Sunday.\n(Express Photo by Tashi Tobgyal) Union Minister for Finance Nirmala Sitharaman poses with her team for a photo op before leaving to present the Budget in New Delhi on Sunday.\nStory continues below this adUnion Finance Minister Nirmala Sitharaman presents Union Budget 2026, in New Union Finance Minister Nirmala Sitharaman presents Union Budget 2026, in New Delhi , on Sunday.\nUnion Finance Minister Nirmala Sitharaman during the post-Budget press conference in New Delhi on Sunday.\n(Express Photo: Tashi Tobgyal) Union Finance Minister Nirmala Sitharaman during the post-Budget press conference in New Delhi on Sunday.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-02T00:00:03Z",
    "source": "The Indian Express"
  },
  {
    "id": "Ng==",
    "url": "https://finance.yahoo.com/news/flooded-cheap-chinese-goods-latin-045553078.html",
    "title": "Flooded by cheap Chinese goods, Latin America is fighting back to protect its industries",
    "summary": "“Latin America has a solid middle class, relatively high purchasing power and real demand,” said Margaret Myers, director of the Asia and Latin America program at the Inter-American Dialogue think tank in Washington.\nChinese autos make inroads in Brazil and MexicoMexico and Brazil -- Latin America’s regional auto manufacturing centers -- also are under pressure from rising imports of low-priced Chinese cars.\nChinese automakers such as BYD and GWM see huge growth opportunities in Latin America.\nCommodity-rich Latin America has limited leverage on ChinaChina needs Latin America's vast natural resources for its hungry industries, from lithium in Brazil to copper in Chile and fishmeal in Peru.\nOther countries may follow suit, as some analysts expect more protectionist measures including tariffs and stiffer regulations coming out of Latin America.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2026-02-02T04:55:53Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Nw==",
    "url": "https://www.aljazeera.com/features/2026/1/31/gazas-collapsing-economy-drives-youth-to-create-unconventional-solutions",
    "title": "Gaza’s collapsing economy drives youth to create unconventional solutions",
    "summary": "Innovation becomes a go-to strategy for Gaza’s youth as they battle unemployment in a hostile economic environment.\nAhmed Fares Abu Zayed, CEO of Abu Zayed General Trading, described how his company’s operations came to a halt when the war began.\nThe situation was extremely difficult.”AdvertisementRather than shutting down entirely, Abu Zayed began searching for alternatives.\n“When traditional jobs are absent, innovation becomes a means to create opportunities instead of waiting for them,” she said.\nAbu Zayed noted that his electricity project did more than solve his own problem.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-01-31T07:38:21Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MTA=",
    "url": "https://www.buzzfeed.com/alexalisitza/tracking-trump-economy-december",
    "title": "Keeping Track Of Trump's Economy: December 2025",
    "summary": "Gas is a sensitive topic for Economy Hate Watch readers.\nSome people are seeing numbers that start with a six, and others — the lucky souls — are seeing twos.\nWhat I will say is that our last edition got a comment that begged me to reiterate that gas prices are cyclical.\nPeople go outside and travel more during the summer, and tend to stay inside more during the winter.\nFor now, at $3.024 a gallon, we may be seeing the winter price ahead of a summer boom.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2026-02-01T14:45:01Z",
    "source": "Buzzfeed"
  },
  {
    "id": "MTI=",
    "url": "https://indianexpress.com/article/cities/ahmedabad/fund-cuts-in-sectors-that-affect-most-needy-people-chavda-on-union-budget-10508055/",
    "title": "Fund cuts in sectors that affect most needy people: Chavda on Union Budget",
    "summary": "“The economy is continuously collapsing, the rupee is continuously devaluing.\nThe budget does not show any concrete plan to combat the continuous rise in inflation, unemployment, economic inequality, and declining income,” Chavda said.\nGujarat Pradesh Congress Committee president Amit Chavda on Sunday criticised the Union Budget 2026-27, saying that thousands of crores of rupees have been cut in sectors such as health, education, social welfare, agriculture, rural and urban development.\n“What is disturbing is that these cuts have been made in sectors that affect the most needy people.\nThe government is proud of the fiscal deficit of 4.4 per cent, but this figure has been achieved at the cost of people’s health, education and future.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2026-02-01T19:24:38Z",
    "source": "The Indian Express"
  },
  {
    "id": "MTQ=",
    "url": "https://www.businessinsider.com/laid-off-amazon-tech-worker-job-search-challenges-advice-2026-1",
    "title": "I was laid off by Amazon and am struggling to find work. The job market feels like a brick wall, and I'm worried about my finances.",
    "summary": "While my final paychecks from Amazon I received through this month have helped cushion the transition, the slow progress in my job search has left me increasingly worried about my finances.\nBusiness Insider is speaking with workers who've found themselves at a corporate crossroads — whether due to a layoff, resignation, job search, or shifting workplace expectations.\nIn 2024, I transferred to a similar role on a fully remote team, which allowed me to return home to Michigan.\nMy advice for people who have been laid offI'm super stressed about my job search and recently applied for unemployment benefits.\nWhile it's important to stay consistent in your job search, I'd also recommend taking some time to rest — apply steadily, not at full throttle.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-01-31T10:05:02Z",
    "source": "Business Insider"
  },
  {
    "id": "MTU=",
    "url": "https://cheezburger.com/44162821/im-two-days-in-and-the-red-flag-list-is-already-a-mile-long-designer-wants-to-quit-job-2-days-in",
    "title": "‘I’m two days in, and the \"red flag\" list is already a mile long’: Designer wants to quit job 2 days in after 8 months of unemployment",
    "summary": "Employee uses loophole in company's half day policy, ends up working just one hour a day every Friday: 'Half days entirely depend on the set lunch time?\nAlright then!'",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2026-01-31T14:00:00Z",
    "source": "Cheezburger.com"
  },
  {
    "id": "MzE=",
    "url": "https://www.businessinsider.com/electric-bills-surge-utilities-31b-rate-increases-2025-2026-1",
    "title": "Utilities want $31 billion more from customers, and your electric bill is about to feel it",
    "summary": "Electric and gas utilities asked state regulators to approve $31 billion in rate increases last year, more than double the $15 billion they sought in 2024, a new study from PowerLines, a nonprofit that advocates for utility customers, found.\nMuch of that came from Florida Power and Light's $9 billion rate hike request — nearly all of which regulators approved.\n\"I never want Americans to pay higher electricity bills because of data centers,\" Trump said in the post.\nPower demand forecastsSome power grid researchers are skeptical of the forecast demand.\nSteering utilities to first consider the latest electric grid-enhancing technologies before building new power plants to serve data centers could also help lower customer electric bills, Hua said.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-31T10:00:01Z",
    "source": "Business Insider"
  },
  {
    "id": "NTY=",
    "url": "https://www.npr.org/2026/01/31/nx-s1-5694716/partial-government-shutdown",
    "title": "What to know about the partial government shutdown",
    "summary": "What to know about the partial government shutdowntoggle caption Rahmat Gul/APThe U.S. government has entered a partial shutdown after Congress failed to meet a deadline of midnight on Friday to complete work on a spending package to prevent funding from running out across multiple federal departments.\nThat two-week continuing resolution is designed to allow lawmakers to negotiate reforms at the agency after federal immigration officers in Minnesota killed two U.S. citizens this month.\nBut the House, which had previously approved a package to fund all six departments, needs to vote again on the amended package.\nWhat Democrats are asking forDemocrats are calling for broad changes to the way federal immigration officers carry out their work.\nThey also want to make it easier to pursue legal action against immigration officers and \"independent investigations\" into misconduct by federal officers.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-31T05:01:06Z",
    "source": "NPR"
  },
  {
    "id": "NjA=",
    "url": "https://sg.finance.yahoo.com/news/india-doubles-tax-holiday-gift-081541660.html",
    "title": "India doubles tax holiday for GIFT City businesses to 20 years",
    "summary": "The tax boost for GIFT City comes as it is attracting increased interest from large ⁠global reinsurers.\nAfter the end of 20 years these businesses will be taxed at a flat ​rate of 15%, the federal budget proposed.\nForeign ‌companies setting up units in Indian regions outside of Gujarat International Finance Tec‑City, or GIFT City, are taxed at a base rate of 35%.\n\"This will encourage both ⁠global and domestic institutions ​to structure international financial services ​business within India’s own financial hub,\" Dipesh Shah, executive director at ‍the regulator ⁠for financial services at GIFT City told Reuters.\n\"Today’s announcement will provide long-term tax ⁠certainty and predictability to the IFSC (international financial services ‌centre) ecosystem.\"",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-01T08:15:41Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NjQ=",
    "url": "https://indianexpress.com/article/health-wellness/budget-2025-centre-regional-medical-hubs-experts-reaction-clear-policy-10507445/",
    "title": "Budget 2026: Centre plans 5 Regional Medical Hubs, experts welcome move but urge clear policy",
    "summary": "Union Finance Minister Nirmala Sitharaman on Saturday announced a new initiative to position India as a global hub for medical tourism, proposing the establishment of five Regional Medical Hubs across the country.\nThe proposed Regional Medical Hubs will function as integrated healthcare complexes, bringing together medical services, education, and research under one umbrella.\nAccording to the finance minister, the hubs will include AYUSH centres, Medical Value Tourism Facilitation Centres, and supporting infrastructure for diagnostics, post-treatment care, and rehabilitation.\n“If the government promotes medical tourism in an official way, I am sure it would bring both global recognition and financial benefits,” he said.\nHe emphasised that further visa liberalisation would be critical to make India competitive with other medical tourism destinations like Thailand.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-01T11:23:19Z",
    "source": "The Indian Express"
  },
  {
    "id": "NjY=",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/foreigners-get-a-direct-pass-to-indian-equity/articleshow/127849907.cms",
    "title": "Foreigners get a direct pass to Indian equity",
    "summary": "Live Eventsas a Reliable and Trusted News Source Addas a Reliable and Trusted News Source Add Now!\n(You can now subscribe to our(You can now subscribe to our ETMarkets WhatsApp channelIndia will open a new door to foreign retail money at a time when overseas fund managers are pulling out from local stocks.\nThe budget proposed allowing individuals residing outside India-beyond NRIs and overseas citizens of India (OCIs)-to buy listed stocks directly.Under the proposal, persons resident outside India (PROIs) can invest in listed companies through portfolio investment schemes (PIS), with the individual cap doubled to 10% and the aggregate limit for all PROIs raised to 24% from 10%.\nAnyone who does not qualify as an Indian resident under foreign exchange rules will be treated as a PROI.Overseas individuals currently bet on Indian markets mainly through pooled investment vehicles managed by foreign institutions, alternative investment funds (mainly category-III) or via limited NRI channels.\nThe biggest roadblocks could be the onerous KYC checks and client onboarding, including documentation that is compliant with the Foreign Exchange Management Act.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2026-02-02T00:36:03Z",
    "source": "The Times of India"
  },
  {
    "id": "NzE=",
    "url": "https://indianexpress.com/article/technology/tech-news-technology/india-hands-apple-a-win-by-letting-foreign-firms-fund-equipment-without-tax-risk-10508635/",
    "title": "India hands Apple a win by letting foreign firms fund equipment without tax risk",
    "summary": "File photo of the logo of Apple is illuminated at a store in the city center in Munich, Germany, on Dec. 16, 2020.\n(AP)India’s government on Sunday handed a major win to Apple by allowing foreign companies to provide machines to their contract manufacturers in certain areas for five years without any tax risk.\nApple has been growing in India in recent years as it diversifies beyond China.\nAnd while China still accounts for ‍75% ⁠of global iPhone shipments, India’s share has quadrupled to 25% since 2022.\nApple had been lobbying India’s government to modify its income tax laws to ensure the company is not taxed for ownership of the high-end iPhone machinery it provides to its contract manufacturers.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-02T05:05:32Z",
    "source": "The Indian Express"
  }
]