[
  {
    "url": "https://finance.yahoo.com/news/yikes-top-investment-bank-looks-162906862.html",
    "title": "‘Yikes’: Top investment bank looks under the hood of the economy and finds ‘the labor market doesn’t look that good’",
    "summary": "For much of the year, top economists , including Fed Chair Jerome Powell, have said we’re in a “low hire, low fire” jobs market.\nIf the government does reopen, Pingle’s team said it expects jobs data for September to be released next week, and potentially the October inflation report, the Consumer Price Index.\nA leading investment bank has delivered an arresting diagnosis of the U.S. economy: the labor market, long a pillar of resilience, may be in real trouble.\nThe hiring rate, as measured by multiple business surveys, has dropped to levels historically seen only in recessions.\nWhile some see an argument for interest rate cuts to buffer the labor market, others worry inflation isn’t yet tamed.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-11-10T16:29:06Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://uk.finance.yahoo.com/news/ftse-100-live-markets-us-government-shutdown-stocks-085404873.html",
    "title": "FTSE 100 and US markets rally as investors cheer potential end to US shutdown",
    "summary": "The FTSE 100 (^FTSE), European markets and US stocks rose sharply on Monday by the closing bell in London, bouncing back from a tech-led selloff last week, as traders parse signs that the US government shutdown could be coming to an end.\nThe US Senate advanced a House-passed bill on Sunday, which would fund the government until 30 January.\n\"It looks like we’re getting very close to the shutdown ending,\" Trump said on Sunday evening.\nThe tech-heavy Nasdaq Composite (^IXIC) surged as much as 1.5%, while the S&P 500 (^GSPC) climbed by around 0.8%.\nIn Europe, Germany's DAX (^GDAXI) gained 1.7% and the CAC 40 (^FCHI) in Paris rose 1.6%.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-11-10T08:54:04Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/video/markets-experiencing-optimism-fatigue-strategist-220000541.html",
    "title": "Markets are experiencing 'optimism fatigue,' strategist says",
    "summary": "You say balancing optimism with fatigue.\nSo that to me is peak optimism, right?\nAnd we're just, you know, we're not looking for any type of downside catalyst here, but can things really get that much better to the upside from an optimism standpoint, which is in my opinion, fatigue.\n00:54 Speaker ABut if I am willing to bet Will, listen, I think earnings are going to continue to expand.\nSo again, that that again screams fatigue to me, which we're also have some seasonality at play too.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-11-07T22:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/russia-economy-oil-gas-revenue-sanctions-price-discount-lukoil-rosneft-2025-11",
    "title": "Russia's oil revenues plunge just as US sanctions hit when Moscow can least afford it",
    "summary": "Russian President Vladimir Putin's government is grappling with shrinking oil revenues and a slowing economy as sanctions pressure builds.\nRussian President Vladimir Putin's government is grappling with shrinking oil revenues and a slowing economy as sanctions pressure builds.\nGetty ImagesRussian President Vladimir Putin's government is grappling with shrinking oil revenues and a slowing economy as sanctions pressure builds.\nMoscow collected 888.6 billion rubles, or $10.9 billion, in oil and gas taxes, down from about 1.2 trillion rubles in October 2024, official data published on Thursday show.\nOver the first 10 months of 2025, oil and gas revenues totaled 7.5 trillion rubles, down from 9.5 trillion in the same period last year — a drop of more than 2 trillion rubles, or 21%.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-11-07T06:26:35Z",
    "source": "Business Insider"
  },
  {
    "url": "https://finance.yahoo.com/news/morning-bid-markets-rejoice-potential-053412871.html",
    "title": "Morning Bid: Markets rejoice potential end to US government shutdown",
    "summary": "Nonetheless, the positive stride was enough to send Nasdaq futures up 1.2% and S&P 500 futures up 0.⁠7% in Asia, with European futures ‌also clocking strong gains.\nWhite House economic adviser Kevin Hassett said in an interview that the U.S. economy could contract in the fourth quarter if the shutdown ​drags on.\nData on Friday also showed U.S. consumer sentiment weakened to the lowest level in nearly 3-1/2 ‌years in early November amid worries about the economic fallout of the shutdown.\nStill, many investors viewed the pullback as a breather rather than a sign of deeper trouble.\nIn China, the CSI300 blue-chip index was down 0.‍24%, while Hong ⁠Kong's Hang Seng Index rose 0.6%.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-11-10T05:34:12Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/treasury-official-warns-of-widespread-economic-damage-if-supreme-court-rules-against-trumps-tariffs-190100275.html",
    "title": "Treasury official warns of widespread economic damage if Supreme Court rules against Trump's tariffs",
    "summary": "The Trump administration is warning that if the Supreme Court were to dismantle President Trump's tariffs, it would cause \"unnecessary economic pain and hardship,\" damaging financial markets and confidence.\nYou've seen commitments by all different countries and companies to invest in the US.”\"It would damage confidence.\n\"Without that, businesses will remain cautious, trade flows will stay disrupted, and the potential economic gains will be considerably diminished.\"\nThe US has collected $225 billion in tariffs over the past year, $145 billion more than the previous year.\nDaco estimates a full reversal of the IEEPA tariffs could imply over $85 billion in tax rebates or reimbursements.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-11-07T19:01:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/trump-ramping-effort-convince-skeptical-050102225.html",
    "title": "Trump is ramping up a new effort to convince a skeptical public he can fix affordability worries",
    "summary": "“We are the ones that have done a great job on affordability, not the Democrats,” Trump said at an event in the Oval Office to announce the deal.\nThe outlook for inflation is unclearAs of now, the inflation outlook has worsened under Trump.\nBut critics say it will be hard for Trump to turn around public perceptions on affordability.\nTwo other White House officials said messaging would change — but not policy.\nWith Federal Reserve Chair Jerome Powell's term ending in May, the White House anticipates the start of consistent cuts to the Fed's benchmark interest rate.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-11-07T05:01:02Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-march-higher-as-vote-lifts-hopes-for-end-to-us-shutdown-002422119.html",
    "title": "Stock market today: S&P 500, Nasdaq soar, lead Dow higher as Senate vote lifts hopes for end to US shutdown",
    "summary": "Tech stocks led a roaring start to Wall Street's week, with investor spirits boosted by Congress taking a big step toward ending the record-breaking government shutdown that has clouded the picture of the economy.\nThe tech-heavy Nasdaq Composite (^IXIC) surged over 2.2%, to close back within striking distance of its all-time high.\nThe S&P 500 (^GSPC) climbed by around 1.5%, while the Dow Jones Industrial Average (^DJI) rose about 0.8%, or over 350 points.\nMeanwhile, it has disrupted federal services and delayed the release of key economic data, complicating the Federal Reserve's policymaking and Wall Street's calculations.\nThe Consumer Price Index (CPI) and Producer Price Index (PPI) inflation updates due this week are set to be the latest victims, even if the shutdown does end this week.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-11-10T00:24:22Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/video/gen-z-building-emergency-savings-230032731.html",
    "title": "Gen Z is building emergency savings as economic fears loom",
    "summary": "And here with more insight on this age group is Gen Z researcher and author Jason Dorsey.\n00:48 Jason DorseyYeah, it's a scary time to be in Gen Z, financially and in the workforce.\nAnd you put it all together and it's exactly why Gen Z is pairing back on their spending.\nThey're getting sticker shock from healthcare, you know, they're they're finding out these premiums could go up.\nSo think about Gen Z as all the 20-somethings that you see in the US, and then goes down probably to the mid-teen years.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-11-07T23:00:32Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/live/stock-market-today-nasdaq-sp-500-dow-come-off-lows-as-rough-week-for-tech-nears-end-201237522.html",
    "title": "Stock market today: Dow, S&P 500, Nasdaq end volatile week lower amid worst tech sell-off since April",
    "summary": "The tech-heavy Nasdaq Composite (^IXIC) pared losses to fall 0.2%, while the S&P 500 (^GSPC) erased losses to close out the session up 0.1%.\nStocks pared declines after Democrats laid down conditions for a deal to end the government shutdown, a proposal that Republicans subsequently rejected.\nThe S&P 500 and the Dow also closed out the bumpy week in the red as persistent worries about an AI bubble and Big Tech valuations run high.\nOverall sentiment dropped to 50.3, the worst reading since 2022, as respondents fretted over the shutdown's effects.\nThe private data reverberated through Wall Street more than usual, given the current dearth of official updates on the economy.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-11-07T20:12:37Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/economists-agree-not-crazy-feeling-140000181.html",
    "title": "Economists agree: You’re not crazy for feeling like the rich get richer, and the poor are doing worse. Welcome to the ‘K-shaped economy’",
    "summary": "“But at the top, people are spending, at the higher income and wealth.”When did the K-shaped economy emerge?\n“Number one, lower income households always struggle more in the economy.\n“And second, that it tends to be that after each recession, lower income workers fall further behind in the income distribution,” he added.\nBut another part of the resurgence of discussions about a bifurcated economy comes from the relative nature of a K-shaped economy, according to Schipper.\n“The K-shaped economy, the bifurcated economy, is potentially a more vulnerable economy,” Sahm said.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-11-07T14:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.usatoday.com/story/news/politics/2025/11/09/trump-approval-rating-falls-in-new-poll-democrats-2026-stock-rises/87181915007/",
    "title": "Trump faces cost-of-living criticism in new poll as Democrats' 2026 stock rises",
    "summary": "The Trump administration faced mounting criticism on the economy and cost of living in a new poll, and most respondents said they want Democrats to take control Congress after the midterm elections next year.\nDemocrats seized on that frustration in last week's Nov. 4 election, when the party won key races across the country.\nWhen it comes to the ongoing shutdown, 49% said either Republicans in Congress or Trump are at fault, and 42% said Democrats in Congress are to blame.\nAnd though a majority of respondents expressed dissatisfaction with Republicans over the economy, they still held a one-point advantage over Democrats in the poll.\nMore broadly, 61% of survey respondents said the country was moving in the wrong direction, marking a 7-point increase since the pollsters last asked the question in March.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-11-09T17:57:40Z",
    "source": "USA Today"
  },
  {
    "url": "https://finance.yahoo.com/video/market-correction-overdue-not-because-200000664.html",
    "title": "Market correction is 'overdue,' but not because of an AI bubble",
    "summary": "Our next guest says bubble talk is overdone, but indeed the market could be due for a correction.\nOur sense is that going into the end of the year, uh the market will continue to do well.\n01:04 Nancy CurtinWe should talk a little bit about the bubble talk uh on on01:06 Speaker AYeah, let's do.\nBecause an innovation driven bull market unlike a cyclical or liquidity or recovery from recession type of bull market, uh fundamentally, you are adding earnings and productivity uh in infrastructure investment to the economy and that's very powerful.\nUltimately, all bull markets are killed by the Fed, but they seem to be in an easing mode at the moment.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-11-07T20:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-end-volatile-week-lower-amid-worst-tech-sell-off-since-april-210026318.html",
    "title": "Stock market today: Dow, S&P 500, Nasdaq end volatile week lower amid worst tech sell-off since April",
    "summary": "The tech-heavy Nasdaq Composite (^IXIC) pared losses to fall 0.2%, while the S&P 500 (^GSPC) erased losses to close out the session up 0.1%.\nStocks pared declines after Democrats laid down conditions for a deal to end the government shutdown, a proposal that Republicans subsequently rejected.\nThe S&P 500 and the Dow also closed out the bumpy week in the red as persistent worries about an AI bubble and Big Tech valuations run high.\nOverall sentiment dropped to 50.3, the worst reading since 2022, as respondents fretted over the shutdown's effects.\nThe private data reverberated through Wall Street more than usual, given the current dearth of official updates on the economy.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-11-07T21:00:26Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/why-miners-risk-injuries-one-of-the-worlds-saltiest-lakes-2025-10",
    "title": "Why miners risk their lives in one of the world's saltiest lakes",
    "summary": "Known for its colorful pink hues and rich salt deposits, Lake Retba, or Lac Rose, is a driving force of Senegal's economy.\nBut extracting salt from a hypersaline lake comes with its fair share of risks for local miners.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-11-08T16:00:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://finance.yahoo.com/video/citis-smith-markets-investment-041048670.html",
    "title": "Citi's Smith on Markets and Investment",
    "summary": "Paul Smith, Citi's Head of Markets for Japan, Asia North, and Australia, discusses the market outlook and investment strategies.\nHe speaks with David Ingles and Yvonne Man on \"Bloomberg: The China Show.\"",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-11-10T04:10:48Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/video/tesla-shake-warren-buffett-quiet-181027685.html",
    "title": "Tesla shake-up, Warren Buffett to 'go quiet' from Berkshire",
    "summary": "0:03 spk_0It's time for Yahoo Finance's market minute.\nPlus, Tesla is losing key leaders across its cybertruck Model 3, and Model Y programs.\nIt's the latest in a series of high-level departures at the company this year.And Warren Buffett will no longer write Berkshire's annual report.\nThe billionaire investors said today he would be going quiet as Greg Abel takes over Berkshire at the end of the year.\nBut Buffett did say he would continue to deliver his Thanksgiving letter, and that's your Yahoo Finance market minute.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-11-10T18:10:27Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.androidcentral.com/apps-software/ai/google-finance-with-deep-search-ai-lets-users-watch-the-market-like-a-hawk",
    "title": "Google Finance with Deep Search AI lets users watch the market like a hawk",
    "summary": "What you need to knowGoogle Finance is receiving a major update that brings Gemini's AI software Deep Search to U.S. users.\nWith Deep Search, users can ask complex questions regarding the changing stock market, as well as receive market predictions using known data.\nThis morning (Nov 6), Google Finance announced a major new addition to its platform that those involved with stocks may find fruitful.\nIt was announced in a Keyword post that Google Finance is receiving Gemini AI assistance via Deep Search.\nIt announced that, with Deep Search AI, Google Finance users can ask even more complex questions packed with every minute detail they can think of.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-11-07T12:03:00Z",
    "source": "Android Central"
  },
  {
    "url": "https://www.mysanantonio.com/business/article/layoffs-texas-21140768.php",
    "title": "Mass layoffs hit over a thousand Texans",
    "summary": "Every major metro across the state has been hit in the latest wave of mass layoff notices.\nDespite federal banks and universities forecasting a positive September for the Texas job market, layoffs continue to come in.\nFrom January through the end of October, more than 747,000 workers filed unemployment claims in Texas.\nWe are very thoughtful and deliberate in our approach, understanding the impact these decisions have on individuals at the company,” company officials said in its letter confirming the layoffs.\nJob1USA announced its conducting mass layoffs at several facilities, including San Antonio, Houston, Round Rock, Haslet, Fort Worth and Arlington.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-11-07T13:00:18Z",
    "source": "mySA"
  },
  {
    "url": "https://finance.yahoo.com/news/doing-better-around-50-americans-115700784.html",
    "title": "You’re doing better than around 50% of Americans if you check off just 1 of these 3 boxes. How do you stack up?",
    "summary": "Not living paycheck-to-paycheckAs of 2025, a whopping 57% of American adults say they are living paycheck to paycheck, according to MarketWatch Guides [2].\n\"Living paycheck to paycheck means having little to no money remaining after paying for basic expenses such as rent and utilities,\" said MarketWatch.\n\"Someone living paycheck to paycheck would be at risk of not being able to pay bills or afford necessities if they missed a single payday.\nLiving paycheck to paycheck can make it difficult to build an emergency fund, save for the future or splurge occasionally.\"\nIf you’re young and saving money, congratulations, you’re in an elite group of financial ninjas!",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-11-09T11:57:00Z",
    "source": "Yahoo Entertainment"
  }
]