[
  {
    "url": "https://gizmodo.com/welcome-to-the-jobless-growth-economy-2000673236",
    "title": "Welcome to the ‘Jobless Growth’ Economy",
    "summary": "America is entering an era of “jobless growth,” according to analysts at Goldman Sachs.\nThe memo, written by economists David Mericle and Pierfrancesco Mei and spotted by Fortune, warns that the current market of “modest job growth alongside robust GDP growth” is likely the new normal going forward.\nThe thing about senior roles is that you need people with experience to fill them.\nThat hasn’t materialized even a little thus far, but the idea that it will has severely messed up the job market.\nOne thing is for sure: AI is going to be transformative for the economy.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-17T12:30:59Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://uk.finance.yahoo.com/news/imf-global-debt-reeves-jobs-economy-weekend-budget-125851835.html",
    "title": "The Weekend: IMF warns of global debt emergency as Reeves grapples with slowing jobs market",
    "summary": "There was a stark warning from the IMF this week as it predicted government debt across the world would hit the highest level since the aftermath of World War Two by the end of the decade.\nThe report comes ahead of the government's autumn budget, where chancellor Rachel Reeves is expected to raise the tax burden on families and businesses.\nThe official figures showed pay growth slowing and unemployment edging higher in the three months to August.\nPerhaps Reeves could find inspiration in the work of Joel Mokyr, Philippe Aghion and Peter Howitt, who were this week awarded the 2025 Nobel economics prize for \"having explained innovation-driven economic growth\".\nThe American, French and Canadian economists \"have taught us that sustained growth cannot be taken for granted,” the prize-awarding body said.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-10-18T12:58:51Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/bi-today-sunday-newsletter-ai-gig-economy-2025-10",
    "title": "The AI revolution's next casualty could be the gig economy",
    "summary": "lighning bolt icon An icon in the shape of a lightning bolt.\nShuji Kajiyama/AP ImagesThe gig economy is facing a reckoning.\nBoth moves point toward the same future: one where the very workers who built the gig economy may soon find themselves training the technology that replaces them.\nBy helping Uber strengthen its AI, drivers could be accelerating the very driverless world they fear.\nStill, he has warned that the eventual decline of driving jobs poses a significant societal challenge to the gig economy.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-19T10:45:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/tariffs-inflation-economy-chicago-small-business-2025-10",
    "title": "I run coffee shops and bars in Chicago. Tariffs and uncertainty forced me to freeze hiring, cut jobs, and raise prices.",
    "summary": "Michael Salvatore, who runs coffee shops and bars, has made some changes and is figuring out how else tariffs will affect business operations.\nMichael Salvatore, who runs coffee shops and bars, has made some changes and is figuring out how else tariffs will affect business operations.\nThis uncertainty creates this temperature where I'm going to hold off on any major decisions because I don't know how that's going to affect my bottom line tomorrow.\nA 12-ounce drip coffee went from $3.00 to $3.15.\nEven with that, even with great revenue coming in, because coffee prices went up, because paper goods went up, because labor went up, because insurance went up, every line item in our expense sheet has gone up.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-10-19T08:46:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://finance.yahoo.com/news/robert-kiyosaki-warns-us-baby-111500504.html",
    "title": "Robert Kiyosaki warns US baby boomers will be ‘wiped out,’ left homeless ‘all over’ the country — how to fight back now",
    "summary": "(2)“The boomers don’t have enough money to get through inflation.\nKiyosaki argued that by printing fiat currency, the Federal Reserve fuels price increases that make everyday life harder for ordinary Americans.\nBut according to “Rich Dad, Poor Dad” author Robert Kiyosaki, those golden years may not be so golden after all.\nKiyosaki also shared the assets he believes can stand strong against inflation, money printing — and more.\nReal estateGold isn’t the only asset investors turn to during inflationary times.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-17T11:15:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/trump-hit-china-economy-where-205727945.html",
    "title": "Here’s how Trump can hit China’s economy where it really hurts as analysts say Beijing’s rare earths gamble could backfire",
    "summary": "The Trump administration insists it holds the upper hand as trade friction with Beijing has reignited over its sweeping rare-earths export controls.\nStill, China’s rare earth restrictions stunned some obverses, who have said they could “forbid any country on Earth from participating in the modern economy,” given how critical the minerals are to a vast array of technologies.\n“Whatever the motivation, China’s recent actions were a bit of a gamble and there is a risk that they could backfire,” they wrote.\nThey also listed ways that the U.S. could ramp up its retaliation and cause even more disruption to China’s economy.\nTrump could force Microsoft to halt sales and updates in China, eventually resulting in security holes going unfixed.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-18T20:57:27Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.noahpinion.blog/p/the-richest-third-world-country",
    "title": "The richest third-world country",
    "summary": "Art by GrokThe other day a friend asked me whether it made sense to call America “the richest third-world country”.\nBut nowadays, when people call the U.S. a “third world country”, I find myself taking the epithet much more seriously.\nAmerican politics is starting to look decidedly like something you’d encounter in a dysfunctional middle-income nation — Turkey, Hungary, Brazil, or Israel.\nAs I said, this is the kind of thing that happens, if not in third-world dictatorships, then at least in middle-income countries with populist strongmen.\nThe U.S. is getting Third World politics; will it also get Third World poverty?",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-18T04:31:59Z",
    "source": "Noahpinion.blog"
  },
  {
    "url": "https://beincrypto.com/shutdown-adds-twist-to-september-cpi/",
    "title": "Rare Friday CPI Could Sway Fed’s Next Move",
    "summary": "However, something will occur differently, with the CPI data coming only five days before the Fed’s October 29 meeting.\nThe US CPI report is typically released once a month, usually on or around the 10th to 13th of the following month.\nAs for timing relative to Federal Reserve meetings, CPI usually comes out 1–2 weeks before the Fed’s Federal Open Market Committee (FOMC) meeting.\nInflation, Shutdown, and the Fed’s DilemmaAccording to analysts surveyed by MarketWatch, the September CPI report is expected to show consumer prices continuing to rise.\nCPI Report Estimates.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-10-19T19:23:00Z",
    "source": "BeInCrypto"
  },
  {
    "url": "https://gizmodo.com/bitcoin-price-slumps-as-wall-street-prepares-for-crypto-etf-frenzy-2000673653",
    "title": "Bitcoin Price Slumps as Wall Street Prepares for Crypto ETF Frenzy",
    "summary": "As part of the Trump administration’s embrace of crypto, the SEC has been more welcoming to publicly traded ETFs that are intended to track various crypto assets.\nWe're already at 2x AltAlt Season Crypto ETFs and its not even October.\nhttps://t.co/VWMf8tT8S8 — Eric Balchunas (@EricBalchunas) September 18, 2025As an example of how the inherently speculative nature of crypto assets may be bleeding too much into traditional markets, a filing was made last month for a product that would track small-cap crypto assets with 2x leverage.\nThe product uses “Alt Season” in its name, which is a nod to the particularly frothy part of the crypto market cycle when less established crypto assets start to outperform bitcoin itself.\nCrypto Market Structure Bill Off to Rough StartWhile the crypto industry is still seeking greater clarity in terms of the regulatory definitions of various types of crypto assets (i.e.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-17T17:40:25Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.businessinsider.com/how-wall-street-stars-spent-first-big-paychecks-2025-10",
    "title": "How to spend it: 10 finance up-and-comers share their first big purchases after their big paydays",
    "summary": "lighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nBusiness Insider asked its Rising Stars of Wall Street to remember that moment and share what they did with their first big check.\nMy whole family and extended family are still based there, and I hadn't been home in a while.\"\nBut after I got my first big bonus at BlackRock, I took my parents and my husband to dinner at Blue Hill.\"",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-19T10:03:02Z",
    "source": "Business Insider"
  },
  {
    "url": "https://finance.yahoo.com/news/goldman-sachs-says-demand-gold-175231232.html",
    "title": "Goldman Sachs says the demand for gold is not just hype, and predicts the U.S. could still see a repeat of a Nixon-era spike",
    "summary": "Lina Thomas, commodities strategist with Goldman Sachs Research, said in a video posted on Thursday the swelling price of gold is more than hype.\nGoldman Sachs projects gold will reach $4,900 by the end of 2026.\nThe recent gold bug has even led Wall Street to reluctantly capitulate to investors’ desire to buy gold.\n1970s deja vuGoldman commodities strategist Thomas drew a comparison between today’s gold rush and that of the 1970s.\n“Back then, fiscal concerns and policy uncertainty led private investors to seek a store of value outside the system,” she said.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-17T17:52:31Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/video/docusign-ceo-discusses-emerging-capabilities-112752991.html",
    "title": "Docusign CEO discusses the emerging capabilities of AI startups",
    "summary": "00:09 Speaker BYou know, Open AI is a hugely important partner for us.\nA lot of our AI is is built on theirs and and other uh frontier LLM models.\nIt's the most important data a company has and so I think those those three factors position us very well to help bring AI to agreements.\n01:32 Speaker AThe pace that uh in OpenAI is moving to uh release new products, update models, whatever it is.\nUh, we do that, I think Doy is going to be very well positioned in the long term.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-17T11:27:52Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://gizmodo.com/cnn-is-trying-to-sell-a-streaming-service-again-only-more-expensive-this-time-2000673714",
    "title": "CNN Is Trying to Sell a Streaming Service Again (Only More Expensive This Time)",
    "summary": "For years now, CNN has been haplessly trying to modernize its media franchise by launching a streaming service.\nThose of you aware of these efforts will recall CNN+, which launched a few years ago and, despite an ample amount of buzz and financing, humiliatingly lasted less than a month.\nIf you’ll recall, CNN+ was developed several years ago and was initially hailed as the future of news programming.\nAt the time, CNBC reported that, in the first few weeks of the service, only 10,000 people watched CNN+ on a daily basis.\nAt the time of its unfortunate launch, it was compared to Quibi, the financially bloated streaming service launched in 2020 that sought to monetize “quick bite” infotainment but crashed and burned inside of a year.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2025-10-17T21:25:32Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://ritholtz.com/2025/10/mib-henry-ward/",
    "title": "MiB: Henry Ward, Carta Chief Executive Officer",
    "summary": "This week, I speak with Henry Ward, Chief Executive Officer at Carta, a technology company that provides capitalization table management and valuation software for startups.\nThey discuss founding a business, the growth of private markets, and his lobby efforts for retail investors to access private markets.\nHis current reading is here; A transcript of our conversation is available here Tuesday.\nYou can stream and download our full conversation, including any podcast extras, on Apple Podcasts, Spotify, YouTube, and Bloomberg.\nAll of our earlier podcasts on your favorite pod hosts can be found here.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-17T21:00:09Z",
    "source": "Ritholtz.com"
  },
  {
    "url": "https://finance.yahoo.com/news/hes-62-shes-64-just-190107518.html",
    "title": "He's 62, She's 64, And 'Are Just About Millionaires' — But She Insists On Keeping $75K Hidden Because 'It Feels Safer'",
    "summary": "A 62-year-old man said his 64-year-old wife insists on keeping $75,000 in cash hidden at home because \"it feels safer\" than leaving it in a bank.\nBefore he died, her father had little savings and owned several low-value properties, including a home that sold for $40,000.\n\"You guys are just about millionaires,\" Kamel noted, emphasizing that the money isn't the issue — the fear behind it is.\nWhat The Hosts RecommendedCo-host Jade Warshaw said the wife's concerns come from poor estate planning, not from bank risk.\n\"Put half in a high-yield savings, and if you get a safe for the house, put half there.\"",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2025-10-17T19:01:07Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://flowingdata.com/2025/10/17/50-cent-adjusted-for-inflation/",
    "title": "50 Cent adjusted for inflation",
    "summary": "The rapper Curtis Jackson became 50 Cent a couple of decades ago, but the dollar is not what it used to be.\nAccounting for inflation, Brian Moore shows Jackson’s current value, which is 109 Cent, as of August 2025.\nOne might argue the other direction where 50 Cent stayed static name-wise, in which case he is currently 50 Cent and rewinding back to 1994, he would be 23 Cent.\nThese are the day’s tough decisions.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-10-17T16:24:29Z",
    "source": "Flowingdata.com"
  },
  {
    "url": "https://www.yahoo.com/news/articles/chinas-ruling-communist-party-meets-030122502.html",
    "title": "What to know about the meeting where China's ruling Communist Party maps its 5-year goals",
    "summary": "HONG KONG (AP) — One of China’s most important meetings begins Monday, as leader Xi Jinping and other ruling Communist Party elites gather to map the goals for the next five years.\nThe closed-door gathering — known as the fourth plenum — is expected to last four days and will discuss and put the final touches on China’s next five-year plan, a blueprint for 2026-2030.\nBut Xi also will likely highlight China's push to become the global leader in many technologies, such as artificial intelligence.\nThat could result in more spending on advanced technology, said Ning Zhang, a senior China economist at UBS.\nChina's chief challenges in the next five yearsSince the massive disruptions of the COVID-19 pandemic, China has struggled to reignite faster economic growth.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-19T03:01:22Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/warren-buffett-plowed-more-1-110239842.html",
    "title": "Warren Buffett plowed more than $1 billion into three stocks, and it says a lot about where he sees consumer priorities are right now: Houses, beer, and gas",
    "summary": "Berkshire Hathaway’s 2025 investments suggest Warren Buffett and his successor, Greg Abel, are focusing on consumer-centered brands, despite broader economic uncertainties.\nThe conglomerate has notably increased stakes in homebuilder Lennar, energy giant Chevron, and beverage company Constellation Brands, while reducing exposure to financial institutions.\nBuffett’s moves highlight a preference for sectors tied to everyday consumption and long-term goals, such as housing, energy, and consumables.\nThroughout 2025, Berkshire’s investments have focused on brands heavily exposed to the health and prospects of consumers.\nSome of Berkshire’s largest investments this year have been in brands which likely qualify as essential for U.S. shoppers—or reflect their long-term goals.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-17T11:02:39Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://gizmodo.com/tech-bros-are-obsessed-with-statue-maxxing-2000673718",
    "title": "Tech Bros Are Obsessed With Statue-Maxxing",
    "summary": "Luckily, the tech bros are on it.\nAccording to Bloomberg, many Republican-aligned tech investors are trying to build new statues across America to prepare us for our own Fall of the Empire era.\nLonsdale seems slightly less obsessed with scale, but is deeply interested in aesthetics.\nPer Bloomberg, he’s a bit less obsessed with “Western” values than the others, and wants to pull inspiration from structures like Aztec and Mayan temples, the Sphinx of Giza, and the Great Wall of China.\nPlus, it’s not like he’s exactly opposed to deeply gaudy-looking constructions, so, he’s kinda the audience for this kind of thing.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-18T13:00:20Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.businessinsider.com/federal-workers-wallets-paycheck-to-paycheck-government-shutdown-2025-10",
    "title": "Federal Workers Are Pinching Pennies During the Government Shutdown",
    "summary": "Hundreds of thousands of federal employees have been furloughed or are working without pay amid the shutdown, while the Trump administration pushes through new staff cuts.\n'I won't have enough savings to pay for the bills'Federal workers told Business Insider that one check can be the difference between paying a bill or going into debt.\nA filing from the Office of Management and Budget on October 10 indicated that between 4,132 and 4,232 federal workers were marked for layoffs, with some receiving RIF notices that day.\nA few CDC workers told Business Insider that this lack of job security is having a tangible impact on their lives and financial planning.\nOver 200,000 federal workers have lost their jobs, and thousands more have left their government posts through retirement, buyouts, quits, and deferred resignations since Trump took office in January.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-19T08:03:01Z",
    "source": "Business Insider"
  }
]