[
  {
    "id": "MA==",
    "url": "https://www.bbc.co.uk/sounds/play/p0n1p693",
    "title": "Is There A Gen Z Jobs Crisis?",
    "summary": "Adam and Alex are joined by BBC business editor Simon Jack to unpack some of the factors driving the trend.\nPlus Alex updates us on Nigel Farage appointing Reform UK’s new top team, which he is calling his ‘shadow cabinet’.\nYou can now listen to Newscast on a smart speaker.\nIf you want to listen, just say \"Ask BBC Sounds to play Newscast”.\nIf you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd Newscast brings you daily analysis of the latest political news stories from the BBC.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2026-02-17T20:43:00Z",
    "source": "BBC News"
  },
  {
    "id": "MQ==",
    "url": "https://uk.finance.yahoo.com/news/gold-prices-oil-pound-commodities-dollar-interest-rates-federal-reserve-uk-inflation-093233998.html",
    "title": "Gold price below $5,000 as investors wait on Fed guidance for clues",
    "summary": "Gold prices remained below the $5,000 threshold on Wednesday as investors awaited the release of minutes from the Federal Reserve’s January meeting for further guidance on the outlook for US interest rates.\n“Gold prices are taking support above $4,850 today... this is a technical bounce” after prices fell in the previous session on easing geopolitical tensions\", Ajay Kedia, director at Kedia Commodities, told Reuters.\nNon-yielding bullion typically benefits from lower interest rate environments.\nHowever, Fed governor Michael Barr said another rate cut could come somewhere well down the road, citing ongoing risks to the US inflation outlook.\n“Our primary interest here is we don't want Iran to get a nuclear weapon,” the vice president said during an interview with Fox News.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-18T09:32:33Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mg==",
    "url": "https://www.businessinsider.com/nevada-sues-kalshi-trump-cftc-with-prediction-markets-2026-2",
    "title": "Nevada sues Kalshi as federal regulators say back off",
    "summary": "Nevada gambling regulators sued the prediction markets company Kalshi on Tuesday, saying the platform's rapid growth forced their hand.\nA Kalshi spokesperson declined to comment on Tuesday afternoon, but the company swiftly asked a federal court to take over the new state case.\nThe CFTC on Tuesday sided with another events-contracts company that is fighting with Nevada regulators, and its chairman, Michael Selig, filmed a video statement defending the new platforms.\nEconomists and political scientists have long been fascinated by prediction markets as a way to channel the so-called wisdom of the crowds.\nLegal battles are pending on the East Coast as well, with regulators in Maryland and New Jersey having clashed with prediction markets.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-18T01:17:02Z",
    "source": "Business Insider"
  },
  {
    "id": "Mw==",
    "url": "https://www.bbc.com/news/articles/c5y6g57j3meo",
    "title": "Plan to increase youth minimum wage could be delayed",
    "summary": "He argued that it was fair to pay a lower rate to young workers because \"if someone is less experienced and less well trained than someone who has been doing the job for a while they are not necessarily going to be as productive\".",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-18T07:33:24Z",
    "source": "BBC News"
  },
  {
    "id": "NA==",
    "url": "https://www.bbc.com/news/articles/c80jy2lkdg3o",
    "title": "Reform plans to keep UK's budget watchdog",
    "summary": "In January, Reform UK leader Nigel Farage told the Telegraph he had \"questioned the need\" for the OBR, which he accused of \"effectively dictating to elected politicians what they should or should not do\".",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2026-02-18T01:39:39Z",
    "source": "BBC News"
  },
  {
    "id": "Ng==",
    "url": "https://newsletter.mikekonczal.com/p/why-affordability-and-the-vibecession",
    "title": "Why Affordability and the Vibecession Are Real Economic Problems",
    "summary": "This argument often emphasizes that incomes at the bottom of the distribution rose faster than those at the top, producing a durable wage compression.\nOne could correctly say that these affordability problems existed in 2019 and are independent of the inflation wave.\nAnd I think it’s worth being explicit about why a wave of inflation can generate real affordability problems.\nGraphic 2 has some prices that have increased faster than overall prices during that time, ones that are pretty important for people.\nFrom end of 2013 to 2019, core essentials rose about 14.3%, essentials rose about 10.5%, and overall PCE rose about 7.9%.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-17T02:49:04Z",
    "source": "Mikekonczal.com"
  },
  {
    "id": "Nw==",
    "url": "https://finance.yahoo.com/news/top-trump-advisor-furious-true-210501303.html",
    "title": "Top Trump advisor furious about true cost of tariffs being revealed, vows to punish New York Fed for ‘worst paper’ ever in history",
    "summary": "A top White House economic official on Wednesday blasted independent research on tariffs, dismissing its findings as inaccurate and misleading.\nMore from Yahoo Scout How does the White House defend current tariff policy?\nWhy did White House officials criticize Federal Reserve research?\nThe exact findings from the New York Fed show a dire scenario for Americans.\nThe New York Fed declined to comment.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2026-02-18T21:05:01Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "OA==",
    "url": "https://www.bbc.com/news/articles/c1mjrgkk1m8o",
    "title": "Food prices are surging in Russia. Is the war hitting Russians in the pocket?",
    "summary": "Kristina, a Moscow marketing specialist in her mid-40s, also had dig into her savings to buy food last month.\nShe lives with her husband, who is a personal trainer, and says she has started paying attention to discounts and has noticed others in supermarkets doing so as well.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-18T00:19:54Z",
    "source": "BBC News"
  },
  {
    "id": "OQ==",
    "url": "https://www.businessinsider.com/vinod-khosla-ai-taxes-capital-labor-job-losses-billionaires-musk-2026-2",
    "title": "Vinod Khosla: Scrap Taxes on Most Americans to Counter AI Job Losses",
    "summary": "Venture capitalist Vinod Khosla said that AI might warrant a rethink of the tax system.\nVenture capitalist Vinod Khosla said that AI might warrant a rethink of the tax system.\nMert Alper Dervis/Anadolu via Getty ImagesVenture capitalist Vinod Khosla said that AI might warrant a rethink of the tax system.\nShould we eliminate preferential treatment of capital gains tax and equalize to ordinary income?\"\nShould we eliminate preferential treatment of capital gains tax and equalize to ordinary income?",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2026-02-17T13:49:53Z",
    "source": "Business Insider"
  },
  {
    "id": "MTE=",
    "url": "https://kottke.org/26/02/the-k-shaped-economy",
    "title": "The K-Shaped Economy",
    "summary": "I think I’d heard the term “k-shaped economy” somewhere before but didn’t really know what it meant until I watched this video:American Airlines is changing the layout of some of their aircraft to add 31 first class and premium seats while cutting out 73 economy seats.\nMeanwhile, economy is getting more cramped and low-cost carriers are going bankrupt.\nIt’s because wealthy passengers are where the money’s at.\nAnd these days, premium seating is bringing in more revenue than the economy cabin.\nIt’s a perfect example of the K-shaped economy.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-17T20:31:34Z",
    "source": "kottke.org"
  },
  {
    "id": "MTI=",
    "url": "https://www.theatlantic.com/ideas/2026/02/for-europe-its-not-back-to-business-as-usual/686023/",
    "title": "No, It’s Not Back to Business as Usual",
    "summary": "Just like last year, I watched the most important American speech at the Munich Security Conference in the overflow room, sitting on the floor, underneath the speakers.\nJust like last year, this group was hoping to hear how the U.S. administration is planning to contribute to these projects.\nIn the hours and days afterward, I did not meet a single person of any nationality who thinks that the American-European relationship is returning to business as usual.\nJust after Munich, Rubio flew to Bratislava and Budapest, where he heaped praise upon Viktor Orbán, the Hungarian prime minister.\nNone of that is business as usual either.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-17T11:27:47Z",
    "source": "The Atlantic"
  },
  {
    "id": "MzI=",
    "url": "https://www.businessinsider.com/ai-energy-utilities-tech-stocks-investing-nvda-msft-says-strategist-2026-2",
    "title": "A technical strategist says Mag 7 stocks are now 'dead money.' Here's what he thinks investors should buy instead.",
    "summary": "\"I don't want to short Microsoft but I certainly don't want to buy it,\" he told the podcast host, George Noble.\nShannon also ascribed the \"dead money\" label to Nvidia, highlighting what he sees as a lack of real growth.\nBut Shannon still cautions investors, using Sandisk's bull run to illustrate the trend of companies surging before a correction.\nNow that he's looking past the AI trade, Shannon sees more opportunity in overlooked sectors that many investors don't seem to be focused on: energy and utilities.\n\"Everyones obsessed with the tech stocks that are breaking down and that fact that bitcoin has been having a lot of difficulty,\" he stated.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-17T16:17:09Z",
    "source": "Business Insider"
  },
  {
    "id": "NjU=",
    "url": "https://www.project-syndicate.org/commentary/trump-administration-financial-reforms-could-have-far-reaching-consequences-by-dambisa-moyo-2026-02",
    "title": "Five US Policy Shifts Could Reshape Financial Markets",
    "summary": "Email requiredPassword required Remember me?\nPlease enter your email address and click on the reset-password button.\nIf your email exists in our system, we'll send you an email with a link to reset your password.\nPlease note that the link will expire twenty-four hours after the email is sent.\nIf you can't find this email, please check your spam folder.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2026-02-18T15:03:30Z",
    "source": "Project Syndicate"
  }
]