[
  {
    "url": "https://www.businessinsider.com/trump-immigration-prices-manufacturing-tariffs-america-economy-2025-9",
    "title": "Trump's Manufacturing, Immigration, Prices Priorities Are in Conflict",
    "summary": "The president wants to boost US manufacturing, cut down on immigration, and keep prices down all at once.\nIf there has been one throughline to the president's economic agenda, it's his desire to rebuild American manufacturing and get companies to make things here.\nThe most glaring deterrent for foreign companies looking to move some operations to America's shores is Trump's immigration crackdown.\nBut increased prices on foreign goods give domestic companies cover to raise their prices.\nIn an ideal world, there would be a boom in job growth, in manufacturing and otherwise, that disproportionately benefited American workers.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-09-25T08:08:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://finance.yahoo.com/video/trumps-tariffs-drugs-trucks-furniture-123540158.html",
    "title": "Trump's new tariffs on drugs, trucks and furniture: Top Story",
    "summary": "00:30 Speaker ANow, stocks of pharmaceuticals across Asia fell heavily and in fact, in Australia too.\n01:00 Speaker ANow, Trump also said he would start charging a 50% tariff on imported kitchen cabinets and bathroom vanities, and a 30% tariff on upholstered furniture.\n01:27 Speaker AThe Trump administration would levy tariffs on firms that do not maintain a one-to-one ratio over time.\n01:44 Speaker ANow, if implemented, this could prove to be a big headache for the likes of Apple.\n02:14 Josh LiptonThis coming after a big batch of commentary on Thursday, including Michelle Bowman, Bowman saying that the fragile job market justifies more interest rate cuts.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-09-26T12:35:40Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/ai-boom-unsustainable-unless-tech-105907536.html",
    "title": "The AI boom is unsustainable unless tech spending goes ‘parabolic,’ Deutsche Bank warns: ‘This is highly unlikely’",
    "summary": "The current AI boom is not sustainable, a Deutsche Bank research note warned this morning, because tech spending won’t “remain parabolic.” AI capex is now so massive it is keeping the U.S. out of recession, the bank said.\nOn the heels of Nvidia’s $100 billion investment in OpenAI, two research notes out today suggest the current boom in AI may be unsustainable.\n“Two trillion dollars in annual revenue is what’s needed to fund computing power needed to meet anticipated AI demand by 2030.\nEstimates vary as to how much is being spent by AI hyperscalers on the data centers and the massive power infrastructure they need to support them.\nThe bad news is that in order for the tech cycle to continue contributing to GDP growth, capital investment needs to remain parabolic.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-09-23T10:59:07Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://uk.finance.yahoo.com/news/bank-of-england-inflation-outlook-113744730.html",
    "title": "Bank of England’s chief economist ‘more comfortable’ with inflation outlook",
    "summary": "The Bank of England’s (BoE) chief economist, Huw Pill, has signalled growing confidence in the UK’s disinflationary trajectory, saying he is now “more comfortable” with the inflation outlook than he was earlier this year.\nPill’s remarks come as headline inflation held steady at 3.8% in August, almost double the BoE's 2% target.\nWhile price growth has eased from its post-pandemic peaks, concerns remain over its stickiness, particularly in services and wage inflation.\nThe BoE held interest rates at 4% in its September meeting, with a 7-2 majority on the MPC in favour of maintaining the current level.\nThe Organisation of Economic Co-operation and Development (OECD) this Tuesday said it expects UK inflation to surge, with Britain experiencing the highest level among the G7 group of advanced economies this year.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-09-23T11:37:44Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://abcnews.go.com/Business/fed-chair-powell-rising-inflation-slow-hiring-pose/story?id=125857000",
    "title": "Fed Chair Powell says rising inflation and slow hiring pose 'challenging situation'",
    "summary": "The Fed, which opted to cut interest rates last week, is guided by a dual mandate to keep inflation under control and maximize employment.\nLast week, Powell said the Fed remains \"strongly committed to maintaining our independence.\"\nStephen Miran, a top White House economic advisor who joined the Fed board last week, cast the lone dissenting vote.\nConstruction continues on the Marriner S. Eccles Federal Reserve Board Building, the main offices of the Board of Governors of the Federal Reserve System on September 16, 2025 in Washington, DC.\nIf the Fed raises interest rates as a means of protecting against tariff-induced inflation, it risks tipping the economy into a downturn.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-09-23T17:31:39Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.businessinsider.com/china-companies-involution-united-states-avoid-cutthroat-competition-price-war-2025-9",
    "title": "China urges its companies in the US to avoid the cutthroat competition that has sent prices down",
    "summary": "lighning bolt icon An icon in the shape of a lightning bolt.\nOn Tuesday, Commerce Minister Wang Wentao met with representatives from over 10 Chinese companies in New York and urged them to avoid cutthroat competition, according to a statement from the ministry.\n\"Chinese companies in the United States have overcome difficulties and achieved significant results, which is a remarkable achievement,\" Wang said at the meeting.\nIf Chinese firms export their price wars to the US, it could hurt their own profitability and reignite trade tensions with Washington.\nHe urged firms to \"respond proactively\" and pursue \"diversified strategies and compliant operations.\"",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-09-25T07:42:51Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/ai-index-indeed-skills-jobs-change-roles-immune-2025-9",
    "title": "Here are the jobs most and least likely to be transformed by GenAI, according to a new index from Indeed",
    "summary": "Indeed's GenAI Skill Transformation Index measures how much generative AI could change the way different skills or jobs are performed.\nMore than a quarter (26%) of jobs posted on Indeed in the past year could be \"highly\" transformed by GenAI.\nThe outlook for different jobsThe latest findings reveal that childcare, nursing, and construction are the least likely to be transformed by generative AI.\nData & Analytics and accounting were second and third, behind software development, as most likely to be transformed by GenAI.\nHere's the full breakdown of jobs and skills:A chart from the Indeed GenAI Skill Transformation Index Indeed Hiring Lab",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-09-23T09:00:03Z",
    "source": "Business Insider"
  }
]