[
  {
    "url": "https://gizmodo.com/the-real-reason-you-havent-been-replaced-by-ai-yet-2000641235",
    "title": "The Real Reason You Haven’t Been Replaced by AI Yet",
    "summary": "It’s the ticking time bomb in the global economy, and every CEO knows it: AI is already powerful enough to replace millions of jobs.\nThe AI revolution isn’t being held back because the technology isn’t ready.\nWe have now 4,100.”The subtext is clear: Palantir already considers 500 of its employees to be a surplus that AI could replace.\nIncreasingly, managers are being forced to justify why a human is needed for a role that an AI could potentially perform.\nIt’s not that AI can’t replace us, especially in knowledge jobs.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-08-10T22:44:46Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://finance.yahoo.com/news/more-half-industries-already-shedding-171804971.html",
    "title": "More than half of industries are already shedding workers, a ‘telling’ sign that’s accompanied past recessions, top economist says",
    "summary": "Moody’s Analytics chief economist Mark Zandi followed up his earlier warning that the economy is on the brink of a recession.\nOn Sunday, he pointed out that the start of a recession is often not clear until after the fact.\nFor now, the jobs data don’t signal a recession yet, but more than half of U.S. industries are already shedding workers.\nZandi said payroll employment data is by far the most important data point, and declines for more than a month consecutively would signal a downturn.\nIn the past, if more than half the ≈400 industries in the payroll survey were shedding jobs, we were in a recession,” he added.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-08-10T17:18:04Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/c39ddjv09vvo",
    "title": "Plan to boost jobs for newly qualified nurses and midwives",
    "summary": "Plan to boost jobs for newly qualified nurses and midwives2 days ago Share Save Hugh Pym • @bbcHughPym Health editor Share SaveGetty ImagesNew measures to make it easier for NHS employers in England to take on newly qualified nurses and midwives have been announced by the government.\nThe move comes after warnings there are up to three times more graduates than vacancies in some areas of the health service.\nThe Royal College of Nursing welcomed the move but said the test would be if students could actually find jobs.\nThe Department of Health said the changes would tackle concerns about jobs after record numbers chose to train for NHS professions during the pandemic – with fewer nurses and midwives quitting.\n\"I am sending a clear message to every newly qualified nurse and midwife.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-08-10T23:42:02Z",
    "source": "BBC News"
  },
  {
    "url": "https://finance.yahoo.com/news/something-weird-going-economy-6-120000656.html",
    "title": "‘Something weird’s going on’ in the economy as 6 new economic classes take shape, says New York Times bestselling author",
    "summary": "He divides American households into six wealth levels, ranging from under $10,000 (level 1) to $10-million-plus (level 5 and beyond).\nHe’s chief operating officer at Ritholtz Wealth Management, but he’s also a blogger, and now a two-time author thanks to his latest book, The Wealth Ladder , which quickly shot to New York Times bestseller status .\n“Something weird’s going on,” he told Fortune in an interview.\nMaggiulli told Fortune about the long-anticipated Great Wealth Transfer, when baby boomers pass on their $124 trillion fortunes to the Gen Xers and millennials now in or entering midlife.\nIs this right for me?”Alex Bryson, professor of quantitative social science at University College London, told Fortune something similar in an interview about his research into 21st-century labor markets, social mobility, and young workers.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-08-09T12:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/documentary-editor-law-school-fight-for-workers-rights-2025-8",
    "title": "I was a movie editor. Fighting for workers' rights made me quit the industry and go to law school.",
    "summary": "After a decade editing documentaries, Edward Wardrip is going to law school to try and help fix what he sees as a broken system for workers.\nAfter a decade editing documentaries, Edward Wardrip is going to law school to try and help fix what he sees as a broken system for workers.\nCourtesy of Edward WardripAfter a decade editing documentaries, Edward Wardrip is going to law school to try and help fix what he sees as a broken system for workers.\nMovie and TV unions are strong — but documentaries and reality TV are left outThe movie and TV industry is known for its strong unions.\nThere's a whole class of people in our economy who are doing what we have not typically considered union work.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-08-10T09:19:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://news.slashdot.org/story/25/08/11/1610211/goodbye-165000-tech-jobs-student-coders-seek-work-at-chipotle",
    "title": "'Goodbye, $165,000 Tech Jobs. Student Coders Seek Work At Chipotle.'",
    "summary": "Want to read Slashdot from your mobile device?\nPoint it at m.slashdot.org and keep reading!",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-08-11T16:10:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://uk.finance.yahoo.com/news/ftse-100-live-stocks-trump-putin-meet-us-china-trade-deadline-081455049.html",
    "title": "Wall Street flat and FTSE rises as Nvidia and AMD agree to pay US 15% cut of China chip sales",
    "summary": "Wall Street hovered around the flatline on Monday, marginally inching towards its record highs despite Nvidia (NVDA) and AMD (AMD) falling after the two companies agreed to pay the US government 15% of the revenue for certain chip sales to China.\nThe deal will reportedly involve “some swapping of territories” with suggestions that it would see Ukraine ceding Russia the parts of Donbas that it still controls.\nUkraine’s president Volodymyr Zelenskyy was quick to reject the idea and European leaders have called for any peace talks with Russia to include Kyiv.\nBloomberg reported on Sunday that European leaders are seeking to speak with Trump before his meeting with Putin.\nBut there is still uncertainty hanging around the market, surrounding concerns about gold bar imports into the US being taxed.\"",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-08-11T08:14:55Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://flowingdata.com/2025/08/11/why-economic-data-requires-regular-updates/",
    "title": "Why economic data requires regular updates",
    "summary": "Many are discovering that the Bureau of Labor Statistics updates past estimates, but some have been misled to believe that the recent correction to jobs numbers was politically motivated.\nFor the New York Times, Ben Casselman, with graphics by Keith Collins and Christine Zhang, explains why updates to the data are a regular thing.\nThere is a fundamental tension inherent in all economic data: accuracy vs. timeliness.\nBut the most complete data is often based on tax returns, Social Security filings or other records that aren’t available until months or years later.\nStatistical agencies release preliminary estimates of job growth, inflation, gross domestic product and other measures, then revise them as more complete data becomes available.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-08-11T08:26:51Z",
    "source": "Flowingdata.com"
  },
  {
    "url": "https://finance.yahoo.com/news/whitmer-told-trump-private-michigan-130110135.html",
    "title": "Whitmer told Trump in private that Michigan auto jobs depend on a tariff change of course",
    "summary": "Just getting the meeting Tuesday with the Republican president was an achievement for someone viewed as a contender for her party's White House nomination in 2028.\nThe fact that Whitmer had “an opening to make direct appeals” in private to Trump was unique in this political moment, said Matt Grossman, a Michigan State University politics professor.\nIt was her third meeting with Trump at the White House since he took office in January.\nOn Tuesday, she told the president that the economic damage from the tariffs could be severe in Michigan, a state that helped deliver him the White House in 2024.\nWhite House spokesman Kush Desai said no other president “has taken a greater interest in restoring American auto industry dominance than President Trump.\"",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-08-09T13:01:10Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/ai-doomsday-taking-jobs-overhyped-david-sacks-agi-2025-8",
    "title": "David Sacks says the doomsday scenario of AI wiping out jobs is 'overhyped'",
    "summary": "White House AI and crypto czar David Sacks said the idea that AI will lead to massive job losses is \"overhyped.\"\nDavid Sacks, the White House AI and crypto czar, is throwing cold water on the AGI hype train.\nAI companies are racing to achieve AGI, or artificial general intelligence, commonly considered a form of AI that can reach human levels of reasoning.\nThis is the stuff of great engineering and should be celebrated,\" Sacks wrote in his post.\nOne of the doomsday scenarios Sacks rejected in his post is the fear that AI will lead to massive job losses.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-08-10T01:13:07Z",
    "source": "Business Insider"
  }
]