[
  {
    "url": "https://www.businessinsider.com/real-problem-america-jobs-data-bls-funding-trump-fired-commissioner-2025-8",
    "title": "The Real Problem With the BLS and America's Jobs Data",
    "summary": "America is the gold standard for economic data — but that doesn't mean it's perfect.\nTrump's main issue with the BLS was its revisions to previous months' jobs data, which revealed a weaker jobs market than had been previously estimated.\nIt's not just jobs data that suffers from a lack of participation.\nMeanwhile, it would be very difficult for the BLS data to be \"rigged\" by anyone, including the Commissioner.\nBLS is a prized gem of the economic world, even if it's imperfect.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-08-05T14:21:44Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.wired.com/story/pointers-on-travel-points-view-from-the-wing/",
    "title": "The Internet's Biggest Travel Nerd Shares Pointers on Points",
    "summary": "But miles, points, and rewards are not merely a side hustle or a second job; they’re a lifestyle.\n“I couldn't tell you how long I spend on the blog, because I’m doing the things that I enjoy anyway,” says Leff.\nWhen it's time to evaluate the future of my relationship with a card, I put that reminder into my calendar.\nI paired that with a deal through American Express Travel where you could book the Conrad Bangkok presidential suite for $51 a night.\nGary Leff belongs to 70-plus travel loyalty programs.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2025-08-06T13:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.businessinsider.com/consumer-spending-up-but-so-is-household-debt-credit-loans-2025-8",
    "title": "Consumer spending may be up, but so is household debt, a new report from the New York Fed shows",
    "summary": "The stock market and consumer spending may be up, but so is household debt.\nA new report from the Federal Reserve Bank of New York shows total household debt has risen to $18.39 trillion when adjusted for inflation — that figure is about $1.05 trillion less than the all-time peak in the last quarter of 2008.\nAround 4.4% of household debt is at some stage of delinquency, a percentage that the bank's researchers called \"elevated.\"\nReports from other financial research agencies also show rising debt and potential financial distress in certain sectors of borrowers.\nA WalletHub report on Tuesday shows household debt increased by $28 billion during the second quarter of 2025, which was nearly six times the increase in the same period in 2024.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-08-06T01:45:46Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/ai-impact-unemployment-job-loss-young-tech-workers-goldman-sachs-2025-8",
    "title": "AI is already driving up unemployment among young tech workers, according to Goldman Sachs",
    "summary": "Impact LinkArtificial intelligence is reshaping the US job market — and young tech workers are feeling the brunt of it.\n\"It is true that AI is starting to show up more clearly in the data,\" wrote Jan Hatzius, Goldman Sachs' chief economist, in a Monday note.\nThe impact has been especially sharp for young tech workers.\n\"While this is still a small share of the overall US labor market, we estimate that generative AI will eventually displace 6-7% of all US workers,\" Hatzius wrote.\nThe report comes amid growing concerns about US labor market weakness.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-08-05T06:57:13Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.usatoday.com/story/money/2025/08/05/black-unemployment-up-slower-labor-market-economy/85467628007/",
    "title": "Unemployment among Black Americans can be an early sign of economic strain. It’s rising",
    "summary": "Economists say the unemployment surge for Black Americans this year could be a troubling sign for the economy at large, because this segment is often the first hit by economic downturns.\n\"The Black unemployment rate is always the first to go up.\nIn Michigan, the unemployment rate for Black people hit 10% in the first quarter – nearly double the state's total unemployment rate and up 3.2% from 2020, according to the Economic Policy Institute.\nRising unemployment for Black Americans may not be the only crack in the labor market data.\n\"It's one of those things where looking at Black unemployment rate and Black labor market indicators told us this story was coming.\"",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-08-05T09:30:51Z",
    "source": "USA Today"
  },
  {
    "url": "https://www.businessinsider.com/economist-tyler-cowen-warns-students-unprepared-for-ai-economy-2025-8",
    "title": "Economist Tyler Cowen Warns Students Unprepared for AI Economy",
    "summary": "Tyler Cowen said that universities were \"producing a generation of students who will go out on the labor market and be quite unprepared for what they're expected to do.\"\nTyler Cowen said that universities were \"producing a generation of students who will go out on the labor market and be quite unprepared for what they're expected to do.\"\nLeon Neal/Getty ImagesTyler Cowen said that universities were \"producing a generation of students who will go out on the labor market and be quite unprepared for what they're expected to do.\"\nImpact LinkColleges aren't preparing their students to join a labor market being transformed by AI, and the consequences may be psychological as much as economic, a leading economist has said.\nTyler Cowen, a professor at George Mason University, said that universities were \"producing a generation of students who will go out on the labor market and be quite unprepared for what they're expected to do.\"",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-08-06T11:52:41Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.bbc.com/news/articles/c87e82pd97wo",
    "title": "The games industry: Developers go their own way as jobs dry up",
    "summary": "Despite struggling to find a full-time job in the industry, Holly has just released her first commercial game alongside uni course mate Harvey Hayman.\nFunding for new video games has also declined in the past two years, so the project has been largely self-financed.\nUKIE, which represents the games industry, says there are \"more routes than ever\" into gaming careers but access to entry level jobs remains \"challenging\".\nScott Alsworth, from the IWGB Union's game workers' branch, said the UK games industry faced \"apocalyptic conditions\" after years of mass layoffs, overspending \"and AI-driven displacement\".\nHolly says the games industry is \"so friendly\" and supportive and meeting others in the same situation has made the past two years \"more manageable\" for her.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2025-08-05T08:21:03Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/brazil-central-bank-warns-us-121854055.html",
    "title": "Brazil central bank warns on US tariffs, vows to anchor inflation expectations",
    "summary": "By Marcela AyresBRASILIA (Reuters) -Brazil's central bank on Tuesday flagged caution over the impact of steeper U.S. trade tariffs, reaffirming its commitment to a policy stance aimed at lowering inflation expectations after signaling interest rates will remain on hold for long.\nAdvertisement AdvertisementAdvertisement AdvertisementThe broader macroeconomic effects remain uncertain and will depend on the course of negotiations and market perceptions of risk, it said.\nThey also noted that inflation expectations among many market participants remain above the official 3% target, with no significant changes in longer-term projections, even as implied inflation measures derived from financial assets have declined.\n\"The committee reaffirmed and renewed its commitment to reanchoring expectations and to conducting a monetary policy that supports such a movement,\" the minutes said.\nLatin America's largest economy is evolving broadly in line with expectations, said the central bank, with slowing growth seen as necessary to widen the output gap and ensure inflation control.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-08-05T12:18:54Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.derekthompson.org/p/how-ai-conquered-the-us-economy-a",
    "title": "How AI Conquered the US Economy: A Visual FAQ",
    "summary": "Nobody can say for sure whether the AI boom is evidence of the next Industrial Revolution or the next big bubble.\nWe can all stop talking about “what will happen if AI dominates the economy at such-and-such future date?” No, the AI economy is here and now.\nToday, in a bit of a throwback to my early blogging years, I’m going to try to walk through an FAQ with graphs to create a visual guide to the question:How big is the AI boom?\n“AI companies are reaching revenue milestones faster than previous generations of startups,” the company announced in a recent report.\nBut independent evaluators in the study actually concluded that using AI did the opposite: it increased task completion time by about 20 percent.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-08-07T10:12:54Z",
    "source": "Derekthompson.org"
  },
  {
    "url": "https://www.theverge.com/news/753863/trump-truth-social-ai-search-perplexity-conservative-bias",
    "title": "Truth Social’s new AI search engine basically just pushes Fox News",
    "summary": "Donald Trump’s Truth Social has launched a new AI search feature that consistently pushes conservative media sources.\nThe feature, Truth Search AI, is powered by the AI startup Perlexity and is now available on the web version of Trump’s social media platform, with public testing coming to the iOS and Android apps “in the near future.”In our testing, all of the source links that Truth Search AI cited were for conservative publications, including Fox News, Fox Business, The Washington Times, and The Federalist.\nThe vast majority of these links directed users to articles published by Fox outlets, which suggests the Perplexity-powered search engine is limiting results to Trump-supporting media.\n“Current evidence indicates that Trump’s tariffs have not improved the overall U.S. economy and are associated with a net negative effect, though some specific sectors benefit,” Truth Search AI wrote in response.\nThe sourcing pool for Truth Social’s AI search tool seems, unsuprisingly, very narrow.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-08-07T14:04:06Z",
    "source": "The Verge"
  }
]