[
  {
    "id": "MQ==",
    "url": "https://www.businessinsider.com/economy-job-market-divide-k-shape-economy-2026-2",
    "title": "The economy grew strongly last year, but hiring stagnated. It's making the gap between the rich and everyone else worse.",
    "summary": "The data is in, and last year presents an economic conundrum: Overall growth was relatively strong, but job growth was virtually nonexistent.\nZipRecruiter economist Nicole Bachaud thinks the job market could be at a \"pivot point\" after stronger hiring in January.\nThey don't have to worry as much about rising prices of necessities and slowing wage growth.\n\"They're also enjoying faster wage growth, while lower-income families are seeing reduced wage growth, near-zero real wage growth, and not much wealth appreciation outside of real estate, if they have that.\"\nLower-income wage growth surged between 2021 and 2022, but has since cooled down a lot from the late 2022 peak.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-22T10:12:01Z",
    "source": "Business Insider"
  },
  {
    "id": "Mg==",
    "url": "https://www.businessinsider.com/us-economy-outlook-joseph-stiglitz-recession-inflation-job-market-tariffs-2026-2",
    "title": "3 Signs US Economy Will 'Get Worse,' According to Joseph Stiglitz",
    "summary": "Joseph Stiglitz, a Nobel laureate and Columbia economist, said he believes the US economy would continue to weaken when speaking to CNBC about his macro outlook on Thursday.\n\"Not great right now, and the prospects are that we're just going to get worse,\" Stiglitz said of his economic outlook.\nBut there are a few under-the-surface details that suggest the economy isn't on a good path, Stiglitz suggested.\nBloomberg/Getty ImagesStiglitz also pointed to the push from the Trump administration to lower interest rates.\nIn that scenario, the economy could grow without stoking inflation, meaning the US could have room to lower interest rates more than markets expect.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-20T10:15:01Z",
    "source": "Business Insider"
  },
  {
    "id": "Mw==",
    "url": "https://abcnews.com/Business/us-economy-expected-slowed-end-2025/story?id=130296352",
    "title": "US economy slowed more than expected at end of 2025",
    "summary": "US economy slowed more than expected at end of 2025A shopper selects items at a grocery store on Feb. 10, 2026, in Chicago.\nA shopper selects items at a grocery store on Feb. 10, 2026, in Chicago.\nA shopper selects items at a grocery store on Feb. 10, 2026, in Chicago.\nA shopper selects items at a grocery store on Feb. 10, 2026, in Chicago.\nThe U.S. economy slowed more than expected over the final months of 2025, federal government data on Friday showed.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-20T13:50:41Z",
    "source": "Abcnews.com"
  },
  {
    "id": "NA==",
    "url": "https://www.npr.org/2026/02/20/nx-s1-5718214/economy-gdp-tariffs-inflation-consumer-spending",
    "title": "The economy slowed in the last 3 months of the year — but was still solid in 2025",
    "summary": "The economy slowed in the last 3 months of the year — but was still solid in 2025toggle caption Jeremy Weine/Getty ImagesThe U.S. economy slowed in the final months of last year, but it continued to expand, thanks to robust consumer spending and business investment in artificial intelligence.\n(Both measures compare the size of the economy at year's end to where it was 12 months earlier.)\nConsumer spending is the biggest driver of the U.S. economy, and that trend continued in the final months of last year.\nThat made GDP look weaker in the early months of the year.\nThat subtracted from fourth-quarter growth, although much of that will be made up in the early months of 2026.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-20T13:52:51Z",
    "source": "NPR"
  },
  {
    "id": "NQ==",
    "url": "https://www.businessinsider.com/finding-job-search-struggles-savings-americans-federal-reserve-amazon-tech-2026-2",
    "title": "Job Searches Lengthen, Savings Dwindle for Americans",
    "summary": "Joanelle Cobos (left), Clair Todd (right)Job searches are taking longer, and some Americans' savings aren't keeping up.\nWilke's experience underscores how quickly a prolonged job search can unravel someone's finances — especially for workers without much savings to fall back on.\nBusiness Insider is speaking with workers who've found themselves at a corporate crossroads — whether due to a layoff, resignation, job search, or shifting workplace expectations.\nMany Americans aren't prepared financially for unemploymentAs unemployment spells lengthen, the financial risks of a prolonged job search are rising for many Americans.\nBut if her job search stretches on, she knows that sense of security will gradually fade.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-22T10:05:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MTA=",
    "url": "https://www.backyardgardenlover.com/not-all-cars-are-money-pits-10-cars-that-are-worth-more-used-than-new/",
    "title": "Not All Cars Are Money Pits: 10 Cars That Are Worth More Used Than New",
    "summary": "Yet, this isn’t always the case: some used models often sell for above the MSRP of their newer rivals.\nThis used car has an astonishingly high price difference over a new model: around 12.3% and an average $4,038 increase.\nIt is clearly a very popular used car choice.\nToyota RAV4 PrimeThe Toyota RAV4 Prime is the plug-in hybrid version of America’s perennial SUV bestseller.\nNot all used RAV4 Hybrid pricing comes from electrified variants: the standard RAV4 Hybrid also appears above new MSRP in some used listings.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-20T12:00:57Z",
    "source": "Backyardgardenlover.com"
  },
  {
    "id": "MTI=",
    "url": "https://www.businessinsider.com/financial-independence-in-new-york-city-early-retirement-investment-portfolio-2026-2",
    "title": "How One Couple Hit Financial Independence Living in New York City",
    "summary": "The couple went from pricey New York City rent to a monthly mortgage, and, eventually, to an incredibly low housing payment when they paid off their mortgage early in 2024.\nBusiness Insider reviewed public records filed with the New York City Register that confirm the couple's mortgage was paid off in September 2024.\nSimplified investingBefore hiring a financial planner, Chang and Nathanson were saving, but without a clear plan.\nAvoiding lifestyle creepEarning two professional salaries in New York City can create pressure to spend accordingly.\nFor Nathanson and Chang, avoiding lifestyle inflation has been central to reaching financial independence.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-20T10:30:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MzE=",
    "url": "https://www.businessinsider.com/lucid-layoffs-read-memo-us-workforce-tesla-rival-2026-2",
    "title": "Read the memo: Tesla rival Lucid cuts 12% of its US workforce as EV winter takes hold",
    "summary": "Tesla rival Lucid is slashing its workforce as the EV winter tightens its grip.\nEV startup Lucid is cutting 12% of US employees, according to an email interim CEO Marc Winterhoff sent to unaffected employees on Friday, which Business Insider has seen.\nWinterhoff said the cuts would exclude hourly production employees in manufacturing, logistics, and quality.\nIt comes as Lucid faces a difficult environment for EV makers amid an industry-wide downturn, with EV sales plummeting industry-wide in the US following the end of the $7,500 tax credit in September.\nWe have implemented a 12% reduction of our U.S. workforce, excluding hourly production employees in manufacturing, logistics, and quality.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-20T16:29:05Z",
    "source": "Business Insider"
  },
  {
    "id": "Mzc=",
    "url": "https://www.wired.com/story/the-supreme-courts-tariff-ruling-wont-bring-car-prices-back-to-earth/",
    "title": "The Supreme Court’s Tariff Ruling Won’t Bring Car Prices Back to Earth",
    "summary": "Now, despite a US Supreme Court ruling that will nix some of those Trump tariffs, car buyers will likely get no respite.\nAutomakers have actually done an OK job shielding consumers from the effects of tariffs, Caldwell says.\nEven as retailers have blamed tariffs for steadily rising prices of consumer goods like electronics and appliances, car prices are up just 1 percent since this time last year, the firm’s data shows.\nBut as the tariff regime drags on, that could change in ways that make new-car buyers even less happy.\n“If cost pressures continue to build, automakers may have less room to shield shoppers from higher prices,” Caldwell says, “but for now, the broader market impact is still playing out.”",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-21T00:10:01Z",
    "source": "Wired"
  },
  {
    "id": "NDU=",
    "url": "https://abcnews.com/Politics/gov-shapiro-blasts-trumps-tariff-policy-after-supreme/story?id=130382811",
    "title": "Gov. Shapiro blasts Trump’s tariff policy after Supreme Court rebuke",
    "summary": "“I wish [Trump] would just adhere to the Supreme Court's ruling,” Shapiro said.\nAfter the Supreme Court invalidated most of President Donald Trump's sweeping tariff policy, Pennsylvania Democratic Gov.\nShapiro, who was at the White House for a governor's meeting when the court's decision was released, said he witnessed Trump's first reaction.\nAsked if he supported abolishing ICE, Shapiro did not say directly whether he does or not.\nHe casts some votes and takes some positions that I strongly disagree with, but at the end of the day, my job is to serve the people of Pennsylvania,\" Shapiro said.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-22T15:05:35Z",
    "source": "Abcnews.com"
  },
  {
    "id": "NDk=",
    "url": "https://www.wired.com/story/they-bet-against-trumps-tariffs-now-they-stand-to-make-millions/",
    "title": "They Bet Against Trump’s Tariffs. Now They Stand to Make Millions",
    "summary": "Investment firms are on track for an enormous payday after the Supreme Court of the United States (SCOTUS) struck down President Donald Trump’s signature tariff policy on Friday.\nWhen Trump introduced sweeping tariffs on foreign goods last April, hedge funds and specialist investment firms began to bet on the possibility that the courts might rule that he had violated the law.\nEven then, he says, the administration may choose to challenge any lower court ruling that requires the government to refund tariff payments.\nThe prevailing uncertainty leaves the investment firms holding refund claims with a dilemma: Should they bank some winnings by flipping the claims to another buyer, or wait out the legal wrangling?\n“Trump is Trump is Trump, man,” says Braziel.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-20T21:05:44Z",
    "source": "Wired"
  },
  {
    "id": "NTI=",
    "url": "https://petapixel.com/2026/02/20/us-supreme-court-rules-trumps-tariffs-are-illegal/",
    "title": "US Supreme Court Rules Trump’s Tariffs Are Illegal",
    "summary": "The United States Supreme Court has struck down President Trump’s controversial global tariffs in a 6-3 ruling.\nEvery lower court that had considered Trump’s use of tariffs had ruled against him.\nToday, the Supreme Court has validated what we’ve been saying all along: these tariffs were unlawful from the start.\n“Small businesses are rightfully worried that the Administration will respond to this legal defeat by simply reimposing the same tariff policy through other means.\nTariffs imposed under IEEPA crippled small businesses; tariffs reimposed under different statutory approaches would have the same destructive effect.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2026-02-20T15:49:58Z",
    "source": "PetaPixel"
  },
  {
    "id": "NTQ=",
    "url": "https://www.businessinsider.com/coo-job-is-especially-challenging-with-tariff-uncertainty-scotus-2026-2",
    "title": "COO's Jobs Are Especially Challenging Due to Tariff Uncertainty",
    "summary": "Friday's tariff ruling has once again put America's supply-chain bosses in a bind.\n\"Tariffs are written in DC, and they're felt in the COO's inbox,\" Jason Schloetzer, a professor at Georgetown's McDonough School of Business, told Business Insider.\nMany companies are still grappling with the impact of actions they took last year to cope with Trump's tariff hikes, said Rob Lalka, who teaches entrepreneurship at Tulane University.\nNow, with the fate of Trump's tariffs up in the air, COOs are experiencing the kind of whiplash that can be debilitating, said Lalka, especially for those at startups and small businesses with limited resources.\nOmni, which imports goods from Spain and exports to Canada, lost sales last year due to the Trump administration's tariffs, Smith said.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-21T10:39:01Z",
    "source": "Business Insider"
  },
  {
    "id": "NTU=",
    "url": "https://slate.com/news-and-politics/2026/02/supreme-court-analysis-john-roberts-trump-tariffs-fail.html",
    "title": "John Roberts’ Rebuke of Trump’s Tariffs Is Withering, Confident, and Genuinely Encouraging",
    "summary": "The Supreme Court struck down Donald Trump’s sweeping “emergency” tariffs on Friday, ruling 6–3 that they far exceed what federal law allows.\nIn truth, Trump’s tariffs were always on shaky legal ground, no matter how confidently the White House insisted they were permissible.\nBut IEEPA does not mention tariffs, duties, taxes, or anything else that would hint at Congress’ desire to delegate tariff authority to the executive branch.\nRoberts, joined by Gorsuch and Barrett, invoked the “major questions doctrine” to bolster their conclusion that IEEPA does not cover tariffs.\nAdvertisementTrump’s Justice Department argued that the doctrine does not apply to “foreign affairs,” attempting to gerrymander a massive exception to accommodate its trade policy.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-20T17:07:07Z",
    "source": "Slate Magazine"
  }
]