[
  {
    "id": "MA==",
    "url": "https://www.businessinsider.com/gen-x-financially-secure-but-still-in-debt-2026-1",
    "title": "I'm 52 and thought I'd be financially secure by now. But I'm still facing debt and long-term unemployment.",
    "summary": "The author is still financially struggling in her 50s.\nCourtesy of Dana Lee JonesThe author is still financially struggling in her 50s.\nInstead, at 52, I'm still struggling financially and facing debt.\nMy career felt solid.\nMany contractors like me did not receive back pay, and each day without work felt like slipping into the same uncertainty I was still clawing my way out of.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-10T12:47:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MQ==",
    "url": "https://finance.yahoo.com/video/jobs-report-impact-why-experts-214109145.html",
    "title": "Jobs report impact: Why experts expect 2 Fed rate cuts this year",
    "summary": "00:03 RobYeah, we we think there's probably a couple to come, but they won't be early and they won't be quick.\nAnd I think I think really when we think about that couple of rate cuts, it's really because there's a wide dispersion of potential outcomes here, right?\nWith the uh if we see some uh a surge in this economy, the Fed may not have to do anything, right?\nBut when you consider that small businesses are still going to be, you know, trying to access bank loans with revolving rates and they're, you know, they're subject to interest rate risk.\nI think that a few cuts, one or two, maybe one in March, one in June would really start to get things going.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-01-09T21:41:09Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mg==",
    "url": "https://www.businessinsider.com/jobs-report-december-data-live-updates-2026-1",
    "title": "Jobs report recap: US added fewer jobs in December than expected, capping off a tough 2025 for job seekers",
    "summary": "One way: \"We really slow down in terms of hiring, and we hit a place where the bottom falls out.\nAnd it's not just about slow hiring, it's about firing workers and a recession.\"\nShe told Business Insider in December that she thinks the job market will go in one of two ways.\nShe told Business Insider in December that she thinks the job market will go in one of two ways.\n\"At some point, if you want to grow as a company, you're going to have to bring in more workers,\" Sahm said.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-01-09T10:55:05Z",
    "source": "Business Insider"
  },
  {
    "id": "Mw==",
    "url": "https://www.calculatedriskblog.com/2026/01/december-employment-report-50-thousand.html",
    "title": "Calculated Risk: December Employment Report: 50 thousand Jobs, 4.4% Unemployment Rate",
    "summary": "Total payrolls increased by 50 thousand in December.\nPrivate payrolls increased by37 thousand, and public payrolls increased 13 thousand.\nThe second graph shows the year-over-year change in total non-farm employment since 1968.In December, the year-over-year change was 0.594 million jobs.\nI'll have more later ... Year-over-year employment growth has slowed sharply.The third graph shows the employment population ratio and the participation rate.\nThe first graph shows the jobs added per month since January 2021.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2026-01-09T13:30:00Z",
    "source": "Calculatedriskblog.com"
  },
  {
    "id": "NQ==",
    "url": "https://www.businessinsider.com/analyst-quit-jpmorgan-to-run-restaurants-with-father-best-decision-2026-1",
    "title": "I quit my job at JPMorgan to run a restaurant group with my dad. It's the best decision I've ever made.",
    "summary": "Photo courtesy of The Louis CollectionKassidy Angelo is pictured with her father, Tom Angelo.\nI never imagined myself entering the restaurant business at the age of 24.\nI viewed it as a once-in-a-lifetime opportunity not only to work with my dad, but to build something from the ground up.\nHaving worked with senior management at JPMorgan, I had the confidence to run the restaurant.\nOn my first day at the restaurant, I learned how to run the door, be a hostess, serve, and run private events.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-11T10:11:01Z",
    "source": "Business Insider"
  },
  {
    "id": "Ng==",
    "url": "https://www.businessinsider.com/point72-strategy-executive-james-malick-has-left-the-hedge-fund-2026-1",
    "title": "Point72's strategy leader exits as Steve Cohen's $41.5 billion fund rolls out new businesses",
    "summary": "New York Mets owner Steve Cohen runs more than $41 billion at his firm, Point72.\nNew York Mets owner Steve Cohen runs more than $41 billion at his firm, Point72.\nRich Storry/Getty ImagesNew York Mets owner Steve Cohen runs more than $41 billion at his firm, Point72.\nRich Storry/Getty ImagesPoint72's chief strategy officer is no longer at the $41.5 billion hedge fund.\nJames Malick, who joined Steve Cohen's firm in 2023, departed the asset manager this week, two people familiar with the matter told Business Insider.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2026-01-09T10:17:01Z",
    "source": "Business Insider"
  },
  {
    "id": "Nw==",
    "url": "https://www.businessinsider.com/trump-ban-wall-street-buying-houses-not-solution-home-prices-2026-1",
    "title": "How banning big investors from buying homes could affect prices",
    "summary": "Industry watchers on both sides of the aisle say President Donald Trump's recently announced goal of banning \"large institutional investors\" from buying single-family homes won't address the root cause of high home prices: a shortage of homes.\nIn the aftermath of the 2008 financial crisis, large investors bought thousands of distressed properties, particularly in Southeastern cities.\nAnd since 2022, large investors have slowed their purchasing as interest rates have spiked and home prices have remained high.\nSome major investors have shifted their business model to buying homes in bulk directly from homebuilders, rather than purchasing them one by one.\nFairweather agreed that banning large landlords from owning single-family homes would mean fewer tenants could live in these wealthier neighborhoods.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-09T17:22:56Z",
    "source": "Business Insider"
  },
  {
    "id": "OA==",
    "url": "https://www.jezebel.com/america-had-its-worst-non-recession-jobs-year-since-2003",
    "title": "America Had Its Worst Non-Recession Jobs Year Since 2003",
    "summary": "ICE and CPB’s racist operations, more than any other policy of Trump 2, are harming economic growth, according to the last legitimate Chair of the Federal Reserve.\nTrump is throwing that all into question, making us look more like Europe and Japan; older, less dynamic societies with a cap on intrinsic economic growth.\nTrump also wants to lower interest rates to around 1% or less, essentially making that a requirement of the next Fed Chair.\nWhat the 1970s taught us is that there is good economic growth and bad economic “growth,” called inflation.\nIt is very possible that Trump drops the Fed Funds Rate to 1%, and broader interest rates rise in response.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-09T16:36:19Z",
    "source": "Jezebel"
  },
  {
    "id": "OQ==",
    "url": "https://www.mentalfloss.com/culture/jobs/best-cities-to-find-job-2026",
    "title": "Looking for a Job? These Cities Are Leading the Way in 2026",
    "summary": "MORE THAN A PAYCHECKWalletHubThere are two key drivers when it comes to uncovering the cities with the best job opportunities in 2026: market and socioeconomic factors.\nAccording to WalletHub, job market factors to consider when searching for your next best role include employment growth, average monthly salary, unemployment rates, job security, job satisfaction, and access to benefits and retirement options.\nColumbia, Maryland, quietly dominates with promising employment growth, affordable rent and housing, and exceptional job security.\nDown South, Orlando, Florida, is not just tourists and theme parks; it's a thriving job market paired with no state income tax, which is always a plus.\nThis metropolis reported robust job growth from 2024 to 2026 across multiple specialties and annual median wages that align with the rising cost of living.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2026-01-11T15:00:00Z",
    "source": "Mental Floss"
  },
  {
    "id": "MTA=",
    "url": "https://www.npr.org/2026/01/09/nx-s1-5670392/jobs-employment-labor-market-economy-tariffs",
    "title": "Hiring slows in December to end the weakest year of job growth since the pandemic",
    "summary": "Hiring slows in December to end the weakest year of job growth since the pandemictoggle caption Spencer Platt/Getty Images North AmericaHiring remained anemic in December, closing out the weakest year for job growth since the beginning of the pandemic.\nFor all of 2025, employers added 584,000 jobs — compared to 2 million new jobs in 2024.\nThe federal government added 2,000 jobs in December, but is still down 277,000 jobs from the beginning of the year.\nThe government recorded big job losses earlier in the fall, when workers who accepted buyouts officially dropped off the government's payroll.\nConcern about the weakening job market prompted the Federal Reserve to cut its benchmark interest rate in December for the third time since September.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-09T13:49:25Z",
    "source": "NPR"
  },
  {
    "id": "MTI=",
    "url": "https://finance.yahoo.com/video/us-consumer-sentiment-improves-four-154225447.html",
    "title": "US Consumer Sentiment Improves to Four-Month High",
    "summary": "US consumer sentiment climbed to 54 from 52.9 in December, according to the University of Michigan, on slightly more upbeat views about the economy as tariff concerns fade.\nMichael McKee reports on Bloomberg Television.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-09T15:42:25Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MTQ=",
    "url": "https://www.yahoo.com/news/articles/400-000-payout-maduros-capture-141046047.html",
    "title": "A $400,000 payout after Maduro's capture is putting prediction markets in the spotlight",
    "summary": "Prediction markets let people wager on anything from a basketball game to the outcome of a presidential election — and recently, the downfall of former Venezuelan President Nicolás Maduro.\nHere's what we know:How prediction markets workThe scope of topics involved in prediction markets can range immensely — from escalation in geopolitical conflicts, to pop culture moments and even the fate of conspiracy theories.\nProponents of prediction markets argue putting money on the line leads to better forecasts.\nStill, it's never a “crystal ball,” he noted, and prediction markets can be wrong, too.\nLoose regulationBecause they’re positioned as selling event contracts, prediction markets are regulated by the CFTC.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-11T14:10:46Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MTU=",
    "url": "https://www.cbc.ca/news/business/job-numbers-dec-2025-9.7039303",
    "title": "Canadian economy added 8,200 jobs in December, while unemployment rose to 6.8%",
    "summary": "Statistics Canada says a boost in the number of people looking for work in December drove the unemployment rate higher at the end of the year.\nCanada created just 8,200 new jobs in December, while the unemployment rate rose to 6.8 per cent, up from 6.5 per cent the month before.\nDecember's job gains were concentrated in full-time work, which added 50,200 jobs in December, while part-time ‍employment fell ⁠by 42,000.\nDouglas Porter, BMO's chief economist, said the December figures bring job gains back to a more \"realistic place.\"\nFriday's jobs report marks the Bank of Canada's last look at the state of the labour market before its first interest-rate decision of the year later this month.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-01-09T14:00:31Z",
    "source": "CBC News"
  },
  {
    "id": "MTc=",
    "url": "https://www.wired.com/story/backchannel-silicon-valley-billionaires-california-taxes/",
    "title": "Silicon Valley Billionaires Panic Over California’s Proposed Wealth Tax",
    "summary": "He recently posted a tweet stream opposing the bill, saying that if California passed the wealth tax it would be cutting off its nose to spite its face.\nWhen I speak to Mahan, he emphasizes the risk of California standing alone in taxing the net worth of billionaires.\nBecause of the mobility of rich people, California does have real worries about the impact of a state wealth tax.\nAlso, I don’t see why an exodus of billionaires necessarily means the end of Silicon Valley as the heart of tech innovation.\nA few years ago, some tech people moved to Miami, claiming it was going to become the new Silicon Valley.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-09T16:00:00Z",
    "source": "Wired"
  },
  {
    "id": "MzU=",
    "url": "https://autos.yahoo.com/general/articles/ford-stored-unsold-mavericks-underground-154900595.html",
    "title": "Ford Stored Unsold Mavericks Underground in Kansas City During 1970s Sales Slump",
    "summary": "During the 1970s, Ford Motor Company took an unconventional approach to managing surplus inventory by storing unsold vehicles deep underground beneath Kansas City.\nAs market conditions shifted and sales slowed, Ford found itself with thousands of unsold Mavericks occupying dealership space and storage lots.\nCompared with surface storage, the underground environment lowered long-term storage costs and preserved vehicle condition while Ford evaluated its next steps.\nBy storing completed vehicles underground, Ford effectively bought time to redistribute inventory or sell cars later once demand stabilized.\nRather than forcing rapid discounting or scrapping new vehicles, Ford used the underground storage as a buffer against shifting consumer demand.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-01-10T15:49:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzY=",
    "url": "https://finance.yahoo.com/news/plains-gp-holdings-pagp-pricing-211139932.html",
    "title": "Is Plains GP Holdings (PAGP) Pricing Reflect Long Term Energy Infrastructure Demand?",
    "summary": "Our Discounted Cash Flow (DCF) analysis suggests Plains GP Holdings is undervalued by 83.0%.\nFor Plains GP Holdings, the model used is a 2 Stage Free Cash Flow to Equity approach, based on last twelve months free cash flow of about $2.26b.\nPlains GP Holdings scores just 2/6 on our valuation checks.\nOn our checks, Plains GP Holdings has a valuation score of 2 out of 6 .\nRecent coverage around Plains GP Holdings has centered on its position in the U.S. energy infrastructure space and how investors are thinking about long term demand for transport and storage capacity.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-09T21:11:39Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mzg=",
    "url": "https://finance.yahoo.com/news/factbox-white-house-gathers-oil-110226050.html",
    "title": "Factbox-White House gathers oil majors, traders, drillers on Venezuela",
    "summary": "By Jarrett RenshawJan 9 (Reuters) - The White House is convening a ​meeting on Friday with major ‌U.S.\nand international oil companies to discuss ‌potential investment in Venezuela’s energy sector, as the administration weighs ways to revive crude output in the ⁠sanctions-hit country, ‌according to a White House official.\nThe companies include producers, refiners, ‍traders and oilfield services firms with past or potential exposure to Venezuela.\nAlso ​attending are Secretary of State ‌Marco Rubio, Energy Secretary Chris Wright and Interior Secretary Doug Burgum, the White House official said.\nHere is a list of companies expected to ⁠attend, according to ​a White House official.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-09T11:13:13Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mzk=",
    "url": "https://www.businessinsider.com/california-billionaires-list-wealth-tax-2026-1",
    "title": "See the list of California's 200-plus billionaires who could be hit by the proposed wealth tax",
    "summary": "Palmer Luckey, Mark Zuckerberg, and Jensen Huang are among the billionaires who could be affected by a California wealth tax.\nPalmer Luckey, Mark Zuckerberg, and Jensen Huang are among the billionaires who could be affected by a California wealth tax.\nPatrick T. Fallon/AFP/Getty Images; Jeff Bottari/Zuffa LLC/Getty Images; Patrick T. Fallon/AFP/Getty ImagesPalmer Luckey, Mark Zuckerberg, and Jensen Huang are among the billionaires who could be affected by a California wealth tax.\nPatrick T. Fallon/AFP/Getty Images; Jeff Bottari/Zuffa LLC/Getty Images; Patrick T. Fallon/AFP/Getty Imageslighning bolt icon An icon in the shape of a lightning bolt.\nSo a proposed wealth tax on its billionaires could be a windfall, if they stick around.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-10T21:10:45Z",
    "source": "Business Insider"
  }
]