[
  {
    "id": "MA==",
    "url": "https://www.cnn.com/2025/12/20/business/russia-economy-struggling-ukraine-war-intl",
    "title": "Russia’s economy is struggling. But that won’t bring Putin to the negotiating table for years",
    "summary": "But the gathering economic storm is unlikely to bring President Vladimir Putin to the negotiation table anytime soon to end the war in Ukraine.\n“Russian soldiers today are paid more than any Russian soldier in the history of Russian soldiers,” RUSI’s Connolly said.\nSome of Russia’s more deprived areas have experienced an uplift during the war, in part because of huge pay checks going to Russian soldiers and their families.\n“They (Russian oil producers) are rerouting oil exports through smaller Russian companies… That is all costing a lot of money,” she said.\nIf that is combined with stronger sanctions enforcement and increased pressure on India and China to stop buying Russian oil, the Kremlin could eventually change its calculus, she argued.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-12-20T08:00:00Z",
    "source": "CNN"
  },
  {
    "id": "MQ==",
    "url": "https://www.investopedia.com/how-trump-can-turbocharge-the-global-economy-and-crush-inflation-11871221",
    "title": "There's One Thing Trump Could Do To Turbocharge The Global Economy And Crush Inflation",
    "summary": "There's no indication that tariffs will suddenly be removed, but the paper highlighted the extreme impact they've had on the global economy.\nPresident Donald Trump could invigorate the global economy and stamp out inflation quickly.\nThat's a boost of 0.5 percentage points per year, all while reducing inflation for U.S. consumers.\n\"One year after \"liberation day,\" the U.S. administration starts lowering U.S. tariffs back to the levels at end-2024.\"\nLiberation from \"Liberation Day\" would not only reinvigorate global trade, but would help household budgets for U.S. consumers.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-12-21T11:20:00Z",
    "source": "Investopedia"
  },
  {
    "id": "Mg==",
    "url": "https://www.calculatedriskblog.com/2025/12/ten-economic-questions-for-2026.html",
    "title": "Calculated Risk: Ten Economic Questions for 2026",
    "summary": "1) Economic growth: Economic growth was probably close to 2% Q4-over-Q4 in 2025.\n3) Unemployment Rate: The unemployment rate was at 4.6% in November, up from 4.2% in November 2024.\nWill the core inflation rate decrease further in 2026, and what will the YoY core inflation rate be in December 2026?\nCurrently the FOMC is projecting the unemployment rate will decrease to the 4.3% to 4.4% range in Q4 2026.\nLong term, the BLS is projecting the overall participation rate will decline to 61.1% by 2034 due to demographics.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-12-21T13:21:00Z",
    "source": "Calculatedriskblog.com"
  },
  {
    "id": "Mw==",
    "url": "https://www.businessinsider.com/economists-paint-a-complicated-picture-of-trumps-economic-outcomes-2025-12",
    "title": "Trump is touting a smaller trade deficit. Economists paint a more complicated picture.",
    "summary": "Ahead of the midterm elections, Trump is promoting reduced trade deficit and tariff revenue as economic successes.\nAhead of the midterm elections, Trump is promoting reduced trade deficit and tariff revenue as economic successes.\nJonathan Ernst/REUTERSAhead of the midterm elections, Trump is promoting reduced trade deficit and tariff revenue as economic successes.\n'\"Unlike the budget deficit, the trade deficit is meaningless,\" Winegarden added.\n\"Remember when I said 'tariff' — my favorite word is 'tariff,'\" Trump told a crowd in Pennsylvania, \"Tariffs are bringing us hundreds of billions of dollars.\"",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-12-22T12:34:01Z",
    "source": "Business Insider"
  },
  {
    "id": "NA==",
    "url": "https://www.yahoo.com/news/articles/long-lines-food-pantry-inflation-100428499.html",
    "title": "Long lines at the food pantry: Inflation tests Trump’s base in Michigan",
    "summary": "CAPAC, Michigan, Dec 21 (Reuters) - On a recent snowy morning in a Trump-loving part of rural Michigan, three dozen cars idled outside a firehouse-turned-food pantry.\nLudwig said she had expected Trump to have made greater ​progress on inflation nearly a year into his presidency.\nBut now, persistent inflation is testing that pledge — and the patience of voters who helped put him in office.\nA dozen said they would still vote Republican, and three said they were unsure or did not share their voting plans.\nAdvertisement AdvertisementAdvertisement AdvertisementHe predicted Trump's tariffs would bring back high-paying manufacturing jobs and boost wages above the rate of inflation.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-12-21T10:04:28Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NQ==",
    "url": "https://finance.yahoo.com/news/trump-shook-global-trade-uncertainty-060313193.html",
    "title": "Trump shook up global trade this year; some uncertainty may persist in 2026",
    "summary": "His trade policies - and the global reaction to them - will remain front and ​center in 2026, but face some hefty challenges.\nSince then, European exporters and economies have broadly coped with the new tariff rate, thanks to various exemptions and their ability to find ⁠markets elsewhere.\nFrench bank Societe Generale estimated the total direct impact of the tariffs ‌was equivalent to just 0.37% of the region's GDP.\nWhat notably did not happen was the economic calamity and high inflation that legions of economists predicted would unfold from Trump's tariffs.\nThe International Monetary Fund, in fact, twice lifted its global growth outlook in the months following Trump's \"Liberation Day\" tariffs announcement ​in April as uncertainty ebbed and deals were struck to reduce the originally announced rates.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-12-22T06:03:13Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Ng==",
    "url": "https://www.yahoo.com/news/articles/trumps-economy-collides-reality-pennsylvania-130334158.html",
    "title": "Trump's 'A+++++' economy collides with the reality in a Pennsylvania city critical to the midterms",
    "summary": "“It's worse than ever,” the 67-year-old retiree, who relies on Social Security, said when asked about the economy.\nIn our world, trust me, it’s not an ‘A.’ To me, it’s an ‘F,’ ‘F,’ ‘F,’ ‘F,’ ‘F,’ ‘F.’”Agreement that prices are too highWith a population of roughly 125,000 people, Allentown anchors the Lehigh Valley, which is Pennsylvania's third-largest metro area.\nAdvertisement AdvertisementAdvertisement Advertisement“Every race here, all the time,” Allentown’s mayor, Democrat Matt Tuerk, recalled of the frenzied race last year.\nBut as attention shifts to next year’s midterms, Allentown cannot escape its place as a political battleground.\nHarris' nearly 2.7 percentage point win in the county was the tightest margin for a Democratic presidential candidate since 2004.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-12-20T13:03:34Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MTE=",
    "url": "https://www.businessinsider.com/job-market-find-work-employment-hiring-slowdown-careers-2025-12",
    "title": "Job Market in 2025: Americans Struggled to Find Work, Trying to Cope",
    "summary": "Business Insider spoke with dozens of job seekers across generations in 2025, some of whom have been unemployed for more than a year.\nStill, through the frustration, they've also found ways to cope and connect with a community of fellow job seekers.\nGiving up on job goalsA challenging job market has forced some job seekers to confront the possibility that their goals and aspirations may be out of reach.\nHow job seekers are coping with the stress — and breaking throughSome job seekers Business Insider spoke with have leaned on others — including friends, family, professional contacts, and fellow job seekers — for support and solidarity during their job searches.\nValen's top advice for other job seekers: Reframe how you view the process — and lean on others along the way.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-12-21T09:53:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MTI=",
    "url": "https://www.project-syndicate.org/commentary/powerful-headwinds-facing-global-economy-in-2026-by-kenneth-rogoff-2025-12",
    "title": "Expect Turbulent Asset Markets in 2026",
    "summary": "After three years of extraordinary returns, investors should start worrying about the inevitable crash that follows periods of sustained euphoria.\nOne might expect that, after three years of extraordinary returns, markets would start worrying about the inevitable crash that follows periods of sustained euphoria.\nHOLIDAY SALE: Save $25 on a Digital Plus subscription Our annual flagship magazine, PS Quarterly: The Year Ahead 2026, is here!\nMoreover, the negative impact of Trump’s tariff and immigration policies will be felt more acutely in 2026.\nAs markets begin to sense that growth is slowing, possibly accompanied by rising inflation, today’s euphoria could quickly fade.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-12-22T15:13:49Z",
    "source": "Project Syndicate"
  }
]