[
  {
    "url": "https://gizmodo.com/welcome-to-the-jobless-growth-economy-2000673236",
    "title": "Welcome to the ‘Jobless Growth’ Economy",
    "summary": "America is entering an era of “jobless growth,” according to analysts at Goldman Sachs.\nThe memo, written by economists David Mericle and Pierfrancesco Mei and spotted by Fortune, warns that the current market of “modest job growth alongside robust GDP growth” is likely the new normal going forward.\nThe thing about senior roles is that you need people with experience to fill them.\nThat hasn’t materialized even a little thus far, but the idea that it will has severely messed up the job market.\nOne thing is for sure: AI is going to be transformative for the economy.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-17T12:30:59Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.businessinsider.com/wall-street-mamdani-cuomo-divide-nyc-mayoral-race-change-2025-10",
    "title": "Where Wall Street stands on the NYC mayoral race, and how that could shift closer to Election Day",
    "summary": "We examined where Wall Street workers are putting their money .\nBut first, Wall Street on the campaign trail.\nThe big storyMamdani vs. CuomoStephanie Keith; Michael M. Santiago / Getty ImagesWall Street's stance on New York's mayoral race might surprise you.\nMamdani, a democratic socialist, appears to represent the antithesis of everything Wall Street is about.\nAnd if that's the case, some on Wall Street could change their tune.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-10-16T13:29:24Z",
    "source": "Business Insider"
  },
  {
    "url": "https://uk.finance.yahoo.com/news/imf-global-debt-reeves-jobs-economy-weekend-budget-125851835.html",
    "title": "The Weekend: IMF warns of global debt emergency as Reeves grapples with slowing jobs market",
    "summary": "There was a stark warning from the IMF this week as it predicted government debt across the world would hit the highest level since the aftermath of World War Two by the end of the decade.\nThe report comes ahead of the government's autumn budget, where chancellor Rachel Reeves is expected to raise the tax burden on families and businesses.\nThe official figures showed pay growth slowing and unemployment edging higher in the three months to August.\nPerhaps Reeves could find inspiration in the work of Joel Mokyr, Philippe Aghion and Peter Howitt, who were this week awarded the 2025 Nobel economics prize for \"having explained innovation-driven economic growth\".\nThe American, French and Canadian economists \"have taught us that sustained growth cannot be taken for granted,” the prize-awarding body said.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-10-18T12:58:51Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://abcnews.go.com/Politics/trump-administrations-20b-bailout-argentina/story?id=126513232",
    "title": "What to know about the Trump administration's $20B bailout for Argentina",
    "summary": "Argentina's President Javier Milei met with Trump and top U.S. officials, including Treasury Secretary Scott Bessent, Tuesday at the White House.\nPresident Donald Trump welcomes Argentina's President Javier Milei at the White House in Washington, October 14, 2025.\n\"Why would USA help bail out Argentina while they take American soybean producers' biggest market, he said.\nPresident Donald Trump speaks during a meeting with Argentina's President Javier Milei at the White House in Washington, October 14, 2025.\n\"If he loses, we are not going to be generous with Argentina,\" Trump said.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-10-15T16:24:54Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cew418r5rxdo",
    "title": "UK sanctions Russia's oil giants over Ukraine war",
    "summary": "The UK government is also pursuing a major Indian oil refinery and four Chinese oil terminals in a package of 90 new sanctions.\nBritain is targeting Russia's largest oil companies and the country's \"shadow fleet\" of oil tankers in a bid to cut off Vladimir Putin's ability to fund the war in Ukraine.\nThe two Russian oil firms export 3.1 million barrels of oil per day.\nA Russian embassy spokesperson said: \"Attacks on leading Russian oil and gas companies destabilise global energy markets and ultimately hit consumers worldwide.\"\nThe US separately has discussed putting additional tariffs on goods from China, up to 500%, tied to Beijing's purchases of Russian oil.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-15T14:24:39Z",
    "source": "BBC News"
  },
  {
    "url": "https://finance.yahoo.com/news/robert-kiyosaki-warns-us-baby-111500504.html",
    "title": "Robert Kiyosaki warns US baby boomers will be ‘wiped out,’ left homeless ‘all over’ the country — how to fight back now",
    "summary": "(2)“The boomers don’t have enough money to get through inflation.\nKiyosaki argued that by printing fiat currency, the Federal Reserve fuels price increases that make everyday life harder for ordinary Americans.\nBut according to “Rich Dad, Poor Dad” author Robert Kiyosaki, those golden years may not be so golden after all.\nKiyosaki also shared the assets he believes can stand strong against inflation, money printing — and more.\nReal estateGold isn’t the only asset investors turn to during inflationary times.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-17T11:15:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.calculatedriskblog.com/2025/10/2009-calling-bottom-for-economy.html",
    "title": "Calculated Risk: 2009: Calling the Bottom for the Economy",
    "summary": "In early 2009, many analysts were predicting the 2nd Great Depression.\nHowever I started seeing some positive signs ... and I was able to call the end of the recession in mid-2009.\nFrom January 2009: Vehicle SalesDavid Rosenberg at Merrill Lynch wrote a research piece last week: \"Not Your Father’s Recession ...(But Maybe Your Grandfather’s)\" (no link)Needless to say, the piece wasn't too upbeat.\nBut I was intrigued by some of the comments on vehicle sales.\nEven though most of the economic news will be ugly in 2009, my guess is all three of these series will find a bottom (or at least the pace of decline will slow significantly).",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-10-15T12:11:00Z",
    "source": "Calculatedriskblog.com"
  },
  {
    "url": "https://www.businessinsider.com/ai-spending-boom-capex-big-tech-morgan-stanley-2025-10",
    "title": "Morgan Stanley says huge AI capex spending will deliver returns by 2028",
    "summary": "In an October 13 note to investors, Morgan Stanley global director of research Katy Huberty shared a chart on AI tech spending diffusion.\nIt showed a group of highly connected tech companies with a lot of capital flowing either through or from OpenAI.\nThe analyst notes that Morgan Stanley's tech team thinks the AI spending cycle is still in its early stages, but the huge price tag shouldn't necessarily spook investors.\nMorgan Stanley's forecast implies the current wave of AI spending is part of a longer-term profit cycle and not a speculative bubble that some have begun to fear.\nAnalysts from firms such as Morningstar have speculated that colossal AI capex among tech companies such as Amazon, Microsoft, and Alphabet could negatively impact their stock prices over time.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-10-15T09:30:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/ulta-beauty-gen-alpha-prefers-in-store-shopping-korean-beauty-2025-10",
    "title": "Ulta Beauty CEO says Gen Alpha prefers to shop IRL",
    "summary": "Despite being true digital natives, Gen Alpha shoppers are all about IRL.\nDuring Fortune's Most Powerful Women Summit on Tuesday, Ulta Beauty CEO Kecia Steelman said Gen Alpha consumers prefer in-store experiences over online shopping.\n\"What we're seeing with the Gen Alpha consumer is, yes, they're getting their information online, but they really, really like that experience in store.\nSteelman said Gen Alpha shoppers are also into Korean beauty, which has become popular among US consumers, and clean beauty, which is products made ethically with non-harmful ingredients.\nRepresentatives for Ulta Beauty did not respond to a request for comment from Business Insider.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-10-15T18:41:45Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.noahpinion.blog/p/the-richest-third-world-country",
    "title": "The richest third-world country",
    "summary": "Art by GrokThe other day a friend asked me whether it made sense to call America “the richest third-world country”.\nBut nowadays, when people call the U.S. a “third world country”, I find myself taking the epithet much more seriously.\nAmerican politics is starting to look decidedly like something you’d encounter in a dysfunctional middle-income nation — Turkey, Hungary, Brazil, or Israel.\nAs I said, this is the kind of thing that happens, if not in third-world dictatorships, then at least in middle-income countries with populist strongmen.\nThe U.S. is getting Third World politics; will it also get Third World poverty?",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-18T04:31:59Z",
    "source": "Noahpinion.blog"
  },
  {
    "url": "https://www.businessinsider.com/youtube-star-mrbeast-taking-steps-to-launch-financial-services-2025-10",
    "title": "YouTube Star MrBeast Takes Steps to Launch Financial Services Venture",
    "summary": "MrBeast, who built a brand on stunt videos featuring cash giveaways, wants to help his fans manage their money.\nThe world's top YouTuber, who has 445 million subscribers, is laying the groundwork to expand into financial services, according to a new trademark application and investor materials viewed by Business Insider.\nIt would exist under the \"MrBeast Financial\" brand.\nIt said the company would launch by partnering with a fintech company to leverage its existing infrastructure \"while avoiding regulatory, credit risk, and capital requirement.\"\nIn 2024, fintech company MoneyLion sponsored a $4.2 million giveaway tied to the creator's Amazon Prime Video show \"Beast Games.\"",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-10-15T21:14:35Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.yahoo.com/news/articles/kremlin-rejects-trumps-view-russian-112721598.html",
    "title": "Kremlin rejects Trump's view that the Russian economy could collapse",
    "summary": "By Guy Faulconbridge, Olesya Astakhova and Gleb StolyarovMOSCOW (Reuters) -The Kremlin on Wednesday pushed back at U.S. President Donald Trump's warning that the Russian economy was going to collapse, saying that Russia had considerable reserves and was strong enough to allow President Vladimir Putin to achieve his goals.\nTrump on Tuesday said that Putin should settle the war in Ukraine which was making Russia look bad.\nHe also mentioned \"long lines waiting for gasoline\" and said the Russian \"economy is going to collapse\".\n\"As for the Russian economy, it has a sufficient and considerable margin of safety to allow the country's leadership and all of us to implement the plans that we set for ourselves,\" Peskov told reporters.\nDuring Putin's first two terms as president from 2000 to 2008, Russia's economy soared to $1.7 trillion from less than $200 billion in 1999.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-15T11:27:21Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://gizmodo.com/bitcoin-price-slumps-as-wall-street-prepares-for-crypto-etf-frenzy-2000673653",
    "title": "Bitcoin Price Slumps as Wall Street Prepares for Crypto ETF Frenzy",
    "summary": "As part of the Trump administration’s embrace of crypto, the SEC has been more welcoming to publicly traded ETFs that are intended to track various crypto assets.\nWe're already at 2x AltAlt Season Crypto ETFs and its not even October.\nhttps://t.co/VWMf8tT8S8 — Eric Balchunas (@EricBalchunas) September 18, 2025As an example of how the inherently speculative nature of crypto assets may be bleeding too much into traditional markets, a filing was made last month for a product that would track small-cap crypto assets with 2x leverage.\nThe product uses “Alt Season” in its name, which is a nod to the particularly frothy part of the crypto market cycle when less established crypto assets start to outperform bitcoin itself.\nCrypto Market Structure Bill Off to Rough StartWhile the crypto industry is still seeking greater clarity in terms of the regulatory definitions of various types of crypto assets (i.e.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-17T17:40:25Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://finance.yahoo.com/news/goldman-sachs-says-demand-gold-175231232.html",
    "title": "Goldman Sachs says the demand for gold is not just hype, and predicts the U.S. could still see a repeat of a Nixon-era spike",
    "summary": "Lina Thomas, commodities strategist with Goldman Sachs Research, said in a video posted on Thursday the swelling price of gold is more than hype.\nGoldman Sachs projects gold will reach $4,900 by the end of 2026.\nThe recent gold bug has even led Wall Street to reluctantly capitulate to investors’ desire to buy gold.\n1970s deja vuGoldman commodities strategist Thomas drew a comparison between today’s gold rush and that of the 1970s.\n“Back then, fiscal concerns and policy uncertainty led private investors to seek a store of value outside the system,” she said.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-17T17:52:31Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/video/docusign-ceo-discusses-emerging-capabilities-112752991.html",
    "title": "Docusign CEO discusses the emerging capabilities of AI startups",
    "summary": "00:09 Speaker BYou know, Open AI is a hugely important partner for us.\nA lot of our AI is is built on theirs and and other uh frontier LLM models.\nIt's the most important data a company has and so I think those those three factors position us very well to help bring AI to agreements.\n01:32 Speaker AThe pace that uh in OpenAI is moving to uh release new products, update models, whatever it is.\nUh, we do that, I think Doy is going to be very well positioned in the long term.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-17T11:27:52Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://gizmodo.com/cnn-is-trying-to-sell-a-streaming-service-again-only-more-expensive-this-time-2000673714",
    "title": "CNN Is Trying to Sell a Streaming Service Again (Only More Expensive This Time)",
    "summary": "For years now, CNN has been haplessly trying to modernize its media franchise by launching a streaming service.\nThose of you aware of these efforts will recall CNN+, which launched a few years ago and, despite an ample amount of buzz and financing, humiliatingly lasted less than a month.\nIf you’ll recall, CNN+ was developed several years ago and was initially hailed as the future of news programming.\nAt the time, CNBC reported that, in the first few weeks of the service, only 10,000 people watched CNN+ on a daily basis.\nAt the time of its unfortunate launch, it was compared to Quibi, the financially bloated streaming service launched in 2020 that sought to monetize “quick bite” infotainment but crashed and burned inside of a year.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2025-10-17T21:25:32Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.businessinsider.com/sequoia-roelof-botha-venture-capital-return-free-risk-2025-10",
    "title": "Sequoia partner says there's too much venture capital and not enough companies to invest in: 'It's a return-free risk'",
    "summary": "Sequoia partner Roelof Botha said there's too much money in venture capital and not enough return.\nSequoia partner Roelof Botha said there's too much money in venture capital and not enough return.\nTasos Katopodis/Getty Images for Jacob HelbergSequoia partner Roelof Botha said there's too much money in venture capital and not enough return.\nImpact LinkEven a veteran Silicon Valley investor can't make the numbers behind venture capital add up.\nVenture capital has had a mostly rough year so far, driven by uncertainty in the economy and markets.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-10-16T09:20:02Z",
    "source": "Business Insider"
  },
  {
    "url": "https://hackaday.com/2025/10/15/floss-weekly-episode-851-buckets-of-money/",
    "title": "FLOSS Weekly Episode 851: Buckets Of Money",
    "summary": "This week Jonathan talks to James Cole about Firefly III, the personal finance manager!\nThis one itches James’ own itch, but brings great visualization and management tools for your personal finances!\nLet us know, or contact the guest and have them contact us!\nIf you’d rather read along, here’s the transcript for this week’s episode.\nPlaces to follow the FLOSS Weekly Podcast: SpotifyRSSTheme music: “Newer Wave” Kevin MacLeod (incompetech.com)Licensed under Creative Commons: By Attribution 4.0 License",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-15T18:30:01Z",
    "source": "Hackaday"
  },
  {
    "url": "https://www.yahoo.com/news/articles/us-homebuilder-sentiment-hits-6-162158457.html",
    "title": "US homebuilder sentiment hits 6-month high; economy uncertainty clouds housing outlook",
    "summary": "\"A meaningful recovery in housing demand, construction and transactions is unlikely before mid-2026.\"\nThe National Association of Home Builders/Wells Fargo Housing Market index increased five points to 37 this month, the highest reading since April, the NAHB said on Thursday.\nAdvertisement AdvertisementAdvertisement AdvertisementHigher mortgage rates have dampened housing demand, resulting in a glut of unsold new homes on the market.\n\"The housing market has some areas with firm demand, including ... ongoing solid conditions for the luxury market,\" said NAHB chairman Buddy Hughes.\nHOUSING MARKET CONDITIONS REMAIN CHALLENGINGThe survey is the latest to highlight what some economists are calling a K-shaped economy, where high-income households are driving much of activity.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-10-16T16:21:58Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://abcnews.go.com/Business/wireStory/average-long-term-us-mortgage-rate-slips-627-126585508",
    "title": "Average long-term US mortgage rate slips to 6.27%, nearing a low for 2025",
    "summary": "(AP Photo/David Zalubowski, File)The average rate on a 30-year U.S. mortgage declined again this week, easing to just above its lowest level this year.\nThe average long-term mortgage rate slipped to 6.27% from 6.3% last week, mortgage buyer Freddie Mac said Thursday.\nThe average rate dropped to 5.52% from 5.53% last week.\nEven if the Fed opts to cut its short-term rate further that doesn’t necessarily mean mortgage rates will keep declining.\nThe average rate on a 30-year mortgage has remained above 6% since September 2022, the year mortgage rates began climbing from historic lows.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-16T16:39:45Z",
    "source": "ABC News"
  }
]