[
  {
    "id": "MA==",
    "url": "https://www.businessinsider.com/ai-economy-jobs-unemployment-citrini-disruption-openai-anthropic-2026-02",
    "title": "Investors Face Harsh Reality: If AI Hype Is Real, so Are the Layoffs",
    "summary": "Thomas Fuller/NurPhoto via Getty ImagesYou know all that money and effort everyone's putting into AI because they're convinced it's a technology that will change everything?\nAnd now the blowback: AI boosters are calling the Citrini post \"AI doomerism\" and are poking at some of its doomsday scenarios.\nIt's what accounts for the enormous investments tech companies are making in AI, and the crazy valuations we're seeing for the likes of Anthropic ($380 billion) and OpenAI ($850 billion).\nBut a lot of the value will come from the fact that AI will let computers do lots of work humans do now.\nNor do you have to be an AI \"doomer\" to think this way — it's baked into the pitch of the biggest AI companies.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2026-02-24T19:02:50Z",
    "source": "Business Insider"
  },
  {
    "id": "MQ==",
    "url": "https://www.businessinsider.com/supreme-court-trump-tariffs-ruling-impact-consumer-prices-goldman-sachs-2026-2",
    "title": "Sorry, shoppers: prices aren't coming down post-tariffs ruling, Goldman Sachs says",
    "summary": "Retail prices are unlikely to fall even after the Supreme Court struck down Trump's tariffs, Goldman Sachs says.\nRetail prices are unlikely to fall even after the Supreme Court struck down Trump's tariffs, Goldman Sachs says.\nMyung J Chun/Los Angeles Times/Getty ImagesRetail prices are unlikely to fall even after the Supreme Court struck down Trump's tariffs, Goldman Sachs says.\nImpact LinkDon't expect prices at the store to fall just because the Supreme Court struck down President Donald Trump's tariffs.\nBut they're unlikely to cut prices outright, economists at Goldman Sachs wrote in a note published Sunday.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2026-02-23T06:07:01Z",
    "source": "Business Insider"
  },
  {
    "id": "Mg==",
    "url": "https://www.businessinsider.com/economists-business-leaderss-react-citrini-report-ai-recession-stock-crash-2026-2",
    "title": "What smart people in economics and business are saying about a viral report warning of an AI-driven recession and stock crash",
    "summary": "A Wall Street trader works on the floor at the New York Stock Exchange.\nA Wall Street trader works on the floor at the New York Stock Exchange.\nBrendan McDermid/ReutersA Wall Street trader works on the floor at the New York Stock Exchange.\nBrendan McDermid/Reuterslighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-24T12:47:21Z",
    "source": "Business Insider"
  },
  {
    "id": "Mw==",
    "url": "https://www.businessinsider.com/trump-state-of-union-speech-economy-taxes-inflation-fed-housing-2026-2",
    "title": "Trump touted his economic agenda on prices, taxes, and healthcare in his State of the Union",
    "summary": "President Donald Trump gave his annual State of the Union speech before Congress.\nPresident Donald Trump gave his annual State of the Union speech before Congress.\nHe opened the event focused on his administration's economic agenda, especially inflation rates and consumer prices.\nThe Trump administration officially launched TrumpRx a few weeks ago, a direct-to-consumer prescription platform.\nEconomic outlookThroughout his second term, the Trump administration has leaned into affordability issues, especially high prices on consumer goods.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-25T02:35:31Z",
    "source": "Business Insider"
  },
  {
    "id": "Ng==",
    "url": "https://www.businessinsider.com/zachary-squire-tekmerion-capital-brevan-howard-spinout-hedge-fund-2026-2",
    "title": "Meet Tekmerion: The classics-obsessed macro investor spinning out of Brevan Howard with $1 billion",
    "summary": "Even in the eccentric world of macro investors, though, Squire stands out.\n\"We want investors who understand what macro is, we want investors who understand hedge funds,\" he added.\nAdding to his macro toolkit, Squire spent the next three years in London for credit investor HBK, focused on emerging markets.\nThe manager caught the eye of billionaire Brevan Howard cofounder Alan Howard, who personally backed the young fund.\nBecause of the slow frequency of many macro datasets, the firm typically holds positions for weeks at a time, Morrissey said.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-25T10:57:01Z",
    "source": "Business Insider"
  },
  {
    "id": "OQ==",
    "url": "https://www.businessinsider.com/spirit-budget-carrier-with-premium-seats-beat-bankruptcy-2026-2",
    "title": "Spirit Expands Premiums Seats, Loyalty Rewards to Beat Bankruptcy",
    "summary": "Its debts and costs will be reduced, allowing the airline to keep fares low while doubling down on two of the industry's biggest moneymakers: premium seats and loyalty programs.\nThis includes new Spirit First loungers in the first few rows, extra-legroom premium economy seats, and expanded loyalty perks, giving travelers more choices while generating additional revenue.\nAmerican, Delta, and United have led this trend by doubling down on expanding and revamping their own high-dollar premium seats.\nThis push toward premium isn't newSpirit first began experimenting with higher-end offerings in 2024, as travelers showed a willingness to pay extra for premium perks.\nThe barebones seats on Spirit don't recline, have screens, or have a proper seatback pocket.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-25T10:01:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MTE=",
    "url": "https://finance.yahoo.com/news/stocks-sell-off-traders-wake-111342816.html",
    "title": "Stocks sell off as traders wake up to the realization that Trump has ‘highly punitive’ options for new trade tariffs",
    "summary": "Goldman Sachs also reported that its in-house “Risk Appetite Indicator” had sunk back from its recent peak.\nAt first glance, ending the tariffs looked broadly good for stocks because it makes international trade easier and cheaper for companies.\nAs UBS’s Paul Donovan put it, “Welcome back uncertainty.”BNP analyst William Bratton published a research note summarizing Trump’s options.\nIt is not applicable to agricultural products, metals, minerals, chemicals, oil, gas, pharmaceuticals, aircraft, some electronics, and various automobiles.\nSection 232 tariffs also “have no upper limit and can be expanded in scope once implemented.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-23T11:13:42Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mjg=",
    "url": "https://www.bbc.com/news/articles/c875edj1qeno",
    "title": "Reform vows to overhaul pension schemes for new local government workers",
    "summary": "Reform plans to bar any new entrants to the current schemes and, like most of the private sector, enrol new employees into defined contribution schemes.\nIn those schemes payout is not guaranteed, but instead depends on contributions made by the employee and employer, and gains (or losses) from market investments.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2026-02-23T22:14:36Z",
    "source": "BBC News"
  },
  {
    "id": "NTM=",
    "url": "https://www.npr.org/2026/02/25/nx-s1-5724002/trump-tariffs-consumer-prices",
    "title": "Why prices won't drop after the Trump tariff ruling, according to economists",
    "summary": "Why prices won't drop after the Trump tariff ruling, according to economiststoggle caption Timothy A. Clary/AFP via Getty ImagesConsumers likely won't see cheaper prices at the grocery store or shopping mall, economists say, despite the Supreme Court striking down many of President Trump's tariffs.\nWithin hours of the ruling, Trump said he was using a different law to reimpose taxes on global imports.\nBy Saturday, Trump said he was using Section 122 of the Trade Act of 1974 to implement worldwide tariffs of 15%, after initially saying he would impose them at 10%.\nThere's also Section 338 of the Tariff Act of 1930, a never-used authority to use tariffs to retaliate against foreign discrimination against American goods.\nBut in this case, tariffs have led to higher prices for consumers, and they could stay that way.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-25T10:00:00Z",
    "source": "NPR"
  }
]