[
  {
    "url": "https://abcnews.go.com/Business/trumps-new-tariffs-economy-experts-weigh/story?id=124273016",
    "title": "What do Trump's new tariffs mean for the economy? Experts weigh in",
    "summary": "What do Trump's new tariffs mean for the economy?\nExperts weigh inDonald Trump signs an executive order restarting the Presidential Fitness Test in public schools, July 31, 2025, in the Roosevelt Room of the White House in Washington.\nU.S. stocks tumbled on Friday in the immediate aftermath of sweeping new tariffs issued by President Donald Trump.\n\"Obviously, they're not what we want to see,\" Stephen Miran, chair of the White House Council of Economic Advisors, said on Friday.\nCongress passed Trump's spending measure earlier this month; more recently, Trump announced a fresh round of tariffs late Thursday.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-08-01T19:51:35Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.businessinsider.com/russia-economy-inflation-down-pmi-gdp-growth-central-bank-tradeoff-2025-8",
    "title": "Russia's inflation fight is working — at the cost of growth",
    "summary": "Russian President Vladimir Putin's administration has managed to keep his country's economy humming despite sweeping Western sanctions, but there are growing pressures.\nRussian President Vladimir Putin's administration has managed to keep his country's economy humming despite sweeping Western sanctions, but there are growing pressures.\n\"Current inflationary pressures, including underlying ones, are declining faster than previously forecast,\" Russia's central bank said last month.\nRussia's inflation fell from 8.2% in the first quarter to 4.8% in the second quarter, prompting its central bank to lower its key interest rate from 20% to 18%.\nRussia's central bank now finds itself walking a tightrope: keeping inflation in check while avoiding a deeper downturn.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-08-04T05:32:18Z",
    "source": "Business Insider"
  },
  {
    "url": "https://abcnews.go.com/Business/stocks-tumble-after-trump-unveils-sweeping-new-tariffs/story?id=124272914",
    "title": "Stocks close lower after Trump's new tariffs, weak jobs report",
    "summary": "Traders work on the floor at the New York Stock Exchange in New York City, July 30, 2025.\nTraders work on the floor at the New York Stock Exchange in New York City, July 30, 2025.\nA weak jobs report worsened investor jitters, revealing a slowdown of hiring over recent months as Trump's previous tariffs took hold.\nThe U.S. added 73,000 jobs in July, which came in well below an average of 130,000 jobs jobs added each month this year, according to data from the U.S. Bureau of Labor Statistics, or BLS.\nThe report also provided new estimates for two previous months, significantly dropping the government's estimate of jobs added in May and June.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-08-01T13:53:43Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.businessinsider.com/real-problem-america-jobs-data-bls-funding-trump-fired-commissioner-2025-8",
    "title": "The Real Problem With the BLS and America's Jobs Data",
    "summary": "America is the gold standard for economic data — but that doesn't mean it's perfect.\nTrump's main issue with the BLS was its revisions to previous months' jobs data, which revealed a weaker jobs market than had been previously estimated.\nIt's not just jobs data that suffers from a lack of participation.\nMeanwhile, it would be very difficult for the BLS data to be \"rigged\" by anyone, including the Commissioner.\nBLS is a prized gem of the economic world, even if it's imperfect.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-08-05T14:21:44Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/trump-says-he-will-fire-bureau-of-labor-statistics-commissioner-2025-8",
    "title": "Trump fires Bureau of Labor Statistics commissioner",
    "summary": "Following a disappointing jobs report on Friday, President Donald Trump fired the Bureau of Labor Statistics commissioner.\nShe will be replaced with someone much more competent and qualified,\" Trump wrote in a Truth Social post.\nDuring the search for McEntarfer's replacement, Deputy Commissioner William Wiatrowski will serve as Acting Commissioner, Labor Secretary Lori Chavez-DeRemer said on X.\nTrump wrote that the Friday jobs report was a \"major mistake\" and \"The Economy is BOOMING under 'TRUMP.'\"\n\"The totally groundless firing of Dr. Erika McEntarfer, my successor as Commissioner of Labor Statistics at BLS, sets a dangerous precedent and undermines the statistical mission of the Bureau,\" William Beach, an economist and former Commissioner of Labor Statistics, said in a post on X.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-08-01T18:52:29Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.wired.com/story/pointers-on-travel-points-view-from-the-wing/",
    "title": "The Internet's Biggest Travel Nerd Shares Pointers on Points",
    "summary": "But miles, points, and rewards are not merely a side hustle or a second job; they’re a lifestyle.\n“I couldn't tell you how long I spend on the blog, because I’m doing the things that I enjoy anyway,” says Leff.\nWhen it's time to evaluate the future of my relationship with a card, I put that reminder into my calendar.\nI paired that with a deal through American Express Travel where you could book the Conrad Bangkok presidential suite for $51 a night.\nGary Leff belongs to 70-plus travel loyalty programs.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2025-08-06T13:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://finance.yahoo.com/news/3-dividend-stocks-enhance-portfolio-113136203.html",
    "title": "3 Dividend Stocks To Enhance Your Portfolio",
    "summary": "In such uncertain times, dividend stocks can offer a reliable income stream, providing both potential for growth and a buffer against market volatility.\nTop 10 Dividend Stocks In The United StatesName Dividend Yield Dividend Rating Valley National Bancorp (VLY) 4.79% ★★★★★☆ Universal (UVV) 6.08% ★★★★★★ Huntington Bancshares (HBAN) 3.87% ★★★★★☆ First Interstate BancSystem (FIBK) 6.62% ★★★★★★ Ennis (EBF) 5.69% ★★★★★★ Douglas Dynamics (PLOW) 4.23% ★★★★★☆ Dillard's (DDS) 5.55% ★★★★★★ CompX International (CIX) 5.39% ★★★★★★ Columbia Banking System (COLB) 6.19% ★★★★★★ Citizens & Northern (CZNC) 6.08% ★★★★★☆Click here to see the full list of 145 stocks from our Top US Dividend Stocks screener.\nDividend Yield: 3%Cathay General Bancorp offers a stable dividend with a payout ratio of 32.7%, indicating dividends are well covered by earnings.\nRecent earnings growth supports sustainability, with net income rising to US$77.45 million in Q2 2025 from US$66.83 million a year prior.\nDividend Yield: 8.9%Ardmore Shipping's dividend yield is among the top 25% in the US, supported by a low payout ratio of 36.4%, indicating dividends are well covered by earnings and cash flows.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-08-04T11:31:36Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.theatlantic.com/economy/archive/2025/08/trump-tariffs-economic-data/683740/",
    "title": "The Mystery of the Strong Economy Has Finally Been Solved",
    "summary": "The Trump economy doesn’t look so hot after all.\nInstead, according to the available numbers, inflation remained stable, job growth remained strong, and the stock market set new records.\nIn recent months, Trump has imposed 25 percent tariffs on car parts and 50 percent tariffs on copper, steel, and aluminum.\n(The prior month’s inflation report was also revised upward to show a slight increase in May.)\nThe Trump administration has found itself caught between deflecting blame for the weak economic numbers and denying the numbers’ validity.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-08-01T20:02:00Z",
    "source": "The Atlantic"
  }
]