[
  {
    "url": "https://www.businessinsider.com/fed-rate-cut-fomc-meeting-takeaways-inflation-labor-market-reaction-2025-12",
    "title": "Fed Rate Cut: Here Are the Biggest Takeaways From the Latest Fed Meeting",
    "summary": "From the labor market to inflation to stocks, here's everything to know about the latest Fed decision.\nBusiness Insider's economy and markets teams broke down what the December Fed meeting means for you.\nEmphasis on the labor market hinted that, despite dissent among Fed officials, the focus would remain on strengthening the economy rather than fighting inflation.\n\"I want inflation to be back down to 2% and I want the labor market to be strong — that's what I want.\nIt's the biggest split seen at a Fed meeting since 2019 and signals ongoing tension between the Fed's dual mandate and how each member weighs employment and inflation risks.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-12-10T21:15:49Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/ai-impact-jobs-youth-unemployment-hiring-freeze-uncertainty-tariffs-2025-12",
    "title": "Young People Aren't Getting Hired — but AI Isn't to Blame",
    "summary": "lighning bolt icon An icon in the shape of a lightning bolt.\nYoung people entering the job market are facing the toughest conditions in years — but artificial intelligence isn't the reason.\nA new analysis from a London-based economics consultancy suggests something much more old-fashioned is going on: Companies simply aren't hiring.\nPerkins' report came as markets continue to assess the impact of AI technology on the economy and employment.\nIn October, Goldman warned of an era of \"jobless growth\" in the US due to AI, even as the broader economy remains strong.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-12-08T05:34:23Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/cs/features/810002/influencers-creator-economy-special-series",
    "title": "How the creator economy destroyed the internet",
    "summary": "It’sIt’s fashionable to talk about the creator economy like it’s a new thing, but the harsh reality is that the creator economy is the media and internet economy now.\nPlatforms like TikTok, Instagram, and YouTube generate billions of dollars in revenue in ways that have created some of the richest companies in the history of the world, and they so dominate culture that the future of politics often looks more like creator drama than actual policymaking.\nThere are not many industries where it’s more valuable to stop selling bits and start selling atoms, but every major creator eventually pivots to selling products because it’s more lucrative than chasing views and brand deals.\nAll of those viral videos are just a marketing front for the real MrBeast business: a line of chocolate bars, available at your local Walmart.\nIt’s already here.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-12-08T13:04:53Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/fed-rate-cut-decision-december-what-to-know-2025-12",
    "title": "Fed meeting recap: Central bank cuts rates for a 3rd time — and shows its biggest split in years",
    "summary": "That's because the Fed chief is nearing the end of his term, and investors have already penciled in fewer rate cuts in 2026.\nStocks popped on the rate decision, even as dissent among Fed officials points to heightened uncertainty over the path of monetary policy in 2026.\nStocks popped on the rate decision, even as dissent among Fed officials points to heightened uncertainty over the path of monetary policy in 2026.\nThat's because the Fed chief is nearing the end of his term, and investors have already penciled in fewer rate cuts in 2026.\nI don't expect much between now and the end of his term,\" Hickey said.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-12-09T09:03:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/stock-market-bubble-ai-job-losses-wealth-howard-marks-oaktree-2025-12",
    "title": "Stock Bubble, AI Job Losses, Wealth Destruction on Howard Marks' Radar",
    "summary": "Howard Marks' latest letter to investors contained some bleak warnings about what he sees ahead for markets and the economy.\nRounding out the billionaire investors' top concerns are AI-fueled job losses, a destructive bubble in stocks, and growing debt levels in the US.\nA wealth-destroying stock bubbleJOHANNES EISELE/AFP via Getty ImagesMarks flagged the risks of an AI-fueled stock bubble.\n\"The key is to not be one of the investors whose wealth is destroyed in the process of bringing on progress,\" Marks wrote.\nSocial and political unrestGrowing wealth inequality could stoke social and political chaos in the US, Marks said.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2025-12-10T19:36:51Z",
    "source": "Business Insider"
  },
  {
    "url": "https://finance.yahoo.com/news/careful-wish-top-economist-warns-180233161.html",
    "title": "‘Be careful what you wish for’: Top economist warns any additional interest rate cuts after today would signal the economy is slipping into danger",
    "summary": "The Federal Reserve is likely to deliver its third interest rate cut of the year on Wednesday, a move widely understood to be insurance against the bottom completely falling out of the labor market.\n“If the [Jerome] Powell Fed ends up doing a lot more cuts,” she told Fortune ahead of the decision, “then we probably don’t have a good economy.\nBe careful what you wish for.”That framing cuts against the dominant mood on Wall Street, where rate cuts have recently been reflexively welcomed and futures markets are already pricing in a second round of easing in 2026.\n“Whatever they do could upset the other side.”That tension is especially sharp because Fed Chair Jerome Powell is nearing the end of his term.\n“Feels like in a way the last Powell Fed meeting,” Bloomberg’s Conor Sen wrote on X.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-12-10T18:02:33Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/federal-reserve-cuts-interest-rates-by-25-basis-points-signals-1-cut-ahead-150046493.html",
    "title": "Federal Reserve cuts interest rates by 25 basis points, signals 1 cut ahead",
    "summary": "The Federal Reserve cut interest rates by a quarter percentage point for the third time this year on Wednesday while projecting one more cut for 2026.\nFed officials project one more rate cut next year, the same number projected in September.\nSix members of the Fed would have preferred not to cut rates Wednesday.\nFour members see one cut, four see two cuts, two see three cuts, one sees four cuts, and one sees six cuts.\nThe unemployment rate is seen ticking down to 4.4% next year from 4.5% this year, the same as seen previously.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-12-10T15:00:46Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/live/fed-meeting-live-coverage-federal-reserve-cuts-interest-rates-by-025-powell-says-theres-no-risk-free-path-200909359.html",
    "title": "Fed meeting live coverage: Federal Reserve cuts interest rates by 0.25%, Powell says there's 'no risk-free path'",
    "summary": "The Federal Reserve cut interest rates by 25 basis points at the conclusion of its two-day meeting on Wednesday, marking the central bank's third cut of the year.\nFed officials were split on the decision to lower rates to a range of 3.50%-3.75%, with policymakers dissenting on both sides.\nChicago Fed president Austan Goolsbee and Kansas City Fed president Jeff Schmid favored holding rates steady, while Fed governor Stephen Miran favored a 50 basis point rate cut.\nAt the press conference, Fed Chair Jerome Powell underscored that the Fed remains in a \"challenging\" position, with both sides of its dual mandate in tension.\nThe SEP showed the Fed's median forecasts calling for one interest rate cut in 2026, in line with the projections made in September.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-12-10T20:09:09Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://abcnews.go.com/Business/divided-fed-set-announce-decision-interest-rates/story?id=128204427",
    "title": "Fed cuts interest rates for 3rd time this year in effort to boost hiring",
    "summary": "Fed cuts interest rates for 3rd time this year in effort to boost hiringFederal Reserve Chair Jerome Powell speaks as he holds a press conference following a two-day meeting of the Federal Open Market Committee at the Federal Reserve in Washington, December 10, 2025.\nFederal Reserve Chair Jerome Powell speaks as he holds a press conference following a two-day meeting of the Federal Open Market Committee at the Federal Reserve in Washington, December 10, 2025.\nThe Federal Reserve cut its benchmark interest rate a quarter of a percentage point on Wednesday, opting for its third interest rate cut this year in an effort to revive a sluggish labor market.\nOn the other hand, by lowering rates to stimulate hiring, the Fed threatens to boost spending and worsen inflation.\nLately, sentiment shifted in favor of a rate cut as some influential central bankers voiced openness toward the move, futures markets showed.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-12-10T10:18:04Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.calculatedriskblog.com/2025/12/fomc-projections-gdp-and-unemployment.html",
    "title": "Calculated Risk: FOMC Projections: GDP and Unemployment Revised Up; Inflation Down",
    "summary": "Statement here.\nFed Chair Powell press conference video here or on YouTube here, starting at 2:30 PM ET.\nThe BEA's estimate for first half 2025 GDP showed real growth at 1.6% annualized.\nThat would put the real growth for the first three quarters at 2.2% annualized - well above the top end of the September projections.\nThe FOMC revised up Q4 2025 and Q4 2026 GDP growth.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-12-10T19:11:00Z",
    "source": "Calculatedriskblog.com"
  },
  {
    "url": "https://finance.yahoo.com/news/trump-sets-out-to-address-americans-affordability-concerns-even-as-he-calls-those-worries-a-con-job-180620198.html",
    "title": "Trump sets out to address Americans' affordability concerns even as he calls those worries a 'con job'",
    "summary": "President Trump is hitting the road today to address Americans' affordability concerns head-on.\n\"You can call it affordability or anything you want, but the Democrats caused the affordability problem,\" Trump offered Monday at the White House as he again falsely claimed that prices now are falling overall.\nJust this past weekend, the White House announced a new effort to address \"risks from price fixing and anti-competitive behavior in the food supply chain.\"\nPresident Trump speaks during a Kennedy Center Honors dinner in Washington, D.C., on Saturday.\nHe may also announce new initiatives to address affordability.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-12-08T18:06:20Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/powells-fed-just-cut-rates-160559162.html",
    "title": "Powell's Fed Just Cut Rates Again -- But the Real Shock Is What Happens Next",
    "summary": "After trimming rates twice this autumn and by 1.5 percentage points over the past 15 months the Fed is inching toward levels that could stimulate economic activity, something many policymakers would prefer to avoid.\nThe shutdown that consumed October and most of November has left Powell without timely data to guide the next narrative.\nIn September, eight officials favored stopping cuts at levels expected after Wednesday's decision, while nine signaled at least two more in 2026.\nThe median outlook could adjust growth for 2025 slightly higher, trim inflation estimates for the end of this year, and nudge unemployment forecasts upward.\nPowell faces a more fragmented committee, with several regional presidents arguing against further reductions and Fed Governor Stephen Miran expected to dissent again in favor of a larger half-point cut.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-12-10T16:05:59Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://ca.finance.yahoo.com/news/bank-of-canada-expected-to-hold-benchmark-interest-rate-today-as-market-chatter-turns-to-possible-hikes-ahead-120009898.html",
    "title": "Bank of Canada holds key interest rate at 2.25%, gives no timeline for increases",
    "summary": "The Bank of Canada cut interest rates at its last two consecutive rate decisions.\nREUTERS/Blair Gable · REUTERS / ReutersThe Bank of Canada (BoC) held its benchmark interest rate at 2.25 per cent on Wednesday, a move widely expected by economists.\nThe market had 93.5 per cent odds that the BoC would hold, according to LSEG data.\nMacklem repeatedly noted the BoC’s commitment to keeping inflation on target, even as he and senior deputy governor Carolyn Rogers acknowledged the pressure felt by many Canadians.\nHe acknowledged three months of consensus-beating employment data, but noted “muted hiring intentions across the economy” in the future.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-12-10T12:00:09Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/trump-moves-to-address-americans-affordability-concerns-even-as-he-calls-those-worries-a-con-job-180620833.html",
    "title": "Trump sets out to address Americans' affordability concerns even as he calls those worries a 'con job'",
    "summary": "President Trump is hitting the road today to address Americans' affordability concerns head-on.\n\"You can call it affordability or anything you want, but the Democrats caused the affordability problem,\" Trump offered Monday at the White House as he again falsely claimed that prices now are falling overall.\nJust this past weekend, the White House announced a new effort to address \"risks from price fixing and anti-competitive behavior in the food supply chain.\"\nPresident Trump speaks during a Kennedy Center Honors dinner in Washington, D.C., on Saturday.\nHe may also announce new initiatives to address affordability.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-12-08T18:06:20Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/consumers-expect-medical-costs-to-surge-by-most-in-over-a-decade-161024172.html",
    "title": "Consumers expect medical costs to surge by most in over a decade",
    "summary": "Americans see their medical costs skyrocketing next year by the most in more than a decade, according to data published Monday by the Federal Reserve Bank of New York.\nConsumers’ median expectations for annual growth in medical costs hit 10.1% in November, the New York Fed said.\nExpectations for healthcare costs in the year ahead last approached this level at the beginning of 2014, when consumers saw costs rising by 11.15%.\nA family of four making $130,000, for example, could see annual premium costs rise from $11,050 with enhancements to $23,909 without, according to calculations from the Center on Budget and Policy Priorities.\nSign up for the Mind Your Money newsletterClick here for the latest personal finance news to help you with investing, paying off debt, buying a home, retirement, and moreRead the latest financial and business news from Yahoo Finance",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-12-08T16:10:24Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/trump-kicks-off-economic-tour-in-pennsylvania-and-defends-tariffs-2025-12",
    "title": "Trump defends tariffs as he launches economic tour: 'You can give up certain products. You could give up pencils.'",
    "summary": "President Donald Trump is standing by his tariffs, at least in theory.\n\"They always have a hoax,\" Trump told the crowd, referring to criticism from Democrats that his policies drove up prices.\nYeah, they're too high because they cause them to be too high,\" Trump added.\nDespite standing by his tariff policies, Trump has, in reality, rolled back many of his earlier tariffs, especially ones enacted on April 2.\nOf the remaining tariffs, evidence points to an impact on the price of consumer goods.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-12-10T04:14:37Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/middlemen-supply-chains-america-economy-prices-amazon-uber-2025-12",
    "title": "Middlemen Like Uber, Amazon, and DoorDash Are Consuming the US Economy",
    "summary": "One thing he was not so right about: the idea that the internet would cut out the economy's middlemen.\nAnd while some more analog middlemen — sorry, travel agents — have withered, others in industries from pharma to meatpacking have tightened their grips.\nMiddlemen are a necessary evil in many parts of the modern economy.\nA lot of what middlemen solve for are fixed costs, explains Matthew Grant, an assistant professor of economics at Dartmouth College.\nAmazon booked $638 billion in sales in 2024, Uber generated $44 billion in revenue, and Sysco reported $80 billion in sales.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-12-07T09:28:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.thedailybeast.com/donald-trump-aides-beg-him-to-stop-blaming-joe-biden-for-his-own-mess/",
    "title": "Trump Aides Beg Him to Stop Blaming Biden for His Own Mess",
    "summary": "Weary aides to President Donald Trump want him to stop making fantastical claims about the economy and pinning woes on his predecessor, according to a new report.\nWhite House officials are urging Trump not to dismiss concerns from tens of millions of Americans about the cost-of-living crisis and rising food prices, and to stop pointing the finger at former President Joe Biden, who left office in January.\n“Joe Biden is no longer a threat to them because he’s out of office, he’s never going to be in office again,” one unnamed Trump adviser told CNN.\nYou’ve got to talk about it every day.”CNN suggests that Donald Trump’s plan of “simply blaming Biden” for the state of the economy is not working with the public.\nPaul Morigi/Getty Images“Everybody gets it at the White House,” a Trump adviser told CNN.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2025-12-09T15:04:35Z",
    "source": "Daily Beast"
  },
  {
    "url": "https://www.businessinsider.com/european-cities-visit-holidays-christmas-markets-frequent-traveler-recommendations-2025-12",
    "title": "I lived in Europe for almost a decade. Here are the 6 cities you should visit during the holiday season.",
    "summary": "The city is famous for its grand palaces, and come winter, it's dotted with incredible Christmas markets.\nOne of my favorites is the Advent Basilica Market, which pulls you in like a magnet with colorful stalls, a towering Christmas tree, and a light show every 30 minutes — all in front of St. Stephen's Basilica.\nFor a truly local experience, hop across the river to ice skate at the Advent in Óbuda market, located about 20 minutes from the Basilica on public transport.\nWhile you're in the city, I recommend trying kürtőskalács, which you can watch vendors make at all of the major markets.\nWhen it's fresh off the coals, steam rises from the center of the pastry, resembling a smoking chimney.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-12-10T14:37:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.calculatedriskblog.com/2025/12/fomc-preview-25bps-rate-cut-expected.html",
    "title": "Calculated Risk: FOMC Preview: 25bps Rate Cut Expected",
    "summary": "Most analysts expect the FOMC to reduce the Fed Funds rate by 25bps at the meeting this week to a target range of 3-1/2 to 3-3/4 percent.\nMarket participants currently expect two additional rate cuts in 2026.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-12-07T16:50:00Z",
    "source": "Calculatedriskblog.com"
  }
]