[
  {
    "id": "MQ==",
    "url": "https://www.businessinsider.com/economy-job-market-divide-k-shape-economy-2026-2",
    "title": "The economy grew strongly last year, but hiring stagnated. It's making the gap between the rich and everyone else worse.",
    "summary": "The data is in, and last year presents an economic conundrum: Overall growth was relatively strong, but job growth was virtually nonexistent.\nZipRecruiter economist Nicole Bachaud thinks the job market could be at a \"pivot point\" after stronger hiring in January.\nThey don't have to worry as much about rising prices of necessities and slowing wage growth.\n\"They're also enjoying faster wage growth, while lower-income families are seeing reduced wage growth, near-zero real wage growth, and not much wealth appreciation outside of real estate, if they have that.\"\nLower-income wage growth surged between 2021 and 2022, but has since cooled down a lot from the late 2022 peak.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-22T10:12:01Z",
    "source": "Business Insider"
  },
  {
    "id": "Mg==",
    "url": "https://www.businessinsider.com/supreme-court-trump-tariffs-ruling-impact-consumer-prices-goldman-sachs-2026-2",
    "title": "Sorry, shoppers: prices aren't coming down post-tariffs ruling, Goldman Sachs says",
    "summary": "Retail prices are unlikely to fall even after the Supreme Court struck down Trump's tariffs, Goldman Sachs says.\nRetail prices are unlikely to fall even after the Supreme Court struck down Trump's tariffs, Goldman Sachs says.\nMyung J Chun/Los Angeles Times/Getty ImagesRetail prices are unlikely to fall even after the Supreme Court struck down Trump's tariffs, Goldman Sachs says.\nImpact LinkDon't expect prices at the store to fall just because the Supreme Court struck down President Donald Trump's tariffs.\nBut they're unlikely to cut prices outright, economists at Goldman Sachs wrote in a note published Sunday.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2026-02-23T06:07:01Z",
    "source": "Business Insider"
  },
  {
    "id": "Mw==",
    "url": "https://www.businessinsider.com/finding-job-search-struggles-savings-americans-federal-reserve-amazon-tech-2026-2",
    "title": "Job Searches Lengthen, Savings Dwindle for Americans",
    "summary": "Joanelle Cobos (left), Clair Todd (right)Job searches are taking longer, and some Americans' savings aren't keeping up.\nWilke's experience underscores how quickly a prolonged job search can unravel someone's finances — especially for workers without much savings to fall back on.\nBusiness Insider is speaking with workers who've found themselves at a corporate crossroads — whether due to a layoff, resignation, job search, or shifting workplace expectations.\nMany Americans aren't prepared financially for unemploymentAs unemployment spells lengthen, the financial risks of a prolonged job search are rising for many Americans.\nBut if her job search stretches on, she knows that sense of security will gradually fade.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-22T10:05:01Z",
    "source": "Business Insider"
  },
  {
    "id": "OQ==",
    "url": "https://finance.yahoo.com/news/stocks-sell-off-traders-wake-111342816.html",
    "title": "Stocks sell off as traders wake up to the realization that Trump has ‘highly punitive’ options for new trade tariffs",
    "summary": "More from Yahoo Scout How do different tariff sections impact trade policy complexity?\nWhat caused global markets to decline after Trump's Supreme Court reaction?\nAt first glance, ending the tariffs looked broadly good for stocks because it makes international trade easier and cheaper for companies.\nAs UBS’s Paul Donovan put it, “Welcome back uncertainty.”BNP analyst William Bratton published a research note summarizing Trump’s options.\nSection 232 tariffs also “have no upper limit and can be expanded in scope once implemented.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2026-02-23T11:13:42Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MTM=",
    "url": "https://www.businessinsider.com/jamie-dimon-banks-doing-dumb-things-2008-credit-crisis-warning-2026-2",
    "title": "Jamie Dimon on the loan rush: 'I see a couple of people doing some dumb things'",
    "summary": "Jamie Dimon said he sees echoes of pre-2008 excess as competition heats up.\nJamie Dimon said he sees echoes of pre-2008 excess as competition heats up.\nFabrice Coffrini/AFP/Getty ImagesJamie Dimon said he sees echoes of pre-2008 excess as competition heats up.\nFabrice Coffrini/AFP/Getty Imageslighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-24T05:01:12Z",
    "source": "Business Insider"
  },
  {
    "id": "MzQ=",
    "url": "https://www.businessinsider.com/what-country-richest-people-moving-2026-2",
    "title": "The mega-rich are moving. Here's where they're going.",
    "summary": "In 2018, only 108,000 extremely wealthy individuals emigrated to a new country.\nSwitzerland, for example, has a lump-sum tax scheme that uses a taxpayer's lifestyle expenses as a surrogate tax base, rather than taxing global income and assets.\nThe UAE doesn't levy income tax; instead, it relies on a 5% value-added tax.\nMany of the global wealthy are relocating to cities that offer entrepreneurial freedom, often lacking in more bureaucratic regions.\nWith growing restrictions on travel to many countries, wealthy individuals are applying for second residencies or even multiple citizenships as a safeguard.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-23T08:33:01Z",
    "source": "Business Insider"
  },
  {
    "id": "Mzc=",
    "url": "https://www.wired.com/story/the-supreme-courts-tariff-ruling-wont-bring-car-prices-back-to-earth/",
    "title": "The Supreme Court’s Tariff Ruling Won’t Bring Car Prices Back to Earth",
    "summary": "Now, despite a US Supreme Court ruling that will nix some of those Trump tariffs, car buyers will likely get no respite.\nAutomakers have actually done an OK job shielding consumers from the effects of tariffs, Caldwell says.\nEven as retailers have blamed tariffs for steadily rising prices of consumer goods like electronics and appliances, car prices are up just 1 percent since this time last year, the firm’s data shows.\nBut as the tariff regime drags on, that could change in ways that make new-car buyers even less happy.\n“If cost pressures continue to build, automakers may have less room to shield shoppers from higher prices,” Caldwell says, “but for now, the broader market impact is still playing out.”",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-21T00:10:01Z",
    "source": "Wired"
  },
  {
    "id": "NTI=",
    "url": "https://abcnews.com/Politics/trump-continues-lash-supreme-court-after-tariff-ruling/story?id=130407379",
    "title": "Trump continues to lash out at Supreme Court after tariff ruling",
    "summary": "Trump continues to lash out at Supreme Court after tariff rulingPresident Donald Trump arrives for an event to proclaim \"Angel Family Day\" in the East Room of the White House, Feb. 23, 2026.\n\"The supreme court (will be using lower case letters for a while based on a complete lack of respect!)\nTrump will face some of the Supreme Court justices in person on Tuesday night when he delivers his State of the Union address.\nThe Supreme Court will hear an expedited appeal of Trump's case seeking to effectively end birthright citizenship by executive order.\n\"But this supreme court will find a way to come to the wrong conclusion, one that again will make China, and various other Nations, happy and rich.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-23T17:20:21Z",
    "source": "Abcnews.com"
  },
  {
    "id": "NTQ=",
    "url": "https://www.businessinsider.com/coo-job-is-especially-challenging-with-tariff-uncertainty-scotus-2026-2",
    "title": "COO's Jobs Are Especially Challenging Due to Tariff Uncertainty",
    "summary": "Friday's tariff ruling has once again put America's supply-chain bosses in a bind.\n\"Tariffs are written in DC, and they're felt in the COO's inbox,\" Jason Schloetzer, a professor at Georgetown's McDonough School of Business, told Business Insider.\nMany companies are still grappling with the impact of actions they took last year to cope with Trump's tariff hikes, said Rob Lalka, who teaches entrepreneurship at Tulane University.\nNow, with the fate of Trump's tariffs up in the air, COOs are experiencing the kind of whiplash that can be debilitating, said Lalka, especially for those at startups and small businesses with limited resources.\nOmni, which imports goods from Spain and exports to Canada, lost sales last year due to the Trump administration's tariffs, Smith said.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-21T10:39:01Z",
    "source": "Business Insider"
  }
]