[
  {
    "id": "Mg==",
    "url": "https://www.cnn.com/2025/12/20/business/russia-economy-struggling-ukraine-war-intl",
    "title": "Russia’s economy is struggling. But that won’t bring Putin to the negotiating table for years",
    "summary": "But the gathering economic storm is unlikely to bring President Vladimir Putin to the negotiation table anytime soon to end the war in Ukraine.\n“Russian soldiers today are paid more than any Russian soldier in the history of Russian soldiers,” RUSI’s Connolly said.\nSome of Russia’s more deprived areas have experienced an uplift during the war, in part because of huge pay checks going to Russian soldiers and their families.\n“They (Russian oil producers) are rerouting oil exports through smaller Russian companies… That is all costing a lot of money,” she said.\nIf that is combined with stronger sanctions enforcement and increased pressure on India and China to stop buying Russian oil, the Kremlin could eventually change its calculus, she argued.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "Mw==",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpmfcp",
    "title": "Can Trump convince voters on the US economy?",
    "summary": "The timing of the president’s speech comes after polling suggests the Republican Party is losing support over the direction of the economy.\nWill Republicans be able to convince voters that they should still be trusted on the economy ahead of next year’s midterms?\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 Americast is part of the BBC News Podcasts family of podcasts.\nThe team that makes Americast also makes lots of other podcasts, including The Global Story, The Today Podcast, and of course Newscast and Ukrainecast.\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsd The Today Podcast: https://www.bbc.co.uk/sounds/brand/p0gg4k6r Newscast: https://www.bbc.co.uk/sounds/series/p05299nl Ukrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzmProgramme Website",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NA==",
    "url": "https://www.investopedia.com/how-trump-can-turbocharge-the-global-economy-and-crush-inflation-11871221",
    "title": "There's One Thing Trump Could Do To Turbocharge The Global Economy And Crush Inflation",
    "summary": "There's no indication that tariffs will suddenly be removed, but the paper highlighted the extreme impact they've had on the global economy.\nPresident Donald Trump could invigorate the global economy and stamp out inflation quickly.\nThat's a boost of 0.5 percentage points per year, all while reducing inflation for U.S. consumers.\n\"One year after \"liberation day,\" the U.S. administration starts lowering U.S. tariffs back to the levels at end-2024.\"\nLiberation from \"Liberation Day\" would not only reinvigorate global trade, but would help household budgets for U.S. consumers.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NQ==",
    "url": "https://www.calculatedriskblog.com/2025/12/ten-economic-questions-for-2026.html",
    "title": "Calculated Risk: Ten Economic Questions for 2026",
    "summary": "1) Economic growth: Economic growth was probably close to 2% Q4-over-Q4 in 2025.\n3) Unemployment Rate: The unemployment rate was at 4.6% in November, up from 4.2% in November 2024.\nWill the core inflation rate decrease further in 2026, and what will the YoY core inflation rate be in December 2026?\nCurrently the FOMC is projecting the unemployment rate will decrease to the 4.3% to 4.4% range in Q4 2026.\nLong term, the BLS is projecting the overall participation rate will decline to 61.1% by 2034 due to demographics.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "Ng==",
    "url": "https://www.yahoo.com/news/articles/long-lines-food-pantry-inflation-100428499.html",
    "title": "Long lines at the food pantry: Inflation tests Trump’s base in Michigan",
    "summary": "CAPAC, Michigan, Dec 21 (Reuters) - On a recent snowy morning in a Trump-loving part of rural Michigan, three dozen cars idled outside a firehouse-turned-food pantry.\nLudwig said she had expected Trump to have made greater ​progress on inflation nearly a year into his presidency.\nBut now, persistent inflation is testing that pledge — and the patience of voters who helped put him in office.\nA dozen said they would still vote Republican, and three said they were unsure or did not share their voting plans.\nAdvertisement AdvertisementAdvertisement AdvertisementHe predicted Trump's tariffs would bring back high-paying manufacturing jobs and boost wages above the rate of inflation.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "Nw==",
    "url": "https://finance.yahoo.com/video/consumer-sentiment-seen-substantial-decline-165016713.html",
    "title": "Consumer sentiment has seen a 'substantial decline' this year",
    "summary": "The final read on December consumer sentiment from the University of Michigan actually came in lower than the prior read and below where Wall Street had forecast those numbers.\nAt both the preliminary read and the final read that we released today, we saw very, very modest improvements from November that weren't actually outside the margin of error.\nUm, we have some, um, some aspects of the economy where consumers reported uh some small improvements.\n01:54 Joanne HsuThis is a very, very substantial decline over a relatively short period um of time.\nUm, even though their inflation expectations have come down, um, for for four straight months now, I think for for the short run inflation expectations, um, we're still, their inflation expectations still are higher than they were in 2024.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "OQ==",
    "url": "https://www.businessinsider.com/midwest-cities-popular-homebuyers-zillow-ranking-2025-12",
    "title": "These Midwest Cities Are Most Popular for Homebuyers, Zillow Says",
    "summary": "Springfield, Illinois, was the ninth most popular market for home buyers this year, according to a Zillow analysis.\nSpringfield, Illinois, was the ninth most popular market for home buyers this year, according to a Zillow analysis.\nBrian Cassella/Chicago TribuneSpringfield, Illinois, was the ninth most popular market for home buyers this year, according to a Zillow analysis.\nThat's after it was the second-most popular place for homebuyers in 2024.\nMore than 60% of Zillow page views on homes in Rockford — and a majority of views for the most popular Midwestern cities — came from outside the metro area.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MTA=",
    "url": "https://www.yahoo.com/news/articles/trumps-economy-collides-reality-pennsylvania-130334158.html",
    "title": "Trump's 'A+++++' economy collides with the reality in a Pennsylvania city critical to the midterms",
    "summary": "“It's worse than ever,” the 67-year-old retiree, who relies on Social Security, said when asked about the economy.\nIn our world, trust me, it’s not an ‘A.’ To me, it’s an ‘F,’ ‘F,’ ‘F,’ ‘F,’ ‘F,’ ‘F.’”Agreement that prices are too highWith a population of roughly 125,000 people, Allentown anchors the Lehigh Valley, which is Pennsylvania's third-largest metro area.\nAdvertisement AdvertisementAdvertisement Advertisement“Every race here, all the time,” Allentown’s mayor, Democrat Matt Tuerk, recalled of the frenzied race last year.\nBut as attention shifts to next year’s midterms, Allentown cannot escape its place as a political battleground.\nHarris' nearly 2.7 percentage point win in the county was the tightest margin for a Democratic presidential candidate since 2004.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MTE=",
    "url": "https://www.calculatedriskblog.com/2025/12/schedule-for-week-of-december-21-2025.html",
    "title": "Calculated Risk: Schedule for Week of December 21, 2025",
    "summary": "----- Monday, December 22nd ---------- Tuesday, December 23rd -----Special Note: There is still uncertainty on when some economic reports will be released.\nFor example, we are still missing housing starts and new home sales for September, October and November.The key economic report this week is Q3 GDP.8:30 AM:for November.\nThis is a composite index of other data.8:30 AM:for November.\nThe consensus is for a 0.4% increase.8:30 AM:.\nThe consensus is that real GDP increased 3.2% annualized in Q3, down from 3.8% in Q2.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MTI=",
    "url": "https://www.businessinsider.com/how-to-invest-2026-stock-market-inflation-hot-economic-outlook-2025-12",
    "title": "'Run it hot': Wall Street is trotting out a new playbook for a high-growth, high-inflation economy in 2026",
    "summary": "Impact LinkThe US economy will keep burning hot in 2026, extending a yearslong run of dodging a recession.\n\"We say long commodities the best 'run it hot' trade in '26, and long despised oil/energy without question the best 'run-it-hot' contrarian trade.\"\nConsumer discretionary goodsMorgan Stanley thinks consumer discretionary goods investments fall into the \"run it hot\" investing playbook.\nThat dynamic is already playing out in the discretionary goods sector, strategists said.\nThis combination is especially impactful for the small cap earnings recovery we foresee into 2026,\" the bank's strategists added.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MzE=",
    "url": "https://www.yahoo.com/news/articles/government-research-exposes-culprits-behind-072000708.html",
    "title": "New government research exposes the culprits behind massive energy cost increases: 'Prices are expected to continue rising'",
    "summary": "U.S. energy prices are expected to continue to go up next year, according to new data from the Energy Information Administration.\nWhy are rising energy costs concerning?\nFor Americans already dealing with higher prices for things like groceries and rent, higher energy costs are a punch in the gut.\nOne way to help protect yourself from rising energy prices is to invest in solar.\nTCD's Solar Explorer is a great resource to help you make sense of all the options available.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  }
]