[
  {
    "url": "https://gizmodo.com/is-the-ai-conveyor-belt-of-capital-about-to-stop-2000671017",
    "title": "Is the AI Conveyor Belt of Capital About to Stop?",
    "summary": "Morgan Stanley investor Ruchir Sharma recently noted that money poured into AI investments now accounts for about 40% of the United States’ GDP growth in 2025, and AI companies are responsible for 80% of growth in American stocks.\n“If that doesn’t happen, if there is no real enterprise AI adoption, then it’s all round-tripping,” Jaluria said.\nWhere these investments are generating a return is in the stock market.\n“In many ways, we’re seeing the same developing web of capital flows across the AI space.”This creates some obvious problems.\nTo talk about AI today, it means we have to talk about the credit market, we have to talk about the credit market.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2025-10-13T19:40:03Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.businessinsider.com/government-shutdown-economic-data-earnings-calls-2025-10",
    "title": "Government Shutdown Masks Economic Data, Despite Earnings Calls' Clues",
    "summary": "FilippoBacci/Getty ImagesThis week, America will get an off-brand clue of how the economy is faring as earnings season heats up.\nHowever, a trio of economists said it won't replace key data that isn't being published during the government shutdown .\n\"If the shutdown continues, private data and earnings calls offer useful clues — especially around company performance relative to expectations,\" Gregory Daco, EY's chief economist, said.\n\"Earnings calls will help to give us color, \" Hamrick said, \"but it doesn't give us that fully fleshed out view that things like the CPI and the monthly employment situation read.\"\nThe Bureau of Labor Statistics' jobs report is closely watched to see how the workforce is evolving.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-13T09:20:02Z",
    "source": "Business Insider"
  },
  {
    "url": "https://finance.yahoo.com/news/gofundme-ceo-says-economy-bad-182843671.html",
    "title": "GoFundMe CEO says the economy is so bad that more of his customers are crowdfunding just to pay for their groceries",
    "summary": "GoFundMe’s CEO just said the quiet part out loud: in this economy, more Americans are crowdfunding groceries to get by.\nFor instance, groceries cost more than they did two or three years ago, rents have reset higher, and child care is straining paychecks.\nFor families without savings buffers, a higher cost baseline is the real story.\nThat backdrop explains why an uptick in grocery campaigns on GoFundMe isn’t a curiosity—it’s a barometer of the current economy.\nCrowdfunding groceries is a last-mile solution in a system where wages, benefits, and public supports haven’t fully bridged the gap.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-13T18:28:43Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/impact-ai-job-market-change-role-2025-10",
    "title": "Don't panic: AI isn't here for your job (yet)",
    "summary": "Several examinations of the labor market suggest that AI is not having a significant impact — yet.\nCarlin Stiehl/Los Angeles Times via Getty ImagesSeveral examinations of the labor market suggest that AI is not having a significant impact — yet.\nYet, for now, AI isn't as likely to steal your job as it is to reshape it.\nThe next couple of years will likely be bumpy as companies and employees figure out what AI can do, workplace observers told Business Insider.\n\"It's still very, very early,\" Martha Gimbel, executive director and cofounder of the Budget Lab at Yale, told Business Insider.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-10-13T09:29:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/firms-blaming-ai-for-layoffs-driven-by-fear-work-guru-2025-10",
    "title": "Companies are blaming AI for layoffs — but the real reason is fear of making the wrong move, a workplace guru says",
    "summary": "Cambridge University professor Thomas Roulet says firms are using AI as a scapegoat for corporate indecision.\nCambridge University professor Thomas Roulet says firms are using AI as a scapegoat for corporate indecision.\nBERTRAND GUAY/AFP via Getty ImagesCambridge University professor Thomas Roulet says firms are using AI as a scapegoat for corporate indecision.\nBERTRAND GUAY/AFP via Getty Imageslighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-13T10:06:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://abcnews.go.com/Business/wireStory/uncertainty-economy-tariffs-forces-retailers-cautious-holiday-hiring-126473160",
    "title": "Uncertainty over economy, tariffs forces retailers to be cautious on holiday hiring",
    "summary": "And he's also seeing companies hiring workers closer to when they need them.\nMeanwhile, the list of companies staying mum about their specific holiday hiring goals keeps growing.\nMastercard SpendingPulse, which tracks spending across all payment methods including cash, predicts that holiday sales will be up 3.6% from Nov. 1 through Dec. 24.\nGiven the uncertainty, companies increasingly want to hire workers closer to when they need them, experts said.\nThe Minneapolis-based company also hires seasonal workers across its nearly 2,000 stores and more than 60 distribution facilities to meet demand, it said.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-10-13T13:29:46Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.businessinsider.com/rich-list-trump-trade-war-musk-bezos-zuck-ai-stocks-2025-10",
    "title": "The world's 10 richest people lost nearly $70 billion in Friday's market rout",
    "summary": "The world's 10 richest people lost nearly $70 billion on Friday as fresh fears of a global trade war rattled markets.\nTesla stock slid 5% on Friday, shrinking CEO Elon Musk's wealth by about $16 billion, the Bloomberg Billionaires Index shows.\nIn all, the world's 10 wealthiest people saw a $69 billion wealth reduction.\nThe 10 richest people's wealth loss sounds painful, but they were still collectively worth over $2.9 trillion at Friday's close, led by Musk's $437 billion, Ellison's $351 billion, Zuckerberg's $248 billion, and Bezos' $240 billion.\nThey were still $385 billion in the green for this year as of Friday, with a $159 billion year-to-date wealth gain for Ellison alone, fueled by Oracle's 75% stock surge in 2025.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2025-10-13T10:45:50Z",
    "source": "Business Insider"
  },
  {
    "url": "https://hbr.org/2025/10/how-to-lead-when-the-conditions-for-success-suddenly-disappear",
    "title": "How to Lead When the Conditions for Success Suddenly Disappear",
    "summary": "In today’s workplace, uncertainty has become the norm.\nEconomic headwinds and a volatile stock market have been prompting companies to slash or reallocate budgets mid-course.\nGenerative AI and other forms of automation are reshaping jobs, workflows, and enterprise priorities at a pace few leaders anticipated.\nAt the same time, the constant drive for productivity and rapid technological advancement leaves organizations stretched thin, demanding more with fewer resources, tighter timelines, and heightened scrutiny from boards and investors.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2025-10-13T12:05:36Z",
    "source": "Harvard Business Review"
  },
  {
    "url": "https://www.businessinsider.com/jamie-dimon-warns-us-is-too-reliant-unreliable-foreign-resources-2025-10",
    "title": "'We need to act now': Jamie Dimon warns the US is too reliant on 'unreliable sources' as JPMorgan launches huge investment plan",
    "summary": "Jamie Dimon warned that the US is dangerously overdependent on foreign suppliers.\nJamie Dimon warned that the US is dangerously overdependent on foreign suppliers.\nNoam Galai/Getty ImagesJamie Dimon warned that the US is dangerously overdependent on foreign suppliers.\nNoam Galai/Getty Imageslighning bolt icon An icon in the shape of a lightning bolt.\nJamie Dimon said the US has become too dependent on foreign suppliers for the materials and technologies that underpin its economy and national security.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-10-13T11:09:26Z",
    "source": "Business Insider"
  }
]