[
  {
    "id": "MA==",
    "url": "https://www.businessinsider.com/inflation-december-cpi-consumer-price-index-federal-reserve-interest-rates-2026-1",
    "title": "Inflation in December Held Steady: CPI Increased 2.7%",
    "summary": "The year-over-year inflation rate was 2.7% in December, the same as the forecast and November's increase, and down from the 2.9% a year ago.\nThe Federal Reserve will be able to use these economic reports to make its interest rate decision.\nCME FedWatch indicated a 95% chance after the CPI report that the Fed would hold interest rates steady.\nJerome Powell's term as Federal Reserve Chair ends in May, and his term on the Board of Governors ends in 2028.\n\"I have served at the Federal Reserve under four administrations, Republicans and Democrats alike,\" Powell said in a video statement.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-13T13:33:48Z",
    "source": "Business Insider"
  },
  {
    "id": "MQ==",
    "url": "https://www.businessinsider.com/goldman-sachs-bears-are-wrong-us-stocks-will-rise-2026-1",
    "title": "Goldman Sachs breaks down what the doomsayers get wrong about the US economy in 8 charts",
    "summary": "And if you're in the wealth management business, like Goldman Sachs, it's your job to listen to these concerns.\nGoldman Sachs' wealth management unit did just that Monday, sending out a report to clients saying that the outlook for the US economy and stock market is bright — and that most of the concerns keeping investors awake at night are overblown.\nThe group puts the probability of a recession at 25%, down from last year's estimate of around 35%.\net cetera, we want to make a very strong stand and say, 'No, that is not the case,'\" Sharmin Mossavar-Rahmani, Chief Investment Officer of the Investment Strategy Group, said in a media appearance for the report's release.\nHere are some of the other takeaways from Goldman's Investment Strategy Group, and what they're telling wealthy clients to do with their money in 2026.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-14T10:33:01Z",
    "source": "Business Insider"
  },
  {
    "id": "Mg==",
    "url": "https://finance.yahoo.com/video/why-economists-reset-jobs-reports-193000001.html",
    "title": "Why economists need to 'reset' jobs reports expectations",
    "summary": "For the United States, our new estimate is 3.4%.\nand we see that in the United States that's happening globally also.\n00:58 Speaker BUm, it's going to be a slow level recovery, but this is really the demographic shifts that we've been talking about.\nSo we're going to see, we have to really reset what we're thinking about with regards to jobs because for the last four decades, 150, 200, 250,000 jobs was the norm every month.\nWell, for the foreseeable future, it's going to be 30, 40, 50,000 on average.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-13T19:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mw==",
    "url": "https://finance.yahoo.com/news/billionaire-warren-buffett-said-were-210108567.html",
    "title": "Billionaire Warren Buffett Said If He Were A Handy Guy, He'd 'Short the Dollar' By Buying Distressed Homes With A 30-Year Mortgage And Rent Them Out",
    "summary": "Buffett was spelling out a playbook: use low-interest 30-year fixed-rate debt, buy income-producing assets, and let inflation work in your favor.\nThen came the line that summed it all up: \"It's a way, in effect, to short the dollar.\"\nBuffett was asked what advice he'd give to a young investor choosing between buying their first home or investing in stocks.\nThe distressed deals Buffett referenced are harder to find, and for most buyers, the \"cheap asset\" moment has long passed.\nBuffett wasn't urging people to flip houses.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-12T21:01:08Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NA==",
    "url": "https://finance.yahoo.com/news/why-a-nasty-10-to-15-sell-off-in-the-stock-market-may-be-a-few-months-away-183449902.html",
    "title": "Why a 'nasty' 10% to 15% sell-off in the stock market may be a few months away",
    "summary": "But I will just say that I think stocks are fully priced.\nThis optimism has powered the S&P 500 (^GSPC) beyond 7,000 for the first time, with the Dow Jones Industrial Average (^DJI) knocking on the door of 50,000.\nS&P 500 earnings are estimated to increase by double-digit percentages in each quarter of 2026, according to FactSet data.\nMeanwhile, the bottom-up strategist's price target on the S&P 500 is a lofty 8,010 — up about 18% from current levels.\nIn turn, the forward price-to-earnings ratio (PE) for the S&P 500 is 22 times — well above the 10-year average of 18.7 times.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-13T18:34:49Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NQ==",
    "url": "https://www.jezebel.com/trump-declares-war-on-the-economy",
    "title": "Splinter: Trump Declares War on the Economy",
    "summary": "What can history teach us about what happens when a populist strongman with an idiosyncratic taste for low interest rates undermines central bank independence?\nYou may not care about interest rates, but they care about you.\nInterest rates are effectively a numerical representation of trust and the degree to which bond purchasers believe the people they’re lending money to will pay them back.\nThe bond market’s initial reaction to push interest rates higher also backs this inflationary fear up.\nTrump is attempting to destroy the financial world based on logic and reason, and replace it with one driven by his id.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-01-13T16:31:12Z",
    "source": "Jezebel"
  },
  {
    "id": "Ng==",
    "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-fall-as-markets-react-to-doj-investigation-into-powell-001621567.html",
    "title": "Stock market today: Dow, S&P 500 eke out records, gold soars after Trump amps up fight with Fed, Powell",
    "summary": "Other pockets of markets showed more effects from the Fed fight, with gold (GC=F) and silver (SI=F) surging to records as investors flocked to safer havens.\nRattled markets took in the drama as Powell said the Justice Department has subpoenaed the Fed, threatening criminal charges over his testimony on building renovations.\nIn a strongly worded statement, Powell said the action is an escalation of President Trump's campaign to pressure the Fed into cutting interest rates.\nIn corporates, bank and other financial services stocks slumped thanks to a warning to credit card issuers from Trump.\nLenders will be \"in violation of the law\" if they don't cap interest rates at 10%, he told reporters on Sunday.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2026-01-12T00:16:21Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "OQ==",
    "url": "https://www.businessinsider.com/creator-economy-mergers-acquisition-buyers-publicis-talent-influencer-marketing-2026-1",
    "title": "The creator economy's M&A rebound is in full swing. Here are the likely buyers in 2026.",
    "summary": "Impact LinkIs the creator economy in the midst of a comeback era?\nPublicis Groupe , the French advertising giant, acquired influencer-marketing platform Captiv8 and Brazilian influencer-marketing company BR Media Group .\n, the French advertising giant, acquired influencer-marketing platform and Brazilian influencer-marketing company .\nTo gain a better understanding of which companies are driving M&A in the creator economy, Quartermast analyzed the companies that have historically been the most active buyers.\n\"That's a sign that the creator economy is entering a new age of maturity and growth,\" Creech said.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-12T16:01:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MTA=",
    "url": "https://www.businessinsider.com/creator-income-inequality-grows-top-earners-paydays-rise-2026-1",
    "title": "Creator Income Inequality Grows As Top Earners' Paydays Rise",
    "summary": "New data from the influencer-marketing platform CreatorIQ shows that the income gap in the creator economy is widening.\nThe top 10% of creators on CreatorIQ's platform received 62% of ad payments in 2025, up from 53% in 2023.\nBrands are shifting more of their marketing dollars to creators, with payments more than doubling over the last two years in CreatorIQ's dataset.\nCreatorIQ's report included additional data points that help explain the current dynamics of the creator economy.\nThat suggests that top creators are pulling the average higher, while the typical creator is earning less.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-14T05:01:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MTI=",
    "url": "https://slashdot.org/story/26/01/13/165244/jpmorgan-warns-10-credit-card-rate-cap-would-backfire-on-consumers-and-economy",
    "title": "JPMorgan Warns 10% Credit Card Rate Cap Would Backfire on Consumers and Economy",
    "summary": "One way to make your old car run better is to look up the price of a new model.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-13T16:05:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MTM=",
    "url": "https://www.businessinsider.com/citi-cfo-credit-card-cap-would-have-a-deleterious-impact-2026-1",
    "title": "Citi's Top Execs: the Bank Can't Support a Credit Card Cap",
    "summary": "Citi's top executives warned that President Donald Trump's proposed 10% cap on credit card interest rates could have dire consequences.\n\"An interest rate cap is not something that we would, or could, support, frankly,\" Chief Financial Officer Mark Mason said on a call with reporters ahead of the bank's fourth-quarter earnings call.\n\"At the end of the day, I think an interest rate cap would restrict access to credit to those who need it the most, and frankly would have a deleterious impact on the economy.\"\nMason said multiple times that he did not want to speculate on the impact of the potential cap, given the limited available information.\nIn a post on Truth Social on Friday, Trump said he would call for a one-year cap of 10% on credit card interest rates.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-14T14:52:08Z",
    "source": "Business Insider"
  },
  {
    "id": "MTU=",
    "url": "https://www.npr.org/2026/01/11/nx-s1-5674034/fed-powell-subpoena-doj-building-renovation",
    "title": "DOJ subpoenas the Federal Reserve in an escalating pressure campaign",
    "summary": "DOJ subpoenas the Federal Reserve in an escalating pressure campaigntoggle caption Andre Caballero-Reynolds/AFPThe Justice Department has subpoenaed the Federal Reserve for information on the central bank's headquarters renovation, according to a video statement released by Fed Chairman Jerome Powell on Sunday.\nIt's the latest escalation in the administration's pressure campaign to force the central bank to make bigger cuts in interest rates.\n\"This new threat is not about my testimony last June or about the renovation of the Federal Reserve buildings,\" Powell said.\n\"No one — certainly not the chair of the Federal Reserve — is above the law,\" Powell said.\nTrump, who wants much lower interest rates to goose the economy, has insisted he should have greater say in monetary policy.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-01-12T02:01:26Z",
    "source": "NPR"
  },
  {
    "id": "MTY=",
    "url": "https://abcnews.go.com/Business/inflation-expected-held-firm-posing-challenge-amid-doj/story?id=129127426",
    "title": "Inflation held firm in December, testing Fed amid DOJ probe into Powell",
    "summary": "To address pressure on both of its goals, the Fed primarily holds a single tool: interest rates.\nThe Fed cut interest rates at three consecutive meetings late last year in an effort to boost the flagging labor market.\nThe reduction of interest rates, however, risks spurring demand and hiking inflation.\nIn the event a central bank lacks independence, policymakers tend to favor lower interest rates as a means of boosting short-term economic activity, analysts previously told ABC News.\nStocks closed higher on Monday, shrugging off a dip earlier in the day after reports of the DOJ probe into Powell.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-01-13T13:44:52Z",
    "source": "ABC News"
  },
  {
    "id": "MTc=",
    "url": "https://finance.yahoo.com/news/morning-bid-inflation-test-focuses-115830725.html",
    "title": "Morning Bid: Inflation test focuses Fed row",
    "summary": "Inflation and corporate earnings updates are coming down the pike on Tuesday.\nAnd listen to the latest ‌episode of the Morning Bid daily podcast.\nSubscribe to hear Reuters journalists discuss the biggest news in markets and finance seven days a week.\nBut ROI Finance Columnist Jamie McGeever asks how long Wall Street can keep looking the other way.\nInflation test focuses Fed rowA relatively modest market reaction to new threats on Federal Reserve independence this week owes much to the torrent ⁠of additional information hitting investors, with inflation and corporate earnings updates coming down the pike on Tuesday.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-01-13T11:58:30Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NzI=",
    "url": "https://www.thedailybeast.com/donald-trump-79-forgets-he-promised-voters-a-2000-check-from-tariff-revenues/",
    "title": "Trump, 79, Flat-Out Forgets Crucial Promise to Voters: ‘When Did I Do That?’",
    "summary": "President Donald Trump seemed to briefly power down when confronted by reporters over whether voters could still expect him to deliver on one of his boldest promises to date.\nDonald Trump seems to forget that he promised Americans $2,000 rebate checks from his tariffs while speaking with reporters.\nTariff revenue for 2025 stood at $195 billion, according to data collected by the Committee for a Responsible Federal Budget, a nonprofit that monitors fiscal policy policies.\nThat’s a 150 percent increase over duties collected the previous year, but at a minimum 90.25 percent less than the “Trillions” Trump claims his levies have generated.\nThe MAGA administration framed those funds as a “warrior dividend” from tariff revenue.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-01-12T19:03:34Z",
    "source": "Daily Beast"
  }
]