[
  {
    "id": "MA==",
    "url": "https://www.businessinsider.com/block-layoffs-ai-job-cuts-white-collar-recession-outlook-2026-2",
    "title": "Block's layoffs illustrate the market conundrum at the heart of the viral Citrini report",
    "summary": "Part of Citrini Research's viral view of an economy reshaped by AI might be playing out in real time on Friday.\nBlock investors are celebrating after the financial services company said it would axe nearly half of its workforce on Thursday.\nAlap Shah, the investor who helped author Citrini's viral report, used the moment to tout the paper's foresight.\nAnxieties over AI-fueled job losses swelled this week after the viral report that outlined one possible scenario where artificial intelligence could spark a white-collar recession in several years' time.\nThe report helped stoke a major sell-off in stocks at the start of the week, but some market pros have been skeptical of the unemployment scenario outlined by Citrini.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-27T15:25:07Z",
    "source": "Business Insider"
  },
  {
    "id": "Mg==",
    "url": "https://www.businessinsider.com/uber-driver-quit-full-time-job-working-60-hours-week-2026-2",
    "title": "I quit driving for Uber after I got a full-time finance job. Ride-hailing took more unpaid work than it used to.",
    "summary": "I could accept basically every ride the Uber app suggested and still make money on it.\nUber used a rate card that showed you made X amount of money per mile and X per minute.\nA couple of years ago, I started driving for Uber basically full-time after losing my job.\nA few years ago, Uber started using upfront pricing, which got rid of the rate card and used algorithms to determine my earnings.\nDriving for Uber led to a full-time jobI haven't driven for Uber since December because I recently got a full-time job in finance, the industry I used to work in.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-28T10:29:01Z",
    "source": "Business Insider"
  },
  {
    "id": "Mw==",
    "url": "https://finance.yahoo.com/video/warner-bros-earnings-fed-jobless-000052742.html",
    "title": "Warner Bros. earnings, Fed, jobless claims: What to Watch",
    "summary": "00:15 Speaker AIn the media space, Warner Brothers Discovery is reporting fourth quarter results, but the numbers may take a back seat to the takeover drama, of course.\nParamount Skydance raising its all-cash bid to 31 per share,00:27 Speaker Atopping its prior offer and stirring up competition with Netflix.\n00:36 Speaker ABeyond the M&A fight, investors will be watching advertising trends, the absence of NBA programming likely pressuring fourth quarter results.\n00:44 Speaker AOn the software side, Intuit reporting Q2 earnings.\n01:06 Speaker AOn the macro front, Fed vice chair for supervision, Michelle Bowman is speaking on Thursday.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2026-02-26T00:00:52Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NQ==",
    "url": "https://finance.yahoo.com/video/chinas-yuan-hits-35-month-170618414.html",
    "title": "China's Yuan Hits 35-Month High As Dollar Keeps Falling",
    "summary": "There are no important events for this country at this time.\nSelect \"All\" to see top events in other countries or view all events.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-26T17:06:18Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Ng==",
    "url": "https://finance.yahoo.com/news/average-us-long-term-mortgage-170334002.html",
    "title": "For the first time since 2022, average US long-term mortgage rate dips below 6%",
    "summary": "The average long-term U.S. mortgage rate slipped this week below 6% for the first time since late 2022, good news for home shoppers as the spring home-buying season gets rolling.\nThe benchmark 30-year fixed rate mortgage rate fell to 5.98% from 6.01% last week, mortgage buyer Freddie Mac said Thursday.\nMore from Yahoo Scout Why did mortgage rates fall below 6% recently?\nThe average rate has been hovering close to 6% this year.\nMortgage rates have been trending lower for months, helping drive a pickup in home sales the last four months of 2025, but not enough to lift the housing market out of its slump dating back to 2022, when mortgage rates began to climb from pandemic-era lows.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2026-02-26T17:03:34Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "OA==",
    "url": "https://www.businessinsider.com/stock-market-today-inflation-ppi-wall-street-economy-wholesale-prices-2026-2",
    "title": "Inflation fears have returned, and stocks are getting hammered",
    "summary": "The latest Producer Price Index numbers show wholesale prices rose 0.8% in January, significantly more than the 0.3% increase expected by economists.\nOn an annual basis, headline PPI rose 2.9%.\nStocks sold off, with the Dow losing more than 500 points and tech losses shaving 1% from the Nasdaq.\n\"There are growing concerns about US inflation which looks as if it may start to pick up again,\" he said.\nUet, others said that, while stocks sold off, Treasury yields continued to move lower, suggesting bond investors don't see PPI as a major factor in markets on Friday.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2026-02-27T14:58:27Z",
    "source": "Business Insider"
  },
  {
    "id": "MTA=",
    "url": "https://abcnews.com/Business/wireStory/average-us-long-term-mortgage-rate-dips-below-130533271",
    "title": "Average US long-term mortgage rate dips below 6% for the first time since late 2022",
    "summary": "The average long-term U.S. mortgage rate slipped this week below 6% for the first time since late 2022, good news for home shoppers as the spring homebuying season gets rollingAverage US long-term mortgage rate dips below 6% for the first time since late 2022FILE - A sign is posted for a new home for sale in Ambler, Pa., Oct. 16, 2025.\n(AP Photo/Matt Rourke, File)The average long-term U.S. mortgage rate slipped this week below 6% for the first time since late 2022, good news for home shoppers as the spring homebuying season gets rolling.\nThe benchmark 30-year fixed rate mortgage rate fell to 5.98% from 6.01% last week, mortgage buyer Freddie Mac said Thursday.\nAnd more buyer-friendly mortgage rates this year weren’t enough to lift home sales last month.\n“March is when the spring homebuying season typically begins to ramp up and with rates at a three-and-a-half year low, it could be a barn burner of a spring homebuying season.”",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2026-02-26T17:20:57Z",
    "source": "Abcnews.com"
  },
  {
    "id": "MTI=",
    "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-slide-after-nvidia-led-slump-dampens-ai-mood-again-235202719.html",
    "title": "Stock market today: Dow, S&P 500, Nasdaq fall to end volatile month as AI worries buffet markets",
    "summary": "US stocks sank on Friday after a measure of wholesale inflation came in hotter than expected and Block's (XYZ) surprise shakeup turned the spotlight on AI disruption risks.\nThe Dow Jones Industrial Average (^DJI) led the way down with a loss of 1%, or more than 500 points.\nMeanwhile, the Nasdaq Composite (^IXIC) fell 0.8%, while the S&P 500 (^GSPC) dropped 0.4%, respectively, on the heels of sharp closing losses for the tech-heavy indexes.\nThe Nasdaq and S&P 500 declined more than 3.3% and 0.86%, respectively, for the month.\nOn the macro front, January’s producer price index rose 0.5% month over month, showing that wholesale inflation grew at a faster pace than the 0.3% rise economists expected.",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2026-02-26T23:52:02Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MTM=",
    "url": "https://www.businessinsider.com/california-billionaires-larry-page-spending-miami-homes-luxury-real-estate-2026-2",
    "title": "Miami heat: Phones are ringing off the hook as California billionaires look to drop 9 figures on homes in the 305",
    "summary": "Her phones are ringing with billionaires — titans of tech and finance — looking to drop nine figures on waterfront properties.\n\"I got a flurry of requests and inquiries,\" Delgado, who has landed two billionaire clients recently, told Business Insider.\nShe's not the only one; three other agents told Business Insider that inquiries picked up at the end of 2025 and continued into 2026.\n\"Before, having a $20 million or $30 million sale was an outlier,\" Ana Teresa Rodriguez of Coldwell Banker Realty told Business Insider.\n\"Miami has never been as sophisticated and as diverse as it is in 2026, and the level of wealth moving here is making Miami level up,\" Goldentayer told Business Insider.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-28T10:10:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjA=",
    "url": "https://www.bbc.com/news/articles/cn5gqpz0rk6o",
    "title": "Ocado to axe 1,000 jobs in cost-cutting drive",
    "summary": "\"For a company once seen as the future of supermarket delivery, its fate has been overtaken by its more pedestrian, but larger, rivals, utilising their size and reach and building on their existing business to tell a much more compelling story for investors.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-26T08:19:17Z",
    "source": "BBC News"
  },
  {
    "id": "MzU=",
    "url": "https://www.businessinsider.com/biggest-takeaways-from-nvidias-q4-earnings-vera-rubin-chips-2026-2",
    "title": "5 Biggest Takeaways From Nvidia's Q4 Earnings As Vera Rubin Chips Ship",
    "summary": "The chipmaker delivered another blowout earnings report that underscored how little momentum the AI boom has lost.\nFrom incorporating Groq into Nvidia systems to an update on the new Vera Rubin chips, here are the biggest takeaways from Nvidia's fourth-quarter earnings call.\nSamples of the Vera Rubin chips have been shippedNvidia has begun shipping early samples of its next-generation Vera Rubin chips to customers.\nChief Financial Officer Colette Kress said during the earnings call that the company delivered \"our first Vera Rubin samples\" earlier this week and expects broader shipments of the new chips to begin in the second half of 2026.\n\"We expect every cloud model builder to deploy Vera Rubin,\" Kress said.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2026-02-26T02:06:01Z",
    "source": "Business Insider"
  }
]