[
  {
    "url": "https://abcnews.go.com/Business/stock-market-shrugged-off-weak-data-recession-fears/story?id=124407329",
    "title": "Why the stock market shrugged off weak data, recession fears",
    "summary": "Traders work on the floor of the New York Stock Exchange (NYSE) at the opening bell in New York, Aug. 7, 2025.\nTraders work on the floor of the New York Stock Exchange (NYSE) at the opening bell in New York, Aug. 7, 2025.\nWeak jobs data came out hours before President Donald Trump fired the head of labor statistics.\nThe stock market, however, hardly blinked.\nThe resilient stock market has generated a momentum of its own, some analysts added.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-08-08T11:13:44Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.wired.com/story/pointers-on-travel-points-view-from-the-wing/",
    "title": "The Internet's Biggest Travel Nerd Shares Pointers on Points",
    "summary": "But miles, points, and rewards are not merely a side hustle or a second job; they’re a lifestyle.\n“I couldn't tell you how long I spend on the blog, because I’m doing the things that I enjoy anyway,” says Leff.\nWhen it's time to evaluate the future of my relationship with a card, I put that reminder into my calendar.\nI paired that with a deal through American Express Travel where you could book the Conrad Bangkok presidential suite for $51 a night.\nGary Leff belongs to 70-plus travel loyalty programs.",
    "category": "economics",
    "bias": "right",
    "publishedAt": "2025-08-06T13:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.businessinsider.com/consumer-spending-up-but-so-is-household-debt-credit-loans-2025-8",
    "title": "Consumer spending may be up, but so is household debt, a new report from the New York Fed shows",
    "summary": "The stock market and consumer spending may be up, but so is household debt.\nA new report from the Federal Reserve Bank of New York shows total household debt has risen to $18.39 trillion when adjusted for inflation — that figure is about $1.05 trillion less than the all-time peak in the last quarter of 2008.\nAround 4.4% of household debt is at some stage of delinquency, a percentage that the bank's researchers called \"elevated.\"\nReports from other financial research agencies also show rising debt and potential financial distress in certain sectors of borrowers.\nA WalletHub report on Tuesday shows household debt increased by $28 billion during the second quarter of 2025, which was nearly six times the increase in the same period in 2024.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-08-06T01:45:46Z",
    "source": "Business Insider"
  },
  {
    "url": "https://paulkrugman.substack.com/p/its-beginning-to-smell-a-lot-like",
    "title": "It’s Beginning to Smell a Lot Like Stagflation",
    "summary": "So is inflation happening?\nIt’s true that many of Trump’s tariffs are clearly illegal, and the courts could force him to reverse them.\nThe reason many economists believe that Trump’s tariffs will raise unemployment isn’t so much their level as the uncertainty they create.\nYou might argue that tariff uncertainty will abate now that Trump has made “deals” with some of our major trading partners.\nSo tariff uncertainty remains high.",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-08-08T11:26:34Z",
    "source": "Substack.com"
  },
  {
    "url": "https://www.businessinsider.com/economist-tyler-cowen-warns-students-unprepared-for-ai-economy-2025-8",
    "title": "Economist Tyler Cowen Warns Students Unprepared for AI Economy",
    "summary": "Tyler Cowen said that universities were \"producing a generation of students who will go out on the labor market and be quite unprepared for what they're expected to do.\"\nTyler Cowen said that universities were \"producing a generation of students who will go out on the labor market and be quite unprepared for what they're expected to do.\"\nLeon Neal/Getty ImagesTyler Cowen said that universities were \"producing a generation of students who will go out on the labor market and be quite unprepared for what they're expected to do.\"\nImpact LinkColleges aren't preparing their students to join a labor market being transformed by AI, and the consequences may be psychological as much as economic, a leading economist has said.\nTyler Cowen, a professor at George Mason University, said that universities were \"producing a generation of students who will go out on the labor market and be quite unprepared for what they're expected to do.\"",
    "category": "economics",
    "bias": "lean left",
    "publishedAt": "2025-08-06T11:52:41Z",
    "source": "Business Insider"
  },
  {
    "url": "https://finance.yahoo.com/news/average-rate-30-mortgage-drops-160621983.html",
    "title": "Average rate on a 30-year mortgage drops to lowest level since April",
    "summary": "The long-term rate fell to 6.63% from 6.72% last week, mortgage buyer Freddie Mac said Thursday.\nEven so, mortgage rates are not far from their high this year of 7.04%, which was set in mid-January.\nLast Wednesday, the central bank’s policymaking committee voted to hold its main interest rate steady.\n“While both buyers and sellers welcome lower mortgage rates, it’s not clear whether rates will continue to fall,” said Lisa Sturtevant, chief economist at Bright MLS.\n“A weaker economy could lead to lower mortgage rates, but the risks of higher inflation could keep rates elevated.”",
    "category": "economics",
    "bias": "lean right",
    "publishedAt": "2025-08-07T16:06:21Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.derekthompson.org/p/how-ai-conquered-the-us-economy-a",
    "title": "How AI Conquered the US Economy: A Visual FAQ",
    "summary": "Nobody can say for sure whether the AI boom is evidence of the next Industrial Revolution or the next big bubble.\nWe can all stop talking about “what will happen if AI dominates the economy at such-and-such future date?” No, the AI economy is here and now.\nToday, in a bit of a throwback to my early blogging years, I’m going to try to walk through an FAQ with graphs to create a visual guide to the question:How big is the AI boom?\n“AI companies are reaching revenue milestones faster than previous generations of startups,” the company announced in a recent report.\nBut independent evaluators in the study actually concluded that using AI did the opposite: it increased task completion time by about 20 percent.",
    "category": "economics",
    "bias": "center",
    "publishedAt": "2025-08-07T10:12:54Z",
    "source": "Derekthompson.org"
  },
  {
    "url": "https://www.theverge.com/news/753863/trump-truth-social-ai-search-perplexity-conservative-bias",
    "title": "Truth Social’s new AI search engine basically just pushes Fox News",
    "summary": "Donald Trump’s Truth Social has launched a new AI search feature that consistently pushes conservative media sources.\nThe feature, Truth Search AI, is powered by the AI startup Perlexity and is now available on the web version of Trump’s social media platform, with public testing coming to the iOS and Android apps “in the near future.”In our testing, all of the source links that Truth Search AI cited were for conservative publications, including Fox News, Fox Business, The Washington Times, and The Federalist.\nThe vast majority of these links directed users to articles published by Fox outlets, which suggests the Perplexity-powered search engine is limiting results to Trump-supporting media.\n“Current evidence indicates that Trump’s tariffs have not improved the overall U.S. economy and are associated with a net negative effect, though some specific sectors benefit,” Truth Search AI wrote in response.\nThe sourcing pool for Truth Social’s AI search tool seems, unsuprisingly, very narrow.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-08-07T14:04:06Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.vox.com/today-explained-podcast/422601/trump-economy-bls-firing-erika-mcentarfer",
    "title": "The jobs report is a big deal. Trump’s response is an even bigger one.",
    "summary": "“We need accurate Jobs Numbers,” Trump posted on Truth Social.\nWhy did the head of the Bureau of Labor Statistics make up the statistics?\nThe head of the Bureau of Labor Statistics did not make up the labor statistics.\nAnd that means that most of the people out there who want jobs have jobs.\nHe didn’t end up firing Powell, but then he fired the head of the Bureau of Labor Statistics.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-08-06T20:59:18Z",
    "source": "Vox"
  },
  {
    "url": "https://www.businessinsider.com/alcohol-groups-beg-trump-slash-tariffs-holiday-season-2-billion-2025-8",
    "title": "Major US alcohol groups are begging Trump to slash tariffs before the holidays to keep them from losing $2 billion in sales",
    "summary": "Alcohol groups in the US are urging Trump toAlcohol groups in the US are urging Trump to Thomson ReutersAlcohol groups in the US are urging Trump to Thomson ReutersAs the holiday season looms, US liquor groups are begging Trump to kill the tariffs they say could ruin their most lucrative stretch of the year.\nA group of 57 associations and guilds called the Toasts not Tariffs Coalition, said in a Wednesday letter to the White House that tariffs could result in a $2 billion sales loss in the holidays.\nIn March, Trump also threatened to impose a 200% tariff on wine and other alcohol from the EU.\nGroups in the Toasts not Tariffs coalition represent US liquor heavyweights like Beam Suntory, the parent of Jim Beam, and Jack Daniel's owner Brown-Forman.\nIt sent a similar letter in January, urging Trump to exclude wine and spirits from his coming tariffs and convince the US's trading partners not to apply retaliatory tariffs on their products.",
    "category": "economics",
    "bias": "left",
    "publishedAt": "2025-08-07T05:53:51Z",
    "source": "Business Insider"
  }
]