[
  {
    "url": "https://www.bbc.com/news/articles/c05enyryqvmo",
    "title": "Record warm seas help to bring extraordinary species to UK waters",
    "summary": "That might not sound much, but the UK's seas are now considerably warmer than even a few decades ago, a trend driven by humanity's burning of fossil fuels.\nThat is contributing to major changes in the UK's marine ecosystems, with some new species entering our seas and others struggling to cope with the heat.\nScientists and amateur naturalists have observed a remarkable range of species not usually widespread in UK waters, including octopus, bluefin tuna and mauve stinger jellyfish.\nThat is making marine heatwaves more likely and more intense.\nThe precise distribution of marine species varies from year to year, but researchers expect the UK's marine life to keep changing as humans continue to heat up the Earth.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-08-11T00:36:06Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.wired.com/story/the-plastic-bottles-we-throw-into-the-pacific-are-infesting-the-beaches-of-central-america/",
    "title": "Central American Beaches Are Being Overrun With Local and Foreign Plastic",
    "summary": "A Coca-Cola bottle from 2002 was found on Robinson Crusoe Island, a World Biosphere Reserve, in Chile.\nThese discarded pieces of packaging were collected in a new macro-study that looked at the origin of plastic bottle pollution on beaches and cities along Latin America’s Pacific coastline.\nIt found that across the region, Central American countries are most affected by coastal plastic pollution, and underscores the urgency of confronting this major problem.\nAn environmentalist searches for plastic waste and packaging dumped on El Esterón beach in Intipuca, El Salvador, in October 2024.\nThis study reveals surprising data, given that more than half of the bottles and caps collected had visible dates.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-08-12T09:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.theverge.com/podcast/756701/ai-tools-chatgpt-gemini-vergecast",
    "title": "We found stuff AI is pretty good at",
    "summary": "Tech companies keep telling everyone that this or that AI feature is going to change everything.\nBut when you press them for examples, real, concrete examples of how those AI tools should be used, the answers tend to be lackluster.\nSometimes AI tools feel so open-ended, it’s hard to know where to start or what the best way to use them might beWell, here at The Verge, we have to test all these AI tools to better report on the features and the companies building them.\nIf you have any examples where AI was useful to you, we’d love to hear them.\nYou can email [email protected] or call into the Verge Hotline at 866-VERGE11.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-10T14:53:02Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.newscientist.com/article/2491793-trees-may-be-getting-more-flammable-because-of-climate-change/",
    "title": "Trees may be getting more flammable because of climate change",
    "summary": "This is largely driven by increasing heat, drought and wind speeds making trees more likely to burn when sparks fly.\n“Is climate change actually changing the plants themselves?\nExcept we’re just absolutely zapping them with radiation.”She expects to uncover changes in the plants’ leaf chemistry.\n“The way that plants respond in other tests, in other experimentation… it does change the leaf chemistry,” she says.\nThe site’s climate-controlled chambers can simulate wind, rain, heatwaves and changing atmospheric conditions to investigate how plants and insects cope with rapid climate change.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-08-12T11:00:48Z",
    "source": "New Scientist"
  },
  {
    "url": "https://www.yahoo.com/news/articles/artist-drowns-sculpture-plastic-waste-114328886.html",
    "title": "Artist drowns sculpture in plastic waste in front of the UN during plastic pollution treaty talks",
    "summary": "GENEVA (AP) — As nations began a second week of negotiations Monday for a global accord to end plastic pollution, an artist heaped piles of plastic waste onto a large sculpture in front of the United Nations office.\nDelegates to the treaty talks pass by the sculpture daily in a reminder of their responsibility to solve the plastic pollution crisis.\nBenjamin Von Wong, a Canadian artist and activist, designed the nearly 6 meter (18 foot) sculpture called the “Thinker’s Burden” and built it with a team.\nHe climbed a ladder Monday to reach the top of the sculpture and weave plastic bottles through the DNA.\nUnited Nations Environment Programme Executive Director Inger Andersen told reporters it's still possible to agree on a treaty this week that ends plastic pollution.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-08-11T11:43:28Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/c8jpp3jwe32o",
    "title": "No plans to change passenger rules for new young drivers a 'major oversight', AA says",
    "summary": "No plans to change passenger rules for new young drivers a 'major oversight', AA says2 days ago Share Save Emily Atkinson BBC News Share SaveGetty ImagesThe government's planned overhaul of driving laws in Great Britain has a \"major oversight\" by not including stronger driving licence rules for new and young motorists, the AA has said.\nBut Justice Minister Alex Davies-Jones told the BBC there were no plans to introduce such measures over concerns they might \"unfairly discriminate\" against young parents or carers.\nThe AA welcomed the government's plans in the main, but said \"the missing element is measures to safeguard and to save new driver and passenger lives by limiting peer-age passengers for six months\".\nThe latest government figures show a quarter of fatalities from road collisions involve at least one young driver.\nRoad safety charity Brake said this was due to young drivers being more likely to take risks on the road or crash when they have passengers of their own age, something that does not happen as much for older drivers.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-08-11T14:56:51Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/economist-tyler-cowen-college-students-trained-jobs-ai-work-2025-8",
    "title": "A Third of College Teaching Should Be About AI: Economist Tyler Cowen",
    "summary": "Tyler Cowen said colleges must overhaul their teaching to prepare students for an AI-driven future.\nTyler Cowen said colleges must overhaul their teaching to prepare students for an AI-driven future.\nOriental Image via Reuters ConnectTyler Cowen said colleges must overhaul their teaching to prepare students for an AI-driven future.\nImpact LinkA third of college teaching should be about how to use AI and understand its limits, a leading economist has told Business Insider.\n\"I think we should devote up to one-third of the curriculum to teaching students how to use, interact with, and spot the limitations of AIs,\" he said.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-08-12T11:56:24Z",
    "source": "Business Insider"
  },
  {
    "url": "https://phys.org/news/2025-08-indigenous-communities-action-plastic-pollution.html",
    "title": "Indigenous communities plead for action at plastic pollution talks",
    "summary": "Indigenous communities from North America are at talks on a global treaty on plastic pollution in Geneva, pleading the case for the environment they depend upon, which is slowly being choked by microplastics.\nCountries are trying to negotiate a groundbreaking international treaty on combating plastic pollution.\nShe is asking negotiators to craft a plastic pollution treaty that ensures justice, particularly for the most vulnerable communities, she told AFP.\nHenri Bourgeois Costa, an environmental and plastic pollution expert at the Tara Ocean Foundation, explained Alaska's predicament.\nShe spoke at a conference staged on the sidelines of the negotiations, which are struggling to find a consensus that would stop the amount of plastic pollution from growing.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-10T18:09:45Z",
    "source": "Phys.Org"
  },
  {
    "url": "https://www.bbc.com/news/articles/cjr11z2yx0yo",
    "title": "Arthur's Seat fire: Human activity likely cause, says fire service",
    "summary": "Arthur's Seat blaze likely caused by human activity - fire service2 days ago Share Save Angus Cochrane BBC Scotland News Share SaveFlames take hold as fire burns on Arthur's SeatA large fire on Arthur's Seat in the centre of Edinburgh was almost certainly sparked by human activity, a Scottish Fire and Rescue service group commander has said.\nArthur's Seat rises above Edinburgh from near the Scottish Parliament.\n\"The fire at Arthur's Seat is a sharp reminder of wildfire's destructive power, and the speed at which it can cause significant damage,\" she said.\nBlazes that burned across moorland at Carrbridge and Dava in the Highlands earlier this summer have been called the biggest wildfires Scotland has ever seen.\nProf Rory Hadden, chair of fire science at the University of Edinburgh, agreed that most wildfires in Scotland were caused by human activity.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-08-11T09:24:31Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.universetoday.com/articles/how-telescope-noise-could-help-us-monitor-climate-change",
    "title": "How Telescope Noise Could Help Us Monitor Climate Change",
    "summary": "CAHA hosts several telescopes, including a 3.5 meter telescope with the CARMENES (Calar Alto high-Resolution search for M-dwarfs with Exoearths with Near-infrared and optical Échelle Spectrographs).\nImage Credit: Calar Alto Observatory (CAHA)EM27/SUN is at about 2,100 meters in altitude, and its measurements were combined with an instrument at sea level at the University of Almería (UAL).\nCOCCON and Astroclimes dovetail nicely with the Calar Alto observatory.\nAerial view of the Calar Alto Observatory from the north at the telescope domes.\n“Calar Alto, with its photovoltaic plant and biomass boiler, aims at reaching energy sustainability.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-11T21:53:16Z",
    "source": "Universe Today"
  }
]