[
  {
    "id": "MzA=",
    "url": "https://www.npr.org/2026/02/05/nx-s1-5699511/epa-trump-enforcement",
    "title": "Trump's EPA issues record low legal actions against polluters, watchdog group finds",
    "summary": "Trump's EPA issues record low legal actions against polluters, watchdog group findstoggle caption Kayla Bartkowski/Getty Images North AmericaThe Environmental Protection Agency enforces the country's environmental laws.\nBut a new report shows the Trump EPA has initiated a record low number of actions against polluters, compared to past administrations.\nThat's according to the watchdog group Environmental Integrity Project (EIP), which says the numbers were lower in 2025, even compared to Trump's first term in office.\nBy examining court records, the group found that only 16 legal actions were taken against alleged polluters on the EPA's behalf by the Department of Justice.\nThe group also found a few instances, such as standards for drinking water, where the current Trump administration enforcement numbers are higher than previous administrations.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-05T05:16:34Z",
    "source": "NPR"
  },
  {
    "id": "MzE=",
    "url": "https://www.bbc.com/news/articles/ce3k6vrxwp0o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "title": "Vast seagrass meadows will shield Humber coastline",
    "summary": "Seagrass is one of the most powerful natural tools for tackling climate change and can protect coastlines from storms and erosion, according to Wilder Humber – a partnership of the Yorkshire and Lincolnshire wildlife trusts.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-04T07:43:36Z",
    "source": "BBC News"
  },
  {
    "id": "MzM=",
    "url": "https://www.npr.org/2026/02/03/nx-s1-5684126/energy-star-trump-climate-change",
    "title": "Energy Star has emerged stronger after Trump's EPA tried to end it",
    "summary": "Energy Star has emerged stronger after Trump's EPA tried to end ittoggle caption Joe Raedle/Getty ImagesThe Trump administration tried to end the government's Energy Star program last year, but now Congress has passed — and President Trump has signed into law — bipartisan budget legislation that has the potential to strengthen the energy efficiency program by giving it dedicated funding.\nThe EPA estimates the Energy Star program has saved Americans over $500 billion in energy costs since it was established in 1992.\nPresident Trump's proposed budget last year would have zeroed out Energy Star funding at the EPA.\nEvans says Energy Star already outsources much of its work to the private sector, including efficiency testing required for a product to earn the Energy Star label.\nSponsor MessageThe future of Energy StarThe budget package that includes Energy Star funding passed the House 397-28 and the Senate 82-15.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-03T10:00:00Z",
    "source": "NPR"
  },
  {
    "id": "MzU=",
    "url": "https://www.yahoo.com/news/articles/researchers-issue-warning-making-grim-050000631.html",
    "title": "Researchers issue warning after making grim Antarctic discovery: 'We are only beginning to understand'",
    "summary": "Researchers are sounding the alarm after finding antibiotic resistance genes released from melting Antarctic glaciers.\nGlaciers serve as reservoirs for antibiotic resistance genes, or ARGs, and other microbes.\nARGs from melting glaciers are worrisome because they help facilitate the spread of diseases.\n\"Climate change is reshaping microbial risks in ways we are only beginning to understand,\" study co-author Guannan Mao of Lanzhou University told The Microbiologist.\n\"Recognizing glaciers as part of the global antibiotic resistance landscape is an important step toward protecting both environmental and human health.\"",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-02-03T05:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDA=",
    "url": "https://www.bbc.com/news/articles/c205v3dj818o",
    "title": "Sewage pollution crackdown and lower bills in major water shake-up",
    "summary": "\"To create a water system that truly works for the people of Wales, we must see transformative change with the full devolution of powers over water, and certainty that the people of Wales will be prioritised above corporate bonuses,\" she said.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-03T12:25:19Z",
    "source": "BBC News"
  },
  {
    "id": "NDM=",
    "url": "https://www.bbc.com/sport/articles/cwyg4xw283no",
    "title": "2026 Winter Olympics: IOC must 'be better' on climate change, says president Kirsty Coventry",
    "summary": "Christophe Dubi, the IOC executive director for the Olympic Games, added: \"We make a point to receive those petitions, and we have to recognise climate is a challenge for all of us.\nThe next two Winter Olympics - French Alps 2030 and Utah 2034 - will also have sports spread more widely, while the 2032 Summer Olympics in Brisbane is will have venues across Queensland.\nWhile the action got underway on Wednesday with the start of the curling events, the 2026 Winter Olympics will officially start with the opening ceremony on Friday.\n\"I hope the opening ceremony is seen by everyone as a chance to be respectful,\" she said.\nI hope the opening ceremony will do that.\"",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-02-04T20:34:01Z",
    "source": "BBC News"
  }
]