[
  {
    "id": "Mjc=",
    "url": "https://www.yahoo.com/news/articles/government-research-exposes-culprits-behind-072000708.html",
    "title": "New government research exposes the culprits behind massive energy cost increases: 'Prices are expected to continue rising'",
    "summary": "U.S. energy prices are expected to continue to go up next year, according to new data from the Energy Information Administration.\nWhy are rising energy costs concerning?\nFor Americans already dealing with higher prices for things like groceries and rent, higher energy costs are a punch in the gut.\nOne way to help protect yourself from rising energy prices is to invest in solar.\nTCD's Solar Explorer is a great resource to help you make sense of all the options available.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-12-21T07:20:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mjk=",
    "url": "https://hardware.slashdot.org/story/25/12/21/2337215/google-launches-co2-battery-plants-for-long-duration-storage-of-renewable-energy",
    "title": "Google Launches CO2 Battery Plants for Long-Duration Storage of Renewable Energy",
    "summary": "Want to read Slashdot from your mobile device?\nPoint it at m.slashdot.org and keep reading!",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-12-22T01:34:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MzA=",
    "url": "https://uk.finance.yahoo.com/news/underfloor-heating-energy-savings-wunda-060043188.html",
    "title": "'We've all grown up with radiators - underfloor heating is a no-brainer'",
    "summary": "Sam Jump, pictured with Wunda's pioneering Rapid Response underfloor heating system, is the grandson of the entrepreneurial founders.\nWhen entrepreneurs Charles and Josephine Pugh rented a property with \"uncomfortable and uncontrollable\" underfloor heating (UFH), it sparked a move away from the made-to-order furniture world they had been invested in since the late 1970s.\nThe Pughs’ home heating issue had centred on underfloor screed — a level layer of concrete where piping has traditionally been embedded into — with pipe centres too far apart.\nWith no controls, there was a slow response time to heat and the floor became too hot.\nWunda Group founders Charles and Josephine Pugh, left, with daughter Josephine and grandson Sam.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-12-21T06:00:43Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzU=",
    "url": "https://www.scientificamerican.com/article/will-there-be-a-white-christmas-this-year-it-depends-on-where-you-live/",
    "title": "Will There Be a White Christmas This Year? It Depends on Where You Live",
    "summary": "Are you dreaming of a white Christmas?\nFor some of us in the U.S., it’s a lock; for others, the odds are sadly slim.\nAnd in many places, they are getting slimmer as global temperatures rise and winter weather gets wetter.\nBroadly, the first day of snow is falling later than it used to across the U.S., and the odds of a white Christmas are shrinking.\nAs for this year, current forecasts aren’t in favor of a snowy Christmas for most of the country.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-12-22T12:00:00Z",
    "source": "Scientific American"
  },
  {
    "id": "MzY=",
    "url": "https://www.sciencedaily.com/releases/2025/12/251219093325.htm",
    "title": "Scientists found climate change hidden in old military air samples",
    "summary": "The research shows that moss spores are now released several weeks earlier than they were in the past, highlighting how quickly natural systems can adjust as the climate warms.\nAir sampling in Sweden began in the 1960s as part of efforts to monitor radioactive fallout from nuclear weapons testing.\nOn average, mosses now begin releasing spores about four weeks earlier than they did in 1990, and the peak of spore dispersal arrives roughly six weeks sooner.\nLast year's climate matters more than spring weatherThe findings point to warmer autumns as a key driver of the shift.\nBecause air samples have been collected from locations across Sweden, researchers can reconstruct ecological shifts over decades and compare trends from north to south.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-12-21T06:10:14Z",
    "source": "Science Daily"
  },
  {
    "id": "Mzc=",
    "url": "https://gothamist.com/news/ny-climate-advocates-celebrate-rare-good-news-in-gov-hochuls-gas-hook-up-veto",
    "title": "NY climate advocates celebrate rare good news after Gov. Hochul nixes gas hook-up rule",
    "summary": "Climate advocates in New York are celebrating some rare positive news after Gov.\nKathy Hochul signed a law that will likely curb the proliferation of new gas hook-ups statewide.\nIt meant developers of new homes could pass the cost of gas hook-ups to all utility customers, rather than pay for it themselves.\n“This is a massive win for New York’s gas customers, and for clean air and a livable climate.”The victory comes after a tough year for climate priorities in New York.\nBut according to the Public Utility Law Project the rule was adding $600 million a year to utility costs for all New York homeowners and renters.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-12-20T18:18:00Z",
    "source": "Gothamist"
  }
]