[
  {
    "url": "https://www.cnn.com/2025/11/10/climate/south-america-oil-gas-brazil-guyana-argentina-climate",
    "title": "How South America became the up-and-coming oil capital of the world",
    "summary": "People in South America are dying in fires, floods, storms and droughts made longer and more catastrophic by climate change.\nBut as global oil demand stays strong, and other, richer, countries show few signs of scaling back, their argument is: Why shouldn’t oil supply come from South America?\nArgentina’s huge shale region, Vaca Muerta, often compared to the Permian Basin in Texas, holds the world’s second largest reserves of shale gas and fourth largest of shale oil.\nOil pump jacks at the Vaca Muerta shale oil and gas deposit in the Patagonian province of Neuquen, Argentina, January 21, 2019.\nIf US oil production doesn’t keep growing, South America “becomes much more important,” Monaldi said, otherwise the world risks becoming reliant on countries such as Saudi Arabia and Russia.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-10T10:00:21Z",
    "source": "CNN"
  },
  {
    "url": "https://www.yahoo.com/news/articles/energy-giant-hit-major-lawsuit-000000800.html",
    "title": "Energy giant hit with major lawsuit after allegedly deceiving customers for years: 'It is neither credible nor legally safe'",
    "summary": "One of Europe's biggest oil companies has had to make major changes to its public messaging after a court found it misled consumers about its supposedly eco-friendly practices.\nAs Mongabay reported, this is believed to be the first time an oil company has been found legally liable for this practice, commonly known as greenwashing.\n\"From now on, when companies pursuing fossil fuel expansion use this type of narrative, it is neither credible nor legally safe.\"\nUnfortunately, greenwashing is a common practice among large companies, particularly those involved with dirty fuels.\nAdvertisement AdvertisementAdvertisement AdvertisementVisit the website of most large oil companies, and you're likely to find a prominent section about sustainability and environmentally friendly practices.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-07T00:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/landmark-paris-agreement-set-path-142356581.html",
    "title": "Landmark Paris Agreement set a path to slow warming. The world hasn't stayed on it",
    "summary": "Earth's warming climate has gotten nastier faster than society has been able to wean itself from burning the coal, oil and natural gas that emits carbon pollution that triggers global warming, several scientists and officials said.\nEach year since 2015 has been hotter than the year of the Paris climate deal.\n“You cannot hold back the tides.”In 2015, U.N. projections figured that Earth was on path for almost 4 degrees Celsius (7.2 degrees Fahrenheit) of warming since the mid-1800s.\nNow, the world is on track to warm 2.8 degrees (5 degrees Fahrenheit), maybe a little less if countries do as they promise.\n“The Paris Agreement itself has underperformed,” said climate negotiations historian Joanna Depledge of the University of Cambridge in England.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-09T14:23:56Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/scientists-issue-warning-looming-threat-020000507.html",
    "title": "Scientists issue warning about looming threat to water supply for 1.5 billion people — here's what you need to know",
    "summary": "Recurring snow drought in the Tibetan Plateau poses a major threat to 1.5 billion people who rely on it for freshwater.\nThis creates a snow drought, which occurs when there is an unusually low amount of snowpack.\nAdvertisement AdvertisementAdvertisement AdvertisementClimate-driven snow drought has become a major issue in the Tibetan Plateau, according to the study.\nAs planet-warming pollution exacerbates extreme weather events such as snow drought, billions of people are impacted.\nAdvertisement AdvertisementAdvertisement AdvertisementAdditionally, rapidly melting ice is expected to expand waterways downstream of the Tibetan Plateau by the end of the century.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-08T02:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/trumps-energy-secretary-slams-un-184153746.html",
    "title": "Trump's energy secretary slams UN climate conference in Brazil, where US absence is glaring",
    "summary": "His remarks echoed the U.S. administration’s rejection of global climate agreements and Trump's prioritization of fossil fuels.\nAdvertisement AdvertisementAdvertisement AdvertisementThe U.S. will send no high-level officials to the COP30 climate summit in Brazil, the White House said Friday.\nBacked by overwhelming scientific consensus, the U.N. reaffirmed that climate change is already underway, requiring urgent global action to prevent irreversible harm.\n“Gatherings of global leaders and businesses should be about humans … not on the desire to scare children and grow government power,” he told the AP in Athens.\nClimate policy reversals under TrumpAdvertisement AdvertisementAdvertisement AdvertisementTrump has reversed Biden’s focus on slowing climate change to pursue what the Republican calls U.S. “energy dominance” in the global market.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-07T18:41:53Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/construction-company-shares-photo-3d-193000018.html",
    "title": "Construction company shares photo of 3D-printed home built in remote US region — here's why it could be the first of many",
    "summary": "A new era of home construction in Nome, Alaska, has begun with its first occupied 3D-printed house.\nThis 1,500-square-foot build is in rural Alaska, a region with high-cost construction.\n3D-printed homes can improve daily living for communities in remote areas like Nome.\nAccording to KNOM, the Rasmuson Foundation supported the building of Nome's 3D-printed house.\nAlaska's first lived-in 3D-printed home could become one of many in Nome and abroad.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-09T19:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/e1-all-electric-speed-boat-championship-tom-brady-will-smith2025-11",
    "title": "Inside E1, the F1 for eco-conscious speed boaters backed by the likes of Will Smith, Tom Brady, and Steve Aoki",
    "summary": "People in Croatia watched the E1 series race in June.\nSaudi Arabia and A-list celebrities have backed the seriesWill Smith and his E1 team in 2024.\nMarta Rovatti StudihradSaudi Arabia's Public Investment Fund announced its partnership with the E1 series in 2021.\nA major component of the E1 series is sustainabilityE1 is not just about furthering the motorsport industry or partnering with household names.\nHowever, unlike landlocked Formula E, the E1 series has focused its sustainability efforts on oceans and waterways.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-08T17:37:07Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.yahoo.com/news/articles/community-uproar-discovering-truth-called-133000707.html",
    "title": "Community in uproar after discovering truth about so-called storage facility: 'It's really the Wild West'",
    "summary": "However, concern arose when the facility started producing disruptive noise from high-powered computing fans, Inside Climate News reported.\nOriginally presented to the township as a storage facility, the project turned out to be a cover for bitcoin mining.\nWhy is this bitcoin mining facility important?\nThe case underscores a broader concern about bitcoin mining's energy and water consumption, as well as rising utility costs.\nWhat's being done about the impact of bitcoin mining?",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-11-07T13:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/ce3xdg7xrv9o",
    "title": "Six die as Russia targets energy and residential sites in Ukraine",
    "summary": "Six dead as Russia hits energy and residential sites in Ukraine2 days ago Share Save James Landale, Diplomatic correspondent in Kyiv and Alex Kleiderman Share SaveReuters Two people died in a Russian strike on an apartment building in DniproAt least six people have died after Russia launched hundreds of missile and drone attacks on energy infrastructure and residential targets in Ukraine overnight.\nIn all, 25 locations across Ukraine, including the capital city Kyiv, were hit, leaving many areas without electricity and heating.\nIn Russia, the defence ministry said its forces had shot down 79 Ukrainian drones overnight.\nThe Ukrainian air force said Russia had launched more than 450 exploding bomber drones and 45 missiles.\nThe Ukrainian Energy Ministry said there were power cuts in the Dnipropetrovsk, Chernihiv, Zaporizhzhya, Odesa and Kirovohrad regions, but restoration work was ongoing.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-11-08T15:20:39Z",
    "source": "BBC News"
  },
  {
    "url": "https://tech.yahoo.com/transportation/articles/breakthrough-south-korean-technology-could-090000501.html",
    "title": "Breakthrough South Korean technology could be a game-changer in the future of transportation: 'We can … make a significant impact'",
    "summary": "The innovation uses temperatures of around 1,112 degrees Fahrenheit to decompose the ammonia, according to TechXplore.\nTo eliminate the need for fossil fuels, the team uses ruthenium, a platinum metal, as a \"catalyst\" during a process called pressure swing adsorption.\nIt's a complex mix of elements, compounds, and technology that can create high temperatures and, ultimately, hydrogen fuel.\nThe Korean method doesn't use fossil fuels, as the experts can produce high temperatures with the mix of elements used in the technique.\nThe TechXplore story mentioned KIER's research into hydrogen fuel cells to cleanly power buildings as one way the technology can provide for a more planet-friendly energy future.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-11-09T09:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/residents-outraged-us-nuclear-plant-043000437.html",
    "title": "Residents outraged as US nuclear plant gets greenlight to dump radioactive waste into major river: 'Potential long-term consequences'",
    "summary": "A federal court has ruled that a nuclear plant in New York can dump radioactive waste into the Hudson River, a decision that overrides a 2023 ban on releasing treated wastewater into the river.\nWhy is the dumping of radioactive waste concerning?\nSurfer reported that the river had only recently become a \"viable recreational waterway\" and that dumping radioactive waste may deter people from visiting.\n\"Holtec has a very simple means of greatly reducing the risk,\" Liebmann told Surfer.\nThat would go a long way towards making the public feel safer and continue wanting to interact with the Hudson River.\"",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-10T04:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://futurism.com/science-energy/australia-solar-power-free-electricity",
    "title": "Australia Now Has So Much Solar Power That It’s Giving Electricity Out for Free",
    "summary": "Australia is generating so much solar power that it’s now giving it out for free.\nWith countries making strides in building out solar farms and more households installing solar panels, there’s plenty of energy to go around.\n“People who are able to move electricity use into the zero cost power period will benefit directly, whether they have solar panels or not and whether they own or rent,” said climate change and energy minister Chris Bowen in a statement.\nLast month, the Trump administration quietly canceled the country’s largest solar project as part of a staunchly anti-renewable energy agenda.\nMore on solar energy: Elon Musk Announces Plan to Control Climate by Surrounding Earth in Adjustable Satellites",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-11-07T15:21:33Z",
    "source": "Futurism"
  },
  {
    "url": "https://www.bbc.com/news/articles/c205jvyg3wjo",
    "title": "Do UN climate talks have a point any more?",
    "summary": "\"This 'climate change' - it's the greatest con job ever perpetrated on the world,\" he told the UN General Assembly in September.\nMeanwhile, he has set about dismantling his predecessor Joe Biden's clean energy agenda.\n\"The United States is taking a wrecking ball to clean energy,\" he argues.\nNurPhoto via Getty Images While the is US now betting on fossil fuels, China is going big on green techThe split has transformed the climate debate.\n\"China is already the world's clean-tech superpower,\" says Li Shuo, director of the China Climate Hub at the Asia Policy Institute.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-11-10T00:09:19Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/study-reveals-troubling-factor-increase-101500219.html",
    "title": "New study reveals troubling factor that can increase the risk of dementia: 'The effect could actually be quite large'",
    "summary": "Now, scientists have uncovered another possible hidden risk of air pollution: dementia and Alzheimer's disease.\nThis increased risk applied to those exposed to air pollution levels below the current Environmental Protection Agency (EPA) standard.\nWhat is particulate air pollution?\n\"As far as we can tell, the lower you can go, the lower your risk is,\" Professor Weisskopf said.\nAs the dementia study outlines, the effects of not doing so could be dire.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-07T09:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://seths.blog/2025/11/perhaps-we-have-what-we-need/",
    "title": "Perhaps we have what we need",
    "summary": "If it comes from the future, comes from away, comes from someone else, then our job is to simply wait for it to arrive.\nBut it could be that your organization already has all the resources it needs to change the dynamic in the marketplace.\nAnd the interactions we’re struggling with–the fear is inside us, but so is the bravery and generosity we need to move forward.\nOff-grid energy for two billion people is a solved problem waiting for distribution and implementation.\nActing like we have what we need already, though, gives us the chance to take action right here and right now.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-11-08T10:03:00Z",
    "source": "Seths.blog"
  },
  {
    "url": "https://finance.yahoo.com/video/tsmc-reports-slower-chip-sales-103738872.html",
    "title": "TSMC Reports Slower Chip Sales, Fueling AI Uncertainty",
    "summary": "TSMC reported slowing growth in monthly revenue, highlighting uncertainty over the sustainability of the AI boom even as industry behemoths including Nvidia chase more chip orders.\nMatthew Bloxham of Bloomberg Intelligence explains.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-11-10T10:37:38Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.cnet.com/tech/services-and-software/spotify-brings-wrapped-energy-year-round-with-friend-sharing-stats/",
    "title": "Spotify Brings Wrapped Energy Year-Round With Friend-Sharing Stats",
    "summary": "It can be a long wait for Spotify Wrapped, the end-of-year promotion that allows Spotify users to view and share their listening habits.\nNow, users can keep an eye on those stats daily, plus share their listening habits with friends.\nYou can view your Spotify usage statistics every 24 hours and share your updates via social media services, such as Instagram Notes or Spotify Messages.\nThe new features are somewhat similar to Spotify Wrapped, the service's annual end-of-year review of users' listening habits, which is designed to be shared.\nIt's been the most popular way for Spotify users to view and share their music listening in the past.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-11-07T20:44:00Z",
    "source": "CNET"
  },
  {
    "url": "https://www.upi.com/Science_News/2025/11/07/uk-saturn-moon-life/5091762549082/",
    "title": "Study shows evidence of habitable conditions on Saturn moon",
    "summary": "Nov. 7 (UPI) -- Saturn's Enceladus moon might be capable of supporting life, according to data collected by NASA's Cassini mission and compiled in a new study in the Science Advances journal.\n\"Understanding the long-term availability of its energy is key to determining whether it can support life,\" Miles said.\nPrior studies only discovered heat loss at the moon's south pole, but the new study shows similar activity at the north pole of Enceladus.\nThe moon's subsurface ocean must have balanced energy gains and losses to create a stable environment capable of supporting life.\nSuch a balance is achieved and maintained by tidal heating on Enceladus due to the gravitational effects of Saturn, according to the study.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-07T21:18:56Z",
    "source": "UPI.com"
  },
  {
    "url": "https://www.yahoo.com/news/articles/world-largest-nuclear-reactor-aims-070000048.html",
    "title": "World's largest nuclear reactor aims to power the Earth with virtually unlimited energy: 'Arguably the most complex machine ever designed'",
    "summary": "If successful, the experts in southern France could provide a cleaner alternative to fossil fuels and nuclear fission with \"arguably the most complex machine ever designed,\" ITER's communications lead Laban Coblentz told Euronews Next.\nFission is used to power the 436 nuclear reactors around the world and requires slamming neutrons into larger atoms to create energy, splitting them into smaller particles.\nThe result is far more energy than fission, and without the radioactive waste, all per the United States Department of Energy.\nIt's just a difficult thing to do,\" Coblentz told Euronews.\nAdvertisement AdvertisementAdvertisement AdvertisementHe added that the complex nature of the project is a challenge, often because it is groundbreaking research.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-11-10T10:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/experts-issue-warning-troubling-trend-233000315.html",
    "title": "Experts issue warning on troubling trend that could render entire cities 'uninsurable': 'The industry's role must extend'",
    "summary": "With extreme weather events becoming more frequent and powerful, experts are noticing a concerning trend in high-risk communities.\nInsurance Business reported that the current resilience finance framework could lead some urban areas to be deemed \"uninsurable\" in the near future.\nIn the analysis, the researchers explain how the aftermath of extreme weather events is causing premiums to skyrocket.\nTokio Marine Group CEO Brad Irick told Insurance Business that \"the industry's role must extend beyond claims payouts to proactive risk partnership.\"\nOn an individual level, you can make small lifestyle changes to help reduce your environmental footprint and mitigate the impact of extreme weather.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-07T23:30:00Z",
    "source": "Yahoo Entertainment"
  }
]