[
  {
    "url": "https://www.theverge.com/features/825207/semiconductor-chip-manufacturing-new-silicon-valley",
    "title": "The new silicon valley (literally)",
    "summary": "The hiccups spurred a bipartisan mission to bring semiconductor manufacturing back to the US.\nThe Grand Canyon state’s history with the semiconductor industry initially made it attractive to companies.\nIn Phoenix, Intel and TSMC are each developing advanced processes for manufacturing chips, meant to improve transistor density and energy efficiency.\nThe semiconductor industry around Phoenix already employs more than 33,000 people, with about 4,000 of those added since 2020.\nToday, Silicon Valley is still studded with Superfund sites — places so contaminated they were put on a national priority list for cleanup.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-11-21T00:55:03Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.yahoo.com/news/articles/hospitals-phasing-common-drug-favored-090000989.html",
    "title": "Hospitals phasing out common drug that was favored by doctors over the last 10 years: 'We haven't looked back'",
    "summary": "Many hospitals across the U.S. are making that a reality by phasing out problematic anesthesia options, that also happen to be planet-warming gases, as part of a broader effort to reduce their carbon footprint.\nThis is a significant commitment, considering that operating hospitals currently contribute around 5% of planet-warming gas pollution globally, per a study in Health Affairs.\nIt could potentially save tens of thousands of dollars for some hospitals, while allowing them to improve patient care, per Phys.org.\n\"That money gets to go right back into our patient care,\" said Ariel Brophy, a project manager at Gundersen.\nJoin our free newsletter for cool news and actionable info that makes it easy to help yourself while helping the planet.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-19T09:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/officials-enact-strict-ban-impact-021500175.html",
    "title": "Officials enact strict new ban that will impact every shopper: 'Will help dramatically'",
    "summary": "The law closes a loophole in previous legislation, meaning retailers will no longer be able to provide thicker, reusable plastic bags at checkout.\nInstead, stores will soon only be able to offer recycled paper bags, which may cost extra or require customers to bring their own reusable bags.\n\"This straightforward approach is easy to follow and will help dramatically reduce plastic bag pollution.\"\nAccording to officials, the thicker plastic bags were not being reused or recycled enough to justify their existence.\n\"It's time for us to get rid of these plastic bags and continue to move forward with a more pollution-free environment.\"",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-19T02:15:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.scientificamerican.com/article/five-essential-books-on-plastic-power-and-pollution/",
    "title": "Five Essential Books on Plastic, Power, and Pollution",
    "summary": "If you enjoyed Beth Gardiner’s feature about big oil’s bet on plastics, here are more books curated by Scientific AmericanThe fossil-fuel industry is pivoting to plastics: massive companies are launching new refineries and other industrial plants to make plastic from petrochemicals.\nScience journalist Beth Gardiner follows this story in our December issue, where you’ll meet the communities being harmed and the companies spending billions of dollars to control the future of plastic.\nTo complement that read, here are a few books that you can dive into and explore the wild world of waste management, the chemistry of plastics and more examples of corporate espionage and drama.\nPlastic Inc.: The Secret History and Shocking Future of Big Oil’s Biggest Betby Beth GardinerAvery, February 2026On supporting science journalismIf you're enjoying this article, consider supporting our award-winning journalism by subscribing.\nBeth Gardiner’s new book about big oil’s bet on plastic’s future is coming out in February 2026.",
    "category": "environment",
    "bias": "right",
    "publishedAt": "2025-11-18T20:00:00Z",
    "source": "Scientific American"
  },
  {
    "url": "https://www.yahoo.com/news/articles/scientists-stunned-discoveries-studying-electric-111535850.html",
    "title": "Scientists stunned by discoveries after studying electric bills from thousands of homes: 'A negative trend'",
    "summary": "You expect to get what you pay for when you buy solar panels.\nHowever, research from Germany's respected Fraunhofer Institute for Solar Energy Systems ISE reveals that many PV modules are underperforming compared to manufacturer claims.\nResearchers found a troubling pattern after analyzing over 70,000 solar panel measurements taken since 2012: Before 2016, solar panels typically met or exceeded power ratings.\nAdvertisement AdvertisementAdvertisement Advertisement\"Since then, the data has shown a negative trend,\" said Daniel Philipp, head of the Department Module Characterization and Reliability at Fraunhofer ISE.\nFor now, if you're shopping for solar panels, consider that the advertised wattage might be optimistic.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-19T10:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.scientificamerican.com/article/how-fossil-fuel-companies-are-driving-plastic-production-and-pollution/",
    "title": "How Fossil-Fuel Companies Are Driving Plastic Production and Pollution",
    "summary": "I wanted to see them up close, starting with the impact on those who live with the dangers posed by plastic’s production.\nCatalysts and more heat then prompt the ethylene to combine with other hydrocarbons to form polyethylene—the world’s most commonly used plastic.\nIt’s also the destination for a great deal of used plastic exported by rich countries, purportedly to be recycled.\nBut a significant chunk of its plastic problem comes from waste exported by wealthy countries, including the U.S., which generates more plastic waste than any other nation.\nIn the Indonesian province of Central Sulawesi, an environmental activist identifies plastic packaging waste in a mangrove conservation area.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-11-18T10:00:00Z",
    "source": "Scientific American"
  },
  {
    "url": "https://www.yahoo.com/news/articles/scientists-issue-warning-looming-crisis-011500147.html",
    "title": "Scientists issue warning as looming crisis threatens iconic US coastline: 'It's going to be much more difficult'",
    "summary": "One of the world's most iconic beach communities is at great risk from rising sea levels, according to a new report.\nThe Malibu City Council revealed in late October a comprehensive coastal vulnerability assessment that identified \"four major areas of vulnerability along the city's 21-mile coastline,\" as the Santa Monica Daily Press reported.\nThey are residential and commercial development, septic systems in low-lying areas, the Pacific Coast Highway, and narrow beaches.\nEnvironmental Science Associates used U.S. Geological Survey modeling to predict how tidal inundation, shoreline erosion, storm flooding, and wave run-up will impact the area as sea levels rise as much as 6.6 feet.\nThe newspaper highlighted that sea levels will be 2.5 feet higher by 2070-75.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-11-18T01:15:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://tech.slashdot.org/story/25/11/18/1336231/google-boss-says-trillion-dollar-ai-investment-boom-has-elements-of-irrationality",
    "title": "Google Boss Says Trillion-Dollar AI Investment boom Has 'Elements of Irrationality'",
    "summary": "Every company would be affected if the AI bubble were to burst, the head of Google's parent firm Alphabet has told the BBC.\nFrom the report:",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-18T14:01:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://www.vox.com/future-perfect/469840/meat-industry-greenwashing-jbs-tyson-climate-lawsuits",
    "title": "What happened when America’s biggest meat companies got called out for greenwashing",
    "summary": "is a senior reporter for Vox’s Future Perfect section, with a focus on animal welfare and the future of meat.\nSome of the world’s biggest meat companies are finally facing a degree of accountability for allegedly deceiving the public about their pollution.\nThe changes are the result of a lawsuit settlement with the Environmental Working Group, a nonprofit that sued Tyson for allegedly misleading consumers.\nAs part of the settlement, Tyson must refrain from making these environmental claims for five years and can’t make new ones unless they’re verified by experts.\nIn response, meat and dairy companies have ramped up their presence at COP events to influence negotiations.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-11-20T21:14:50Z",
    "source": "Vox"
  },
  {
    "url": "https://www.yahoo.com/news/articles/man-hit-hefty-fines-aerial-030000242.html",
    "title": "Man hit with hefty fines after aerial footage reveals disturbing scheme: 'We will not tolerate [this]'",
    "summary": "During the investigation into Reilly, aerial images caught the illegal waste.\nExperts stated that the dumping site lacked proper environmental infrastructure.\nCritical protection systems like impermeable liners, gas extraction, and drainage controls are present in legal dumping sites.\nWhen dumping sites don't have that infrastructure, their contents can cause serious damage to soil, air, and water health.\nThe spokesperson urged citizens to reach out to their local environmental protection agencies if they suspect illegal dumping.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-18T03:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://hbr.org/sponsored/2025/11/how-data-centers-can-support-energy-resiliency-while-managing-ai-demand",
    "title": "How Data Centers Can Support Energy Resiliency While Managing AI Demand",
    "summary": "",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-11-19T21:16:03Z",
    "source": "Harvard Business Review"
  },
  {
    "url": "https://www.yahoo.com/news/videos/fire-breaks-un-climate-talks-012153615.html",
    "title": "Fire breaks out at UN climate talks, forcing delay at critical phase",
    "summary": "A fire broke out Thursday inside the UN climate summit venue in Brazil, burning through the roof and causing a panicked evacuation and the suspension of talks entering a crucial phase.\nAdvertisement AdvertisementAdvertisement AdvertisementSecurity responded \"swiftly\" and the blaze was controlled in roughly six minutes, COP30 hosts Brazil and United Nations Climate Change said in a joint statement.\nBrazil later declared the site reopened at 8:40 pm after a fire department inspection, with an AFP reporter seeing a trickle of delegates re-entering and food kiosks resuming work -- though plenary sessions will not restart until Friday.\nAdvertisement AdvertisementAdvertisement AdvertisementThe area where the blaze broke out was sealed off from view with a vast sheet.\nEarlier Thursday, UN Secretary-General Antonio Guterres told negotiators \"the world is watching\" and urged them to reach an \"ambitious compromise.\"",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-11-21T01:21:53Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.theverge.com/news/822450/zigbee-4-0-suzi-smart-home-wireless-mesh-network-ble",
    "title": "Zigbee’s next big update lets you add smart home devices without a hub",
    "summary": "That way, the group says they’ll offer coverage for smart devices installed outside and farther away from a home, without the need for additional hardware to extend the networks.\nA new feature called Batch Commissioning will streamline large-scale installations by allowing multiple smart devices to be set up simultaneously.\nZigbee Direct, a previously optional feature added two years ago, is now standard in 4.0.\nIt allows smartphones to directly connect, control, and even add nearby Zigbee devices to a network using Bluetooth Low Energy without a hub.\nZigbee 4.0 is fully backwards compatible with Zigbee 3.0 and Smart Energy devices, and devices with “sufficient operational resources” can potentially be upgraded over-the-air once certified, according to Peshkova.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-18T10:44:35Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.yahoo.com/news/articles/africa-hosts-first-g20-urges-044101161.html",
    "title": "Africa hosts its first G20 and urges the rich world to do more against climate disasters",
    "summary": "Host South Africa wants to prioritize issues affecting poor countries, including responses to disasters made worse by climate change.\nSouth Africa will urge rich countries and international financial institutions to help more — a plea also being made at global climate talks in Brazil.\nIt is a “big hazard,” said Semadi Manganye, a resident and co-founder of the volunteer group, the Alexandra Water Warriors.\nLobbying world leadersClimate financing has been a focus of sharp debate between rich and poor countries at major summits like the G20.\nAdvertisement AdvertisementAdvertisement Advertisement___Follow AP’s coverage of the G20 summit in South Africa: https://apnews.com/hub/g20-summit___For more on Africa and development: https://apnews.com/hub/africa-pulseThe Associated Press receives financial support for global health and development coverage in Africa from the Gates Foundation.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-19T04:41:01Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://tech.slashdot.org/story/25/11/18/1723237/fund-managers-warn-ai-investment-boom-has-gone-too-far",
    "title": "Fund Managers Warn AI Investment Boom Has Gone Too Far",
    "summary": "A majority of global fund managers think companies are overinvesting, as market anxiety grows about the sustainability of the AI spending boom.\nFrom a report:",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-11-18T17:24:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://www.yankodesign.com/2025/11/18/this-solar-powered-motorcycle-never-needs-charging-for-true-energy-independence/",
    "title": "This solar powered motorcycle never needs charging for true energy independence",
    "summary": "The SOLARIS Self-Charging Solar Motorcycle by MASK Architects challenges the core assumptions of electric mobility with a vehicle that produces its own energy and redefines the relationship between rider, machine, and environment.\nIt operates entirely on power it generates itself, eliminating reliance on fuel stations, external charging points, or electrical grids.\nThis shift reframes freedom for riders, offering movement that isn’t conditioned by access to infrastructure or energy markets.\nThese high-efficiency solar elements convert light into energy throughout the day, ensuring the system remains active under varying conditions.\nA defining feature of the SOLARIS is its deployable charging mechanism, which expands into a protective wing when the motorcycle is parked.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-11-18T22:30:09Z",
    "source": "Yanko Design"
  },
  {
    "url": "https://www.yahoo.com/news/articles/experts-issue-warning-financial-crisis-163000436.html",
    "title": "Experts issue warning on financial crisis looming over millions of people: 'We are running out of time'",
    "summary": "The 39 nations known as Small Island Developing States (SIDS) are facing a severe financial crisis.\nThink of SIDS as \"large ocean states.\"\nAt the launch of a new report by the Global Center on Adaptation (GCA), H.E.\nShe explained that the money SIDS need is \"modest\" compared to the staggering cost of doing nothing, but the existing financial system wasn't built for them.\nThe GCA report found SIDS need $12 billion every year to protect themselves.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-20T16:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/data-centers-driving-up-electricity-demand-and-blackout-risks-report-2025-11",
    "title": "The spike in data centers is one of the main contributors to electricity demand and blackout risks this winter",
    "summary": "An energy report shows that data centers are leading a spike in energy demand and increasing blackout risks this winter.\nAn energy report shows that data centers are leading a spike in energy demand and increasing blackout risks this winter.\nJonathan Ernst/REUTERSAn energy report shows that data centers are leading a spike in energy demand and increasing blackout risks this winter.\n\"Data centers are altering the daily load shape due to their round-the-clock operating pattern, lengthening peak demand periods.\"\nThe two Democrats ran on affordability and have been outspoken about ensuring that ratepayers aren't paying for data centers.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-11-19T13:28:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://abcnews.go.com/International/video/pope-leo-calls-world-leaders-urgent-climate-action-127624235",
    "title": "Video Pope Leo calls for world leaders to take urgent climate action",
    "summary": "Pope Leo calls for world leaders to take urgent climate action Pope Leo XIV urged countries at United Nations climate talks to take “concrete actions” to stop climate, saying God’s creation \"is crying out in floods, droughts, storms and relentless heat.”",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-11-18T12:41:47Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.yahoo.com/news/videos/witness-describes-scene-fire-forces-221814462.html",
    "title": "Witness describes scene after fire forces evacuation at COP30",
    "summary": "Officials say a fire that spread through pavilions being used for UN climate talks in Brazil prompted evacuations on the next-to-last day of the conference, but nobody was hurt.\n(AP Video: Joshua A. Bickel)",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-11-20T22:18:14Z",
    "source": "Yahoo Entertainment"
  }
]