[
  {
    "id": "MzY=",
    "url": "https://www.wired.com/story/china-renewable-energy-revolution/",
    "title": "China’s Renewable Energy Revolution Is a Huge Mess That Might Save the World",
    "summary": "If we could only harness the engine of the stars, it would uncork near limitless energy and neatly sweep away a whole mess of humanity’s problems.\nSolar panels and wind turbines capture the fusion of the sun and convert it to electricity.\nAcross the entire country, those 12 months saw some 50 gigawatts of new solar capacity added.\nIn China, the first three months of 2025 alone saw 60 gigawatts of new solar capacity added to the national grid.\nAny solar capacity that went in after May 2025, Beijing declared, would no longer get this deal.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-01-20T11:00:00Z",
    "source": "Wired"
  },
  {
    "id": "NDA=",
    "url": "https://uk.news.yahoo.com/americans-more-energy-090800527.html",
    "title": "What would Americans do with more energy?",
    "summary": "Americans hit their daily energy low at 2:06 p.m., according to new survey data.\nA survey examining the energy levels and lifestyle goals of 2,000 people saw that on average, respondents said they’d need double their current energy levels to feel fully capable of keeping up with daily demands.\nNo wonder then that the majority of Americans surveyed felt added energy would be life-changing, not just for health and happiness boosts but also for their wallets.\nSeventy-four percent of respondents feel they’d be earning more if they had higher energy levels.\nWhen asked what they’d do with unlimited energy, the top response was spending more time with friends or family (18%).",
    "category": "environment",
    "bias": "right",
    "publishedAt": "2026-01-19T09:08:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDE=",
    "url": "https://www.bbc.com/news/articles/ckgj7me00p0o",
    "title": "UK households to get £15bn for solar and green tech to lower energy bills",
    "summary": "But for an average three bedroom semi-detached home, installing these three technologies, could save £500 annually on energy bills, it estimates.\n\"£15 billion is a substantial commitment, it provides certainty to investors and businesses in the energy market,\" said Dhara Vyas, chief executive of trade body Energy UK.\nTwo thirds (68%) of the solar panels imported by the UK came from China in 2024, according to HMRC trade data.\nUnlike insulation, he said heat pumps are a technology in its infancy, and needed government support to catalyse the industry.\nThe Warm Homes Plan will encourage households to opt for the trio of low carbon technologies - heat pumps, solar panels and batteries.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-01-20T22:32:47Z",
    "source": "BBC News"
  },
  {
    "id": "NDU=",
    "url": "https://www.yankodesign.com/2026/01/20/winter-proof-luxury-this-tiny-house-brings-full-time-comfort-to-colorados-harsh-climate/",
    "title": "Winter-Proof Luxury: This Tiny House Brings Full-Time Comfort to Colorado’s Harsh Climate",
    "summary": "Living small is often romanticized as a sun-drenched, coastal fantasy or a nomadic life on the road, but tiny houses are increasingly proving their worth in far harsher environments.\nOne of the latest examples is a luxurious new model from Tru Form Tiny, designed specifically to handle brutal winters without compromising on comfort or aesthetics.\nDesigner: Tru Form TinyCold-climate performance was a driving force behind the design.\nTru Form Tiny has wrapped the structure in high-R-value insulation and fitted energy-efficient Low-E windows to reduce heat loss and solar gain.\nOn the opposite side of the house, the bathroom feels unusually generous for a tiny home.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-01-21T00:30:30Z",
    "source": "Yanko Design"
  }
]