[
  {
    "id": "MzQ=",
    "url": "https://www.yahoo.com/news/articles/california-wants-mix-hydrogen-gas-140733038.html",
    "title": "California wants to mix hydrogen with gas to cut climate pollution. Critics say that poses risks",
    "summary": "“I don't want to be anyone's experiment,\" said Figueroa, 60, a resident of Orange Cove in California's Central Valley.\nIt's part of a statewide effort to create safety rules for hydrogen blending.\nWhat is hydrogen blending?\n“I think the only reason they are wanting Orange Cove is because they don’t think there’s going to be pushback,” she said.\nOrange Cove resident Francisco Gonzalez has friends with asthma and siblings with respiratory issues, so he worries about the health risks.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-01-12T14:07:33Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzU=",
    "url": "https://www.slashgear.com/2071415/china-wind-farm-ecosystem-study/",
    "title": "China's Wind Farms Are Doing A Lot More Than Generating Electricity",
    "summary": "One significant change that's taking place is shifting how some energy is produced.\nIn October 2025, the BBC reported that an Ember study revealed renewable resources had overtaken coal as the planet's most significant source of electricity.\nChina was an enormous part of this push: The outlet notes that, during the first half of 2025, its growth in wind and solar energy outpaced every other country in the world combined.\nChina has previously found that its enormous solar farm was doing a lot more than just producing energy, and this has also proven to be the case for its expansive efforts in wind.\nA December 2025 study titled \"Offshore wind farms can enhance the structural composition and functional dynamics of coastal waters,\" concluded that the wind farms in Chinese waters are making a positive change to the biodiversity of the regions where they were installed.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2026-01-13T13:15:00Z",
    "source": "SlashGear"
  },
  {
    "id": "MzY=",
    "url": "https://www.bbc.com/news/articles/c5y5p9rzd4ko",
    "title": "Global temperatures dip in 2025 but more heat records on way, scientists warn",
    "summary": "Despite natural cooling from La Niña, 2025 was still much warmer than temperatures even a decade ago, as humanity's carbon emissions continue to heat the planet.\nThat will inevitably lead to further temperature records – and worsening weather extremes – unless emissions are sharply reduced, scientists warn.\nLast year might not have been the hottest on record worldwide but extreme weather events linked to global warming continued.\nEl Niño years tend to be warmer as a global average, while La Niña years are typically cooler.\nThe return of La Niña conditions is thought to have suppressed warmth in 2025.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2026-01-14T03:44:07Z",
    "source": "BBC News"
  },
  {
    "id": "Mzc=",
    "url": "https://www.bbc.com/news/articles/c4g0dp65v77o",
    "title": "Nuclear bunker nears collapse due to coastal erosion",
    "summary": "Nuclear bunker nears collapse due to erosion2 days ago Share Save Paul Murphy East Yorkshire and Lincolnshire climate and environment correspondent Share SaveWhen it was built in the late 1950s the bunker was more than 100 yards from the seaA nuclear bunker is \"just a few days\" away from falling into the sea due to coastal erosion.\nEast Yorkshire has some of the fastest eroding coastline in the UK, according to the Environment Agency.\nThe cold war structure is falling victim to rapid erosion on the East Yorkshire coastThe clifftop bunker is one of a number of nuclear monitoring posts around the UK coastline, according to the historical research group Subterranea Brittanica.\nThe bunker is precariously perched on the clifftops at TunstallThe Holderness coastline is eroding at an average annual rate of about 6.5ft (2m), according to the Environment Agency.\nRobinson said the Tunstall bunker \"adds a lot of meaning\" to this process.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-01-13T17:21:48Z",
    "source": "BBC News"
  },
  {
    "id": "Mzk=",
    "url": "https://www.newscientist.com/article/2511371-sooner-than-expected-climate-impacts-could-cost-the-world-trillions/",
    "title": "Sooner-than-expected climate impacts could cost the world trillions",
    "summary": "Decision-makers typically focus on the middle-ground estimates of climate impacts.\nBut they should be preparing for the worst-case scenarios instead, the report says, since impacts like short-term precipitation extremes in some regions are happening earlier than anticipated.\nThis would mean up to $25 trillion in economic losses annually due to climate-related impacts, says Trust.\nBut the network says it doesn’t foresee a recession, since it expects global economic growth to outpace those damages.\nBut in a positive sign, global emissions are not rising as quickly as they once were, and China’s emissions have flatlined.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-01-14T03:00:58Z",
    "source": "New Scientist"
  },
  {
    "id": "NDE=",
    "url": "https://www.bbc.co.uk/news/articles/cn9zyx150xdo",
    "title": "UK secures record supply of offshore wind but price rises",
    "summary": "Offshore wind is widely seen as the backbone of Great Britain's future clean electricity system, with plentiful wind resources off the country's coastlines.\nThe government wants at least 43 gigawatts (GW) of offshore wind by 2030 to help meet its clean power target.\nThat is a big step-up from its current offshore wind capacity, which stands at 16.6GW, with a further 11.7GW under construction, according to the government.\nBuilding offshore wind and connecting it to the grid takes time – and many analysts have viewed this auction as crucial to get enough wind to meet its target.\nThe 8.4GW secured at this latest auction just about keeps the offshore wind target in reach, several analysts have told the BBC.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-01-14T11:21:15Z",
    "source": "BBC News"
  },
  {
    "id": "NDI=",
    "url": "https://www.bgr.com/2071457/nuclear-waste-dangerous-explained/",
    "title": "Is Nuclear Waste As Dangerous As People Think? Here's The Reality",
    "summary": "Nuclear energy is one of the most polarizing topics when it comes to ways of generating electricity.\nOn the other hand, there are people who warn about how nuclear waste is extremely dangerous, and the risk is too high to be allowed on larger scales.\nWhat's the truth behind it, and is nuclear waste really a huge problem?\nThe chance of mismanagement is still there, but managing nuclear power results in fewer deaths overall (both directly and indirectly) than other methods of generating power.\nNuclear waste still has its dangers, but they're not anywhere near as deadly as many might think.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-01-14T13:17:00Z",
    "source": "BGR"
  },
  {
    "id": "NDM=",
    "url": "https://www.yahoo.com/news/videos/hungarys-lake-balaton-freezes-first-113040341.html",
    "title": "Hungary's Lake Balaton freezes for the first time in years",
    "summary": "Do movers charge extra for stairs and elevators, and how much does it cost?\nDealing with stairs is an inevitable part of working in the moving industry.\nWhile some movers won't charge you any extra for carrying your belongings up and down several flights of stairs, others will.\nHere's what you need to know.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-01-13T11:30:40Z",
    "source": "Yahoo Entertainment"
  }
]