[
  {
    "id": "MzM=",
    "url": "https://hardware.slashdot.org/story/26/02/01/080244/99-of-new-us-energy-capacity-will-be-green-in-2026",
    "title": "99% of New US Energy Capacity Will Be Green in 2026",
    "summary": "What this country needs is a good five cent ANYTHING!",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2026-02-01T12:34:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MzQ=",
    "url": "https://www.bbc.com/news/articles/c75xg17rr1xo",
    "title": "Ukrainians brace for -20C despite energy truce: 'It will be a catastrophe'",
    "summary": "\"Of course we are following the talks, we want some stability,\" Iryna tells me people here long for peace more than anyone.\n\"But how can we trust Russia not to stab us in the back?\"",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-01-31T07:47:58Z",
    "source": "BBC News"
  },
  {
    "id": "MzU=",
    "url": "https://www.yahoo.com/news/articles/supply-popular-fruit-plummets-severe-190000539.html",
    "title": "Supply of popular fruit plummets as severe storms devastate crops: 'On course for its worst season'",
    "summary": "Advertisement AdvertisementFrequent extreme weather events, which have been increasing, damage agricultural yields.\nFood supply chains can be fragile as weather events cause downturns across continents.\nClimate-related threats to a stable and affordable food supply are local and global.\nDoing so stabilizes global temperatures and mitigates extreme weather events that ruin agriculture.\nThe current cherry season in Argentina has its setbacks.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-01T19:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mzc=",
    "url": "https://www.sintef.no/en/latest-news/2026/pretty-soon-heat-pumps-will-be-able-to-store-and-distribute-heat-as-needed/",
    "title": "Pretty soon, heat pumps will be able to store and distribute heat as needed",
    "summary": "“Think of it as a thermal battery, which stores the heat from the heat pump and can be used later.\nSimonsen is a member of the team that has developed the new thermal batteries.\nWith the new batteries, heat pumps combine storage and smart distribution of heat,” says Simonsen.\n“Specifically, we have designed and tested a type of heat sink that improves heat transfer in the thermal batteries,” says Simonsen.\n“Corrosion is particularly critical because salt hydrates are tough on aluminium, especially when impurities are present.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-02-01T18:15:40Z",
    "source": "Sintef.no"
  },
  {
    "id": "Mzg=",
    "url": "https://newatlas.com/environment/cern-supercollider-waste-heat-homes/",
    "title": "CERN supercollider gets sustainable side hustle heating local homes",
    "summary": "How about a side hustle heating several thousand homes in the neighborhood?\nWith a circumference of 26.7 km (16.6 miles), the LHC it is the largest particle accelerator ever built.\nAside from generating electricity bills that would rival my overdraft, it also results in waste heat – lots of waste heat.\nThis building houses the connection between CERN's heat exchange system and the heating system for the new commercial and residential area of Ferney-Voltaire CERNThe system was inaugurated last December and is now becoming fully operational.\n\"In the new set-up, hot water initially passes through two 5-MW heat exchangers, which transfer thermal energy to the new heating network in Ferney-Voltaire.\"",
    "category": "environment",
    "bias": "right",
    "publishedAt": "2026-01-31T00:03:00Z",
    "source": "New Atlas"
  },
  {
    "id": "NDM=",
    "url": "https://skift.com/2026/01/31/warm-winters-are-breaking-the-ski-industry-and-artificial-snow-isnt-enough/",
    "title": "Warm Winters Are Breaking the Ski Industry — and Artificial Snow Isn’t Enough",
    "summary": "Aspen One, among the few U.S. ski companies with resorts that opened on time this winter, says snowmaking and glacier covers are only temporary defenses against years of record low snowfall.\nRapid global warming and higher temperatures are eroding the foundations of winter tourism, shortening ski seasons, reducing snow and making it less predictable.\n\"Snowmaking isn’t the core issue; the energy being used is,\" said Chris Miller, senior vice president of sustainability at Aspen One.\n\"We’re focused on tackling the root causes of climate change, not just adapting within resort boundaries.\"\nIts latest property, Limelight Mammoth in the Mammoth mountain ski area in California, is a fully electric hotel.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-01-31T13:00:00Z",
    "source": "Skift"
  }
]