[
  {
    "id": "MTI=",
    "url": "https://environment.ec.europa.eu/news/new-law-more-sustainable-circular-and-safe-batteries-enters-force-2023-08-17_en",
    "title": "New law on more sustainable, circular and safe batteries enters into force",
    "summary": "A new law to ensure that batteries are collected, reused and recycled in Europe is entering into force today.\nThis will support the shift to a circular economy, increase security of supply for raw materials and energy, and enhance the EU’s strategic autonomy.\nThe Batteries Regulation will ensure that batteries placed on the EU single market will only be allowed to contain a restricted amount of harmful substances that are necessary.\nBackgroundSince 2006, batteries and waste batteries have been regulated at EU level under the Batteries Directive.\nSuch exponential growth in demand for batteries will lead to an equivalent increase in demand for raw materials, hence the need to minimise their environmental impact.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-21T08:28:42Z",
    "source": "Europa.eu"
  },
  {
    "id": "MzA=",
    "url": "https://www.scientificamerican.com/article/trump-administration-slashes-mercury-regulations-from-coal-plants/",
    "title": "Trump administration slashes mercury regulations from coal plants",
    "summary": "Mercury pollution from coal plants has been tied to serious neurological problems, especially in children and babiesOn Friday the Trump administration officially rolled back a series of Biden-era environmental regulations on coal plants, including some intended to clamp down on mercury pollution.\nThose earlier rules allowed power plants that burned a particularly dirty form of coal called lignite coal to emit more mercury than plants that burned other forms of the fossil fuel.\nThe move is the latest in a string of actions by the Trump administration to prop up what has long been viewed as a moribund coal industry in the U.S.\nThe administration has ordered the Department of State to run military facilities on coal power, funded renovations for coal-powered plants and even blocked plants from shutting down.\n“And once again, the Trump administration is doing so at the expense of people’s health.”Coal-fired power plants are the leading source of mercury emissions in the U.S., according to the EPA.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-02-20T17:30:00Z",
    "source": "Scientific American"
  },
  {
    "id": "MzI=",
    "url": "https://science.slashdot.org/story/26/02/18/044252/air-pollution-emerges-as-a-direct-risk-factor-for-alzheimers-disease",
    "title": "Air Pollution Emerges As a Direct Risk Factor For Alzheimer's Disease",
    "summary": "Become a fan of Slashdot on Facebook",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-18T07:00:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MzM=",
    "url": "https://www.yahoo.com/news/articles/california-colorado-washington-sue-trump-200550952.html",
    "title": "California, Colorado and Washington sue Trump administration to unlock funding for clean energy projects",
    "summary": "SAN FRANCISCO, Feb 18 (Reuters) - California, Colorado and Washington are suing the federal government to force ‌it to pay out grants approved by Congress for ‌clean energy projects, the California attorney general's office said on Wednesday.\nStates, including California, have been among the main foils to various ⁠Trump administration policies, launching dozens of suits.\nThe new suit responds in part to California's loss of $1.2 billion in federal funding for ‌the Alliance for Renewable Clean Hydrogen ​Energy Systems, or ARCHES, Bonta ​said.\nAdvertisement AdvertisementFederal agencies must ​execute laws, California said.\n\"It's as simple as Congress has the power of the purse, not the executive ​branch, and Congress ‌already appropriated this funding,\" Bonta said in an ​interview on Tuesday, ahead of the announcement.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-02-18T20:05:50Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzQ=",
    "url": "https://www.newscientist.com/article/2516338-atmospheric-pollution-caused-by-space-junk-could-be-a-huge-problem/",
    "title": "Atmospheric pollution caused by space junk could be a huge problem",
    "summary": "After a Falcon 9 rocket stage burned up in the atmosphere, vaporised lithium and other metals drifted over Europe.\nSeeing the news, Robin Wing at the Leibniz Institute of Atmospheric Physics in Germany and his colleagues turned on their lidar, an instrument for atmospheric sensing.\nTwenty hours later, it detected a 10-fold spike in lithium, a key component of rocket hulls, in the upper atmosphere as the plume of vaporised metal drifted over it.\nAtmospheric modelling suggested this plume had drifted 1600 kilometres from the area where the Falcon 9 re-entered the atmosphere.\nThe study is the first to trace high-altitude pollution to a specific spacecraft re-entry.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-19T16:00:19Z",
    "source": "New Scientist"
  },
  {
    "id": "MzY=",
    "url": "https://www.scientificamerican.com/article/epa-faces-lawsuit-over-ending-the-endangerment-finding-pillar-climate-law/",
    "title": "EPA faces lawsuits over climate endangerment finding withdrawal",
    "summary": "Medical and environmental groups are challenging the EPA’s decision to break with the long-standing scientific evidence that climate change endangers human healthOn Wednesday prominent medical and environmental groups challenged the Trump administration’s decision to scrap a 2009 finding that climate change threatens human health.\nThe challenge comes days after EPA administrator Lee Zeldin announced that the agency would scrap the 2009 “endangerment finding,” breaking with the long-standing scientific consensus that global warming poses a risk to human health.\nThe new lawsuit could once more elevate the fight over whether climate change harms health to the Supreme Court.\nIn 2007 the Court decided in the case Massachusetts v. EPA that greenhouse gases, including carbon dioxide, qualified as air pollutants under the Clean Air Act.\nWhen contacted by Scientific American on Wednesday, the EPA declined to comment on the lawsuit, citing a long-standing practice of not commenting on current or pending litigation.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-18T15:00:00Z",
    "source": "Scientific American"
  },
  {
    "id": "Mzc=",
    "url": "https://www.theregister.com/2026/02/19/ai_climate_crisis_claims/",
    "title": "Study questions claims AI will solve the climate crisis",
    "summary": "He reached two central conclusions after looking at 154 claims of AI climate benefits arising from eight sources (including the IEA, climate researchers, Microsoft, Google, and others).\nFirst off, there's a serious problem with the conflation of traditional AI, like predictive models and computer vision, with generative AI tools that chat, create images, and make music.\n\"This analysis found that the overwhelming majority of AI climate benefit claims relate to 'traditional' forms of AI rather than generative AI,\" Joshi wrote in the report.\n\"However, much of the projected energy consumption of AI will stem specifically from 'generative AI,' rather than more traditional forms of machine learning.\"\nThe evidence that isn'tAlong with conflating the potential climate benefits of using traditional AI with the far more energy-intensive and frequent deployments of generative AI datacenters, the report concludes that most of the evidence that even traditional AI would help with the climate crisis lacks support.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-02-19T18:23:34Z",
    "source": "Theregister.com"
  },
  {
    "id": "Mzg=",
    "url": "https://www.bbc.com/weather/articles/cgrz24y2wvno",
    "title": "Flooding may worsen before it improves as more rain forecast for UK",
    "summary": "We have seen fluvial - or river - flooding, which is when rivers or streams burst their banks and flood surrounding areas.\nThere has also been pluvial - or surface water - flooding, which is a direct result of intense or prolonged rainfall that overwhelms drainage systems.\nHowever, a third type of flooding - groundwater flooding - has also been a widespread problem, especially in parts of southern England.\nLow lying river valleys and areas on chalk aquifers - such as the Salisbury Plains - are most prone to groundwater flooding.\nThe Environment Agency says groundwater flooding, external occurs when water under the ground (the water table) rises to the surface.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-02-18T14:54:18Z",
    "source": "BBC News"
  },
  {
    "id": "NDA=",
    "url": "https://www.sciencedaily.com/releases/2026/02/260218031554.htm",
    "title": "A spinning gyroscope could finally unlock ocean wave energy",
    "summary": "Most existing wave energy devices perform well only under specific wave conditions, limiting their effectiveness in the constantly shifting environment of the open sea.\nA researcher at The University of Osaka has taken a close look at a new approach known as a gyroscopic wave energy converter (GWEC).\n\"Wave energy devices often struggle because ocean conditions are constantly changing,\" says Takahito Iida, author of the study.\nModeling Maximum Wave Energy EfficiencyTo better understand how the system behaves, the researcher used linear wave theory to model the interaction among ocean waves, the floating structure, and the gyroscope.\nBy clarifying how to fine tune the gyroscope's operating parameters, the research offers practical guidance for building more flexible and efficient wave energy systems.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-02-18T14:33:28Z",
    "source": "Science Daily"
  },
  {
    "id": "NDE=",
    "url": "https://www.cbc.ca/news/climate/epa-endangerment-9.7095596",
    "title": "U.S. environment agency sued over scrapping scientific rule behind climate protections",
    "summary": "The legal challenge, filed in the U.S. Court of Appeals for the District of Columbia Circuit, asserts that the EPA's rescission of the endangerment finding is unlawful.\nThe 2009 finding supported common-sense safeguards to cut climate pollution, including from cars and trucks, the lawsuit says.\nThe endangerment finding \"led to trillions of dollars in regulations that strangled entire sectors of the United States economy, including the American auto industry,\" Zeldin said.\nEnvironmental groups described the move as the single biggest attack in U.S. history against federal authority to address climate change.\nEvidence backing up the endangerment finding has only grown stronger in the 17 years since it was approved, they said.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-18T17:42:56Z",
    "source": "CBC News"
  }
]