[
  {
    "url": "https://www.theverge.com/science/757084/data-purge-climate-change-environmental-justice-trump",
    "title": "Why Donald Trump’s environmental data purge is so much worse this time",
    "summary": "A watchdog group that monitors publicly-available environmental data has recorded 70 percent more federal website changes during Trump’s first 100 days in office in 2025 compared to the start of his first term in 2017.\nThat includes changes to content, like replacing the term “climate change” with “extreme weather,” and the wholesale removal of entire webpages.\n“The thing that is the most different is this total erasure of information about environmental racism and the evidence of environmental racism,” Gehrke says.\n“That story is yet to unfold.” So far, the EPA’s climate change website is still intact.\nFarmers and environmental groups have also filed suit to force the Trump administration to restore federal resources.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-08T23:25:48Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.cnn.com/2025/08/08/climate/scientists-respond-trump-report",
    "title": "Scientists launch coordinated response after Trump admin attempts to wipe credible climate research off the record",
    "summary": "Climate change Air quality Pollution See all topics FollowDozens of veteran climate scientists are launching a coordinated response to a Trump administration report that casts doubt on the severity of climate change.\nThe scientists, responsible for authoring or contributing research to hundreds of peer-reviewed studies, want to counter what they interpret as the Trump administration’s attempts to wipe credible, widely accepted climate science off the record.\n“Decades of climate research and data have yielded expanded understanding of how greenhouse gases affect the climate,” NAS president Marcia McNutt said in a statement.\nSeveral climate scientists whose research was cited in the Trump report said it misused or misrepresented their work.\n“It’s giving me flashbacks to 2005, when such false debates raged.”Cobb said she hopes to help “set the record straight” on climate science in their response to the DOE report.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-08-08T14:00:44Z",
    "source": "CNN"
  },
  {
    "url": "https://gizmodo.com/nasa-told-to-overhaul-its-plans-to-replace-the-international-space-station-2000639959",
    "title": "NASA Told to Overhaul Its Plans to Replace the International Space Station",
    "summary": "For nearly 30 years, the International Space Station has played orbital home for astronauts from all over the world, but its time is running out.\nSlated to retire in 2030, NASA is aiming to replace it with a privately-run station that can host its astronauts in space when needed.\nIn a memo signed August 4, Duffy directs NASA to revise its Commercial Low Earth Orbit Destination program, which is designed to facilitate the development of commercial stations to replace the ISS.\nAnother major change is the revision to minimum capability requirements for an ISS replacement.\n“How was NASA’s previous strategy for commercial stations going to work when they lost close to a third of their budget?” Phil McAlister, previously the director of NASA’s Commercial Space Division, said in an interview with Ars Technica.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-08-07T15:27:23Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.theatlantic.com/science/archive/2025/08/us-climate-liability/683797/",
    "title": "America Is Living in a Climate-Denial Fantasy",
    "summary": "ET on August 8, 2025Last month, the world’s highest court issued a long-awaited opinion on how international law should regard climate harm.\nThe ICJ opinion was the first time the world court has expressly addressed climate obligations under international law, and it did so with unusual clarity.\nIn some countries, including the Netherlands and Kenya, international law is incorporated into domestic law at the point of ratification.\nIn prior international climate negotiations, America has tried to minimize its responsibility as the largest cumulative emitter of greenhouse gases.\nIts intent to roll back the endangerment finding is at odds with recent domestic legal opinion.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-08-08T14:26:43Z",
    "source": "The Atlantic"
  },
  {
    "url": "https://www.theverge.com/news/756580/apple-japan-alternative-ios-browsers",
    "title": "Apple’s lock on iPhone browser engines gets a December deadline",
    "summary": "is a news writer focused on creative industries, computing, and internet culture.\nPosts from this author will be added to your daily email digest and your homepage feed.\nWe might finally see the first iPhone browsers built on top of third-party engines now that Japanese regulators have taken up the issue.\nNot only do they set a December deadline for restrictions to be lifted, but also specify that Apple can’t enforce alternative rules that make it difficult to adopt alternatives to the company’s own WebKit browser engine.\nAccording to a translation provided by the Open Web Advocacy organization, the guidelines prevent Apple from doing the following:“Imposing unreasonable technical restrictions on individual app providers while allowing them to adopt alternative browser engines, placing excessive financial burdens on individual app providers for adopting alternative browser engines, and steering smartphone users away from using individual software that incorporates alternative browser engines.”",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-08T08:15:40Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.bbc.com/weather/articles/czjm4zl20wzo",
    "title": "UK weather: Fourth summer heatwave with 34C forecast in coming days",
    "summary": "Warm air will be drawn up from the south thanks to the interaction between high pressure drifting across the south of the UK and an area of low pressure - containing remnants of Tropical Storm Dexter - in the Atlantic.\nEngland and Wales will have the best of the sunshine, although a few scattered thunderstorms are likely.\nThis will be the first day of the heat where the official heatwave criteria is met across many areas.\nFor an official heatwave to be defined, there needs to be three consecutive days with temperatures above 25 to 28C, dependant on where you are in the UK.\nWith very warm and humid air around until Wednesday, that will make it the fourth heatwave of the summer, particularly for east Wales, the Midlands, eastern and south-eastern areas of England.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-08-08T11:48:49Z",
    "source": "BBC News"
  },
  {
    "url": "https://gizmodo.com/the-war-for-the-web-has-begun-2000640840",
    "title": "The War for the Web Has Begun",
    "summary": "In one corner is Cloudflare, a giant of web infrastructure that acts as a gatekeeper for a huge portion of online traffic.\n“Perplexity is just using a proxy to fetch something that’s already on the public web, to answer a user’s question.\nThe public web should be public,” defended tech founder Andrej Radonjic.\nthe public web should be public.\nCloudflare, by choosing to block Perplexity’s undeclared crawlers, has effectively appointed itself as the AI data police, making decisions about what constitutes “legitimate” web traffic.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-08T18:54:30Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://gizmodo.com/the-atlantic-hurricane-season-is-about-to-get-real-2000640747",
    "title": "The Atlantic Hurricane Season Is About to Get Real",
    "summary": "After an unusually slow start to hurricane season, it’s looking like storm activity is about to ramp up.\nSo far, the 2025 Atlantic hurricane season has produced four tropical storms and no hurricanes.\n“As the 2025 Atlantic Hurricane Season enters its historical peak, atmospheric and oceanic conditions continue to favor an above-normal season as NOAA first predicted in May,” NOAA stated in an update on Thursday, August 7.\nThe 2023 Atlantic hurricane season was also characterized by extreme sea surface temperatures, producing the fourth-highest number of named storms since record keeping began in 1950.\nThe Atlantic hurricane season historically peaks in September, so seeing storm activity increase in August isn’t unusual.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-08T17:40:04Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.bbc.com/news/articles/cyvn3qe0jpgo",
    "title": "Is Perrier as pure as it claims? The bottled water scandal gripping France",
    "summary": "At issue is whether some world-famous brands, notably the iconic Perrier label, can even continue calling themselves \"natural mineral water\".\nIt raises the possibility that for the first time in its 160-year history, Perrier water may soon not be labelled as what people assume it to be.\nThe advantage for Perrier is that the new beverages do not claim to be \"natural mineral water\".\nPerrier says the new brand is part of the mix, and that it has no intention of abandoning its original Source Perrier natural mineral water.\nIt has applied for \"natural mineral water\" status for just two out of the five drilling wells it was using for Perrier mineral water.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-08-08T04:58:33Z",
    "source": "BBC News"
  }
]