[
  {
    "id": "Mjg=",
    "url": "https://www.bbc.com/news/articles/c9dn6q4n80eo",
    "title": "River Itchen sewage spills threatening salmon survival, says MP",
    "summary": "\"At the River Itchen we have more than £70m worth of improvements to improve water quality as part of a wider plan for the River Test and Itchen, we will be announcing these in more detail later this year.\"",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-02-27T10:11:32Z",
    "source": "BBC News"
  },
  {
    "id": "MzE=",
    "url": "https://www.bbc.com/news/articles/cze0wzey2dno",
    "title": "Stormont: Bill to permanently ban fracking approved by NI Executive",
    "summary": "The Fermanagh and South Tyrone MLA who introduced a bill to ban fracking in the last mandate, said this was \"a positive day for the environment and will protect the wellbeing of local communities for generations to come\".",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2026-02-26T20:31:47Z",
    "source": "BBC News"
  },
  {
    "id": "MzI=",
    "url": "https://ca.news.yahoo.com/energy-hungry-india-tells-carney-090000395.html",
    "title": "Energy-hungry India tells Carney 'we are willing to buy whatever Canada is offering'",
    "summary": "To that end, Patnaik said India is interested in getting its hands on a lot more Canadian uranium in particular to power its growing nuclear sector.\n\"We are willing to take whatever,\" the high commissioner said, adding Indian companies are open to ownership stakes in Canadian uranium mines and buying more of this country's world-leading nuclear technology.\nAdvertisement AdvertisementAdvertisement AdvertisementIn exchange for tariff relief, India agreed to buy U.S. oil and U.S.-controlled Venezuelan exports instead, Trump said.\nBut, with wider U.S. trade talks on pause, Patnaik said India also wants Canadian oil to round out its supply.\nThe trouble, Patnaik said, is so much Canadian oil is currently destined for a single customer: the U.S.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-02-27T09:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzM=",
    "url": "https://www.sciencedaily.com/releases/2026/02/260228082714.htm",
    "title": "A major climate hope in Antarctica just melted away",
    "summary": "For years, researchers studying the Southern Ocean have pointed to one possible upside in an otherwise troubling climate outlook.\nThe study, published in Communications Earth and Environment, raises new questions about where iron in the Southern Ocean actually originates.\nWhy Iron in the Southern Ocean MattersEven though Antarctic waters are dark for months at a time, the Southern Ocean supports abundant phytoplankton growth.\nIn 2022, the researchers traveled aboard the now-decommissioned U.S. icebreaker, the Nathaniel B. Palmer, to the Dotson Ice Shelf in the Amundsen Sea of West Antarctica.\nRethinking Antarctic Iron and Climate ModelsTogether, these findings challenge long standing assumptions about iron sources in the Southern Ocean as the planet warms.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-28T14:59:08Z",
    "source": "Science Daily"
  },
  {
    "id": "MzQ=",
    "url": "https://gothamist.com/news/new-yorks-energy-research-agency-says-the-states-landmark-climate-law-is-infeasible",
    "title": "New York's energy research agency says the state's landmark climate law is infeasible",
    "summary": "Kathy Hochul a letter on Thursday calling the state’s climate law infeasible and overly expensive to implement.\nThe letter from the New York State Energy Research and Development Authority, which is controlled by the governor, outlined extra costs New York households could face if the law is implemented as planned.\nThe state climate law was passed after President Donald Trump pulled the United States out of the Paris Agreement, a landmark international treaty to reduce greenhouse gas emissions, during his first term.\n“This is a nonserious set of unsourced calculations,” said Raya Salter, a member of the Climate Action Council, which helped craft the 2019 climate law.\nSalter said the climate law is structured to make businesses pay for the pollution they create and to incentivize them to become more sustainable.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2026-02-27T19:04:35Z",
    "source": "Gothamist"
  },
  {
    "id": "MzY=",
    "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-subject-wise-quiz-environment-and-geography-week-151-10556262/",
    "title": "UPSC Essentials | Daily subject-wise quiz : Environment and Geography MCQs on South Pars field, seagrass and more (Week 151)",
    "summary": "The above mentioned statements refer to:(a) Bandhavgarh Tiger Reserve(b) Palamau Tiger Reserve(c) Ranthambore Tiger Reserve(d) Sariska Tiger ReserveRelevance: Tiger Reserves are frequently asked in Prelims under location mapping, vegetation type, and associated wildlife sanctuaries.\n(Other Source: ntca.gov.in)Story continues below this adQUESTION 2With reference to the South Pars field, consider the following statements:1.\nUPSC often asks about origin (Aravalli Range), basin boundaries, and state-wise river flow, making it a high-probability geography topic.\n(Source: phedwater.rajasthan.gov.in)Previous Daily Subject-Wise-QuizDaily Subject-wise quiz — History, Culture, and Social Issues (Week 146)Daily subject-wise quiz — Polity and Governance (Week 151)Daily subject-wise quiz — Science and Technology (Week 151)Daily subject-wise quiz — Economy (Week 151)Daily subject-wise quiz — Environment and Geography (Week 150)Daily subject-wise quiz – International Relations (Week 150)Subscribe to our UPSC newsletter and stay updated with the news cues from the past week.\nStay updated with the latest UPSC articles by joining our Telegram channel – IndianExpress UPSC Hub, and follow us on Instagram and X.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2026-02-27T15:58:40Z",
    "source": "The Indian Express"
  }
]