[
  {
    "url": "https://www.bbc.com/news/articles/cx2lmnvj3n5o",
    "title": "Red Tractor ad banned for misleading environmental claims",
    "summary": "Red Tractor ad banned for misleading environmental claims4 days ago Share Save Esme Stallard Climate and science reporter, BBC News Share SaveRed Tractor The Red Tractor advert was last shown in 2023 but will now be banned for future use unless it is updatedA TV advert by Red Tractor, the UK's biggest certifier of farm products on supermarket shelves, has been banned for exaggerating the scheme's environmental benefits and misleading the public.\nBut Red Tractor called the watchdog's decision \"fundamentally flawed\" and argued that the scheme's focus was animal welfare not environmental standards.\nIn 2021, Red Tractor aired an advert in which it said: \"From field to store all our standards are met.\nIt said that Red Tractor had failed to provide \"sufficient evidence\" that its farms met \"basic\" environmental laws and had a good environmental outcome to substantiate the claims in the ad.\nJim Mosley, CEO of Red Tractor, told the BBC: \"They believe that we have implied an environmental claim.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-10-15T02:40:44Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/ce3xynwwx4yo",
    "title": "Mysterious 'warm blob' breaks records in the North Pacific Ocean",
    "summary": "While climate change is known to make marine heatwaves more likely, scientists are struggling to explain why the north Pacific has been so hot for so long.\n\"There's definitely something unusual going on in the north Pacific,\" said Zeke Hausfather, a climate scientist at Berkeley Earth, a research group in the US.\nSo removing that cooling effect in shipping hotspots like the north Pacific could be revealing the full impact of human-caused warming.\nAnd a warm north Pacific appears to have different effects later in the winter, favouring milder and wetter conditions in some parts of Europe.\n\"But since the La Niña is quite weak this year, the extreme warmth in the north Pacific could be more important for forecasting the winter ahead.\"",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-17T23:26:57Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.theverge.com/news/801257/amazon-nuclear-energy-reactor-first-look",
    "title": "Amazon shares a ‘first look’ at new nuclear facility",
    "summary": "Amazon shared some new details about its plans to help deploy more nuclear energy across Washington State, where the company is headquartered.\nA rendering of the Cascade Advanced Energy Facility.\nA rendering of the Cascade Advanced Energy Facility.\nCalled the Cascade Advanced Energy Facility, it’ll include three sections with a combined capacity of 960 megawatts, about enough electricity to power 770,000 homes in the US.\nImage: X-energy via AmazonAmazon’s blog post today says that the Cascade facility should create about 100 permanent jobs, as well as more than 1,000 construction jobs.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-16T22:35:54Z",
    "source": "The Verge"
  },
  {
    "url": "https://gizmodo.com/noaas-winter-forecast-is-here-see-whats-in-store-for-your-state-2000673573",
    "title": "NOAA Forecast Maps Reveal What’s in Store for Your State This Winter",
    "summary": "Under normal conditions in the Pacific, trade winds blow west along the equator, transporting warm water from South America to Asia.\nEl Niño and La Niña are two opposing climate patterns that disrupt these normal conditions, according to NOAA.\nUnder La Niña conditions, winter temperatures also tend to be above average in the south and below average in the north.\nPeriods of El Niño and La Niña typically last 9 to 12 months, but they can last years.\nThe CPC expects weak La Niña conditions to persist through the winter, then shift to ENSO-neutral conditions sometime between January and March 2026.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-10-17T15:20:51Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://gizmodo.com/i-think-its-quite-a-scandal-plug-in-hybrids-not-as-climate-friendly-as-they-seem-researchers-say-2000673189",
    "title": "‘I Think It’s Quite a Scandal’: Plug-in Hybrids Not as Climate-Friendly as They Seem, Researchers Say",
    "summary": "In a new study published on Thursday, the researchers claim that plug-in hybrids actually only emit 19% less than cars with internal combustion engines.\nBut, unlike standard hybrids, plug-in hybrids have a larger battery.\nGimbert said that European drivers might not be incentivized to drive it fully in electric mode.\n“It’s actually 68 grams of CO2 per kilometer in electric mode, instead of being zero emission,” Gimbert said.\nThe American Automobile Association thinks consumers might show more interest in hybrids and plug-in hybrids as electric vehicle demand continues to wane.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-16T20:15:17Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.wired.com/review/jabra-enhance-select-700/",
    "title": "Jabra Enhance Select 700 Review: Still Great Hearing Aids",
    "summary": "So what is it about the Enhance Select 700 aids that makes them 200 better than the Select 500?\nThe big sell is a new audio feature called SoundScape Auto Focus.\nI struggled a bit with Auto Focus when I first started using the Enhance Select 700, as I had trouble hearing my wife in a restaurant playing loudish music over the PA—exactly the scenario Auto Focus was designed for.\nThe bottom line is that if you’re happy with your Enhance Select 500 (or 300), there is absolutely no need to rush to upgrade to the Select 700.\nFor that reason, the Jabra Enhance Select 300 remains my top pick for over-the-counter hearing aids, with the 700 making for a compelling product if price is no object.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-17T11:30:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.theverge.com/games/802089/pokemon-legends-z-a-shiny-hunting",
    "title": "Pokémon Legends: Z-A makes a big, welcome change for shiny hunters",
    "summary": "Pokémon Legends: Z-A hadn’t been out even a few hours before the tweets started rolling in: Shiny pokémon don’t despawn.\nIn other Pokémon games, like Scarlet and Violet, pokémon despawn after you get a certain distance away from them or trigger a loading screen.\nYou can still miss out on shiny pokémon in Z-A, but we’ll get to that in a bit.\nFleeing pokémon aside, the new shiny spawning mechanics are great for a game so heavy on roundabout, vertical, on-foot exploration.\nIt’s a relief knowing that most shiny pokémon will be waiting for you to reach them on your own terms.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-17T22:16:04Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/news/800104/amazon-fire-tv-stick-4k-plus-new-name",
    "title": "Amazon’s new name for the Fire TV Stick 4K only adds more confusion",
    "summary": "Following the debut of Amazon’s $39.99 Fire TV Stick 4K Select, the company told The Verge that a name change was coming to the existing “Fire TV Stick 4K” to clarify where it sat in the lineup.\nNow, Amazon has introduced that new branding, relaunching the product as the Amazon Fire TV Stick 4K Plus.\nSure, the original name was confusing (is 4K better or worse than 4K Select?\nRelated Amazon picked up the Plus that Apple TV dropped this weekThe differences between Amazon’s 4K-ready Fire TV Sticks are small.\nThe 4K Select includes half the RAM of the 4K Plus and the 4K Max, meaning it’ll almost certainly be slower to navigate between menus and jump into apps.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-10-15T18:45:07Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.scientificamerican.com/article/how-wood-vaulting-could-help-slow-climate-change/",
    "title": "How ‘Wood Vaulting’ Could Help Slow Climate Change",
    "summary": "How Wood Vaulting WorksThe concept is straightforward: instead of constructing massive machines to collect atmospheric carbon dioxide and inject it miles into the Earth’s crust, wood vaulters simply divert materials from Earth’s fast-paced biological carbon cycle into the much-slower geological carbon cycle.\nAs they await the axe, trees in logging-focused forests take up roughly 170 billion tons of carbon every year, 14 billion tons of which finds its way into wood.\nAnother start-up, Mast Reforestation, has buried burned trees on a plot of private land in Montana.\nClay’s fine-grained structure ensures that little to no oxygen reaches buried wood, preventing bacteria from decomposing it.\nConstruction of the first trench of the world’s first commercial-scale wood vault, near the Potomac River, where the equivalent of 100 metric tons of carbon dioxide were buried.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-16T11:00:00Z",
    "source": "Scientific American"
  }
]