[
  {
    "id": "MzY=",
    "url": "https://www.yahoo.com/news/articles/south-korea-climate-pledge-cut-050925509.html",
    "title": "South Korea’s climate pledge to cut coal, lower emissions clash with US push for LNG purchases",
    "summary": "Climate activists contend such plans may conflict with the country’s pledges to help curb climate change and could lock South Korea into a fossil fuel-dependent future.\nSouth Korea’s overall LNG imports may not increase if it offsets purchases of more U.S. natural gas by reducing imports from other sources such as Australia and the Middle East.\nSouth Korea's goal to cut carbon emissions by 53% to 61% of its 2018 level, fell short of climate activists’ expectations.\nLNG made up almost a fifth of South Korea’s total energy supply last year, according to the International Energy Agency, or IEA.\nAdvertisement AdvertisementAdvertisement AdvertisementSouth Korea's energy mixRenewable energy generated 7% of South Korea’s domestic power in 2022, according to the IEA.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-12-29T05:09:25Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mzc=",
    "url": "https://www.yahoo.com/news/articles/farmers-devastated-unexpected-storm-destroys-203000772.html",
    "title": "Farmers devastated after unexpected storm destroys crops: 'Significantly affected the remaining harvest'",
    "summary": "According to Fresh Plaza, the Valencia region in Spain is having a tough kaki harvest season.\nIn mid-November, the area was hit with a surprise hailstorm that impacted key kaki production sites.\nThe president of the Spanish Kaki Association, Pascual Prats, estimated 20% of the existing harvest was damaged by hail.\nWhat can be done to help kaki farmers?\nLess pollution means a more stable climate, which is conducive to successful crop production and food security.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-12-28T20:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mzg=",
    "url": "https://www.yahoo.com/news/articles/lawmakers-launch-groundbreaking-initiative-could-200000720.html",
    "title": "Lawmakers launch groundbreaking initiative that could revolutionize agriculture: 'Will help shape the future'",
    "summary": "A new pilot program dedicated to agrivoltaics will soon take place on New Jersey farmland.\nThe Dual-Use Solar Energy Pilot Program will lead the process of installing solar panels on qualified farms to test it as a new revenue stream for farmers, according to an SNJ Today report.\nAgrivoltaics combines agriculture with solar by installing panels on existing farmland.\n\"This partnership will allow us to continue rapidly expanding clean energy sources while allowing farmers to reap the benefits,\" Governor Murphy said.\nBringing solar into farming helps to clean up the food and agriculture industries and make them more eco-friendly.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-12-29T20:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mzk=",
    "url": "https://www.yahoo.com/news/articles/south-korea-end-breeding-bears-112322514.html",
    "title": "South Korea will end breeding of bears and extraction of their bile",
    "summary": "SEOUL, South Korea (AP) — South Korea said it will formally end its dwindling yet much-criticized bear bile farming industry this week, though about 200 bears are still kept in pens and raised for their gallbladders.\nSouth Korea is one of the few countries that allow farming to extract bile from bears, mostly Asiatic black bears known as moon bears, for traditional medicine or as food believed to promote vitality and stamina.\nAnimal rights groups are responsible for handling purchases of bears from farmers and the government establishing facilities to hold them.\nBear farming began in South Korea in the early 1980s, with farmers importing bears from Malaysia and other Southeast Asian countries.\nAbout 1,000 bears were raised in farms in South Korea in 2014.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-12-30T11:23:22Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDA=",
    "url": "https://www.newscientist.com/article/2506852-eu-carbon-border-tax-will-force-others-to-cut-emissions-from-2026/",
    "title": "EU carbon border tax will force others to cut emissions from 2026",
    "summary": "Tensions have been ramping up in the lead-up to the start of the EU’s carbon border tariff, or what it calls a carbon border adjustment mechanism.\n“I think we can expect to see carbon border adjustment mechanisms popping up all over the world,” says Belton.\nThe EU’s carbon border tax is essentially an extension of its carbon pricing.\nSome nations, including Brazil and Turkey, are introducing their own carbon pricing schemes specifically because of the EU’s carbon border tax.\nThe ideal situation would be for all nations that introduce carbon border adjustment mechanisms to adopt the same system.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-12-30T14:00:32Z",
    "source": "New Scientist"
  },
  {
    "id": "NDI=",
    "url": "https://finance.yahoo.com/video/centrus-ramps-us-uranium-production-161730551.html",
    "title": "Centrus Ramps up US Uranium Production",
    "summary": "Centrus Energy jumps after launching US uranium enrichment manufacturing.\nCEO Amir Vexler, a former GE executive, joined Bloomberg to talk about how nuclear power can meet AI-driven energy demand, why US policy is shifting fast, and what domestic fuel means for markets, jobs, and national security.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-12-30T16:17:30Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDM=",
    "url": "https://www.yahoo.com/news/articles/experts-raise-red-flags-concerning-041500949.html",
    "title": "Experts raise red flags on concerning side effect of shipping industry: 'We know there is a longer-term solution'",
    "summary": "Quiet narwhals and other marine animals rely on it to communicate, navigate, and find food.\nHowever, as the Guardian reported, new research shows that increasing ship traffic is ruining that silence.\nA study conducted in Eclipse Sound near Baffin Island documented how underwater noise from large cargo ships overwhelms narwhal communications.\nScientists now confirm that no marine species appears fully immune to ship noise, according to marine biologist Lindy Weilgart.\nWhen underwater noise drowns out natural communication, marine animals lose essential tools for their daily lives and become more stressed.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-12-30T04:15:00Z",
    "source": "Yahoo Entertainment"
  }
]