[
  {
    "id": "MzA=",
    "url": "https://www.yahoo.com/news/articles/why-boosting-production-venezuelas-very-150149908.html",
    "title": "Why boosting production of Venezuela's 'very dense, very sloppy' oil could harm the environment",
    "summary": "Since then, the United States has moved to assert control over Venezuelan oil exports, the country's main source of revenue, seizing tankers it says were transporting crude in violation of U.S. sanctions and signaling plans to redirect Venezuelan oil to global markets under U.S. oversight.\nVenezuela's oil reserves are thought to be the largest in the world at an estimated 300 billion barrels.\nAdvertisement AdvertisementAdvertisement AdvertisementEven a modest increase in Venezuelan oil production could carry climate consequences on the scale of entire countries, said Mahdavi, of the University of California, Santa Barbara.\nHe said Venezuela’s heavy oil reserves lie in fragile plains crisscrossed by slow-moving rivers, a geography that can magnify the effects of spills.\nThe true environmental and social costs of Venezuela’s oil have never been fully calculated, de Lisio said.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-01-09T15:01:49Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzE=",
    "url": "https://www.wired.com/story/the-oceans-just-keep-getting-hotter/",
    "title": "The Oceans Just Keep Getting Hotter",
    "summary": "Since 2018, a group of researchers from around the world have crunched the numbers on how much heat the world’s oceans are absorbing each year.\nIn 2025, their measurements broke records once again, making this the eighth year in a row that the world’s oceans have absorbed more heat than the years before.\nWhile some of the excess heat warms the ocean’s surface, it also slowly travels further down into deeper parts of the ocean, aided by circulation and currents.\nGlobal temperature calculations—like the ones used to determine the hottest years on record—usually only capture measurements taken at the ocean’s surface.\nWhile sea surface temperatures have risen since the industrial revolution, thanks to our use of fossil fuels, these measurements don’t provide a full picture of how climate change is affecting the oceans.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-01-09T08:00:00Z",
    "source": "Wired"
  },
  {
    "id": "MzI=",
    "url": "https://news.slashdot.org/story/26/01/09/148202/record-ocean-heat-is-intensifying-climate-disasters-data-shows",
    "title": "Record Ocean Heat is Intensifying Climate Disasters, Data Shows",
    "summary": "It is better to travel hopefully than to fly Continental.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2026-01-09T14:07:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MzM=",
    "url": "https://www.yahoo.com/news/articles/aerial-photos-reveal-chinas-carpet-001500762.html",
    "title": "Aerial photos reveal China's 'carpet-like' project blanketing vast desert: 'Sandy and mostly devoid of life'",
    "summary": "A massive solar panel array in China is expected to crack 7,000 megawatts of power generation in 2026, according to EnergiesMedia.\nThe Three Gorges Kubuqi Solar Park has been under construction since 2022, blanketing an Inner Mongolian desert in panels.\n\"Sandy and mostly devoid of life, the Kubuqi Desert in Inner Mongolia once had a reputation for being a 'sea of death.'\n\"The construction is part of China's multiyear plan to build a 'solar great wall' designed to generate enough energy to power Beijing.\"\nThe Three Gorges Kubuqi Solar Park, due to be completed in 2030, will be 250 miles long, three miles wide, and will be able to generate 100 gigawatts of clean energy.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-01-11T00:15:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzQ=",
    "url": "https://www.yahoo.com/news/articles/scientists-raise-concern-findings-surface-030000056.html",
    "title": "Scientists raise concern as new findings surface about eerie global phenomenon: '[We] can't afford to ignore'",
    "summary": "It's hard to predict the probability of the worst-case scenarios because you can't calculate uncertainty.\nAdvertisement AdvertisementAdvertisement AdvertisementThe study, published in the journal Earth's Future, found multiple worst-case scenarios.\nOne of them is where temperatures rise 4 degrees Celsius (7.2 degrees Fahrenheit) and the sea level rises 2 meters.\nAdvertisement AdvertisementAdvertisement AdvertisementAdditionally, the global temperature rise of 1.3 degrees Celsius (2.34) has already seen many deaths during heatwaves.\nWhat's being done about worst-case climate scenarios?",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-01-10T03:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDE=",
    "url": "https://www.scientificamerican.com/article/ocean-temperatures-just-hit-a-dire-new-record/",
    "title": "Ocean Temperatures Just Hit a Dire New Record",
    "summary": "The world’s ocean absorbed more heat in 2025 than in any other year on recordThe oceans just keep getting hotter.\nAccording to new research from dozens of international scientists published in Advances in Atmospheric Sciences early on Friday, the world’s oceans stored more heat in 2025 than any other year on record.\nIn 2025 the upper 2,000 meters of the ocean absorbed a record-setting 23 zettajoules more energy than in 2024.\nThese hot surface temperatures are a factor in Earth’s overall annual surface temperature; 2025 is expected to be the second- or third-hottest year on record.\nHotter oceans contribute to rising sea levels, disrupt fragile marine ecosystems and fuel extreme weather.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-01-09T08:00:00Z",
    "source": "Scientific American"
  },
  {
    "id": "NDI=",
    "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essentials-subject-wise-quiz-environment-and-geography-week-144-10464747/",
    "title": "UPSC Essentials | Daily subject-wise quiz : Environment and Geography MCQs on white-bellied heron, Andes mountain range and more (Week 144)",
    "summary": "(a) Only one(b) Only two(c) All three(d) NoneRelevance: The white-bellied heron is one of the world’s rarest birds and frequently appears in questions.\nQUESTION 4With reference to the International Solar Alliance, consider the following statements:1.\nAlso on the list is the International Solar Alliance (ISA), which is headquartered in India.\nPrevious Daily Subject-Wise-QuizDaily Subject-wise quiz — History, Culture, and Social Issues (Week 139)Daily subject-wise quiz — Polity and Governance (Week 144)Daily subject-wise quiz — Science and Technology (Week 144)Daily subject-wise quiz — Economy (Week 144)Daily subject-wise quiz — Environment and Geography (Week 143)Daily subject-wise quiz – International Relations (Week 143)Subscribe to our UPSC newsletter and stay updated with the news cues from the past week.\nStay updated with the latest UPSC articles by joining our Telegram channel – IndianExpress UPSC Hub, and follow us on Instagram and X.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2026-01-09T14:29:51Z",
    "source": "The Indian Express"
  }
]