[
  {
    "id": "MzA=",
    "url": "https://science.slashdot.org/story/26/02/18/044252/air-pollution-emerges-as-a-direct-risk-factor-for-alzheimers-disease",
    "title": "Air Pollution Emerges As a Direct Risk Factor For Alzheimer's Disease",
    "summary": "Mater artium necessitas.\n[Necessity is the mother of invention].",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-02-18T07:00:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MzE=",
    "url": "https://www.yahoo.com/news/articles/california-colorado-washington-sue-trump-200550952.html",
    "title": "California, Colorado and Washington sue Trump administration to unlock funding for clean energy projects",
    "summary": "SAN FRANCISCO, Feb 18 (Reuters) - California, Colorado and Washington are suing the federal government to force ‌it to pay out grants approved by Congress for ‌clean energy projects, the California attorney general's office said on Wednesday.\nStates, including California, have been among the main foils to various ⁠Trump administration policies, launching dozens of suits.\nThe new suit responds in part to California's loss of $1.2 billion in federal funding for ‌the Alliance for Renewable Clean Hydrogen ​Energy Systems, or ARCHES, Bonta ​said.\nAdvertisement AdvertisementFederal agencies must ​execute laws, California said.\n\"It's as simple as Congress has the power of the purse, not the executive ​branch, and Congress ‌already appropriated this funding,\" Bonta said in an ​interview on Tuesday, ahead of the announcement.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-02-18T20:05:50Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzM=",
    "url": "https://www.scientificamerican.com/article/epa-faces-lawsuit-over-ending-the-endangerment-finding-pillar-climate-law/",
    "title": "EPA faces lawsuits over climate endangerment finding withdrawal",
    "summary": "Medical and environmental groups are challenging the EPA’s decision to break with the long-standing scientific evidence that climate change endangers human healthOn Wednesday prominent medical and environmental groups challenged the Trump administration’s decision to scrap a 2009 finding that climate change threatens human health.\nThe challenge comes days after EPA administrator Lee Zeldin announced that the agency would scrap the 2009 “endangerment finding,” breaking with the long-standing scientific consensus that global warming poses a risk to human health.\nThe new lawsuit could once more elevate the fight over whether climate change harms health to the Supreme Court.\nIn 2007 the Court decided in the case Massachusetts v. EPA that greenhouse gases, including carbon dioxide, qualified as air pollutants under the Clean Air Act.\nWhen contacted by Scientific American on Wednesday, the EPA declined to comment on the lawsuit, citing a long-standing practice of not commenting on current or pending litigation.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-18T15:00:00Z",
    "source": "Scientific American"
  },
  {
    "id": "MzU=",
    "url": "https://www.bbc.com/weather/articles/cgrz24y2wvno",
    "title": "Flooding may worsen before it improves as more rain forecast for UK",
    "summary": "We have seen fluvial - or river - flooding, which is when rivers or streams burst their banks and flood surrounding areas.\nThere has also been pluvial - or surface water - flooding, which is a direct result of intense or prolonged rainfall that overwhelms drainage systems.\nHowever, a third type of flooding - groundwater flooding - has also been a widespread problem, especially in parts of southern England.\nLow lying river valleys and areas on chalk aquifers - such as the Salisbury Plains - are most prone to groundwater flooding.\nThe Environment Agency says groundwater flooding, external occurs when water under the ground (the water table) rises to the surface.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-02-18T14:54:18Z",
    "source": "BBC News"
  },
  {
    "id": "Mzc=",
    "url": "https://www.sciencedaily.com/releases/2026/02/260218031554.htm",
    "title": "A spinning gyroscope could finally unlock ocean wave energy",
    "summary": "Most existing wave energy devices perform well only under specific wave conditions, limiting their effectiveness in the constantly shifting environment of the open sea.\nA researcher at The University of Osaka has taken a close look at a new approach known as a gyroscopic wave energy converter (GWEC).\n\"Wave energy devices often struggle because ocean conditions are constantly changing,\" says Takahito Iida, author of the study.\nModeling Maximum Wave Energy EfficiencyTo better understand how the system behaves, the researcher used linear wave theory to model the interaction among ocean waves, the floating structure, and the gyroscope.\nBy clarifying how to fine tune the gyroscope's operating parameters, the research offers practical guidance for building more flexible and efficient wave energy systems.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-02-18T14:33:28Z",
    "source": "Science Daily"
  },
  {
    "id": "Mzg=",
    "url": "https://www.cbc.ca/news/climate/epa-endangerment-9.7095596",
    "title": "U.S. environment agency sued over scrapping scientific rule behind climate protections",
    "summary": "The legal challenge, filed in the U.S. Court of Appeals for the District of Columbia Circuit, asserts that the EPA's rescission of the endangerment finding is unlawful.\nThe 2009 finding supported common-sense safeguards to cut climate pollution, including from cars and trucks, the lawsuit says.\nThe endangerment finding \"led to trillions of dollars in regulations that strangled entire sectors of the United States economy, including the American auto industry,\" Zeldin said.\nEnvironmental groups described the move as the single biggest attack in U.S. history against federal authority to address climate change.\nEvidence backing up the endangerment finding has only grown stronger in the 17 years since it was approved, they said.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-18T17:42:56Z",
    "source": "CBC News"
  },
  {
    "id": "NDE=",
    "url": "https://www.sciencedaily.com/releases/2026/02/260217005803.htm",
    "title": "A satellite illusion hid the true scale of Arctic snow loss",
    "summary": "Why Snow Cover Matters for Climate ChangeSnow cover measures how much of Earth's land surface is blanketed in snow.\nSnow loss leads to a decrease in albedo which leads to higher energy absorption which, in turn, leads to enhanced snow loss.\nQuestions About NOAA Snow DataFor years, some climate researchers have questioned how reliable NOAA's snow cover data might be.\nSnow cover has actually been shrinking by about half a million square kilometres per decade, or about half the area of Ontario.\nClearer Evidence of Arctic Snow DeclineThe revised findings strengthen the conclusion that snow cover is declining throughout the year and increase confidence in that trend.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-18T03:58:00Z",
    "source": "Science Daily"
  },
  {
    "id": "NDI=",
    "url": "https://www.aljazeera.com/news/2026/2/19/activist-group-extinction-rebellion-says-it-is-under-fbi-investigation",
    "title": "Activist group Extinction Rebellion says it is under FBI investigation",
    "summary": "Environmental group Extinction Rebellion has said that climate change activists associated with the group are being investigated by the Trump administration, which is also openly working to roll back environmental protections in the United States.\nThe Department of Justice also opened an investigation into the environmental group Climate Defiance earlier this month in response to what Extinction Rebellion said was a “viral peaceful protest”.\n“Trump is weaponising the DOJ to attack peaceful protesters in order to appease a multi-trillion dollar fossil fuel industry that got him elected,” Extinction Rebellion’s New York chapter said in a statement shared on Instagram.\nKnown as XR, the activist group garnered media attention worldwide through disruption, hitting roads, airports and other public transport networks with direct action protests against climate change in major cities.\nA number of fossil fuel companies also donated to Trump’s re-election campaign.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-02-19T04:04:45Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDM=",
    "url": "https://www.scientificamerican.com/article/how-climate-change-made-deadly-floods-in-spain-even-worse/",
    "title": "How climate change made deadly floods in Spain even worse",
    "summary": "In 2024 extreme rain and floods hit the Spanish region of Valencia, killing more than 230 people in the country.\nAt the time, scientists speculated that climate change had fueled the event—and now a new study reveals how much it did so.\nThe study shows that, because of climate change, the rate of intense rainfall was about 21 percent higher over a six-hour period in Valencia than it would have been without the influence of climate change.\nThe findings show that the kinds of storms researchers once predicted would happen thanks to climate change are “already becoming evident,” the authors write.\nUltimately, they highlight an “immediate need” to ensure cities are prepared for a possible onslaught of extreme weather as a result of climate change.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-02-17T18:40:00Z",
    "source": "Scientific American"
  },
  {
    "id": "NDY=",
    "url": "https://www.sciencedaily.com/releases/2026/02/260217005714.htm",
    "title": "Climate change is accelerating but nature is slowing down",
    "summary": "They compared species turnover rates, meaning how quickly one species replaces another, before and after this period of accelerated warming.\nRather, they often operate in what is called the \"Multiple Attractors\" phase, a concept predicted in 2017 by theoretical physicist Guy Bunin.\nIn this multiple attractors phase, species continually replace one another because of internal biological interactions, even when environmental conditions remain stable.\nBiodiversity Loss and Environmental DegradationIf these internal dynamics typically keep ecosystems in motion, why are turnover rates slowing?\nIn a healthy \"Multiple Attractors phase\" ecosystem, a broad regional pool of species supplies a steady stream of potential newcomers.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-02-18T05:22:03Z",
    "source": "Science Daily"
  }
]