[
  {
    "url": "https://www.bbc.com/news/articles/c05enyryqvmo",
    "title": "Record warm seas help to bring extraordinary species to UK waters",
    "summary": "That might not sound much, but the UK's seas are now considerably warmer than even a few decades ago, a trend driven by humanity's burning of fossil fuels.\nThat is contributing to major changes in the UK's marine ecosystems, with some new species entering our seas and others struggling to cope with the heat.\nScientists and amateur naturalists have observed a remarkable range of species not usually widespread in UK waters, including octopus, bluefin tuna and mauve stinger jellyfish.\nThat is making marine heatwaves more likely and more intense.\nThe precise distribution of marine species varies from year to year, but researchers expect the UK's marine life to keep changing as humans continue to heat up the Earth.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-08-11T00:36:06Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.theverge.com/podcast/756701/ai-tools-chatgpt-gemini-vergecast",
    "title": "We found stuff AI is pretty good at",
    "summary": "Tech companies keep telling everyone that this or that AI feature is going to change everything.\nBut when you press them for examples, real, concrete examples of how those AI tools should be used, the answers tend to be lackluster.\nSometimes AI tools feel so open-ended, it’s hard to know where to start or what the best way to use them might beWell, here at The Verge, we have to test all these AI tools to better report on the features and the companies building them.\nIf you have any examples where AI was useful to you, we’d love to hear them.\nYou can email [email protected] or call into the Verge Hotline at 866-VERGE11.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-10T14:53:02Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.yahoo.com/news/articles/artist-drowns-sculpture-plastic-waste-114328886.html",
    "title": "Artist drowns sculpture in plastic waste in front of the UN during plastic pollution treaty talks",
    "summary": "GENEVA (AP) — As nations began a second week of negotiations Monday for a global accord to end plastic pollution, an artist heaped piles of plastic waste onto a large sculpture in front of the United Nations office.\nDelegates to the treaty talks pass by the sculpture daily in a reminder of their responsibility to solve the plastic pollution crisis.\nBenjamin Von Wong, a Canadian artist and activist, designed the nearly 6 meter (18 foot) sculpture called the “Thinker’s Burden” and built it with a team.\nHe climbed a ladder Monday to reach the top of the sculpture and weave plastic bottles through the DNA.\nUnited Nations Environment Programme Executive Director Inger Andersen told reporters it's still possible to agree on a treaty this week that ends plastic pollution.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-08-11T11:43:28Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/c8jpp3jwe32o",
    "title": "No plans to change passenger rules for new young drivers a 'major oversight', AA says",
    "summary": "No plans to change passenger rules for new young drivers a 'major oversight', AA says1 day ago Share Save Emily Atkinson BBC News Share SaveGetty ImagesThe government's planned overhaul of driving laws in Great Britain has a \"major oversight\" by not including stronger driving licence rules for new and young motorists, the AA has said.\nBut Justice Minister Alex Davies-Jones told the BBC there were no plans to introduce such measures over concerns they might \"unfairly discriminate\" against young parents or carers.\nThe AA welcomed the government's plans in the main, but said \"the missing element is measures to safeguard and to save new driver and passenger lives by limiting peer-age passengers for six months\".\nThe latest government figures show a quarter of fatalities from road collisions involve at least one young driver.\nRoad safety charity Brake said this was due to young drivers being more likely to take risks on the road or crash when they have passengers of their own age, something that does not happen as much for older drivers.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-08-11T14:56:51Z",
    "source": "BBC News"
  },
  {
    "url": "https://hackaday.com/2025/08/08/one-file-six-formats-just-change-the-extension/",
    "title": "One File, Six Formats: Just Change The Extension",
    "summary": "However, [PortalRunner] has crafted a file that can behave as six different filetypes, simply by swapping out the extension at the end of the filename.\n[PortalRunner] simply found a bunch of different file formats that could feasibly be crammed in together into a single file without corrupting each other or confusing software that loads these files.\nIt all comes down to how file formats work.\n[PortalRunner] found a way to merge the headers of various formats, creating a file that could be many different types.\nIf you love diving into the binary specifics of how file formats work, this is a great project to dive into.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-08-09T05:00:24Z",
    "source": "Hackaday"
  },
  {
    "url": "https://phys.org/news/2025-08-indigenous-communities-action-plastic-pollution.html",
    "title": "Indigenous communities plead for action at plastic pollution talks",
    "summary": "Indigenous communities from North America are at talks on a global treaty on plastic pollution in Geneva, pleading the case for the environment they depend upon, which is slowly being choked by microplastics.\nCountries are trying to negotiate a groundbreaking international treaty on combating plastic pollution.\nShe is asking negotiators to craft a plastic pollution treaty that ensures justice, particularly for the most vulnerable communities, she told AFP.\nHenri Bourgeois Costa, an environmental and plastic pollution expert at the Tara Ocean Foundation, explained Alaska's predicament.\nShe spoke at a conference staged on the sidelines of the negotiations, which are struggling to find a consensus that would stop the amount of plastic pollution from growing.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-10T18:09:45Z",
    "source": "Phys.Org"
  },
  {
    "url": "https://www.businessinsider.com/stranger-helped-stranded-on-road-changed-my-life-2025-8",
    "title": "A stranger came to help me out when I was stranded on the side of the road. He had a profound impact on my life.",
    "summary": "I was still pretty young, but, honestly, I should have known how to change a flat tire by that point in life.\nI turned on the hazard lights and started to fumble around in the trunk for the spare and the jack.\nI was completely caught off guardWithin moments, the man — without introduction or any small talk — asked for the tools and set to work.\nI helped him pull the old tire off, rolled the new one over, and helped finalize the process.\nThe stranger who helped me with my flat may or may not have thought about what effect he had on me, but his impact will last a lifetime.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-08-09T18:38:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.bbc.com/news/articles/cjr11z2yx0yo",
    "title": "Arthur's Seat fire: Human activity likely cause, says fire service",
    "summary": "Arthur's Seat blaze likely caused by human activity - fire service1 day ago Share Save Angus Cochrane BBC Scotland News Share SaveFlames take hold as fire burns on Arthur's SeatA large fire on Arthur's Seat in the centre of Edinburgh was almost certainly sparked by human activity, a Scottish Fire and Rescue service group commander has said.\nArthur's Seat rises above Edinburgh from near the Scottish Parliament.\n\"The fire at Arthur's Seat is a sharp reminder of wildfire's destructive power, and the speed at which it can cause significant damage,\" she said.\nBlazes that burned across moorland at Carrbridge and Dava in the Highlands earlier this summer have been called the biggest wildfires Scotland has ever seen.\nProf Rory Hadden, chair of fire science at the University of Edinburgh, agreed that most wildfires in Scotland were caused by human activity.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-08-11T09:24:31Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.vox.com/future-perfect/422708/future-of-food-abundance-factory-farming-grunwald",
    "title": "The brutal trade-off that will decide the future of food",
    "summary": "Before joining Vox, she reported on factory farming for national outlets including the Guardian, the Intercept, and elsewhere.\nHumans already slaughter an eye-watering 80 billion land animals per year, a number that will continue to soar.\nAnimal agriculture takes up lots of land and resources — that’s why meat is bad for the environment in the first place.\nMaybe it won’t, but if you don’t keep working and fighting, it definitely won’t.”We should look at animal agriculture the same way.\nWe don’t know if we’ll ever convince humanity to abandon the “radical evil” of factory farming, but it would be an abdication to give up trying.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-09T05:16:50Z",
    "source": "Vox"
  }
]