[
  {
    "id": "OA==",
    "url": "https://environment.ec.europa.eu/news/new-law-more-sustainable-circular-and-safe-batteries-enters-force-2023-08-17_en",
    "title": "New law on more sustainable, circular and safe batteries enters into force",
    "summary": "A new law to ensure that batteries are collected, reused and recycled in Europe is entering into force today.\nThis will support the shift to a circular economy, increase security of supply for raw materials and energy, and enhance the EU’s strategic autonomy.\nThe Batteries Regulation will ensure that batteries placed on the EU single market will only be allowed to contain a restricted amount of harmful substances that are necessary.\nBackgroundSince 2006, batteries and waste batteries have been regulated at EU level under the Batteries Directive.\nSuch exponential growth in demand for batteries will lead to an equivalent increase in demand for raw materials, hence the need to minimise their environmental impact.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-21T08:28:42Z",
    "source": "Europa.eu"
  },
  {
    "id": "Mjc=",
    "url": "https://www.bbc.com/news/articles/cqj9y9xw5v8o",
    "title": "Government relaunches green payment scheme for farmers after sudden closures",
    "summary": "Reynolds said the illegal dumping of waste - described by one farmer as \"a travesty of justice that surely must be righted\" - was an issue that had been \"seized\" by the prime minister, with more resources being given to the Environment Agency.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-02-24T17:59:27Z",
    "source": "BBC News"
  },
  {
    "id": "Mjk=",
    "url": "https://hackaday.com/2026/02/23/a-candle-powered-light/",
    "title": "A Candle-Powered Light",
    "summary": "For a little over two thousand years, the primary light sources after the sun had set were oil lamps and candles.\nThis was well before the age of fossil fuels, so these oil lamps were often fueled with a labor-intensive agricultural product like olive oil.\nLabor and materials costs aside, though, there’s a surprising amount of energy in these fuels and [Maciej Nowak Projects] has a generator that help these ancient light sources generate some electricity on the side.\nThe generator is based around a piece of technology called a thermoelectric generator (TEG), which produces a voltage potential when placed in a temperature gradient.\nIt would make a fitting addition to anyone’s emergency power outage kit as it really increases the amount of available light produced from any given candle.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-02-23T09:00:52Z",
    "source": "Hackaday"
  },
  {
    "id": "MzE=",
    "url": "https://www.theverge.com/tech/883006/kohler-anthem-evocycle-smart-shower-system-water-recirculate-filter-recycle",
    "title": "Kohler’s new shower reuses dirty water to get you clean",
    "summary": "Kohler claims its new Anthem EvoCycle smart shower system can deliver “up to 80% water savings” without the use of showerheads that limit flow or pressure.\nPricing starts at $7,500, or $5,625 with discounts, but you’ll need to buy fixtures and the $825 water tank base separately.\nSwitching to “Cycle Mode” mixes a half gallon of that fresh water with dirty used water that’s sent through a closed loop filtration system before being pumped up to the showerhead.\nThe system not only reduces water usage, but it can also potentially reduce energy usage by using the hot water heater less.\nThe EvoCycle smart shower connects to Kohler’s mobile app so you can track water savings and activate a self-cleaning mode.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-02-23T16:17:26Z",
    "source": "The Verge"
  }
]