[
  {
    "url": "https://www.theverge.com/report/808647/bill-gates-climate-change-ai-emissions-memo",
    "title": "Why is Bill Gates tone policing on climate change?",
    "summary": "Bill Gates wants us all to be more upbeat about climate change.\nGates acknowledges the disparities, but minimizes the role climate change plays in exacerbating inequalities.\nYes, food and shelter are probably a bigger priority than climate change for someone trying to make ends meet.\n“When there’s a typhoon, you can’t fish.”Obviously, there was more than climate change at play in her story.\nTropical storms draw heat energy from warming waters, and have grown more intense with climate change.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-29T12:05:45Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/report/809348/ai-fire-detection-vail-hpe-smart-city-platform",
    "title": "How one mountain town hopes AI can help it fight wildfires",
    "summary": "A popular ski resort town in Colorado is adopting a new AI Smart City Solution from Hewlett Packard Enterprise (HPE) to help it better detect wildfires, as well as update a range of other city services.\nResearchers and first responders are increasingly exploring ways in which new AI tools might help them get ahead of blazes.\nForrest connected with HPE and the company Kamiwaza, which has developed an AI orchestration platform, to ask how AI might be able to help the town.\nNow, Vail is the first municipality in the US to adopt HPE’s new “smart city solution,“ developed alongside Kamiwaza, Nvidia, and several other tech companies.\nHPE’s smart city platform will run out of a nearby data center that is primarily powered by renewable energy.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-10-29T20:48:30Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/bill-gates-pushes-back-against-doomsday-outlook-on-climate-change-2025-10",
    "title": "Bill Gates Pushes Back Against 'Doomsday Outlook' on Climate Change",
    "summary": "Bill Gates wants to change the discussions around climate.\nBryan Bedder/Getty Images for Bloomberg PhilanthropiesBill Gates wants to change the discussions around climate.\nBryan Bedder/Getty Images for Bloomberg PhilanthropiesBill Gates says climate change is not the end of the world.\nGates has studied climate change for over a decade and has long been outspoken about it, publishing the book \"How to Avoid a Climate Disaster\" in 2021.\nIn his Monday note, Gates proposed that scientists consider human well-being instead of using temperature as a metric for climate change.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-28T14:49:39Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.bbc.com/news/articles/ce8g3018krro",
    "title": "Government urged to review botched insulation across Britain",
    "summary": "About 280,000 properties in Britain were offered free insulation - either external wall or other types of solid wall - under government schemes between 2013 and 2025.\nUnder the scheme, 350 homes in the town's Fishwick area were fitted with external wall insulation.\nTasneem Hussain had external wall insulation installed on her home in Fishwick at about the same time as the Rashid family.\nHowever, similar problems have arisen in later government insulation schemes.\nJean Liddle, 82, was among a number of Chilton residents who had external wall insulation fitted on her home.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-30T05:56:44Z",
    "source": "BBC News"
  },
  {
    "url": "https://hbr.org/podcast/2025/10/inside-indias-energy-transition-tata-powers-net-zero-strategy",
    "title": "Inside India’s Energy Transition: Tata Power’s Net Zero Strategy",
    "summary": "By 2024, Tata Power was India’s largest private power producer by installed capacity with annual revenues of $7.4 billion.\nToday, thousands of companies around the world have set ambitious goals to achieve net zero emissions, including Tata Power, India’s oldest and largest private power producer.\nToday on Cold Call, we’ll discuss the case, “Tata Power and India’s Energy Transition” with Professor Vikram Gandhi and Dr. Praveer Sinha, CEO of Tata Power.\nAnd I think Tata Power actually is a fantastic example as to how they’ve been able to balance the interaction.\nSo one of the biggest shareholders of Tata Power is Tata Sons, which is the main holding company.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-10-28T12:15:00Z",
    "source": "Harvard Business Review"
  },
  {
    "url": "https://www.yahoo.com/news/articles/researchers-issue-warning-overlooked-hazard-030000466.html",
    "title": "Researchers issue warning on overlooked hazard that can harm human lungs — here's what you need to know",
    "summary": "After exposure, researchers found that the plastic particles built up in lung tissue, causing structural abnormalities, inflammation, and stress on lung cells.\nLab tests on human lung cells evidenced similar harmful effects, providing insight into the potential health risks of airborne nanoplastics.\nThis study — and its alarming findings — highlight how plastic pollution and poor air quality directly harm human health.\nOver time, this discarded plastic breaks down into microplastics, a larger category of tiny plastic particles that includes nanoplastics.\nThis study contributes to a growing body of research demonstrating the harm that microscopic plastic pollution already poses to human health.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-29T03:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.nature.com/articles/d41586-025-03472-z",
    "title": "What now for the global plastics treaty?",
    "summary": "When the United Nations negotiations on plastic pollution in Geneva, Switzerland, collapsed in August, observers declared the outcome an abject failure and the process broken.\nTrust and science: the essential elements missing from plastics treaty talksMany media outlets saw a failure of multilateralism, but what I saw was fatigue.\nI served as an adviser on Rwanda’s delegation in 2022, when it co-sponsored the UN Environment Assembly resolution to end plastic pollution.\nFor some nations, plastics manufacturing underlies economic survival and political stability.\nNegotiators must acknowledge the economic realities that underpin resistance and the ecological urgencies that demand change.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-28T00:00:00Z",
    "source": "Nature.com"
  },
  {
    "url": "https://news.slashdot.org/story/25/10/28/1951245/humanity-has-missed-15c-climate-target-says-un-head",
    "title": "Humanity Has Missed 1.5C Climate Target, Says UN Head",
    "summary": "Humanity has failed to limit global heating to 1.5C and must change course immediately, the secretary general of the UN has warned.\nFrom a report:",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-10-28T20:10:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://www.nature.com/articles/d41586-025-03557-9",
    "title": "Daily briefing: How the plastics-treaty breakdown could pave the way for something better",
    "summary": "Plus, glowing sperm helped to reveal secrets of mosquito sex and seven times that basic science changed the world.\nHello Nature readers, would you like to get this Briefing in your inbox free every day?\nNature | 4 min readFeatures & opinionThe polymerase chain reaction — the fundamental science behind infection-detecting PCR tests — originated from work on bacteria found in hot springs.\nnov.) is one of 30 newly described species found by researchers after an expedition around the South Sandwich Islands.\n(Ocean Census press release | 7 min read) (The Nippon Foundation-Nekton Ocean Census/Schmidt Ocean Institute © 2025)",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-10-29T00:00:00Z",
    "source": "Nature.com"
  },
  {
    "url": "https://www.wired.com/story/greenhouse-gas-protocol-caught-in-big-techs-friendly-fire/",
    "title": "A Fight Over Big Tech’s Emissions Has the Greenhouse Gas Protocol Caught in the Crossfire",
    "summary": "Last week’s request for public comment from the Greenhouse Gas Protocol (GHGP) doesn’t look like a major win for a tech giant to the naked eye.\nBut for Google and Microsoft, the announcement constitutes a considerable win in their years-long battle against their competitors over how to account for the carbon emissions of data centers and, by extension, AI.\nOut of ScopeScope 2 is a subcategory used by the GHGP to account for a company’s indirect emissions from purchased electricity, steam, heat, or cooling.\nFor tech giants, Scope 2 emissions have surged as AI has driven massive growth in data center energy use.\nAs these loads have grown, so too has the pressure to find a new way to account for them.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-30T10:31:37Z",
    "source": "Wired"
  },
  {
    "url": "https://www.bbc.com/news/articles/c5yp8r4ryvmo",
    "title": "Climate change intensified India's heatwaves in 2024 - Lancet study",
    "summary": "Climate change intensified India's heatwaves in 2024 - Lancet study2 days ago Share Save Nikita Yadav BBC News, Delhi Share SaveNurPhoto via Getty Images India has faced increasingly intense heatwaves in recent yearsAlmost one-third of the heatwave days India experienced in 2024 were driven by climate change, according to a new report by the medical journal The Lancet.\nThe report found that India recorded an average of 19.8 heatwave days last year, of which 6.6 days would not have occurred without human-induced climate change.\nIt also estimated that heat exposure in 2024 resulted in the loss of 247 billion potential labour hours, mostly in the agriculture and construction sectors.\nProlonged exposure to extreme heat has serious repercussions on health.\n\"Throughout last year,152 record-breaking extreme weather events were registered across 61 countries, and life-threatening, extreme heat events are becoming more intense than previously predicted,\" the report stated.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-30T11:03:40Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.theverge.com/news/807686/elon-musk-grokipedia-launch-wikipedia-xai-copied",
    "title": "Elon Musk’s Grokipedia launches with AI-cloned pages from Wikipedia",
    "summary": "Unlike newer projects, Wikipedia’s strengths are clear: it has transparent policies, rigorous volunteer oversight, and a strong culture of continuous improvement.\nThrough open collaboration and consensus, people from all backgrounds build a neutral, living record of human understanding – one that reflects our diversity and collective curiosity.\nThis human-created knowledge is what AI companies rely on to generate content; even Grokipedia needs Wikipedia to exist.\nWikipedia’s nonprofit independence — with no ads and no data-selling — also sets it apart from for-profit alternatives.\nAs we approach Wikipedia’s 25th anniversary, Wikipedia will continue focusing on providing free, trustworthy knowledge built by its dedicated volunteer community.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-28T00:46:59Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.nature.com/articles/d41586-025-03469-8",
    "title": "Trust and science: the essential elements missing from plastics treaty talks",
    "summary": "Plastics overwhelmingly end up in the ocean or at landfill sites.Credit: Salvatore Laporta/KONTROLAB/LightRocket/GettyIn August, the world should have been celebrating the first global agreement to end plastics pollution.\nWhat now for the global plastics treaty?\nThe world’s first plastics treaty is in crisis: can it be salvaged?\nUN plastics treaty: don’t let lobbyists drown out researchersStrong and his team understood that they couldn’t make progress without engaging with these concerns.\nFor the plastics treaty talks to succeed, the incoming chair, hosts and delegates need to up their game.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-28T00:00:00Z",
    "source": "Nature.com"
  },
  {
    "url": "https://www.yahoo.com/news/articles/india-conducts-cloud-seeding-trial-102956385.html",
    "title": "India conducts cloud-seeding trial to clear New Delhi's smog",
    "summary": "NEW DELHI (AP) — Indian authorities on Tuesday carried out a cloud-seeding experiment over smog-choked New Delhi in an attempt to induce rainfall and clear the city’s toxic air, which has sparked anger among residents.\nA plane sprayed chemicals into clouds over some areas of the Indian capital to encourage rain and wash pollutants from the air, which remained in the “very poor” category, according to air quality monitors.\nNew Delhi and its surrounding region, home to more than 30 million people, routinely rank among the world’s most polluted.\nIndia has six of the 10 most polluted cities globally, and New Delhi is the most polluted capital, according to a report from Switzerland-based air quality monitoring database IQAir earlier this year.\nAir quality worsens in New Delhi every winter as farmers burn crop residue in nearby states and cooler temperatures trap the smoke, which mixes with vehicle and industrial emissions.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-28T10:29:56Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/ukrainian-drones-hit-russian-pantsir-system-radars-oil-depots-crimea-2025-10",
    "title": "Ukrainian drones hit a $20 million Pantsir missile system and a couple of radar stations in attacks on Russia's Crimea defenses",
    "summary": "lighning bolt icon An icon in the shape of a lightning bolt.\nImpact LinkUkrainian drones knocked out a $20 million Russian air defense system and multiple radar stations during an attack on the occupied Crimean peninsula, a security source told Business Insider on Wednesday.\nA source in the Security Service of Ukraine, the country's internal security agency, said long-range attack drones struck a Pantsir surface-to-air missile system and two radar stations overnight.\nRussia's defense ministry said it shot down five Ukrainian drones over Crimea earlier on Wednesday.\nThey said that every deep-strike operation, like the one overnight, hurts Russia's \"military and logistical potential.\"",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-10-29T13:04:32Z",
    "source": "Business Insider"
  },
  {
    "url": "https://tech.yahoo.com/transportation/articles/chinese-solid-state-battery-breakthrough-170000745.html",
    "title": "Chinese Solid-State Battery Breakthrough Powers 800-Mile Range",
    "summary": "Chinese automakers just unveiled a new solid-state battery that could revolutionize the electric vehicles industry.\nSolid-state batteries, by contrast, use a solid electrolyte which eliminates the need for a bulky separator component separating positive and negative electrodes.\nAdvertisement AdvertisementAdvertisementThe competition to corner the market on solid-state EV batteries is fierce.\nToyota currently leads the charge on patents, with 1,700 filed for solid-state battery technologies.\nChinese companies are already reportedly working on making EV batteries with a 2,000 kilometer (km) (1,300 mile) range.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-28T17:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/cr7m0n890npo",
    "title": "Who is Rob Jetten, tipped to become youngest Dutch prime minister?",
    "summary": "Who is Rob Jetten, tipped to become youngest Dutch prime minister?\nWhen Wilders cancelled an appearance because of security fears, Rob Jetten seized the moment and took his place.\nIf his party does come top, Rob Jetten could become the Netherlands' first openly gay prime minister.\n\"Robot Jetten is going to be prime minister!\"\n\"Sometimes it can work out really crazy in politics,\" Jetten replied with a broad grin.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-10-30T03:50:18Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/c04gqez4lkyo",
    "title": "What is COP30 and where and when is it taking place?",
    "summary": "COP30 is taking place ten years after the Paris climate agreement, in which countries pledged to try to restrict the rise in global temperatures to 1.5C.\nCOP30 is the 30th annual UN climate meeting, where governments discuss how to limit and prepare for further climate change.\nWhere is COP30 taking place?\nCOP30 is taking place at a crucial moment with global climate targets under significant strain.\nUnder the Paris agreement, countries were supposed to have submitted updated plans ahead of COP30 detailing how they will cut their emissions of planet-warming gases.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-30T16:19:30Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.sciencedaily.com/releases/2025/10/251029002920.htm",
    "title": "Earth has hit its first climate tipping point, scientists warn",
    "summary": "Together with several co-authors, he led the chapter on \"Earth System Tipping Points and Risks.\"\nWunderling explains: \"The devastating consequences that arise when climate tipping points are crossed pose a massive threat to our societies.\nThe World Nears a Cascade of Climate Tipping PointsAccording to the report, scientists have identified roughly two dozen parts of the global climate system that could reach tipping points.\nUnderstanding Climate Tipping PointsClimate tipping points have become a major focus in climate research only within the past two decades.\nPositive Tipping Points Offer HopeThe authors also highlight that not all tipping points are destructive.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-29T08:26:38Z",
    "source": "Science Daily"
  },
  {
    "url": "https://www.core77.com/projects/138889/Egg-Box-Sneakers-exploring-creativity-through-waste-material",
    "title": "Egg Box Sneakers – exploring creativity through waste material",
    "summary": "This concept demonstrates how primitive materials can become a source of endless imagination and cultural commentary where art, design, and sustainability meet.\nDesign TeamVadim KibardinThese sneakers are handcrafted entirely from recycled egg cartons, 100% packaging material transformed into the familiar form of contemporary footwear.\nUsing only two types of carton egg boxes, the project explores the creative potential of humble materials and limited resources.\n\"Egg Box Sneakers\" reflect a way of thinking: turning waste into value, simplicity into meaning, and constraints into creative energy.\nThe project is a continuation of a 20-year-long artistic journey by Vadim Kibardin, who works primarily with cardboard, paper, and packaging to create functional sculptures and art objects.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-28T16:38:00Z",
    "source": "Core77.com"
  }
]