[
  {
    "id": "NDE=",
    "url": "https://hardware.slashdot.org/story/26/02/08/0233236/why-is-china-building-so-many-coal-plants-despite-its-solar-and-wind-boom",
    "title": "Why Is China Building So Many Coal Plants Despite Its Solar and Wind Boom?",
    "summary": "Want to read Slashdot from your mobile device?\nPoint it at m.slashdot.org and keep reading!",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2026-02-08T17:34:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "NDM=",
    "url": "https://www.yahoo.com/news/articles/scientists-achieve-major-breakthrough-pursuit-170000945.html",
    "title": "Scientists achieve major breakthrough in pursuit of nearly limitless energy source: 'Cutting-edge upgrades'",
    "summary": "A team of global experts working on a fusion power generator in the United Kingdom is entering its fifth development campaign in pursuit of nearly limitless energy source.\nAs explained by the United States Department of Energy, fusion energy could be a game-changing source of abundant power, made when atoms collide to form larger ones.\nSolar panels can provide household energy independence by lowering or even eliminating your electricity bill with abundant energy from the sun.\nAdvertisement AdvertisementFor their part, UKAEA scientists plan to learn some important details from the latest project, which could expedite large-scale fusion electricity production.\n\"Over the coming months, we hope to push further the boundaries of what's possible in spherical tokamak science.\"",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-02-08T17:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDQ=",
    "url": "https://www.yahoo.com/news/articles/over-100-000-people-ordered-080500349.html",
    "title": "Over 100,000 people ordered to evacuate as catastrophic flooding threatens entire city: 'Water is coming in from every corner'",
    "summary": "Advertisement AdvertisementMorocco's historic city of Ksar El-Kbir has been hit hard by this week's flooding.\n\"Water is coming in from every corner and rainfall is expected to reach 150 millimeters between afternoon and evening today.\nThe Grand Palace is at risk of flooding from this week's rain.\nWhile the northern part of the country is facing flooding today, officials were addressing a major drought in parts of the country late last year.\nMorocco's innovative floating solar installation shades reservoir water to save it from evaporation while producing electricity for nearby infrastructure.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-02-06T08:05:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDU=",
    "url": "https://uk.finance.yahoo.com/news/britain-invest-1-4-billion-223603099.html",
    "title": "Britain to invest up to $1.4 billion in community energy projects",
    "summary": "LONDON, Feb 9 (Reuters) - Britain will invest up to 1 billion pounds ($1.4 billion) in community ​energy projects, such as installing solar panels on ‌libraries and other public buildings, to help meet climate targets and ‌cut local energy costs, it said on Tuesday.\nThe Local Power Plan, ‌launched on Monday, aims to support locally owned clean energy projects across community buildings ‍and public sites.\nIt will be backed by Great British Energy, the government's publicly owned energy company, with the funding ​part of the 8.3 billion pounds committed to ‌GBE over the current Parliament.\nEnergy Secretary Ed Miliband said the initiative would allow communities to own and control clean energy generation, ensuring profits flow into local areas rather than to large energy companies.\nThe funding will be distributed through grants and loans to community energy ⁠groups and local authorities, with schemes launching later this year, ‌the government said.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-02-09T22:36:03Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTE=",
    "url": "https://www.bbc.com/news/articles/c0lx3e1w5y8o",
    "title": "Rare mosses reintroduced to Yorkshire to fight climate change",
    "summary": "\"We want to try to produce the diversity of plant life there because the more diversity we have, the more resilient they're going to be through climate change and if we can bring back these species that have been lost we can see if we will get resilient habitats that will survive the next 100, 1,000 or millennia in these places.\"",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-02-08T09:04:47Z",
    "source": "BBC News"
  }
]