[
  {
    "url": "https://gizmodo.com/wildfire-smoke-chokes-canada-and-u-s-triggering-air-quality-alerts-2000639059",
    "title": "Wildfire Smoke Chokes Canada and U.S., Triggering Air Quality Alerts",
    "summary": "Smoke billowing from the blazes has blanketed central Canada and the northern U.S., prompting widespread air quality alerts.\nIn the U.S., the National Weather Service (NWS) has issued air quality alerts across the Midwest and Northeast.\nThe Switzerland-based air quality monitoring database IQAir—which provides real-time air quality data—listed Minneapolis, Minnesota, as having some of the worst air pollution in the world over the weekend, the Associated Press reported.\nAir quality alerts indicate that air is unhealthy for sensitive groups, including people with asthma, lung or heart disease, children, and older adults.\nThat said, wildfire smoke can affect anyone’s health, regardless of their age or preexisting conditions.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-08-05T16:25:58Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://gizmodo.com/trump-administration-moves-to-destroy-satellite-that-monitors-greenhouse-gases-2000639234",
    "title": "Trump Administration Moves to Destroy Satellite That Monitors Greenhouse Gases",
    "summary": "Two satellite missions on the chopping block have provided climate scientists, oil and gas companies, and farmers with critical atmospheric carbon data for years.\nTrump’s budget proposal threatens both missions, but the standalone OCO-2 would be completely destroyed during its fiery descent through Earth’s atmosphere.\nThe OCO-2 and OCO-3 sniff out atmospheric carbon dioxide using spectrometers to detect wavelengths of light absorbed by CO2 molecules.\nThis instrument has also provided valuable insights into urban carbon dioxide emissions and contributed data that supported the Paris Agreement.\nWhen plants absorb sunlight to convert carbon dioxide and water into energy, their chlorophyll—a light-absorbing pigment—leaks some unused photons, JPL explains.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-05T20:15:35Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.wired.com/story/inside-the-biden-administrations-unpublished-report-on-ai-safety/",
    "title": "Inside the US Government's Unpublished Report on AI Safety",
    "summary": "More importantly, they showed shortcomings in a new US government standard designed to help companies test AI systems.\nTrump’s administration has since steered experts away from studying issues such as algorithmic bias or fairness in AI systems.\nThe event took place at the Conference on Applied Machine Learning in Information Security (CAMLIS).\nParticipants were asked to use the NIST AI 600-1 framework to assess AI tools.\nThe framework covers risk categories including generating misinformation or cybersecurity attacks, leaking private user information or critical information about related AI systems, and the potential for users to become emotionally attached to AI tools.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-06T18:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.scientificamerican.com/article/why-the-epas-latest-move-could-worsen-the-climate-crisis/",
    "title": "Why the EPA’s Latest Move Could Worsen the Climate Crisis",
    "summary": "As such, if the finding is successfully rescinded, EPA will have actively and intentionally walked away from its responsibility to address climate change.\nBut in addition to being crafted by five known climate contrarians, the report is riddled with climate denial tropes, cherry-picked evidence, and distortions of the indisputably well-established facts on climate change.\nSharply cutting those emissions is crucial to limiting dangerous climate change.\nHundreds of scientists have come together to write major globally relevant reports, including the U.S. Fifth National Climate Assessment (NCA5) and the Sixth Assessment Report of the Intergovernmental Panel on Climate Change (AR6), documenting the latest science.\nLost homes, rising insurance premiums, unhealthy outdoor working conditions, business interruptions and damaged infrastructure are all effects of a worsening climate.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-08-06T15:00:00Z",
    "source": "Scientific American"
  },
  {
    "url": "https://www.newyorker.com/news/the-lede/the-epas-disastrous-plan-to-end-the-regulation-of-greenhouse-gases",
    "title": "The E.P.A.’s Disastrous Plan to End the Regulation of Greenhouse Gases",
    "summary": "Last week, it announced a plan to revoke the endangerment finding.\nStill, in taking on the endangerment finding, the Administration has managed to outdo itself.\nThe attempt to rescind the endangerment finding combines pandering to the fossil-fuel industry with another of the Administration’s favorite activities: flouting science.\nAt this point, repealing the endangerment finding on scientific grounds should be impossible: contra the claims of the D.O.E.\nRescinding the endangerment finding could “backfire on the fossil fuel industry,” Parenteau observed.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-04T10:00:00Z",
    "source": "The New Yorker"
  },
  {
    "url": "https://www.theverge.com/tesla/720157/tesla-death-lawsuit-verdict-lawyer-brett-schreiber-interview",
    "title": "The lawyer who beat Tesla is ready for ‘round two’",
    "summary": "The day before posting the reel, he stood in a Florida courtroom alongside his clients as a jury handed Tesla a major defeat.\nThere’s Tesla in the showroom and then there’s Tesla in the courtroom.\nAnd Tesla in the showroom tells you that they’ve invented the greatest full self-driving car the world has ever seen.\nBut to that end, I can say that Tesla has a system of gathering data.\nTesla’s going to find out.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-08-06T20:54:41Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/news/718639/gabe-newell-valve-superyacht-oceanco",
    "title": "Valve founder Gabe Newell just purchased a superyacht company",
    "summary": "Valve founder Gabe Newell is setting out on a new adventure — and it doesn’t involve Half-Life 3.\nInstead, Newell is acquiring Oceanco, the yacht-building company that’s creating his $400 million super ship, as reported earlier by Boat International.\nAlong with Newell’s 364-foot-long superyacht, Oceanco developed Amazon founder Jeff Bezos’ $500 million sailing yacht, Koru, which stretches 417 feet long.\nIt’s also behind the Kaos sailing superyacht owned by Walmart heir Nancy Walton Laurie, as well as the Bravo Eugenia, owned by Dallas Cowboys owner Jerry Jones.\nAs for what Newell plans to do now that he’s the head of a big superyacht builder, Oceanco puts it pretty simply: “His first decision?",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-04T21:20:39Z",
    "source": "The Verge"
  },
  {
    "url": "https://news.asu.edu/20250725-environment-and-sustainability-new-global-study-shows-freshwater-disappearing-alarming",
    "title": "New global study shows freshwater is disappearing at alarming rates",
    "summary": "Seventy-five percent of the world’s population lives in 101 countries that have been losing freshwater for the past 22 years.\n“Continents are drying, freshwater availability is shrinking, and sea-level rise is accelerating.\nClimate extremes began accelerating and in response, groundwater use increased and continental drying exceeded the rates of glacier and ice sheet melting.\n\"This study really shows how important it is to have continuous observations of a variable such as terrestrial water storage,\" Chandanpurkar said.\nA planetary wake-up callThe unprecedented scale of continental drying threatens agriculture and food security, biodiversity, freshwater supplies and global stability.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-03T19:49:34Z",
    "source": "Asu.edu"
  }
]