[
  {
    "id": "MzA=",
    "url": "https://www.yahoo.com/news/articles/scientists-uncover-potentially-game-changing-235000029.html",
    "title": "Scientists uncover potentially game-changing universal new benefit after planting mushrooms: 'Unsung hero'",
    "summary": "As the BBC reported, the architecture firm Redhouse Studio developed a \"mycotecture\" method that uses fungal mycelium to break down toxic materials.\nRedhouse Studio is changing the way people think about toxic demolition debris, construction scrap materials, and polluted soils.\nThis news is encouraging because it offers a natural solution to address mounting construction waste as development demand steadily increases.\nRedhouse Studio has already been using its fungi technology to address housing and health crises in Cleveland, Ohio.\n\"Decades of racist city planning, banking, and industrial practices have poisoned communities and blighted neighborhoods,\" Redhouse Studio wrote.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-12-19T23:50:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzE=",
    "url": "https://www.yahoo.com/news/articles/scientists-discover-concerning-phenomenon-could-011500264.html",
    "title": "Scientists discover concerning phenomenon that could cause devastating floods: 'Even more intense'",
    "summary": "Dr. Pepin explained, \"Mountains share many characteristics with Arctic regions and are experiencing similarly rapid changes.\"\nAdvertisement AdvertisementAdvertisement AdvertisementHe added that both areas are experiencing significant snow and ice loss, and it's changing the ecosystems.\nWhy is snow and ice loss in the mountains concerning?\nWhile the loss of snow and ice is harmful to mountain communities, it's not just those communities that suffer.\nDr. Pepin also noted, \"When you transition from snowfall to rain because it has become warmer, you're more likely to get devastating floods.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-12-19T01:15:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzM=",
    "url": "https://finance.yahoo.com/news/boeing-seeks-faa-emissions-waiver-225330159.html",
    "title": "Boeing seeks FAA emissions waiver to sell 35 additional 777F freighters",
    "summary": "By David ShepardsonWASHINGTON, Dec 19 (Reuters) - Boeing (BA) on Friday asked the Federal Aviation Administration for a waiver of airplane emissions rules to allow it to ​sell another 35 Boeing 777F freighters, citing strong customer demand and a ‌delay in the next-generation plane's certification.\nBoeing said the waiver would allow it to meet anticipated customer demand for cargo planes prior to the 777-8F entering service.\nBoeing said large widebody freighters are crucial to the export of goods.\n\"Of ‌the $600 billion in goods exported by air cargo in 2024, more than $260 billion were transported on large widebody freighters,\" Boeing said.\nBoeing ⁠said the 777F is the most fuel-efficient airplane for ​the global freight market and the only large ​widebody freighter in production.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-12-19T22:53:30Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzQ=",
    "url": "https://www.npr.org/2025/12/19/nx-s1-5648270/trump-weather-climate-national-center-atmospheric-research-ncar",
    "title": "Scientists push back on Trump plan to break up a critical climate and weather center",
    "summary": "Scientists push back on Trump plan to break up a critical climate and weather centertoggle caption Chip Somodevilla/Getty ImagesThe White House plans to break up a key weather and climate research center in Colorado, a move experts say could jeopardize the accuracy of forecasting and prediction systems.\nIt's the latest climate-related move by President Trump, who has called climate change a hoax, cut funding for climate research, and removed climate and weather scientists from their posts across the federal government.\nAmerican Meteorological Society President David Stensrud says he has used NCAR weather models throughout his career.\nHe calls NCAR \"a world-envied research center for atmospheric science\" and \"a beating heart for the atmospheric science community.\"\nThe administration has also rolled back National Science Foundation funding for climate science.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-12-19T18:25:37Z",
    "source": "NPR"
  },
  {
    "id": "Mzc=",
    "url": "https://www.yahoo.com/news/articles/expert-issues-urgent-warning-disease-021500884.html",
    "title": "Expert issues urgent warning about disease-carrying insects lurking in US region: 'They were out and about'",
    "summary": "As Pennsylvania hunters gear up and head into the woods this fall, an expert has warned that the state is seeing more ticks than usual.\nAdvertisement AdvertisementAdvertisement AdvertisementThe lab has also found that tick-borne illnesses, such as Lyme disease, anaplasmosis, babesiosis, and Powassan virus, are on the rise.\nPennsylvania is not the only state to report an increase in tick-borne diseases in recent years.\nFor instance, Quebec officials announced the Canadian province's first case of Rocky Mountain spotted fever, a tick-borne disease.\nGenerally, though, reducing pollution to slow the rapid rise in global temperatures can help limit the length of the tick season.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-12-19T02:15:00Z",
    "source": "Yahoo Entertainment"
  }
]