[
  {
    "url": "https://www.theverge.com/news/802070/nuclear-fusion-energy-ai-trump-roadmap",
    "title": "The US has a new roadmap for fusion energy, without the funds to back it up",
    "summary": "The Department of Energy (DOE) released a new roadmap for the US to realize the decades-long dream of harnessing fusion energy.\nIt’s a commitment to support research and development efforts and pursue public-private partnerships to finally build the first generation of fusion power plants.\nNuclear fusion plants, in contrast, would fuse atoms together to generate energy in a controlled way.\nBoth Google and Microsoft have announced plans to purchase electricity from forthcoming fusion power plants that are supposed to be online by the late 2020s or 2030s.\nThe DOE dedicates an entire section of the roadmap to AI, which it calls a “transformative tool for fusion energy.” Researchers can use AI models to construct “digital twins” to more quickly study how experimental facilities would perform, the roadmap says as an example.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-17T22:21:39Z",
    "source": "The Verge"
  },
  {
    "url": "https://gizmodo.com/noaas-winter-forecast-is-here-see-whats-in-store-for-your-state-2000673573",
    "title": "NOAA Forecast Maps Reveal What’s in Store for Your State This Winter",
    "summary": "Under normal conditions in the Pacific, trade winds blow west along the equator, transporting warm water from South America to Asia.\nEl Niño and La Niña are two opposing climate patterns that disrupt these normal conditions, according to NOAA.\nUnder La Niña conditions, winter temperatures also tend to be above average in the south and below average in the north.\nPeriods of El Niño and La Niña typically last 9 to 12 months, but they can last years.\nThe CPC expects weak La Niña conditions to persist through the winter, then shift to ENSO-neutral conditions sometime between January and March 2026.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-10-17T15:20:51Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.bbc.com/news/articles/ce3xynwwx4yo",
    "title": "Mysterious 'warm blob' breaks records in the North Pacific Ocean",
    "summary": "While climate change is known to make marine heatwaves more likely, scientists are struggling to explain why the north Pacific has been so hot for so long.\n\"There's definitely something unusual going on in the north Pacific,\" said Zeke Hausfather, a climate scientist at Berkeley Earth, a research group in the US.\nSo removing that cooling effect in shipping hotspots like the north Pacific could be revealing the full impact of human-caused warming.\nAnd a warm north Pacific appears to have different effects later in the winter, favouring milder and wetter conditions in some parts of Europe.\n\"But since the La Niña is quite weak this year, the extreme warmth in the north Pacific could be more important for forecasting the winter ahead.\"",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-17T23:26:57Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/weather/articles/c0jdp9wynn7o",
    "title": "Rising temperatures are threatening UK trees - but these species could save our forests",
    "summary": "Some of the United Kingdom's most valued trees are struggling to keep pace with climate change and increasing extreme weather.\n\"We are very concerned that changing conditions are putting our trees under significant stress,\" warns Dr Eleanor Tew from Forestry England.\nTo future-proof our forests, a 'species for the future' list has been released highlighting thirty trees likely to thrive in a warmer climate.\nIt includes familiar names like oak, birch, and alder, alongside less common species such as coast redwood and Corsican pine, which it is hoped will lead to a more resilient woodland.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-10-19T04:12:39Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/c3vnr45x5qyo",
    "title": "Government vows to create 400,000 jobs in clean energy sector",
    "summary": "Government vows to create 400,000 jobs in energy sector1 day ago Share Save Pritti Mistry Business reporter Share SaveEd Miliband says 400,000 jobs is \"not a target, it's what we need\"The government has announced plans to train and recruit more workers for the UK's clean energy sector, promising to create 400,000 extra jobs by 2030.\nSpeaking on the BBC's Sunday with Laura Kuenssberg programme, Energy Secretary Ed Miliband said thousands of jobs were needed to develop Britain's clean energy sector to \"get bills down for good\".\nAs part of the government's strategy, five \"technical excellence colleges\" will be set up to train workers with clean energy skills, with £2.5m in funding going towards pilot schemes in Cheshire, Lincolnshire, and Pembrokeshire, according to the Department for Energy Security and Net Zero (DESNZ).\nPA Media The Siemens wind turbine factory in Hull, where hundreds are employed, is \"booming\", a minister has saidThere would be also be tailored schemes for ex-offenders, school leavers and the unemployed.\nHe said 10,000 extra jobs would be needed to support the construction of the Sizewell C nuclear power station in Suffolk and described how the Siemen's wind turbine factory in Hull was \"booming\".",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-10-19T09:52:42Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.theverge.com/transportation/801780/gm-ev-battery-lab-lmr-range-cost",
    "title": "The lab where GM is cooking up new EV batteries to beat China",
    "summary": "GM says its affordable, more sustainable LMR batteries will decisively outperform China’s best lithium iron phosphate (LFP) specimens — currently the world’s favored low-cost solution.\nGM plans to keep on the EV offensive“This unlocks premium long-distance range at an affordable cost,” says Andy Oury, a lead GM battery engineer.\nAmong North American automakers, GM placed early bets on building its own “high nickel” or “nickel rich” batteries.\nChina’s answer was those LFP batteries, which sparked that nation’s EV revolution, especially for small budget models that dominate that market.\nThe Wallace lab can now produce up to 100 cells a day, and has created 26 variants of LMR cells in three form factors.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-10-17T20:48:08Z",
    "source": "The Verge"
  },
  {
    "url": "https://finance.yahoo.com/news/tesla-announces-bold-offer-entice-231500219.html",
    "title": "Tesla announces bold new offer to entice buyers: 'Act now for the best deal'",
    "summary": "The lease credit coincided with the expiration of the EV tax credit.\nThe company said that the lease credit is subject to change or end at any time.\nIn an apparent attempt to compensate for the profit loss from the lease credit, Tesla increased the prices of the Model 3 and Model Y by up to 11%.\nAlthough the EV tax credit has expired, there are still ways to save money when purchasing or leasing an EV.\nTesla's lease credit may help more widespread adoption of electric vehicles, which would greatly benefit the environment.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-10-18T23:15:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://tech.slashdot.org/story/25/10/17/1948248/plug-in-hybrids-pollute-almost-as-much-as-petrol-cars-report-finds",
    "title": "Plug-in Hybrids Pollute Almost As Much As Petrol Cars, Report Finds",
    "summary": "If at first you don't succeed, you must be a programmer.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-10-17T21:20:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://hbr.org/sponsored/2025/10/what-happens-when-your-buildings-can-manage-themselves",
    "title": "What Happens When Your Buildings Can Manage Themselves?",
    "summary": "",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-10-17T19:19:49Z",
    "source": "Harvard Business Review"
  },
  {
    "url": "https://hardware.slashdot.org/story/25/10/17/2314242/first-look-at-the-amazons-nuclear-facility-planned-for-washington-state",
    "title": "First Look at the Amazon's Nuclear Facility Planned For Washington State",
    "summary": "If at first you don't succeed, you must be a programmer.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-10-18T01:25:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://www.businessinsider.com/moved-kids-family-big-city-to-rural-small-town-2025-10",
    "title": "We Moved Our Kids From a Big City to a Rural Town; Our Life Is Great",
    "summary": "The author, shown with her family, says moving from a big city to a small town was one of the best decisions her family has made.\nThe author, shown with her family, says moving from a big city to a small town was one of the best decisions her family has made.\nCourtesy of Kathy LarsonThe author, shown with her family, says moving from a big city to a small town was one of the best decisions her family has made.\nWe were also concerned about leaving the great restaurants and things to do in the big city we had called home for 18 years.\nAnd we didn't know what to expect when it came to the small town everybody-knows-everybody's-business thing.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-19T10:36:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.wired.com/story/how-to-see-comet-lemmon-this-october/",
    "title": "How to See Comet Lemmon This October",
    "summary": "Follow-up observations revealed that the object was a comet visiting from the outer edge of the solar system, and it was named Comet Lemmon (C/2025 A6).\nAccording to NASA, Comet Lemmon will be closest to Earth around October 21, 2025, passing at a distance of about 0.60 astronomical units, or au (1 au is the distance between Earth and the sun).\nComet Lemmon is notable for its greenish tint.\nComet Lemmon (C/2025 A6) photographed in Slovenia in early October.\nPhotograph: Uroš FinkHow to View the CometAs of early October, Comet Lemmon can be found slightly below the handle in the Big Dipper (or the Plough, as it's known in the UK), which forms part of the Ursa Major constellation.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-17T09:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.yahoo.com/news/articles/officials-weigh-sweeping-ban-common-020000431.html",
    "title": "Officials weigh sweeping ban on common item to protect iconic US oasis — here's what you need to know",
    "summary": "Community leaders in California are weighing the benefits of outlawing certain single-use plastics in an effort to better protect the environment.\nExtruded polystyrene, more commonly known as Styrofoam, has long been the target of sweeping bans across the country because of its nonbiodegradable nature.\nIn addition to outright plastic bans, the promotion of sustainable alternatives can go a long way in reducing our reliance on fossil fuels.\nBans also raise awareness about single-use plastic waste and can encourage a shift toward a circular economy through increased use of recyclable or biodegradable materials.\nNo way Definitely Only certain tools I don't know Click your choice to see results and speak your mind.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-18T02:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/researchers-issue-warning-overlooked-factor-231500005.html",
    "title": "Researchers issue warning about overlooked factor increasing heart disease risk — here's what you need to know",
    "summary": "For decades, experts have warned that plastic pollution has been quietly infiltrating our air, water, and food.\nNow, researchers say it may be invading something even more personal — our arteries.\nA new study published in Cardiovascular Research warns that tiny plastic particles — microplastics and nanoplastics — may be emerging risk factors for heart disease.\nThese particles, which originate from the breakdown of plastic waste, have already been detected in the brain, lungs, liver, and bloodstream.\nNow, researchers say their findings on the buildup inside arteries could be reshaping how we understand and prevent heart disease.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-17T23:15:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.aljazeera.com/opinions/2025/10/17/clean-air-is-the-new-frontier-of-global-cooperation",
    "title": "Clean air is the new frontier of global cooperation",
    "summary": "Outdoor air pollution claims 5.7 million lives each year, and a report released last week highlights the lack of international development finance for clean air.\nThis year, we sought to treat the right to breathe clean air with the urgency it deserves.\nThe burden of air pollution is already visible in hospital admissions, school absenteeism, and productivity losses across the continent.\nThrough the National Air Quality Framework and the National Environmental Management Act, we have built a foundation for accountability and transparency in monitoring air quality.\nAdvertisementThe message from Cape Town is clear: clean air belongs at the top table.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-10-17T11:05:40Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://www.yahoo.com/entertainment/celebrity/articles/john-travolta-speaks-disgusting-photo-002500713.html",
    "title": "John Travolta speaks out after 'disgusting' photo of home sparked outrage online: 'It's a practical reason'",
    "summary": "Aside from the lavish lifestyle, a conversation can be had about what private jet travel represents in a time of major pollution concerns.\nThis use of private planes directly impacts the changing climate.\nThe ripple effect from rising global temperatures results in extreme weather events such as destructive storms, longer droughts, and severe wildfires.\nBezos bought his fourth private jet for $80 million in direct contradiction to Amazon's public stance on its environmentally friendly goals.\nAdvertisement AdvertisementAdvertisement AdvertisementWhen the planet is experiencing extreme weather events due to human-caused rising global temperatures, indulgence to this degree may be less practical and more harmful.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-10-19T00:25:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.wired.com/review/jabra-enhance-select-700/",
    "title": "Jabra Enhance Select 700 Review: Still Great Hearing Aids",
    "summary": "So what is it about the Enhance Select 700 aids that makes them 200 better than the Select 500?\nThe big sell is a new audio feature called SoundScape Auto Focus.\nI struggled a bit with Auto Focus when I first started using the Enhance Select 700, as I had trouble hearing my wife in a restaurant playing loudish music over the PA—exactly the scenario Auto Focus was designed for.\nThe bottom line is that if you’re happy with your Enhance Select 500 (or 300), there is absolutely no need to rush to upgrade to the Select 700.\nFor that reason, the Jabra Enhance Select 300 remains my top pick for over-the-counter hearing aids, with the 700 making for a compelling product if price is no object.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-17T11:30:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.yahoo.com/news/articles/officials-stunned-crucial-water-supply-110000653.html",
    "title": "Officials stunned as crucial water supply recovers from months of abysmal drought — here's what's happening",
    "summary": "Gangneung, Korea, is finally showing signs of recovery after one of the worst droughts in decades.\nOverall, 45,000 households were limited to two hours of water usage a day, with additional hours on the weekends.\nAdvertisement AdvertisementAdvertisement AdvertisementDroughts affect far more than farming and agriculture, and they're happening all across the globe in historical fashion.\nWith 2025 predicted to be the hottest and deadliest year to date, human health is at risk as food and water supplies are threatened.\nThe intensity and frequency of droughts and other extreme weather events can be linked to human activity, warming the Earth.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-18T11:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.theverge.com/games/800733/easy-delivery-co-review-steam",
    "title": "Easy Delivery Co. is a cozy, Lynchian dream",
    "summary": "Image: Oro InteractiveIf I have one glaring issue with Easy Delivery Co., it’s the balance between direction and freedom.\nThough that, I think, comes from a desire to spend more time in Easy Delivery Co.’s eerier side.\nIt’s a sign of how versatile Easy Delivery Co. can be, however.\nI might be biased, if only because Easy Delivery Co. feels like it’s been developed from a Venn diagram of my specific interests (especially adorably proportioned motor vehicles).\nEasy Delivery Co. is available now on Steam.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-10-17T17:21:32Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.yahoo.com/news/articles/scientists-raise-alarm-over-common-100000320.html",
    "title": "Scientists raise alarm over common yet 'deeply concerning' practice for pet owners: 'That doesn't sound healthy to me'",
    "summary": "For a pet owner who wants to keep their dog or cat free of fleas, flea treatments seem like a good idea.\nMany flea treatments, especially those by prescription, do not contain either ingredient; The New York Times recently published an unrelated list of common flea treatments and their active ingredients here.\nMany veterinarians have already been advising dog owners against using flea treatments such as Frontline for this reason for years, and the new study helps to reinforce that.\nPet owners will also be upset to learn that they are accidentally polluting our rivers by using these products.\"\nAnd unfortunately, it seems that flea treatments are a much larger contributor than previously thought.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-19T10:00:00Z",
    "source": "Yahoo Entertainment"
  }
]