[
  {
    "id": "Mjg=",
    "url": "https://www.yahoo.com/news/articles/california-wants-mix-hydrogen-gas-140733038.html",
    "title": "California wants to mix hydrogen with gas to cut climate pollution. Critics say that poses risks",
    "summary": "“I don't want to be anyone's experiment,\" said Figueroa, 60, a resident of Orange Cove in California's Central Valley.\nIt's part of a statewide effort to create safety rules for hydrogen blending.\nWhat is hydrogen blending?\n“I think the only reason they are wanting Orange Cove is because they don’t think there’s going to be pushback,” she said.\nOrange Cove resident Francisco Gonzalez has friends with asthma and siblings with respiratory issues, so he worries about the health risks.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-01-12T14:07:33Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mjk=",
    "url": "https://www.slashgear.com/2071415/china-wind-farm-ecosystem-study/",
    "title": "China's Wind Farms Are Doing A Lot More Than Generating Electricity",
    "summary": "One significant change that's taking place is shifting how some energy is produced.\nIn October 2025, the BBC reported that an Ember study revealed renewable resources had overtaken coal as the planet's most significant source of electricity.\nChina was an enormous part of this push: The outlet notes that, during the first half of 2025, its growth in wind and solar energy outpaced every other country in the world combined.\nChina has previously found that its enormous solar farm was doing a lot more than just producing energy, and this has also proven to be the case for its expansive efforts in wind.\nA December 2025 study titled \"Offshore wind farms can enhance the structural composition and functional dynamics of coastal waters,\" concluded that the wind farms in Chinese waters are making a positive change to the biodiversity of the regions where they were installed.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2026-01-13T13:15:00Z",
    "source": "SlashGear"
  },
  {
    "id": "MzA=",
    "url": "https://www.yahoo.com/news/articles/aerial-photos-reveal-chinas-carpet-001500762.html",
    "title": "Aerial photos reveal China's 'carpet-like' project blanketing vast desert: 'Sandy and mostly devoid of life'",
    "summary": "A massive solar panel array in China is expected to crack 7,000 megawatts of power generation in 2026, according to EnergiesMedia.\nThe Three Gorges Kubuqi Solar Park has been under construction since 2022, blanketing an Inner Mongolian desert in panels.\n\"Sandy and mostly devoid of life, the Kubuqi Desert in Inner Mongolia once had a reputation for being a 'sea of death.'\n\"The construction is part of China's multiyear plan to build a 'solar great wall' designed to generate enough energy to power Beijing.\"\nThe Three Gorges Kubuqi Solar Park, due to be completed in 2030, will be 250 miles long, three miles wide, and will be able to generate 100 gigawatts of clean energy.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-01-11T00:15:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzE=",
    "url": "https://www.yahoo.com/news/videos/hungarys-lake-balaton-freezes-first-113040341.html",
    "title": "Hungary's Lake Balaton freezes for the first time in years",
    "summary": "The best sales of the week: Shop major discounts from Amazon, Kate Spade Outlet and othersStart 2026 off right with super savings on big brands like Ugg, Michael Kors, Shark, Hoka and so much more up to 75% off.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2026-01-13T11:30:40Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzI=",
    "url": "https://www.businessinsider.com/microsoft-energy-prices-data-centers-ai-trump-water-2026-1",
    "title": "Microsoft explains how it plans to keep energy prices down for Americans from its data center buildout",
    "summary": "Lighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nMicrosoft's AI data centers need a lot of energy — and it doesn't want Americans to foot the bill.\nData centers are essential for powering AI models, but they have been increasingly putting a strain on US infrastructure.\nHe added that Microsoft would be \"first up,\" suggesting that announcements from other tech companies may follow.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-01-13T14:17:23Z",
    "source": "Business Insider"
  }
]