[
  {
    "id": "MzU=",
    "url": "https://news.slashdot.org/story/26/01/22/0054237/half-of-fossil-fuel-carbon-emissions-in-2024-came-from-32-companies",
    "title": "Half of Fossil Fuel Carbon Emissions In 2024 Came From 32 Companies",
    "summary": "An anonymous reader quotes a report from Inside Climate News:\"Each year, global emissions become increasingly concentrated among a shrinking group of high-emitting producers, while overall production continues to grow.\nSimultaneously, these heavy emitters continue to use lobbying to obstruct a transition that the scientific community has known for decades is essential,\" said Emmett Connaire, senior analyst at InfluenceMap.\nThe findings of the new analysis, he added, \"underscore the growing importance of this kind of rigorous evidence in efforts to determine accountability for climate-related losses.\"",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-01-22T13:00:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MzY=",
    "url": "https://www.npr.org/2026/01/23/nx-s1-5684971/winter-storm-ice-texas-new-england-climate-science",
    "title": "How cuts to federal climate funds could threaten polar vortex research",
    "summary": "How cuts to federal climate funds could threaten polar vortex researchtoggle caption George Walker IV/APA major snow and ice storm is expected to affect tens of millions of people from Texas to New England over the weekend.\nBut winter weather patterns are shifting as the global climate warms, and scientists are working to understand those changes.\nCuts made by the Trump administration to federal climate research could threaten that work.\nPredicting jet stream changes is also important for weather forecasts more broadly, because weather systems move with the jet stream.\nFederal science cuts threaten research on the jet stream and polar vortexMany of the scientists who study the jet stream are employed directly by federal agencies, including NASA and the National Oceanic and Atmospheric Administration (NOAA).",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-01-23T10:12:00Z",
    "source": "NPR"
  },
  {
    "id": "Mzg=",
    "url": "https://www.yahoo.com/news/articles/ukraines-grid-operator-says-energy-143425853.html",
    "title": "Ukraine's grid operator says energy situation has 'significantly' worsened",
    "summary": "KYIV, Jan 23 (Reuters) - Ukraine's energy situation \"significantly\" worsened on Friday after recent Russian air attacks, triggering emergency power outages in most regions, Kyiv's grid operator said.\nThe grim assessment followed a remark by ​Energy Minister Denys Shmyhal on Thursday that Ukraine's energy system had endured its most difficult day ‌since a widespread blackout in November 2022, when Russia began bombing the power grid.\nIn new comments on Friday, Shmyhal said the situation with ‌the grid remained difficult, but he expected things to stabilise somewhat.\nSeveral power generation facilities are undergoing emergency repairs as a result of the combined drone and missile attacks, Ukrenergo said on the ⁠Telegram messaging app.\nUkraine's energy grid relies almost entirely on electricity produced by nuclear power plants, and has already lost half ‌of its generating capacity.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-01-23T22:02:16Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDA=",
    "url": "https://www.cnet.com/home/energy-and-utilities/5-simple-ways-to-lower-your-heat-and-electric-bills/",
    "title": "Keep Cozy With These 5 Tips for Lowering Your Heat and Electric Bills This Winter",
    "summary": "Rather than huddling under a blanket and dealing with the chill, there are options to keep your heating costs within budget this winter.\n(You can also save on heating costs with this small home upgrade and set your thermostat to this temperature.)\nIf you find you don't mind it or even like it, you just found an easy way to save on heating costs this winter.\nYou might have to invest in a solar array and a solar battery and even install central electric heating.\nThat will help reduce the urge to scream when you open your winter energy bill in the future, as well as other utility bills.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-01-22T20:34:00Z",
    "source": "CNET"
  },
  {
    "id": "NDQ=",
    "url": "https://www.statesman.com/weather/article/texas-power-outages-live-map-ercot-updates-21306837.php",
    "title": "Arctic blast hits Texas: See power outage maps, how to report outage",
    "summary": "Texas power outage mapSee Texas energy provider outage maps, how to report an outageAustin EnergyAustin Energy serves the city of Austin.\nSee an outage mapTo report an outage: Call 888-883-3379, text \"outage\" to 25022 or go to https://www.pec.coop/reportoutageAdvertisement Article continues below this adCenterPoint EnergyCenterPoint Energy serves the Houston metro area.\nSee an outage mapTo report an outage: Call 800-227-1376.\nTo report an electric outage, email or text Lubbock Power & Light at LightsOut@LPandL.com or call (806) 775-2509.\nAdvertisement Article continues below this adAtmos EnergyPotter County's main energy provider is Atmos Energy.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2026-01-24T11:00:00Z",
    "source": "Austin American-Statesman"
  }
]