[
  {
    "id": "Nw==",
    "url": "https://environment.ec.europa.eu/news/new-law-more-sustainable-circular-and-safe-batteries-enters-force-2023-08-17_en",
    "title": "New law on more sustainable, circular and safe batteries enters into force",
    "summary": "A new law to ensure that batteries are collected, reused and recycled in Europe is entering into force today.\nThis will support the shift to a circular economy, increase security of supply for raw materials and energy, and enhance the EU’s strategic autonomy.\nThe Batteries Regulation will ensure that batteries placed on the EU single market will only be allowed to contain a restricted amount of harmful substances that are necessary.\nBackgroundSince 2006, batteries and waste batteries have been regulated at EU level under the Batteries Directive.\nSuch exponential growth in demand for batteries will lead to an equivalent increase in demand for raw materials, hence the need to minimise their environmental impact.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-21T08:28:42Z",
    "source": "Europa.eu"
  },
  {
    "id": "Mjg=",
    "url": "https://www.scientificamerican.com/article/trump-administration-slashes-mercury-regulations-from-coal-plants/",
    "title": "Trump administration slashes mercury regulations from coal plants",
    "summary": "Mercury pollution from coal plants has been tied to serious neurological problems, especially in children and babiesOn Friday the Trump administration officially rolled back a series of Biden-era environmental regulations on coal plants, including some intended to clamp down on mercury pollution.\nThose earlier rules allowed power plants that burned a particularly dirty form of coal called lignite coal to emit more mercury than plants that burned other forms of the fossil fuel.\nThe move is the latest in a string of actions by the Trump administration to prop up what has long been viewed as a moribund coal industry in the U.S.\nThe administration has ordered the Department of State to run military facilities on coal power, funded renovations for coal-powered plants and even blocked plants from shutting down.\n“And once again, the Trump administration is doing so at the expense of people’s health.”Coal-fired power plants are the leading source of mercury emissions in the U.S., according to the EPA.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-02-20T17:30:00Z",
    "source": "Scientific American"
  },
  {
    "id": "MzI=",
    "url": "https://www.theregister.com/2026/02/20/spacex_falcon_europe_breakup_lithium_plume/",
    "title": "Euro boffins track lithium plume from Falcon 9 burn-up",
    "summary": "The SpaceX Falcon 9 rocket that burned up over Europe last year left a massive lithium plume in its wake, say a group of scientists.\nThe measurements stem from a SpaceX Falcon 9 upper stage that sprung an oxygen leak about a year ago, sending it into an uncontrolled re-entry.\nA single Falcon 9 upper stage, like the one that broke up over Poland and released the lithium plume, is estimated to contain 30 kg of lithium just in the alloy used in tank walls.\n\"The consequences of increasing pollution from re-entering space debris on radiative transfer, ozone chemistry, and aerosol microphysics remain largely unknown.\"\n\"Using the upper atmosphere as an incinerator\" is a massive blind spot, McDowell told us in a discussion last year.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-20T19:55:33Z",
    "source": "Theregister.com"
  },
  {
    "id": "MzQ=",
    "url": "https://grist.org/equity/jesse-jacksons-vision-for-america-embraced-environmental-justice/",
    "title": "Jesse Jackson’s vision for America embraced environmental justice",
    "summary": "Peggy Shepard walked into her living room on Tuesday morning when her husband told her Jesse Jackson, the civil rights titan from South Carolina, had died.\n“Immediately tears started coming,” said Shepard, co-founder and executive director of WE ACT for Environmental Justice, a New York City-based nonprofit.\nJackson made environmental justice, a term Americans were largely unfamiliar with at the time, a key plank of his second presidential run.\nHere's HowJackson marched with Dr. Martin Luther King Jr., transformed American politics with his two historic presidential campaigns, and inspired countless organizers — including environmental justice advocates — along the way.\nToday she’s remembered as “the mother of the environmental justice movement.” Cheryl Johnson never worked directly with Jackson on environmental issues in Chicago, but the two “would have discussions on the phone,” she said.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2026-02-20T09:30:00Z",
    "source": "Grist"
  },
  {
    "id": "MzY=",
    "url": "https://www.rockpapershotgun.com/climate-change-isnt-about-ai-itself-its-about-progress-11-bit-talk-frostpunk-1886-and-questions-of-scale",
    "title": "\"Climate change isn’t about AI itself, it's about progress\" - 11 Bit talk Frostpunk: 1886 and questions of scale",
    "summary": "I wonder aloud if 11 Bit have considered making a Frostpunk game with a population size parked between Frostpunk and This War of Mine.\nImage credit: 11 bit studiosSułecki is happy to speculate on the subject.\nDiscussing the game's creation, 11 Bit have elsewhere tethered these events to on-going conversations about the workplace impacts of generative AI.\nFrostpunk 1866 will make use of the technology, though 11 Bit have yet to specify how.\nPerhaps that's something 11 Bit should investigate in the third Purpose path.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2026-02-20T10:26:32Z",
    "source": "Rock Paper Shotgun"
  }
]