[
  {
    "url": "https://www.theverge.com/news/841887/data-center-space-solar-power-aetherflux-lunch",
    "title": "The scramble to launch data centers into space is heating up",
    "summary": "A startup developing technologies to harness solar power in space is throwing its hat in with big tech companies attempting to build out data centers that orbit Earth.\nOne potential solution they’re exploring is to try sending some of those data centers into orbit, where they could run on solar energy around-the-clock.\nOutfitted with photovoltaic panels, they’d be able to run on solar power without having to deal with a setting sun.\nThere are other challenges Aetherflux and its competitors will face before data centers can start orbiting Earth.\nWhile launch costs have decreased over the years, it’s still prohibitively expensive to launch and operate these things in space.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-12-10T20:13:03Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.yahoo.com/news/articles/climate-change-threatens-asia-water-090457889.html",
    "title": "Climate change threatens Asia’s water and power systems, reports warn",
    "summary": "BENGALURU, India (AP) — Climate change is battering Asia’s water and power systems and putting millions in harm’s way, forcing countries to pour billions into shoring up basic services, according to two recent reports.\nIn central Vietnam’s Quy Nhon, power lines snapped when Typhoon Kalmaegi blasted the coastal city with heavy rain and strong winds.\nBut Asia faces a triple threat: environmental pressures, low investment and climate change, said Vivek Raman, principal urban development specialist at the ADB and a lead author of the report.\nThe report warns that climate changes threatens both energy security and economic growth across a region where over 4 billion people need reliable electricity.\nThe report found that while nine companies of the 11 studied assessed how climate change impacts them, only seven examined risks at individual plants.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-12-08T09:04:57Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/chinese-researchers-achieve-breakthrough-pursuit-190000714.html",
    "title": "Chinese researchers achieve breakthrough in pursuit of next-gen nuclear power: 'Steadily generating'",
    "summary": "A research team in China may have taken a major step toward making nuclear power far more sustainable, per the South China Morning Post.\nThis is a breakthrough that could dramatically expand the world's supply of nuclear fuel while also reducing the limitations that have held back this technology.\nIf reactors can reliably convert thorium into usable uranium fuel, countries could tap into a much larger and more stable fuel supply.\nNuclear power isn't renewable (because it is finite), but it does produce large amounts of low-carbon electricity.\nIf future phases continue to succeed, thorium-based reactors could eventually offer a more sustainable path to nuclear power.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-12-10T19:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/c1w9ge93w9po",
    "title": "UN environment report 'hijacked' over fossil fuels",
    "summary": "UN environment report 'hijacked' by US and others over fossil fuels, top scientist says2 days ago Share Save Matt McGrath Environment correspondent Share SaveGetty ImagesA key UN report on the state of the global environment has been \"hijacked\" by the United States and other countries who were unwilling to go along with the scientific findings, the co-chair has told the BBC.\nThe Global Environment Outlook, the result of six years' work, connects climate change, nature loss and pollution to unsustainable consumption by people living in wealthy and emerging economies.\nIssued every six or seven years, the Global Environment Outlook is a significant scientific analysis of the major threats to the planet.\nTo solve the connected issues of climate change, pollution, nature and biodiversity loss, the report has many recommendations including a rapid move away from coal, oil and gas and a massive reduction in subsidies for farming and fossil fuels.\nThese strong measures, especially on fossil fuels and plastics, were too much for the United States, Saudi Arabia and Russia among others at the approval meeting, which usually work by consensus.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-12-09T09:00:09Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/epa-eliminates-mention-fossil-fuels-213002570.html",
    "title": "EPA eliminates mention of fossil fuels in website on warming's causes. Scientists call it misleading",
    "summary": "WASHINGTON (AP) — The Environmental Protection Agency has removed any mention of fossil fuels — the main driver of global warming — from its popular online page explaining the causes of climate change.\nThe website's causes of climate page mentions changes in Earth’s orbit, solar activity, Earth's reflectivity, volcanoes and natural carbon dioxide changes, but not the burning of fossil fuels.\nSeven scientists and three former EPA officials tell The Associated Press that this is misleading and harmful.\nThe EPA listed natural causes “might be causing a very tiny amount of warming or cooling at the moment,” he said.\n“Even the EPA acknowledges that natural causes cannot explain the current changes in climate.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-12-09T21:30:02Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://abcnews.go.com/International/wireStory/imf-approves-12-billion-pakistan-bailout-citing-progress-128231956",
    "title": "IMF approves $1.2 billion for Pakistan, citing progress on economic, climate reforms",
    "summary": "With the latest approval, Pakistan has received about $3.3 billion from the IMF since last year.\nPakistan, for decades, has relied on loans from the IMF and friendly nations to meet its financing needs.\nHe said the latest IMF decision shows Pakistan is taking the steps needed to stabilize and grow its economy after narrowly avoiding default last year.\nSharif said Pakistan’s reform and digitalization efforts have now become a global “case study,” but cautioned that shifting from stability to sustained growth will demand further effort.\nIn a statement, the IMF said Pakistan has made “significant progress” in stabilizing the economy despite a tough global environment and this year’s devastating floods.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-12-09T08:10:04Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/mcdonalds-faces-backlash-airing-2025-010500549.html",
    "title": "McDonald's faces backlash after airing 2025 Christmas commercial: 'This is just … terrible'",
    "summary": "A Dutch McDonald's commercial was made entirely using AI, and the backlash has been severe, according to NDTV.\nThe whole ad was punctuated by a satirical soundtrack dubbed \"The Most Terrible Time of the Year.\"\nMcDonald's has released an AI-generated Christmas adThe studio behind it says they 'hardly slept' for several weeks while writing AI prompts and refining the shots — 'AI didn't make this film.\nAdvertisement AdvertisementAdvertisement Advertisement\"AI didn't 'make' McDonald's Christmas ad.\nSocial media reactions to the McDonald's AI ad were decidedly negative.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-12-10T01:05:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://futurism.com/space/evidence-ancient-tropical-oasis-mars",
    "title": "Scientists Find Evidence of Ancient Tropical Oasis on Mars",
    "summary": "Now, an unusual new rock collection discovered by NASA’s Perseverance Mars rover suggests the Red Planet’s ancient past was even wetter and more tropical than scientists previously thought, an intriguing new wrinkle in our efforts to figure out if the planet was once habitable.\nThe team compared the rocks with samples from San Diego, California, and South Africa, and found intriguing similarities.\n“They’re clearly recording an incredible water event, but where did they come from?” Horgan said in the statement.\n“And right now the evidence in these rocks really points toward these kinds of ancient warmer and wetter environments.”“All life uses water,” Broz added.\nMore on Mars: Scientists Say They’ve Found Caves on Mars That May Contain Life",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-12-10T12:00:00Z",
    "source": "Futurism"
  },
  {
    "url": "https://www.yahoo.com/news/articles/jeff-bezos-sparks-outrage-photos-004500088.html",
    "title": "Jeff Bezos sparks outrage after photos of newly renovated mansion surface online: 'This should be illegal'",
    "summary": "Amazon CEO Jeff Bezos has recently upgraded a Florida property while his larger nearby megamansion is under construction, according to Realtor.com.\nBezos' temporary $87 million home has had a wealth of new greenery added, including Brazilian beauty-leaf trees, Japanese yews, and gumbo-limbo trees.\nLarge housing means large cooling demands and steep energy use, which in turn creates pollution.\nEven just the risk of these disasters is creating a housing insurance crisis.\nFacebook commenters were downright disgusted by the luxury housing Bezos is investing in while he's busy building something even bigger.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-12-07T00:45:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.scientificamerican.com/article/data-centers-in-space/",
    "title": "Space-Based Data Centers Could Power AI with Solar Energy—At a Cost",
    "summary": "Orbital data centers could run on practically unlimited solar energy without interruption from cloudy skies or nighttime darkness.\nBut the same physics that make orbital data centers appealing also impose new engineering headaches, Lee says.\nStarcloud estimates that a solar-powered space data center could achieve 10 times lower carbon emissions compared with a land-based data center powered by natural gas generators.\nJohnston says the ideal sun-synchronous orbit would only make orbital data centers visible in the night sky at dawn or dusk.\nFor now, orbital data centers are mostly an idea, a handful of small prototypes and a stack of ambitious slide decks.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-12-09T12:30:00Z",
    "source": "Scientific American"
  },
  {
    "url": "https://www.yahoo.com/news/articles/scientists-surprising-discovery-could-massive-030000121.html",
    "title": "Scientists make surprising discovery that could have massive impact on weather across US: 'Far too dangerous to bet on'",
    "summary": "Findings from a new study suggest a scenario wherein melting of the West Antarctic ice sheet could briefly delay the breakdown of a major system of ocean currents that shapes water circulation in the Atlantic Ocean.\nBut, the study's co-authors warn, this scenario is \"far too dangerous to bet on given its many severe consequences.\"\nNormally, Greenland's melt would weaken the AMOC because lighter, fresher water prevents the sinking motion that drives the system.\nBut the study found a narrow scenario in which melt from West Antarctica could counteract this slowdown.\nMeanwhile, communities can prioritize reducing the heat-trapping gases that pour into the atmosphere while strengthening community resilience to rising sea levels and intensifying weather.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-12-08T03:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/us-senator-calls-insider-trading-120003242.html",
    "title": "US senator calls for insider trading inquiry over Trump donors buying $12m worth of shares",
    "summary": "A senior Democratic senator is calling for an investigation into potential insider trading by fossil-fuel billionaires close to the Trump administration, after a Guardian investigation raised questions about an unusual share buying spree.\nVenture Global was among the “top donors” to Trump’s inauguration, donating $1m, according to the Wall Street Journal.\nIndividuals connected to Venture Global spent $860,000 on lobbying on Capitol Hill in 2024, and another $810,000 so far this year, according to Open Secrets, a non-profit campaign financial watchdog.\nHe withdrew the US from the global climate action treaty, the Paris agreement, and boycotted this year’s UN climate negotiations.\n“Altogether, the fossil industry and Trump team are producing expensive, dirty energy instead of cheaper, clean energy,” said Merkley.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-12-10T12:00:03Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/grid-tech-stocks-poised-soar-100004460.html",
    "title": "Grid Tech Stocks Are Poised to Soar Even Further Amid AI Bubble Fears",
    "summary": "Photographer: Angel Garcia/BloombergWhile some corners of energy markets have looked pretty frothy of late, one segment has Wall Street betting it won’t get trapped in a bubble: grid tech stocks.\nDespite sector-wide gains of some 30% this year, grid tech stocks remain an attractive target, according to Steve Tusa, managing director and senior equity analyst at JPMorgan Chase & Co.\nGrid tech encompasses a range of hardware makers and software developers as well as utility-scale battery installers.\nOther grid tech stocks have also seen large gains this year, mirroring the data center boom.\nNon-AI factors are “playing a larger role” in driving up energy demand in developing economies, which should support grid tech stocks globally, he said.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-12-08T10:00:04Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/oge-energy-oge-announces-dividend-201716180.html",
    "title": "OGE Energy (OGE) Announces Dividend of $0.425 per Share",
    "summary": "OGE Energy Corp. (NYSE:OGE) is included among the 11 Energy Stocks to Buy for a Retirement Portfolio.\nOGE Energy (OGE) Announces Dividend of $0.425 per ShareOGE Energy Corp. (NYSE:OGE), through its subsidiary, operates as an energy services provider in the United States.\nOGE Energy Corp. (NYSE:OGE) reiterated its commitment to shareholders on December 3 when it announced a dividend of $0.425 per share to all shareholders as of the January 5 record date, payable on January 30, 2026.\nOGE Energy Corp. (NYSE:OGE) continues to invest in expansion to make sure it can keep up with the expected surge in energy demand due to the AI boom and rapid industrialization.\nREAD NEXT: 10 Best Renewable Energy Dividend Stocks to Buy Now and 14 Best Utility Dividend Stocks to Buy Now.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-12-10T20:17:16Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.scientificamerican.com/podcast/episode/vaccine-controversies-and-measles-outbreaks-space-pollution-puppy-power/",
    "title": "Vaccine Controversies and Measles Outbreaks, Space Pollution, Puppy Power",
    "summary": "Lauren Young: The major point of discussion was the hepatitis B birth dose of the vaccine.\nThe researchers concluded that light pollution from so-called megaconstellations like SpaceX’s Starlink is a threat to space-based astronomy.\nBut while much attention has focused on how these satellites are affecting space observation conducted from Earth, the researchers say less has been paid to their impacts on space telescopes.\nIn the study the researchers simulated how things would change for space telescopes if the businesses follow through on their intentions.\nThe scientists looked at the potential impacts on four space telescopes, including the Hubble Space Telescope, NASA’s recently launched SPHEREx and two planned space telescopes, the European Space Agency’s ARRAKIHS mission and China’s Xuntian (Sheen-Tyan) observatory.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-12-08T11:00:00Z",
    "source": "Scientific American"
  },
  {
    "url": "https://www.yahoo.com/news/articles/researchers-alarming-discovery-popular-seafood-040000582.html",
    "title": "Researchers make alarming discovery about popular seafood: 'There is an urgent need for continued research'",
    "summary": "Research has highlighted a shocking discovery — the lobster on your plate may contain more than butter sauce.\nResearchers detected these particles not only in the lobsters' organs but also in their tail meat — the part people eat.\nExperts say cutting down on plastic waste is key.\nHow concerned are you about the plastic waste in our oceans?\nAdvertisement AdvertisementAdvertisement AdvertisementEach effort chips away at the plastic found in water sources — and helps keep it off our plates.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-12-07T04:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/alarming-video-giant-snake-nest-001500349.html",
    "title": "Alarming video of giant snake nest in unexpected location sparks fear: 'They're incredibly protective'",
    "summary": "ABC's \"Wildlife Nation: Expedition Florida\" examined Burmese pythons in a recent episode.\nThe researchers on the show are quick to highlight that Burmese pythons are a massive problem in Florida.\nAs apex predators, their eggs don't face any serious predators, which allow their young to propagate unopposed.\nThe drops in biodiversity caused by invasive species incur a steep loss in ecosystem services.\nSome studies have suggested that over the course of 50 years, invasive species have created costs of over a trillion dollars globally.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-12-08T00:15:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.cnet.com/science/space/the-invisible-becomes-visible-scientists-may-have-finally-seen-dark-matter/",
    "title": "Is This the Moment? Scientists Detect a Signal That Might Be Dark Matter",
    "summary": "Scientists theorize that roughly 27% of the universe's total mass-energy is made up of dark matter.\nIf there's more than five times as much dark matter as there is regular matter, then why is it so hard to see?\nThe short answer is that dark matter doesn't interact with matter in a way that humans can detect with our current technology.\nIn the first photo of a black hole taken in 2019, the visible part is the black hole's accretion disk, not the black hole itself.\nNASAStudy author explains what he foundOver the decades, scientists have proposed various potential candidates for what dark matter particles actually are.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-12-08T18:00:41Z",
    "source": "CNET"
  },
  {
    "url": "https://www.cnet.com/science/space/dont-miss-out-northern-lights-to-shine-bright-monday-and-tuesday-night/",
    "title": "The Northern Lights Could Transform the Skies in 15 States Tonight. Find Out Where",
    "summary": "The National Oceanic and Atmospheric Administration is predicting that a recent geomagnetic storm will create a visible aurora borealis in several states tonight.\nThis most recent aurora event comes to Earth courtesy of a coronal mass ejection from the sun on Sunday.\nCoronal mass ejections are massive bursts of plasma and other solar materials that are forcibly blasted from the star.\nNOAA predicts that people in 15 US states could be able to see the aurora tonight.\nThose were caused by X-Class coronal mass ejections, which are a level above the M-Class.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-12-08T21:35:00Z",
    "source": "CNET"
  },
  {
    "url": "https://indianexpress.com/article/cities/delhi/burnt-area-increased-in-haryana-even-as-farm-fire-count-dropped-new-report-flags-concerns-about-data-collection-10410005/",
    "title": "How burnt farm land exposes blind spots in Delhi’s air pollution monitoring",
    "summary": "The iFOREST, an independent nonprofit, said the current satellite-based monitoring system is structurally incapable of capturing most late-afternoon fires.\nMODIS and VIIRS instruments mounted on NASA satellites — on which the government’s monitoring system relies on — pass over North India only between 10:30 am and 1:30 pm.\nThis late-afternoon shift, the authors said, explains why burnt-area mapping shows far higher levels of burning than active fire counts.\nBurnt-area mapping, which uses Sentinel-2 MSI data at 10-20 m resolution, is considered a more reliable indicator of actual stubble burning.\nStory continues below this adChandra Bhushan, CEO of iFOREST, said, “Our analysis provides incontrovertible evidence that India’s current stubble-burning monitoring system is structurally misaligned with ground realities.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-12-09T00:44:25Z",
    "source": "The Indian Express"
  }
]