[
  {
    "url": "https://gizmodo.com/wildfire-smoke-chokes-canada-and-u-s-triggering-air-quality-alerts-2000639059",
    "title": "Wildfire Smoke Chokes Canada and U.S., Triggering Air Quality Alerts",
    "summary": "Smoke billowing from the blazes has blanketed central Canada and the northern U.S., prompting widespread air quality alerts.\nIn the U.S., the National Weather Service (NWS) has issued air quality alerts across the Midwest and Northeast.\nThe Switzerland-based air quality monitoring database IQAir—which provides real-time air quality data—listed Minneapolis, Minnesota, as having some of the worst air pollution in the world over the weekend, the Associated Press reported.\nAir quality alerts indicate that air is unhealthy for sensitive groups, including people with asthma, lung or heart disease, children, and older adults.\nThat said, wildfire smoke can affect anyone’s health, regardless of their age or preexisting conditions.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-08-05T16:25:58Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://gizmodo.com/trump-administration-moves-to-destroy-satellite-that-monitors-greenhouse-gases-2000639234",
    "title": "Trump Administration Moves to Destroy Satellite That Monitors Greenhouse Gases",
    "summary": "Two satellite missions on the chopping block have provided climate scientists, oil and gas companies, and farmers with critical atmospheric carbon data for years.\nTrump’s budget proposal threatens both missions, but the standalone OCO-2 would be completely destroyed during its fiery descent through Earth’s atmosphere.\nThe OCO-2 and OCO-3 sniff out atmospheric carbon dioxide using spectrometers to detect wavelengths of light absorbed by CO2 molecules.\nThis instrument has also provided valuable insights into urban carbon dioxide emissions and contributed data that supported the Paris Agreement.\nWhen plants absorb sunlight to convert carbon dioxide and water into energy, their chlorophyll—a light-absorbing pigment—leaks some unused photons, JPL explains.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-05T20:15:35Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.wired.com/story/inside-the-biden-administrations-unpublished-report-on-ai-safety/",
    "title": "Inside the US Government's Unpublished Report on AI Safety",
    "summary": "More importantly, they showed shortcomings in a new US government standard designed to help companies test AI systems.\nTrump’s administration has since steered experts away from studying issues such as algorithmic bias or fairness in AI systems.\nThe event took place at the Conference on Applied Machine Learning in Information Security (CAMLIS).\nParticipants were asked to use the NIST AI 600-1 framework to assess AI tools.\nThe framework covers risk categories including generating misinformation or cybersecurity attacks, leaking private user information or critical information about related AI systems, and the potential for users to become emotionally attached to AI tools.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-06T18:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://gizmodo.com/nasa-told-to-overhaul-its-plans-to-replace-the-international-space-station-2000639959",
    "title": "NASA Told to Overhaul Its Plans to Replace the International Space Station",
    "summary": "For nearly 30 years, the International Space Station has played orbital home for astronauts from all over the world, but its time is running out.\nSlated to retire in 2030, NASA is aiming to replace it with a privately-run station that can host its astronauts in space when needed.\nIn a memo signed August 4, Duffy directs NASA to revise its Commercial Low Earth Orbit Destination program, which is designed to facilitate the development of commercial stations to replace the ISS.\nAnother major change is the revision to minimum capability requirements for an ISS replacement.\n“How was NASA’s previous strategy for commercial stations going to work when they lost close to a third of their budget?” Phil McAlister, previously the director of NASA’s Commercial Space Division, said in an interview with Ars Technica.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-08-07T15:27:23Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.scientificamerican.com/article/why-the-epas-latest-move-could-worsen-the-climate-crisis/",
    "title": "Why the EPA’s Latest Move Could Worsen the Climate Crisis",
    "summary": "As such, if the finding is successfully rescinded, EPA will have actively and intentionally walked away from its responsibility to address climate change.\nBut in addition to being crafted by five known climate contrarians, the report is riddled with climate denial tropes, cherry-picked evidence, and distortions of the indisputably well-established facts on climate change.\nSharply cutting those emissions is crucial to limiting dangerous climate change.\nHundreds of scientists have come together to write major globally relevant reports, including the U.S. Fifth National Climate Assessment (NCA5) and the Sixth Assessment Report of the Intergovernmental Panel on Climate Change (AR6), documenting the latest science.\nLost homes, rising insurance premiums, unhealthy outdoor working conditions, business interruptions and damaged infrastructure are all effects of a worsening climate.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-08-06T15:00:00Z",
    "source": "Scientific American"
  },
  {
    "url": "https://www.theverge.com/tesla/720157/tesla-death-lawsuit-verdict-lawyer-brett-schreiber-interview",
    "title": "The lawyer who beat Tesla is ready for ‘round two’",
    "summary": "The day before posting the reel, he stood in a Florida courtroom alongside his clients as a jury handed Tesla a major defeat.\nThere’s Tesla in the showroom and then there’s Tesla in the courtroom.\nAnd Tesla in the showroom tells you that they’ve invented the greatest full self-driving car the world has ever seen.\nBut to that end, I can say that Tesla has a system of gathering data.\nTesla’s going to find out.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-08-06T20:54:41Z",
    "source": "The Verge"
  },
  {
    "url": "https://gizmodo.com/a-flesh-eating-germ-is-on-the-rise-this-summer-2000639077",
    "title": "A ‘Flesh-Eating’ Germ Is on the Rise This Summer",
    "summary": "Several states along the Gulf Coast and Eastern Seaboard have already reported a higher than usual tally of Vibrio vulnificus cases and deaths this summer.\nLast week, for instance, the Louisiana Department of Health issued a warning to residents over increased reports of V. vulnificus.\nA 2023 study found that reported cases in the eastern United States increased eightfold from 1988 to 2018, for example.\nFlorida has only seen 13 V. vulnificus cases and four deaths so far in 2025, not far from its usual trends.\nOver the preceding decade, the state had seen an average of seven cases and one death a year from V. vulnificus.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-08-05T19:45:07Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.bbc.com/news/articles/cm2kem4plr5o",
    "title": "Summit opens in final push for plastics treaty to tackle crisis",
    "summary": "\"Proportional to life on earth, plastics have been around for no time at all, there are people alive that weren't using plastics as children.\nLevels of plastic production have grown exponentially over the last few decades.\n\"They can confuse it as food, which then harms their internal organs and also can lead to fatalities, because of digestion difficulties,\" said Zaynab Sadan, global plastics policy lead at WWF.\nIn 2022, countries agreed a global treaty was needed in two years to tackle the issue.\nThat deadline passed in December 2024, after five rounds of negotiations, with no treaty having been signed.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-08-05T04:03:43Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cvg3pp52m65o",
    "title": "Great Barrier Reef suffers worst coral decline on record",
    "summary": "Great Barrier Reef suffers worst coral decline on record3 days ago Share Save Tom McArthur BBC News Share SaveGetty ImagesParts of the Great Barrier Reef have suffered the largest annual decline in coral cover since records began nearly 40 years ago, according to a new report.\nOften dubbed the world's largest living structure, the Great Barrier Reef is a 2,300km (1,429-mile) expanse of tropical corals that houses a stunning array of biodiversity.\nUnusually warm tropical waters triggered widespread coral bleaching on the Great Barrier Reef in 2024 and in the first few months of 2025, the sixth such event since 2016.\n\"The Great Barrier Reef is such a beautiful, iconic place, it's really, really worth fighting for.\nThe creatures are native to the Great Barrier Reef and are capable of eating vast amounts of coral.",
    "category": "environment",
    "bias": "right",
    "publishedAt": "2025-08-05T19:38:41Z",
    "source": "BBC News"
  },
  {
    "url": "https://abcnews.go.com/US/new-jersey-reaches-historic-2-billion-environmental-settlement/story?id=124394391",
    "title": "New Jersey reaches historic $2 billion environmental settlement with DuPont over 'forever chemicals'",
    "summary": "Three chemical producers have reached a historic settlement with the state of New Jersey over \"forever chemicals\" and other pollutants released into the environment.\nNJDEP Commissioner LaTourette and NJ Attorney General Platkin made the announcement on Monday, calling the deal the “largest environmental settlement ever achieved by a single state”.\nThe settlement follows a month of trial proceedings in the U.S. District Court for the District of New Jersey.\nNew Jersey was the first state in the nation to set a maximum contaminant level for certain PFAS.\nThe DuPont settlement will be published in the New Jersey Register and is subject to a public comment period before it can be finalized.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-08-05T23:51:32Z",
    "source": "ABC News"
  }
]