[
  {
    "url": "https://gizmodo.com/elon-musks-boring-company-accused-of-nearly-800-environmental-violations-on-las-vegas-project-2000671820",
    "title": "Elon Musk’s Boring Company Accused of Nearly 800 Environmental Violations on Las Vegas Project",
    "summary": "That agreement, signed by a Boring executive in 2022, was intended to compel the company to comply with state water pollution laws.\nThe Boring Co. is disputing the violation letter, a state spokesperson said.\nPayment of the penalty isn’t required until after the dispute resolution process is complete, a state spokesperson said.\nThe project, initially a 0.8-mile underground route connecting the sections of the Las Vegas Convention and Visitors Authority campus to each other, has grown to a planned 68 miles of tunnels and 104 stations across the Las Vegas Valley.\nAfter ProPublica and City Cast Las Vegas published their January story, both the CEO and the chairman of the LVCVA board criticized the reporting, arguing the project is well-regulated.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-13T15:15:01Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://gizmodo.com/scientists-completed-a-damning-toxicity-report-on-this-forever-chemical-the-epa-hasnt-released-it-2000670270",
    "title": "Scientists Completed a Damning Toxicity Report on This Forever Chemical. The EPA Hasn’t Released It.",
    "summary": "This spring, scientists at the Environmental Protection Agency completed a report on the toxicity of a “forever chemical” called PFNA, which is in the drinking water systems serving some 26 million people.\nDozens of EPA scientists contribute to a typical assessment, which takes years to complete and is subject to extensive peer review.\nMany hoped that, because it was separate from regulatory arms of the agency, IRIS would be insulated from political pressures.\nIn its May press release, the EPA said it was “committed to addressing” forever chemicals in drinking water.\nAt the same time, it was rolling back drinking water limits on some of the compounds.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-11T11:00:38Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.theverge.com/tech/798901/google-will-let-you-hide-sponsored-results-in-search-after-youve-seen-them",
    "title": "Google will let you hide sponsored results in search — after you’ve seen them",
    "summary": "Ads in Google search results are getting a more prominent label, and a way to hide them if you’re not interested.\nCurrently, Google labels paid results on search pages individually with a “sponsored” tag on each one.\nAt the bottom of the section you’ll see a button to hide sponsored results, so you’ll have to scroll by them first.\nTap the button to hide them and they’ll remain collapsed under that sponsored heading; tapping again to show sponsored results unfurls them.\nWouldn’t it make navigation easier if I could hide sponsored results before I’ve scrolled past them?",
    "category": "environment",
    "bias": "right",
    "publishedAt": "2025-10-13T19:21:38Z",
    "source": "The Verge"
  },
  {
    "url": "https://hardware.slashdot.org/story/25/10/13/032224/california-will-stop-using-coal-as-a-power-source-next-month",
    "title": "California Will Stop Using Coal as a Power Source Next Month",
    "summary": "\"Never give in.\nNever give in.\n-- Winston Churchill",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-13T04:34:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://www.bbc.com/weather/articles/cm2zdzwy12do",
    "title": "When do the clocks go back in 2025?",
    "summary": "The clocks will go back by one hour in the UK on the last Sunday of October.\nMost of us will get an extra hour in bed - or at the pub - but it is not such good news for night shift workers who will have to spend an extra hour at work.\nThe clocks go forward again in March 2026.\nYou may already have noticed that the nights are drawing in - in fact we are currently losing four or five minutes of daylight every day.\nHowever the clock change will bring sunset forward by an hour in one fell swoop which may come as a shock to the system.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-10-11T23:32:29Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/aws-exec-signs-time-to-make-career-change-2025-10",
    "title": "3 signs that it's time to make a job change, according to an AWS leader",
    "summary": "She told Business Insider that throughout her career, she's faced numerous challenges — and as she puts it, \"pretty much every six months, something significant changes.\"\n1: The right bossAubrey told Business Insider that you should first ask yourself whether you're working for a leader with whom you have mutual respect.\n\"Are you working for a leader that you respect, that you're inspired by, that you're learning from, and vice versa?\"\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\"You can choose to live through it and be dissatisfied.\n2: The right teamAubrey said you should also ask yourself if you're working on the right team.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-12T09:57:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://gizmodo.com/new-report-finds-earths-most-precious-ecosystems-coral-reefs-scary-climate-tipping-point-2000671008",
    "title": "New Report Finds One of Earth’s Most Precious Ecosystems Has Already Crossed a Scary Climate Tipping Point",
    "summary": "The 2025 Global Tipping Points Report, released by the University of Exeter and international partners on Sunday, finds that the world’s warm-water coral reefs have become the first Earth system to cross its thermal tipping point.\nEarth is in the midst of its fourth global coral bleaching event, according to NOAA.\nSince January 2023, bleaching-level heat stress has impacted 84.4% of the world’s coral reefs, with scientists documenting mass coral bleaching in at least 83 countries and territories.\nThis is the upper range of the thermal tipping point for warm-water coral reefs.\n“These temperatures are essential for retaining functional warm-water coral reefs at meaningful scale,” the report says.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-13T10:00:47Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.yahoo.com/news/articles/grocery-shopper-sparks-outrage-photo-063000839.html",
    "title": "Grocery shopper sparks outrage with photo of baffling sighting in produce section: 'What could possibly be the purpose of this?'",
    "summary": "Grocery stores are notorious for their wasteful packaging, even for items that don't require any packaging at all, such as fresh fruits and vegetables.\nPhoto Credit: Reddit\"This mango at the grocery store with excessively much packaging,\" the original poster wrote.\nMeanwhile, Trader Joe's and Kroger grocery stores have been prioritizing food waste donation efforts to prevent usable food from going into the trash.\nSeveral U.S. states are taking action to reduce packaging waste in public circulation.\nBeyond the grocery store shelves, there are numerous ways to reduce excess packaging and plastic use in your daily life.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-12T06:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://allvpv.org/haotic-journey-through-envvars/",
    "title": "Environment variables are a legacy mess: Let's dive deep into them",
    "summary": "Environment variables are a legacy mess: Let's dive deep into themProgramming languages have rapidly evolved in recent years.\n00:00:00 \\_ sshd-session 5521 pts/0 00:00:00 \\_ bash 5545 pts/0 00:00:00 \\_ nu 5549 pts/0 00:00:00 \\_ bash 5560 pts/0 00:00:00 \\_ psOn Linux, a program must use the execve syscall to execute another program.\nLiberal formatThe Linux kernel is very liberal about the format of environment variables, and so is glibc .\nThe name space of environment variable names containing lowercase letters is reserved for applications.\nApplications can define any environment variables with names from this name space without modifying the behavior of the standard utilities.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-10-13T16:49:15Z",
    "source": "Allvpv.org"
  }
]