[
  {
    "url": "https://www.bbc.com/news/articles/cy4jk8njpngo",
    "title": "Environment Agency failed to visit serious pollution incidents, leaked files show",
    "summary": "Environment Agency failed to visit serious pollution incidents, files show2 days ago Share Save Jonah Fisher Environment correspondent Share SaveGetty Images Serious pollution incidents are those which have an impact on the environment, people or property.\nDocuments and data shared with BBC News from inside England's much criticised environment watchdog show an agency struggling to monitor incidents of serious pollution.\nAn internal EA document from this year states that all potentially serious incidents should be attended by staff.\nThe data show that overall the agency went to just 13% of all the pollution incidents, serious and more limited, that were reported to it in 2024.\nJonah Fisher/BBC Ashley Smith from the campaign group Windrush Against Sewage Pollution (WASP) says its \"virtually impossible\" to get the Environment Agency to come out.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-09-25T01:07:14Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cn4l3j93481o",
    "title": "America's blame game over Canada's wildfire smoke misses the point, experts say",
    "summary": "America's blame game over Canada's wildfire smoke misses the point, experts say2 days ago Share Save Nadine Yousif Senior Canada reporter Share SaveGetty Images Smoke from Canada's wildfires have drifted south to the US several times this summer, clouding the sky with an orange haze.\nA study published in the Nature journal in September has revealed that smoke from Canada's wildfires has also had far-reaching, fatal consequences.\nWildfire smoke contains PM2.5 - a type of air pollution - that is known to trigger inflammation in the body.\nHe added the findings show wildfire smoke should be treated as a serious health issue, akin to breast cancer or prostate cancer.\nGallo Images/Orbital Horizon/Copernicus Sentinel Data 2025 Wildfire smoke can often travel thousands of miles.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-09-25T01:17:33Z",
    "source": "BBC News"
  },
  {
    "url": "https://gizmodo.com/chicagos-once-disgusting-river-just-hosted-a-swimming-party-2000662425",
    "title": "Chicago’s Once-Disgusting River Just Hosted a Swimming Party",
    "summary": "On Sunday, over 250 swimmers dove into the Chicago River for its first open water swim in almost a century.\n“Swimming in the Chicago River may sound like a wild idea, but the river has come a long way from its industrial past,” claimed the Chicago River Swim website.\nReclaiming the river“The Chicago River Swim is a symbol of Chicago’s resilience and progress.\nThe Chicago River Swim was originally planned for 2024, but the city denied the organization’s permit request, citing safety concerns for the proposed route, and the swim ultimately took place in Lake Michigan.\nAccording to the Chicago River Swim website, the river is the cleanest in its recorded history.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-09-23T13:45:51Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.yahoo.com/news/articles/archaeologists-stunned-excavation-reveals-long-235500043.html",
    "title": "Archaeologists stunned after excavation reveals long-hidden city: 'This is mind-blowing'",
    "summary": "The remains of an ancient civilization could offer humanity clues as to how to address the current climate crisis.\nThese practices allowed the Caral civilization that built the city to survive climate-related challenges similar to those the world faces today, according to Sustainability Times.\n\"There are many things we have to do as we're facing climate change,\" said Shady, per Sustainability Times.\n\"Isn't it fascinating how they managed to survive climate change without wars?\"\nWhere many see a future full of water wars and other conflicts over increasingly scarce resources, the Caral civilization proves that there is another way.",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-09-25T23:55:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.theverge.com/news/784652/volvo-erev-hybrid-factory-range-us",
    "title": "Volvo’s next-gen hybrids will be American-made EREVs",
    "summary": "As it struggles with declining sales and an uncertain regulatory environment, Volvo is hoping to realign its fortunes by overhauling its electric vehicle plans.\nAnd a big part of that is a bet on hybrid technology — or more specifically, extended-range electric vehicles (EREV).\nThat said, Volvo’s design team still hasn’t decided what kind of car it will be.\nBut once that decision is made and the EREV goes into production, then Volvo’s South Carolina factor will be at capacity.\nUpdate September 25th: Volvo’s goal is to boost the number of US-built vehicles sold to 50 percent.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-09-24T17:52:46Z",
    "source": "The Verge"
  },
  {
    "url": "https://gizmodo.com/this-black-fungus-turns-plastic-waste-into-edible-ingredients-2000662793",
    "title": "This Black Fungus Turns Plastic Waste Into Edible Ingredients",
    "summary": "They can live almost anywhere, have both medicinal and poisonous qualities, and are—as new research suggests—capable of transforming industrial waste into useful compounds.\nEngineers with the German startup Biophelion have successfully developed a method to coax a yeast-like black fungus—Aureobasidium pullulans—into decomposing and converting plastic waste into new products.\nWhat’s more, during this process, the fungus consumes leftover carbon dioxide in plastic waste, using it to fuel itself and prevent the greenhouse gas from escaping into the atmosphere.\nThe method as is already offers a tantalizing solution for mass-produced plastic waste, however.\nThe surfactant molecule in particular could be the ideal replacement for artificial surfactants—mass-produced chemicals in laundry detergents and dish soap—that too often pollute the environment.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-09-23T19:35:08Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.bbc.com/news/articles/cn4ljv39em7o",
    "title": "Gen Z uprising in Asia shows social media is a double-edged sword",
    "summary": "The Gen Z uprising in Asia shows social media is a double-edged sword2 days ago Share Save Tessa Wong Asia Digital Reporter Share SaveBBCIt was the wedding of the daughter of a Nepalese politician that first angered Aditya.\nThe 23-year-old activist was scrolling through his social media feed in May, when he read about how the high-profile marriage ceremony sparked huge traffic jams in the city of Bhaktapur.\nOver the next few months he noticed more posts on social media by politicians and their children - pictures showing exotic holidays, mansions, supercars and designer handbags.\nThe impact is especially pronounced among Filipinos, who are among the world's most active social media users, she adds.\n\"[Social media] inherently is not designed for long-term change… you are relying on algorithms and outrage and hashtags to sustain it,\" Dr Feldstein points out.",
    "category": "environment",
    "bias": "right",
    "publishedAt": "2025-09-23T21:01:49Z",
    "source": "BBC News"
  },
  {
    "url": "https://news.slashdot.org/story/25/09/24/1956244/fossil-fuel-burning-poses-threat-to-health-of-16-billion-people-data-shows",
    "title": "Fossil Fuel Burning Poses Threat To Health of 1.6 Billion People, Data Shows",
    "summary": "Want to read Slashdot from your mobile device?\nPoint it at m.slashdot.org and keep reading!",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-09-24T22:11:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://www.theverge.com/news/785981/nvidia-audio2face-ai-voice-animation-open-source",
    "title": "Nvidia is letting anyone use its AI voice animation tech",
    "summary": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more.\nNvidia is open-sourcing Audio2Face, its AI-powered tool that generates realistic facial animations for 3D avatars — all based on audio input.\nThe change means developers can now use the tool and its underlying framework to create realistic 3D characters for their games and apps.\nThe company notes that developers can use the tool to create 3D characters for pre-scripted content, as well as for livestreams.\nIn addition to open sourcing the Audio2Face models and software development kits, Nvidia is making the tool’s training frame available, allowing users to tweak its models for different use cases.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-09-25T21:16:23Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/column/786346/optimizer-wearables-fitness-tracking-health-anxiety-paranoia",
    "title": "I’ve got a bone to pick with ‘getting credit’ from your fitness tracker",
    "summary": "I’ll be the first person to admit that fitness trackers can be helpful tools.\nFitness trackers are tools meant to help you measure progress as you work toward health goals.\nIn recent years, fitness trackers have added scores to make disparate data points more digestible.\nI’ve yet to meet a fitness tracking devotee who hasn’t gotten a little too obsessed with metrics at one point or another.\nBut for everyone else, I highly recommend taking a planned, 48 to 72-hour fitness tracking break every 90 days or so.",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-09-26T13:31:14Z",
    "source": "The Verge"
  }
]