[
  {
    "url": "https://www.bbc.com/news/articles/cly959ppezeo",
    "title": "New Supreme Court term will reshape Trump's powers",
    "summary": "New Supreme Court term will reshape Trump's powers\"Defendants have made a range of arguments that, if accepted, risk blurring the line between civil and military federal power - to the detriment of this nation.\"\nThe US Supreme Court begins its new term on Monday with a docket already full of potentially significant cases that could define the scope of Donald Trump's presidential authority - and the prospect of more to come.\nPresidential power is the central focus of this year's Supreme Court term but cases involving several hot-button political and cultural controversies are also scheduled in the coming months.\nOver the past few years, this conservative-dominated Supreme Court has demonstrated a willingness to issue landmark new rulings that have dramatically shifted America's legal landscape.\nThose decisions have contributed to a public view of the Supreme Court that has become increasingly polarised along partisan lines.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-06T20:08:48Z",
    "source": "BBC News"
  },
  {
    "url": "https://gizmodo.com/jeff-bezos-has-a-plan-to-curb-ais-carbon-footprint-send-data-centers-to-space-2000668833",
    "title": "Jeff Bezos Has a Plan to Curb AI’s Carbon Footprint: Send Data Centers to Space",
    "summary": "Jeff Bezos believes that for artificial intelligence to keep expanding, data centers will eventually need to move off the Earth and into space.\nIn turn, Bezos predicted that humans will start building gigawatt-scale orbital data centers within the next 10 to 20 years.\nThe next step is going to be data centers and other kinds of manufacturing.”Data centers are straining Earth’s resourcesAs tech giants pour billions into AI, data center construction is skyrocketing.\nThe concept of orbital data centers as a potential solution isn’t new.\nWe will be able to beat the cost of terrestrial data centers in space in the next couple of decades.”What’s more, orbital data centers would help reduce air and water pollution on Earth.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-07T18:00:28Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.bbc.com/news/articles/c1792qwg85qo",
    "title": "H-1B visa fee: India wants to lure back its best minds from the US, but it won't be easy",
    "summary": "\"I've always wanted to start something of my own, but my immigration status in the US limited that freedom,\" Mr Hassan told the BBC.\nIn just the last six months, more than 200 NRIs [non-resident Indians] have reached out to explore return options,\" said Mr Hassan.\nTrump's $100,000 H-1B visa shock: Why US may lose more than India Other headhunters who scout for Indian talent from US universities corroborate this change in sentiment.\n\"The government will have to go out and actually identify individuals - including top-of-the-line scientists, professionals and entrepreneurs - it wants back.\nThat requires effort, and it needs to come straight from the top,\" Mr Baru told the BBC.",
    "category": "environment",
    "bias": "center",
    "publishedAt": "2025-10-05T22:52:47Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/phd-student-discovers-game-changing-131500439.html",
    "title": "PhD student discovers game-changing method to transform old plastic bags: 'An innovation that has the potential to deliver real change'",
    "summary": "\"Plastic waste has become a very concerning and dangerous problem all around the world,\" study author Ali Ghodrati, a PhD student, said per the Edith Cowan University article.\nAdvertisement AdvertisementAdvertisement AdvertisementAnything that helps reduce plastic waste would be a massive step forward for the environment.\nOf all the plastic waste generated each year, less than 10% is recycled.\nEach American uses an average of 365 plastic bags annually, and some studies estimate that five trillion plastic bags are used globally each year.\n\"It's an innovation that has the potential to deliver real change for both communities and industry.\"",
    "category": "environment",
    "bias": "lean left",
    "publishedAt": "2025-10-05T13:15:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://ca.news.yahoo.com/hotel-prices-lead-countries-consider-062154001.html",
    "title": "Hotel prices lead countries to consider skipping COP30 climate summit",
    "summary": "COP30 HOTEL PRICES LEAVE DELEGATIONS OUT OF POCKETDays after Brazil opened a booking platform in early August, the website showed rates from $360 to $4,400 a night.\nLess than six weeks out from COP30, 81 countries remain in negotiations over hotel rooms while 87 countries have reserved accommodation, according to Brazil's COP30 Presidency.\nEvans Njewa, chair of the Least Developed Countries group that represents the world's poorest nations in U.N. climate talks, said it was still assessing countries' attendance plans.\nSmall island countries have used previous COPs to secure more funding to adapt to climate change.\nSmaller delegations would leave island nations \"lacking expertise needed to effectively participate in the negotiations which decide our future,\" Seid said.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-06T06:21:54Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/snl-return-late-night-trump-jimmy-kimmel-charlie-kirk-comedy-2025-10",
    "title": "'SNL' returns to a late-night world still finding its footing in Trump's 2nd term",
    "summary": "NBC's \"Saturday Night Live\" has long skewered Trump and other political leaders in its sketches.\nNBC's \"Saturday Night Live\" has long skewered Trump and other political leaders in its sketches.\nNBC/Will Heath/NBC via Getty ImagesNBC's \"Saturday Night Live\" has long skewered Trump and other political leaders in its sketches.\nImpact LinkFans tuning into the premiere of \"Saturday Night Live\" are likely accustomed to the comedy sketch show's unapologetic approach to political satire.\nLast month, ABC suspended \"Jimmy Kimmel Live!\"",
    "category": "environment",
    "bias": "lean right",
    "publishedAt": "2025-10-05T00:02:08Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.jpost.com/archaeology/article-869513",
    "title": "A look at archaeological discoveries from ancient Israel",
    "summary": "THIS SEAL, dated to the First Temple period, features Hebrew writing that reads: ‘Natan-melech the king’s servant,’ which is a quote that appears in the second ‘Book of Kings,’ 23:11.\n( photo credit : Eliyahu Yannai/City of David/Wikimedia Commons )",
    "category": "environment",
    "bias": "right",
    "publishedAt": "2025-10-06T13:00:52Z",
    "source": "The Jerusalem Post"
  },
  {
    "url": "https://www.yahoo.com/news/articles/expert-dismantles-myth-cold-weather-163000595.html",
    "title": "Expert dismantles myth about cold weather: 'That's exactly what scientists have been warning us about'",
    "summary": "Amid a chilly winter, it's tempting to dismiss the effects of the changing climate.\nAdvertisement AdvertisementAdvertisement Advertisement\"A cold snap in July doesn't suddenly erase decades of evidence supporting the reality of global warming,\" she said.\n\"Weather does not equal climate,\" Dodds added, explaining that the former describes daily conditions, such as wind, rain, and low temperatures.\nAs Dodds said, the changing climate results in not just hotter weather but also \"more extreme, unpredictable, and chaotic weather.\"\nThis kind of education is perhaps the most important part of understanding rising global temperatures and their impacts.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-05T16:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.islands.com/1988705/la-nina-map-forecast-predictions-winter-2025-what-is/",
    "title": "This Map Of La Niña Is Making Some Key Predictions About Winter 2025",
    "summary": "Whether you're on the snowy Northern Plains or in the arid Southwest, the La Niña forecast is always worth watching.\nAs fall 2025 unfolds, the Climate Prediction Center (CPC) estimates a 71% chance that La Niña will influence climate patterns from October through December 2025.\nIt arises when strong equatorial trade winds push warm surface waters toward Asia, drawing colder waters to the surface along the U.S. West Coast.\nHistorically, La Niña events recur every three to five years.\nBoth La Niña and El Niño significantly impact ecosystems, precipitation, temperature, and the likelihood of extreme events such as droughts, hurricanes, and wildfires.",
    "category": "environment",
    "bias": "left",
    "publishedAt": "2025-10-06T20:42:52Z",
    "source": "Islands.com"
  }
]