[
  {
    "url": "https://www.bbc.com/news/articles/c62d101y94wo",
    "title": "More than 800 migrants cross English Channel in December record",
    "summary": "More than 800 migrants cross Channel in December record16 hours ago Share Save Stuart Maisner and Simon Jones , South East Share SaveGareth Fuller/PA Media The migrants were brought to Dover by Border Force and the RNLIMore than 800 migrants in 13 boats crossed the English Channel on Saturday, according to Home Office data.\nA Home Office spokesperson said: \"The number of small boat crossings are shameful and the British people deserve better.\"\nIn a statement, the Maritime Prefecture of the English Channel and the North Sea said 151 people were rescued and taken back to France.\nThat follows a recent period of 28 days when no small-boat crossings were possible because of windy conditions in the Channel.\nThe English Channel is one of the most dangerous and busiest shipping lanes in the world.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cwyg2629g7do",
    "title": "Napier Barracks in Folkestone used for housing asylum seekers shuts",
    "summary": "Barracks used for housing asylum seekers closesThe site closed on Friday and will be handed over to a property developer for housing.\nNapier Barracks in Folkestone - a former military site - opened as accommodation for migrants in 2020.\nAn army barracks in Kent which has been used to house asylum seekers has closed, according to the Home Office.\nThe government had previously announced discussions had begun to use barracks in Crowborough in East Sussex and Inverness in Scotland to house about 900 male asylum seekers in total.\nNapier Barracks housed more than 300 asylum seekers at its peak, but was believed to have fewer than 100 residents ahead of its closure.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-20T08:57:03Z",
    "source": "BBC News"
  },
  {
    "url": "https://uk.news.yahoo.com/liberal-bishop-appointed-head-catholic-142307919.html",
    "title": "Pro-asylum seeker bishop appointed head of Catholic Church in England",
    "summary": "The newly appointed head of the Catholic Church in England compared Jesus, Mary and Joseph to migrants arriving in Britain.\nA statement was issued on Wednesday by Archbishop-elect Moth alongside Bernard Longley, the Archbishop of Birmingham, to share “concern at societal tensions and division in our communities”.\n“This does not reflect the spirit or message of Christmas.”Earlier this year, Archbishop-elect Moth became the first bishop outside the London dioceses to hold a Mass for Migrants earlier this year.\nHe was ordained a priest in June 1982 and went on to serve as the Catholic Bishop of the Forces from 2009 until 2015.\nThe Independent Inquiry into Child Sexual Abuse (IICSA) report into the Catholic Church, published in November 2020, found Cardinal Nichols “seemingly put the reputation of the church” above his duty to sex assault victims.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-19T21:08:07Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/ice-says-agent-fired-shots-223429583.html",
    "title": "ICE says an agent fired shots at a migrant who hit him and another agent with his SUV in Minnesota",
    "summary": "Last week, ICE agents and protesters clashed in neighboring Minneapolis.\nSt. Paul police said in a statement that they were called to the area by reports of shots being fired, only to learn that the ICE agent had fired the shots.\nICE agents saw the man getting into his SUV and approached the vehicle, McLaughlin said, identifying themselves as ICE agents.\nHe rammed his SUV into an ICE vehicle, striking the second agent, prompting the shots, which did not hit him, she said.\nAfter ramming another ICE vehicle, the man got out of his SUV and attempted to flee into his apartment, but agents brought him to the ground, McLaughlin said.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-21T22:34:29Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/c997l3elxmxo",
    "title": "Young people to be hit hardest by UK's ageing society, report suggests",
    "summary": "Young people will feel burden of UK's ageing society, report suggestsCommittee chair Lord Wood of Anfield told the BBC it was a \"struggle to find where in government\" there was a focus on ageing and the \"transformational effects\" it was going to have on people.\nThe report also found that the crisis in adult social care \"remains a scandal\" which needs to be addressed urgently.\nYoung people will be hit hardest by successive governments' failure to focus on financial and societal challenges caused by an ageing population, a House of Lords report has suggested.\nIt also said an ageing population will need more care workers, leaving fewer workers for other parts of the economy.\n\"To successfully confront this challenge, the approach to financial management of today's and tomorrow's young people will need to change.\"",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-19T14:53:15Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/germany-charges-teens-alleged-wing-100848247.html",
    "title": "Germany charges teens in alleged right-wing extremist group with attempted murder",
    "summary": "BERLIN (AP) — Germany's federal prosecutor brought charges Thursday against eight suspects for their alleged membership in a “right-wing extremist terrorist” group that allegedly aimed to destabilize the country’s democratic system by carrying out attacks on migrants and political opponents.\nThe prosecutors also charged the seven alleged members and one supporter of the group, some of them teenagers, of attempted murder, conspiracy to commit murder, and grievous bodily harm.\nMost of the youths were arrested in May, when they were accused of involvement with a group calling itself “Last Defense Wave.\"\nAt the time, five suspects between 14 and 21 years old were arrested in the states of Mecklenburg-Western Pomerania, Brandenburg, and Hesse.\nSeveral members of the group were also accused of robbing and beating individuals, causing significant injuries, the prosecutor's statement said.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-18T10:08:48Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://abcnews.go.com/US/wireStory/ice-agent-fires-shots-man-after-hit-suv-128604749",
    "title": "ICE agent fires shots at man after being hit by SUV",
    "summary": "The man also bit an ICE agent as officers subdued him outside his apartment.\nSt. Paul police said in a statement that they were called to the area by reports of shots being fired, only to learn that the ICE agent had fired the shots.\nICE agents saw the man getting into his SUV and approached the vehicle, McLaughlin said, identifying themselves as ICE agents.\nHe rammed his SUV into an ICE vehicle, striking the second agent, prompting the shots, which did not hit him, she said.\nAfter ramming another ICE vehicle, the man got out of his SUV and attempted to flee into his apartment, but agents brought him to the ground, McLaughlin said.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-21T23:09:55Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cgex0lyl9dgo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "title": "Boy, 12, arrested over Swale council damage after refugee debate",
    "summary": "Boy, 12, arrested over damage after refugee debate\"Deliberate flooding caused water to pour through the ceiling,\" Swale Borough Council saysA 12-year-old boy has been arrested after a council had to close its office due to vandalism.\nKent Police said the boy, from Sittingbourne, was arrested on Tuesday on suspicion of criminal damage and later bailed.\nThe arrest followed reports to police of criminal damage after people in the public gallery disrupted a Swale Borough Council debate on 10 December about making the area a \"district of sanctuary\" for refugees.\nThe council later said its East Street, Sittingbourne, office was unable to open the following day as toilets and a lift were damaged, and \"deliberate flooding caused water to pour through the ceiling in several areas\".",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-12-18T09:44:49Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.jezebel.com/trump-admin-stops-reuniting-immigrant-children-families-orr-vetting-data-family-separation",
    "title": "Trump Admin Has Abruptly Stopped Reuniting Immigrant Children with Their Families",
    "summary": "Since the advent of the second Trump administration, though, that’s just what the ORR has increasingly become, according to former staffers.\nRoughly 2,400 kids are in ORR shelters of this sort at the moment, with the largest concentration of more than 800 in Texas.\nStill, up until November, kids were still being reunited with family members by ORR on a daily basis.\nEight immigration attorneys contacted for the piece agreed, saying that starting in early November, ORR stopped responding to letters and communications demanding the release of children to qualified sponsors.\nEven when threatened with litigation, ORR hasn’t explained to these attorneys why the kids aren’t being released.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-19T18:01:22Z",
    "source": "Jezebel"
  },
  {
    "url": "https://www.yahoo.com/news/videos/burundi-overwhelmed-tens-thousands-flee-170833505.html",
    "title": "Burundi 'overwhelmed' as tens of thousands flee eastern Congo",
    "summary": "NBA fines Nuggets coach David Adelman $35K for erupting at officials, leading to ejection in loss to RocketsDavid Adelman charged at an official and screamed, “You are f***ing terrible, man!” loud enough to be heard clearly on the broadcast on Saturday night.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-12-19T17:08:33Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.aljazeera.com/features/2025/12/19/how-ice-deports-refugees-and-migrants-despite-years-of-good-conduct",
    "title": "How ICE deports refugees and migrants despite years of good conduct",
    "summary": "The same is true of 73 percent of the more than 65,000 immigrants in ICE detention as of November, a record number of detainees.\nNearly half of all immigrants in ICE detention have neither a criminal conviction nor pending criminal charges.\nJose and Josue were appealing until 2020, when their appeals ran out, but they continued to appear at ICE check-ins.\nA few weeks after Jose and Josue arrived in El Salvador, Josue’s high school in Georgia held its graduation ceremony.\nJose said the brothers followed the conditions: Going to court, attending ICE check-ins, having good moral conduct and no criminal record.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-19T12:38:29Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://www.npr.org/2025/12/21/nx-s1-5616684/amsterdam-sudan-radio-usaid",
    "title": "A radio station in Amsterdam is a lifeline for Sudan. After USAID cuts, it's faltering",
    "summary": "A radio station in Amsterdam is a lifeline for Sudan.\nFrom Amsterdam, the journalists at Radio Dabanga try to shed some light on the dire situation.\n\"Radio Dabanga has become a lifeline for all Sudanese,\" Elsadig said.\nBut in a nearby river-side café Jean-Pierre Fisher, 32, hosted a fundraiser for Radio Dabanga.\nThe radio station believes its online website could continue operating.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-21T11:00:00Z",
    "source": "NPR"
  },
  {
    "url": "https://www.npr.org/2025/12/18/nx-s1-5648584/judge-hannah-dugan-guilty-obstruction-ice",
    "title": "A federal jury finds Milwaukee judge guilty of obstructing immigration agents",
    "summary": "A federal jury finds Milwaukee judge guilty of obstructing immigration agentstoggle caption Adela Tesnow/Pool via APMILWAUKEE — A federal jury found Milwaukee County Circuit Court Judge Hannah Dugan guilty Thursday of obstructing immigration agents as they attempted to arrest an undocumented immigrant defendant last April.\nFlores-Ruiz, a Mexican national, was arrested outside the courthouse after a short chase by the immigration agents and has since been deported.\nDuring the trial, federal agents testified Dugan seemed \"angry\" when she approached them in the public hallway where they were waiting to arrest Flores-Ruiz after his hearing.\nSponsor MessageDuring the government's closing argument, Assistant U.S. Attorney Kelly Watzka said Dugan conducted a \"round-up\" of federal agents and sent them to the chief judge's office.\nUntil President Trump's first term, courthouses were typically off-limits to federal authorities, including immigration agents.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-19T04:24:15Z",
    "source": "NPR"
  },
  {
    "url": "https://www.npr.org/2025/12/19/nx-s1-5649339/trump-suspends-u-s-green-card-lottery-after-brown-university-and-mit-shootings",
    "title": "Trump suspends U.S. green card lottery after Brown University and MIT shootings",
    "summary": "Trump suspends U.S. green card lottery after Brown University and MIT shootingstoggle caption Mark Schiefelbein/APPresident Donald Trump suspended the green card lottery program on Thursday that allowed the suspect in the Brown University and MIT shootings to come to the United States.\nSponsor MessageNeves Valente, 48, is suspected in the shootings at Brown University that killed two students and wounded nine others, and the killing of an MIT professor.\nNearly 20 million people applied for the 2025 visa lottery, with more than 131,000 selected when including spouses with the winners.\nSponsor MessageTrump has long opposed the diversity visa lottery.\nHe has not been deterred if they are enshrined in law, like the diversity visa lottery, or the Constitution, as with a right to citizenship for anyone born on U.S. soil.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-19T07:24:46Z",
    "source": "NPR"
  },
  {
    "url": "https://www.desertsun.com/story/news/crime_courts/2025/12/19/indio-police-investigate-crash-involving-ice-agents-in-indio/87852401007/",
    "title": "ICE agents involved in crash in Indio, ICE also active in Palm Springs",
    "summary": "Federal agents conducting immigration enforcement recently swept across multiple Coachella Valley cities, officials said Friday, Dec. 19.\n\"ICE has been very active in our city over the last few days,\" Palm Springs Police Chief Andy Mills said in a video posted on social media.\n\"We've actually spoken with ICE agents and let them know we are not assisting them in any way shape or form.\"\nHe also specified that Indio Police was not involved in any ICE enforcement or investigative activity but merely had provided an emergency response to the crash.\nSam Morgen covers the city of Palm Springs for The Desert Sun.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-19T23:44:03Z",
    "source": "The Desert Sun"
  },
  {
    "url": "https://www.aljazeera.com/news/2025/12/19/tens-of-thousands-flee-dr-congo-to-burundi-after-rebel-takeover-of-key-city",
    "title": "Tens of thousands flee DR Congo to Burundi amid rebel takeover of key city",
    "summary": "UN refugee agency says women and children arriving ‘exhausted and severely traumatised’ after fleeing eastern DRC.\nThe UN refugee agency (UNHCR) said on Friday that Burundi had reached a “critical point” amid the influx of refugees and asylum seekers fleeing a surge in violence in the DRC’s South Kivu province.\nRefugees started crossing into Burundi on December 5, with numbers surging after M23 seized control of Uvira on December 10.\nIn Burundi, displaced families face difficult conditions at transit points and makeshift camps with minimal infrastructure, the UN said.\nThe rebel advance has given M23 control over substantial territory in the mineral-rich eastern DRC and severed a critical supply route for Congolese forces along the border with Burundi.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-12-19T14:35:00Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://www.theatlantic.com/family/2025/12/immigration-pronatalism-trump-vance/685275/",
    "title": "The Truth About Immigration That MAGA Doesn’t Acknowledge",
    "summary": "(My toddler son has only ever been cared for by immigrant women, myself among them.)\nWhen fewer immigrants are in the American workforce, economic research suggests, women may work less or have fewer babies—possibly both.\nSome researchers anticipate that the Trump administration’s ICE operations will affect immigrant child-care workers even more than Secure Communities did.\nThe relationship between affordable child care and fertility is fuzzy; many countries with subsidized day care and other benefits for parents nevertheless have low birth rates.\nBut some data suggest that as child care gets more expensive or less available, women have fewer kids.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-19T14:40:00Z",
    "source": "The Atlantic"
  },
  {
    "url": "https://www.yahoo.com/news/articles/federal-judge-denies-request-close-214842090.html",
    "title": "Federal judge denies request to close Florida's 'Alligator Alcatraz'",
    "summary": "ORLANDO, Fla. (AP) — A federal judge on Thursday denied a request for a preliminary injunction to close an immigration detention center in the Florida Everglades dubbed “Alligator Alcatraz,” saying a detainee who asked for the order hadn't shown he was suffering irreparable harm at the facility.\nin court papers, hadn't met the high burden required for a preliminary injunction while his challenge to the facility is litigated in federal court in Fort Myers, Florida.\nHis lawsuit claims immigration is a federal issue, and Florida agencies and private contractors hired by the state have no authority to operate the facility under federal law.\nIn the third lawsuit, detainees were seeking a ruling that would ensure that they have access to confidential communications with their attorneys.\nA federal judge in that case ordered the detainees' lawyers and attorneys for the state and federal government defendants to meet Tuesday in an effort to resolve the case.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-18T21:48:42Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.thedailybeast.com/minneapolis-police-chief-eviscerates-ice-goons-for-dragging-woman-down-the-street-christmas/",
    "title": "Police Chief Eviscerates ICE Goons for Dragging Woman Down Street",
    "summary": "A Minnesota police chief used a church pulpit to denounce President Donald Trump’s immigration raids amid outrage over ICE agents dragging an apparently pregnant woman down a snowy street.\nShe’s pregnant!” Another screamed, “Get her off of her f---ing stomach.”The woman was dragged down the street by two ICE agents as they sprayed CS gas at bystanders.\nThe woman was then dragged by one arm, as bystanders threw snowballs and demanded she be let go, as ICE agents fired pepper spray into the crowd.\nMinnesota Rep. Ilhan Omar has said ICE agents pulled over her 20-year-old U.S.-citizen son and demanded his passport.\nCommunity members hold banners as they show up to a press conference to demand accountability after ICE agents were spotted staging in a parking lot in Minneapolis.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-18T13:10:22Z",
    "source": "Daily Beast"
  },
  {
    "url": "https://www.bbc.com/news/articles/czxgrl4937yo",
    "title": "Thailand bombs near Poipet casino hub on Cambodian border",
    "summary": "Thailand bombs near Cambodia's Poipet border crossingPoipet is known for being a major casino hub and the biggest land crossing between the two countriesThe renewed fighting this month has killed at least 21 people in Thailand and 17 in Cambodia, while displacing around 800,000, officials say.\nCambodia's defence ministry said Thai forces dropped two bombs, while the Thai side said that they targeted a facility storing rocket systems.\nThailand says it has bombed a \"logistics centre\" near the Cambodian town of Poipet, known for being a major casino hub and the biggest land crossing between the two countries.\nIn a statement, the Cambodian defence ministry said Thai forces dropped two bombs in the area of Poipet municipality at around 11:00 am (0400 GMT) Thursday.\nThe century-old border dispute between the South East Asian neighbours dramatically escalated on 24 July with a Cambodian rocket barrage into Thailand, followed by Thai air strikes.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-18T13:08:10Z",
    "source": "BBC News"
  }
]