[
  {
    "url": "https://www.usatoday.com/story/news/nation/2025/11/09/migrants-head-south-not-north-trump-border/87166359007/",
    "title": "Migrants hail a boat ride south, away from their American dream",
    "summary": "The 40-plus passengers were from Venezuela, migrants who originally fled economic and political turmoil in the South American country to seek a new life in the United States.\nAstonishingly, they have turned around and headed south, abandoning their American dream for an uncertain future.\nThe flow of migrants south comes while the number of people traveling north through the Darién Gap in Panama has plunged by 98% to nearly zero, according to Panama government data.\nExchanging one dream for anotherOnce in the open water, the captain of the Barricuda 11 headed south from Palenque, the fishing boat loaded with migrants.\nThe migrants lowered their heads in the wind as the boat picked up speed, the hull slamming rhythmically on the waves.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-11-09T11:04:46Z",
    "source": "USA Today"
  },
  {
    "url": "https://www.bbc.com/news/articles/cy5qgyx6e5xo",
    "title": "Why we went undercover for the BBC to expose crime in the Kurdish community",
    "summary": "But Ali says that the illegal working \"damages the whole Kurdish community\" and he feels compelled to \"bring it [the criminal network] out into broad daylight\".\nSaman and Ali have both been monitoring social media reaction to the BBC investigation from inside the Kurdish community and say it has sparked intense anger for some.\n\"We are not spies, and we have no intention of harming the Kurdish community,\" Saman says.\nThe Kurdish Community Centre in Haringey, London, suggests there are a little more than 500,000.\nSaman and Ali say illegal working \"damages the whole Kurdish community\"",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-11-08T02:05:16Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/rescuers-searching-missing-migrants-boat-142546276.html",
    "title": "Rescuers searching for missing migrants after boat sinks off Malaysia recover 5 more bodies",
    "summary": "KUALA LUMPUR, Malaysia (AP) — Malaysian rescuers searching for dozens of people still missing after a boat carrying migrants from Myanmar capsized last week recovered five more bodies on Monday, bringing the death toll to 12.\nAdvertisement AdvertisementAdvertisement AdvertisementOfficials said a larger vessel carrying some 300 people departed from the town of Buthidaung, in Myanmar’s Rakhine state.\nThe passengers were believed to have been split into three smaller boats once the vessel neared Malaysia.\nIn January, Malaysian authorities turned away two boats carrying nearly 300 people believed to be Rohingya refugees.\nThere are around 117,670 Rohingya registered with the U.N.'s refugee agency in Malaysia — about 59% of the total refugee population in the country.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-11-10T14:25:46Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/cddrl7m4dzno",
    "title": "Michael D Higgins leaves Áras on last day as Irish president",
    "summary": "Higgins leaves official residence on last day as Irish presidentMichael D Higgins says serving as Ireland's president was a privilegeWell wishers gathered outside the official residence of the President of Ireland on Monday evening as Michael D Higgins left on his final day in office.\nThe outgoing Irish president and his wife, Sabina, were greeted by cheers and given yellow roses symbolising friendship and joy as they left Áras an Uachtaráin.\nMembers of the Sanctuary Runners formed a guard of honour outside the gates of the residence in Dublin's Phoenix Park as the couple left.\nOn Sunday, a group of Bernese mountain dog owners gathered outside to say their goodbyes.\nPresident Higgins owned a number of Bernese mountain dogs during his tenure, including his beloved current dog, five-year-old Misneach.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-11-10T23:03:52Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cd7rp5zj484o",
    "title": "Seven dead after migrant boat sinks near Thai-Malaysian border",
    "summary": "Seven dead after migrant boat sinks near Thai-Malaysian borderMalaysian Coast Guard officers are looking for more survivorsRescue efforts have entered a second day, with the search area expanded from 170 to 256 square nautical miles.\nMalaysian Coast Guard estimate about 70 people were on board when the vessel sank near the resort island of Langkawi.\nAt least seven people have died after a boat carrying undocumented migrants sank near the border between Thailand and Malaysia.\nMalaysia's maritime authority expects the operation, involving sea surface and aerial searches, to last seven days.\nSince August 2017, a deadly crackdown by Myanmar's army sent hundreds of thousands of Rohingyas fleeing across the border into Bangladesh.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-11-09T12:49:05Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/senate-democrat-questions-trump-administrations-184858899.html",
    "title": "Senate Democrat questions Trump administration's $7.5M payment to Equatorial Guinea",
    "summary": "WASHINGTON (AP) — The Trump administration made a $7.5 million payment to the government of Equatorial Guinea as it seeks to deport people to the West African country and draws closer to its heavily prosecuted leaders, according to the top Democratic senator on the Senate Foreign Relations Committee.\nShaheen said in her letter that the $7.5 million payment stood out because it would would “far exceed the amount of U.S. foreign assistance provided over the last 8 years combined” to the country.\nThe Trump administration, in aiming to ramp up deportations, has sought to forge agreements with countries to take in migrants who are not their citizens.\nBesides deportations, the U.S. is trying to counter Chinese influence in Equatorial Guinea and boost American oil and gas business interests there.\nEquatorial Guinea has challenged those asset seizures at the International Court of Justice.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-11-10T18:48:58Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/cddrq0plr1zo",
    "title": "US judge says Trump cannot deploy National Guard to Portland",
    "summary": "US judge says Trump cannot deploy National Guard to PortlandThe Portland deployment is part of a series of efforts by Trump administration to subdue protests against federal immigration raids in primarily Democrat-led cities, including Chicago, Los Angeles and Washington DC.\nA US judge will not allow President Donald Trump to deploy National Guard members to the city of Portland, Oregon.\nWhen she ruled against the Trump administration earlier this month, Judge Immergut issued two temporary restraining orders.\nOne blocked Trump from mobilising the Oregon National Guard to Portland, while another, broader order stopped him from sending in any troops from any state to Oregon.\nIn the 106-page ruling, Judge Immergut said that she was not blocking the president from ever using National Guard troops, but said that in Portland \"the President did not have a lawful basis to federalize the National Guard\".",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-11-08T02:54:51Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/chicago-police-respond-report-shots-232329748.html",
    "title": "Chicago police respond to report of shots fired at federal agents amid immigration operations",
    "summary": "Chicago police officers responded to a call of gunshots fired at federal agents Saturday amid immigration enforcement operations that drew residents to protest in the streets, the department said.\nAdvertisement AdvertisementAdvertisement AdvertisementTensions are high as federal enforcement has grown increasingly aggressive some two months into an immigration operation in Chicago dubbed Operation Midway Blitz.\nA federal judge issued an extensive injunction this week restricting agents’ use of force after saying a top Border Patrol official repeatedly lied about threats posed by protesters.\nSaturday’s Border Patrol operation in Little Village, a largely Mexican neighborhood, attracted protesters who blew whistles, honked car horns and yelled at agents to leave.\nSome confronted police officers they viewed as helping the federal agents.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-11-08T23:23:29Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.aljazeera.com/news/2025/11/9/why-does-the-uk-want-to-copy-denmarks-stringent-immigration-policies",
    "title": "Why does the UK want to copy Denmark’s stringent immigration policies?",
    "summary": "Home Secretary Shabana Mahmood last month dispatched officials to study the workings of the Danish immigration and asylum system, widely considered the toughest in Europe.\nThe officials are reportedly looking to review the British immigration rules on family reunion and limit refugees to a temporary stay.\nStarmer’s administration has framed the new immigration rules as a “clean break” from a system they see as overreliant on low-paid overseas labour.\nEU member states operate within EU migration and asylum rules, and Schengen zone rules where applicable, and are bound by international obligations such as the UN Refugee Convention.\nRights groups have criticised the EU for immigration policies that focus on border control and for policies to transfer refugees to third countries.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-11-09T16:50:32Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://abc7chicago.com/post/little-village-chicago-shooting-1-arrested-shots-fired-border-patrol-during-immigration-op-26th-kedzie-dhs-says/18138702/",
    "title": "1 arrested after shots fired at Border Patrol over weekend in Little Village: DHS",
    "summary": "1 arrested after shots fired at Border Patrol over weekend in Little Village: DHSDHS says a Little Village shooting happened during a Border Patrol immigration operation Saturday.\nDHS says a Little Village shooting happened during a Border Patrol immigration operation Saturday.\nDHS says a Little Village shooting happened during a Border Patrol immigration operation Saturday.\nDHS says a Little Village shooting happened during a Border Patrol immigration operation Saturday.\nDHS also said \"an unknown number of agitators\" threw a paint can and bricks at Border Patrol vehicles.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-11-10T19:30:39Z",
    "source": "WLS-TV"
  },
  {
    "url": "https://www.yahoo.com/news/articles/suburban-chicago-dad-toddler-headed-201231556.html",
    "title": "Suburban Chicago dad headed to store with toddler says they were pepper-sprayed by federal agents",
    "summary": "CHICAGO (AP) — A suburban Chicago father and his 1-year-old daughter were pepper-sprayed at close range as they headed grocery shopping over the weekend and happened upon federal immigration agents, the family said.\nVeraza said the family was in their car when they heard a helicopter and honking, common signals in the Chicago area these days that federal agents are nearby.\nChicago police were called to respond to a call of gunshots fired at federal agents.\nAdvertisement AdvertisementAdvertisement AdvertisementArea residents, including DeMateo, said agents deployed chemical agents, including tear gas and pepper balls, near his van without being provoked.\nSome protesters confronted Chicago police officers they viewed as helping the federal agents.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-11-10T20:12:31Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/cvg4337rxy1o",
    "title": "How Trump could hamper Zohran Mamdani's New York agenda",
    "summary": "Political experts told the BBC Trump could easily slash more - and that could hamper Mamdani's campaign promises to reduce the cost of living.\nAn $8bn federal funding holeMamdani, a former state assemblyman, faces several challenges aside from Trump in accomplishing his ambitious policy goals, policy experts say.\nTrump has not specified which federal funds he would target.\n\"So, hear me, President Trump, when I say this: To get to any of us, you will have to get through all of us,\" he said on election night.\n'Trump-proofing' New York CityGetty Images Mamdani is making plans for dealing with Trump, who made his real estate career in New York City",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-11-08T12:27:45Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.jpost.com/israel-news/defense-news/article-873141",
    "title": "Israeli forces foil weapons smuggling at Egyptian border",
    "summary": "The three long weapons that the IDF located and seized after they were attempted to be smuggled into Israel, November 7, 2025.\n( photo credit : IDF SPOKESPERSON'S UNIT )",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-11-08T17:55:14Z",
    "source": "The Jerusalem Post"
  },
  {
    "url": "https://www.yahoo.com/news/articles/democrats-electoral-sweep-tests-trump-110714959.html",
    "title": "Democrats' electoral sweep tests Trump’s anti-DEI and immigration agenda",
    "summary": "By David Hood-Nuño, Jonathan Allen and Bianca FlowersWASHINGTON (Reuters) -Democrats' victories in Tuesday’s elections have exposed potential vulnerabilities in U.S. President Donald Trump’s hardline immigration agenda and bid to stamp out diversity, equity and inclusion policies, analysts said.\nNew York City Mayor-elect Zohran Mamdani was the most outspoken, centering his economic platform on racial equity and economic justice.\nIn New York, 70% of Mamdani voters said the next mayor should not cooperate with the Trump administration'​s immigration policies.\nDEMOCRATS TRY TO KEEP UP MOMENTUMWhether the sentiments translate into victory for Democrats in next year's midterm elections remains to be seen, analysts say.\nPolls show the Democratic brand remains unpopular and while Trump's approval rating has dropped, voters remain split between the parties.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-11-07T11:07:14Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.techdirt.com/2025/11/07/trump-administration-wont-stop-mandatory-detention-of-migrants-despite-200-court-rulings-calling-it-illegal/",
    "title": "Trump Administration Won’t Stop Mandatory Detention Of Migrants Despite 200 Court Rulings Calling It Illegal",
    "summary": "Trump Administration Won’t Stop Mandatory Detention Of Migrants Despite 200 Court Rulings Calling It Illegalfrom the one-hundred-duck-sized-judges-ot-one-trump-sized-trump deptThis news should be far more heartening than it is.\nThe rulings come from judges appointed by every president since Ronald Reagan, including 12 appointed by President Donald Trump.\nBut 27 judges appointed by GOP presidents have reached the same conclusions, including 12 appointed by Trump himself.\nThe Trump administration seems to feel it won’t.\nFiled Under: bigotry, cbp, dhs, donald trump, due process, ice, immigration, kristi noem, mass deportation, trump administration",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-11-07T17:28:00Z",
    "source": "Techdirt"
  },
  {
    "url": "https://abc7.com/post/los-angeles-police-chases-chasing-driver-reported-stolen-minivan-405-freeway/18139278/",
    "title": "Woman leads CHP on 155-mile chase from San Fernando Valley all the way to Mexico",
    "summary": "Woman leads CHP on 155-mile chase from San Fernando Valley all the way to MexicoA chase suspect led officers from the Sherman Oaks area all the way to the U.S.-Mexico border Monday afternoon and then crossed into Mexico, officials said.\nA chase suspect led officers from the Sherman Oaks area all the way to the U.S.-Mexico border Monday afternoon and then crossed into Mexico, officials said.\nA chase suspect led officers from the Sherman Oaks area all the way to the U.S.-Mexico border Monday afternoon and then crossed into Mexico, officials said.\nA chase suspect led officers from the Sherman Oaks area all the way to the U.S.-Mexico border Monday afternoon and then crossed into Mexico, officials said.\nLOS ANGELES (KABC) -- A chase suspect led California Highway Patrol officers from the San Fernando Valley to the U.S.-Mexico border Monday afternoon and then crossed into Mexico, officials said.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-11-10T23:32:03Z",
    "source": "KABC-TV"
  },
  {
    "url": "https://www.yahoo.com/news/articles/belarus-leader-threatens-seize-over-163356010.html",
    "title": "Belarus leader threatens to seize over 1,000 Lithuanian trucks stuck by closed border",
    "summary": "TALLINN, Estonia (AP) — The authoritarian leader of Belarus threatened Monday to seize over 1,000 Lithuanian trucks stranded in his country following the closure of its border with Lithuania in recent weeks after repeated incursions by weather balloons carrying smuggled cigarettes.\nLithuanian officials cast the flight disruptions as part of anti-Western activities by Russia-allied Belarus intended to undermine stability.\nThe Belarusian authorities have refused to open a corridor exclusively to evacuate the stranded Lithuanian trucks, demanding that Lithuania fully reopen the border.\nLukashenko said Monday that up to 1,200 Lithuanian trucks were stranded in Belarus because of the closed border, and he warned that Belarusian authorities could seize them if Lithuania fails to reopen it.\nLukashenko noted that Belarusian authorities would raise the Lithuanian border closure in their contacts with Washington.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-11-10T16:33:56Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/ukrainian-strikes-disrupt-power-heating-091717581.html",
    "title": "Ukrainian strikes disrupt power and heating to 2 major cities in Russia",
    "summary": "KYIV, Ukraine (AP) — Ukrainian strikes disrupted power and heating to two major Russian cities near the Ukrainian border, local Russian officials reported Sunday.\nPower knocked out in two Russian citiesA drone strike temporarily caused blackouts and cut heating to parts of Voronezh, regional Gov.\nRussian and Ukrainian news channels on Telegram claimed the strike targeted a local thermal power plant.\nAdvertisement AdvertisementAdvertisement AdvertisementStrikes endanger power supply to nuclear plantsRussia's mass drone and missile strikes Friday hit power substations that supply two of Ukraine’s nuclear power plants, according to Ukrainian Foreign Minister Andrii Sybiha.\n“Russia once again targeted substations that power the Khmelnytskyi and Rivne nuclear power plants,” Sybiha said in a statement on X late Saturday.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-11-09T09:17:17Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/cly9x8vv9v9o",
    "title": "Peru Congress declares Mexican president 'persona non grata'",
    "summary": "Peru Congress declares Mexican president 'persona non grata'Mexico says it has offered Chávez asylum in accordance with international law, and rejected Peru's accusation that it was an \"unfriendly act\".\nBetssy Chávez denies allegations that she played a role in ousted Peruvian President Pedro Castillo's plan to dissolve congress.\nPeru's Congress has voted to declare Mexican President Claudia Sheinbaum as persona non grata - or unwelcome in the country.\nThe declaration - passed in a 63-33 vote in the Peruvian Congress - marks the latest escalation in worsening ties between the two Latin American nations.\nLast September, the Foreign Relations Committee of Peru's Congress proposed declaring Sheinbaum a persona non grata for failing to condemn Castillo's attempted coup and advocating for his release.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-11-07T02:39:07Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.foxla.com/news/police-chase-chp-pursuit-suspect-stolen-car-nov-10-2025",
    "title": "Woman in stolen minivan escapes, crosses US-Mexico border after 4-county pursuit across SoCal",
    "summary": "The Brief An hours-long police chase involving a driver in an allegedly stolen silver Toyota minivan spanned multiple counties in Southern California on Monday.\nThe chase ended around 1:30 p.m. when the driver successfully crossed the international border into Mexico, eluding law enforcement.\nA female driver in an allegedly stolen silver Toyota minivan was able to escape into Mexico after leading officers on a multi-county, hours-long pursuit across Southern California on Monday.\nTimeline:10:35 a.m.: The silver Toyota Sienna minivan was reported stolen from the 1900 block of Hillcrest Drive in Thousand Oaks, Ventura County.\nWhat's next:The driver successfully eluded capture by driving into Mexico.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-11-10T19:21:13Z",
    "source": "FOX 11 Los Angeles"
  }
]