[
  {
    "url": "https://www.yahoo.com/news/articles/hunger-disease-spreading-war-torn-150926777.html",
    "title": "Hunger and disease spreading in war-torn Sudan, WHO says",
    "summary": "LONDON (Reuters) -Hunger and disease are spreading in war-torn Sudan, with famine already present in several areas, 25 million people acutely food insecure and nearly 100,000 cholera cases recorded since last July, the World Health Organisation said on Friday.\n\"Relentless violence has pushed Sudan's health system to the edge, adding to a crisis marked by hunger, illness and despair,\" WHO Senior Emergency Officer Ilham Nour said in a statement.\nAdvertisement AdvertisementAdvertisement Advertisement\"Exacerbating the disease burden is hunger,\" she said, adding that about 770,000 children under 5 years old are expected to suffer from severe acute malnutrition this year.\nCholera has also hit a camp for Darfur refugees in neighbouring eastern Chad, the United Nations refugee agency said on Friday.\n(Reporting by Matthias Williams and Lewis Macdonald Editing by Miranda Murray)",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-08-08T15:09:26Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://nextshark.com/korean-american-researcher-detained-weed-conviction",
    "title": "Korean American researcher held at airport for weeks over decade-old weed conviction",
    "summary": "Korean American researcher held at airport for weeks over decade-old weed convictionA 40-year-old scientist and legal permanent resident has been detained by the U.S. Customs and Border Protection at San Francisco International Airport since July 21.\nAccording to his legal team , he has previously traveled internationally for academic work without incident.\nSince his detention began, he has had almost no communication with family or counsel, and his legal team believes he may now be held at a facility in Arizona.\nAlarming trendKim’s detention comes amid a rise in cases where legal permanent residents are held over minor or decades-old offenses under stricter immigration enforcement.\nThis story is part of The Rebel Yellow Newsletter — a bold weekly newsletter from the creators of NextShark, reclaiming our stories and celebrating Asian American voices.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-06T15:30:53Z",
    "source": "NextShark"
  },
  {
    "url": "https://www.theverge.com/tech/720211/humble-bundle-wb-games-deal-sale",
    "title": "Get Batman: Arkham City, Shadow of Mordor, and 14 more games for $12",
    "summary": "The future of Warner Bros. Games is unclear, as it shut down several studios and canceled anticipated games earlier this year.\nBut there’s no arguing that the company’s back catalog of titles is full of gems, many of which are in Humble’s great $12 bundle.\nThrough August 27th, you can jump on this unbeatable deal that gets you 16 WB Games titles on Steam for just $12, with proceeds going to the Raiden Science Foundation.\nThis bittersweet bundle features an array of licensed and original open-world titles, fighting games, and first-person shooters from WB Games’ studios — most of which have either fallen from grace in recent years or have been shut down.\nOther highlights include Batman: Arkham City, Batman: Arkham Asylum, and the oft-overlooked Mad Max.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-06T20:39:51Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.aljazeera.com/news/2025/8/6/a-migrant-march-in-mexico-continues-despite-scrutiny-of-organisers-arrest",
    "title": "A migrant march in Mexico continues despite scrutiny of organiser’s arrest",
    "summary": "One of the organisers, Luis Garcia Villagran, was detained for alleged human trafficking in the lead-up to the march.\nWednesday’s march set out from the border city of Tapachula, near Guatemala, and nearly 300 migrants, asylum seekers and supporters took part.\nBut the demonstration was overshadowed by the arrest one day earlier of one of its leaders, prominent immigration activist Luis Garcia Villagran.\n“That is the crime,” she said, adding that Garcia Villagran was “not an activist”.\nMujica and Garcia Villagran have both been prominent voices in a movement to make legal immigration pathways more accessible.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-06T23:09:28Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://www.bbc.com/news/articles/cj3lxzpkn87o",
    "title": "Dharali, Uttarakhand: More than 100 people missing after flash floods hit village",
    "summary": "More than 100 missing after flash floods in India3 days ago Share Save Nitin Ramola Reporting from Uttarkashi Nikita Yadav BBC News, Delhi Share SaveState Disaster Response Force Uttarkashi handout/EPA/Shutterstock Heavy rains and flash floods have caused severe damage in Uttarkashi districtMore than 100 people are missing and at least one has died after devastating flash floods in the northern Indian state of Uttarakhand.\nAbout 190 people have been rescued so far in the affected region, Uttarakhand Chief Minister Pushkar Singh Dhami said.\nNitin Ramola Roads leading to Dharali have been badly damagedDamaged roads and heavy rain have hampered rescue teams trying to reach Dharali.\nWeeks of heavy rain have pounded Uttarakhand, with Uttarkashi - home to Dharali village - among the worst hit by flooding.\nRescue efforts are slow due to heavy sludge and debris, but officials have deployed helicopters to aid operations.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-06T04:54:02Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/congress-member-says-us-push-130751718.html",
    "title": "Lebanese Shiite ministers walk out of a Cabinet meeting over plan to disarm Hezbollah",
    "summary": "BEIRUT (AP) — Shiite members of Lebanon's Cabinet walked out a government meeting on Thursday in protest of a proposed plan to disarm the Hezbollah militant group and political organization.\nThe rest of the Cabinet then voted in favor of the U.S.-backed plan to disarm the group and implement a ceasefire with Israel.\nAdvertisement AdvertisementAdvertisement AdvertisementWhile the Cabinet meeting was still underway, an Israeli strike on the road leading to Lebanon's main border crossing with Syria killed five people and injured 10 others, Lebanon's health ministry said.\nIsrael has accused Hezbollah of trying to rebuild its military capabilities and said it is protecting its border.\nA member of the U.S. Congress said that Washington will push Israel to withdraw from all of southern Lebanon if the Lebanese army asserts full control over the country.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-07T13:07:51Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/trump-tariffs-latest-updates",
    "title": "The bulk of Trump's tariffs are finally here. We broke down what the latest updates mean for you.",
    "summary": "Trump has said the long-term benefits of tariffs will be worth some short-term pain.\nHere's where it all stands now that the bulk of Trump's big tariffs are finally in place.\n10% baseline tariff on most imports started in AprilThe 10% baseline tariff Trump announced on April 2 remains in effect for most countries.\nBessent said Trump's 145% tariff on Chinese goods would decrease to 30% for 90 days.\nChina, in turn, said it would lower its tariffs on American goods to 10% from 125% over the same time period.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-08-07T16:07:52Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/h-1b-visa-big-tech-immigration-green-card-2025-8",
    "title": "H-1B Visa: 7 Current or Ex Big Tech Workers Share Immigration Stories",
    "summary": "Business Insider spoke to seven current or former H-1B recipients who moved from India and found work in Big Tech.\nI've seen misconceptions about the H-1B visa that it is replacing US jobs.\nI also get paid similarly to my US colleagues, so I don't think it's fair to say H-1B visa holders are cheap labor.\nI kicked off the process for my Optional Practical Training and received my H-1B visa in the lottery on my first try.\nI relied on my employer for my H-1B visa status and was cautious of not violating my immigration status.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-08T04:05:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://gizmodo.com/companies-find-potential-way-to-avoid-trump-tariffs-and-keep-prices-low-2000639590",
    "title": "Companies Find Potential Way to Avoid Trump Tariffs and Keep Prices Low",
    "summary": "Two court cases have sought to challenge the bizarre legal argument that the White House has made to justify its tariff program, Politico writes.\nSo far, the outcome isn’t looking good for the White House, either.\nPolitico writes:In May, a federal court ruled Trump’s tariffs exceeded the president’s authority granted under the 1977 emergency law.\nThe tariff regime, dubious as it seems to many, has been touted by the White House as one of the president’s chief achievements.\nTrump has always characterized himself as the ultimate deal-maker, and the administration characterized the tariffs as further evidence of that.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-06T18:35:50Z",
    "source": "Gizmodo.com"
  }
]