[
  {
    "url": "https://gizmodo.com/the-dhs-wants-you-to-forget-that-anakin-skywalker-also-descended-into-fascism-2000641374",
    "title": "The DHS Wants You to Forget That Anakin Skywalker Also Descended Into Fascism",
    "summary": "Darth Vader is the villain in Star Wars.\n“Not to spoil the plot, but as any Star Wars fans knows, Darth Vader is also Anakin Skywalker,” the DHS statement read.\nOutside of the wild stretch of assuming the American public understands that Darth Vader is Anakin Skywalker and that Skywalker is a hero, there is a lot to unpack here.\nAlso, we’d venture to guess most people who aren’t Star Wars fans don’t know about any of that.\nThe U.S. government has a long history of not really understanding Star Wars going back to Ronald Reagan’s use of the term in his defense platform.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-11T16:31:06Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.thedailybeast.com/maga-couple-regrets-trump-vote-after-terrifying-border-patrol-stop/",
    "title": "MAGA Couple Regrets Trump Vote After Terrifying Border Patrol Stop",
    "summary": "Two Trump voters allege that Border Patrol agents racially profiled them after they were stopped and questioned on the way to the dentist.\nGeorge told a San Diego NBC affiliate that the SUV put on a siren, pulled them over, and a group of masked Border Patrol agents got out to question them.\nIn a video of the interaction, a Border Patrol agent questions George through the car window.\nThe Border Patrol agent who questioned the Doliez's pulled down his mask during the questioning, but did not detail why he had reasonable suspicion to question the couple.\nBorder Patrol agents search George and Esmeralda Doilez's car at a camping site near San Diego.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-11T16:40:18Z",
    "source": "Daily Beast"
  },
  {
    "url": "https://www.bbc.com/news/articles/c04r5y5xv11o",
    "title": "Posing as a migrant to infiltrate a cross-Channel gang",
    "summary": "Here, one of our reporters who assumed a false identity and posed as a migrant, describes how he met one of the gang's senior members in a secret forest hideout.\nI have, at most, three hours of battery life left, and I need to get to the smuggler's secret camp, meet him, and get out safely.\nWith gang members monitoring everyone who enters the forest, I worry my advisers may end up exposing me rather than protecting me.\nI walk down a path to the smugglers' camp trying to remember the way I came in.\nIn person in the forest, Abdullah appears friendlier than most of the smugglers I have encountered.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-08-10T05:00:06Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/c1dxxddqqz5o",
    "title": "Rachel Morin: Migrant sentenced to life for murdering Maryland mum",
    "summary": "Victor Martinez-Hernandez, 24, was found guilty this year in the rape and murder of Rachel Morin, 37, on a hiking trail in Bel Air, Maryland, in August 2023.\nHe assaulted her, bludgeoned her head with rocks and strangled her before hiding her body in a drainage culvert, the court heard.\nJudge Yolanda Curtin sentenced him to life for the first-degree murder conviction, life for the rape charge, and an additional 40 years for a third-degree sex offence and kidnapping.\nVoice recordings of Ms Morin's children, ranging in age from nine to 15, were played for the court.\nAFP via Getty Images Patty Morin shared graphic details of her daughter's death at a White House media briefing in April",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-08-12T02:58:47Z",
    "source": "BBC News"
  },
  {
    "url": "https://keyt.com/news/2025/08/12/nursing-mother-unlawfully-detained-by-ice-attorney-says/",
    "title": "Nursing mother unlawfully detained by ICE, attorney says",
    "summary": "Gloria Contreras Edin and Hannah Brown, who are representing her pro bono, submitted a writ of habeas corpus petition challenging her continued detention.\nI think that’s important,” Contreras Edin said.\nBut an immigration judge reopened her case last year after finding she wasn’t given notice of that court appearance, her attorney said.\nSince then, she has been doing “everything right,” Contreras Edin explained, and filed for asylum, obtained work authorization and has no criminal history.\nContreras Edin described her client as depressed and distraught and said she has to pump breast milk and dump it in the sink.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-12T16:19:36Z",
    "source": "KEYT"
  },
  {
    "url": "https://www.bbc.com/news/articles/cyvnnj301l3o",
    "title": "More foreign criminals to be deported under expanded scheme",
    "summary": "More foreign criminals to be deported under expanded schemeHome Secretary Yvette Cooper says the changes are to prevent criminals from \"exploiting our immigration system\"Home Secretary Yvette Cooper says expansion of the scheme is to prevent foreign criminals from \"exploiting our immigration system\" and \"fast-track\" their removals.\nMore foreign criminals will be deported before their appeals against their removal are heard as the Home Office adds 15 new countries to its \"deport now, appeal later\" scheme.\nForeign Secretary David Lammy welcomed the decision and said the UK was working to increase the number of other countries where foreign criminals can be returned.\n\"Until Keir Starmer either commits to deporting all foreign criminals or stops rolling out the red carpet for migrants the world over, this problem is not going away.\"\nJustice Secretary Shabana Mahmood said that foreign criminals would be sent \"packing\" if they \"abuse our hospitality and break our laws\".",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-11T03:04:00Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/c4g66x4xr6zo",
    "title": "Hundreds march in London urging release of hostages held in Gaza",
    "summary": "Hundreds march in London urging release of hostages held in Gaza3 days ago Share Save Will Vernon BBC News, central London Maia Davies BBC News Share SaveEPAHundreds of pro-Israel demonstrators marched through central London on Sunday, demanding the release of hostages still held in Gaza and to show their support for the country.\nProtesters led by the UK's chief rabbi Sir Ephraim Mirvis and the Jewish direct action group Stop The Hate held Israeli flags and placards showing the faces of hostages.\nReuters Adam Ma'anit said the UK government could do more to help secure the release of hostages still being held in GazaIt is thought 20, of the remaining 50 hostages held in Gaza, are believed to be alive.\nSome protesters held pictures of Evyatar David - the 24-year-old who was shown looking emaciated and weak in a Hamas video released earlier this month, prompting outrage both in Israel and internationally.\nJulie, who did not want to give her second name, told the BBC that \"we need to carry on remembering\" the hostages.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-10T17:37:18Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/videos/rescue-operations-underway-flash-floods-155754093.html",
    "title": "Rescue operations underway after flash floods hit India’s Dharali",
    "summary": "STORY: :: Indian rescue crews step up search operations days after deadly flash floods hit a Himalayan village:: August 10, 2025:: Dharali, IndiaDrone footage showed houses in Dharali village buried in debris, with excavators removing boulders at the site of the mudslide.\nMultiple army personnel, villagers and laborers continue to remain missing, said Indo-Tibetan Border Police Commandant, Bhanu Pratap Singh on Saturday (August 9).\nAdvertisement AdvertisementAdvertisement AdvertisementDharali, a hamlet of about 200 people that stands more than 3,775 ft (1,150 m) above sea level, is a pit-stop for Hindu pilgrims climbing to the temple town of Gangotri.\nSeveral deadly flood disasters have taken place in the mountain range over the past decade or so, which experts have blamed on climate change and widespread developmental activities on its slopes.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-10T15:57:54Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/mexico-city-floods-flights-to-nowhere-airport-flooded-2025-8",
    "title": "Flights to Nowhere After Mexico City Airport Flooded",
    "summary": "Soldiers removed water from a flooded house in Mexico City on Sunday.\nSoldiers removed water from a flooded house in Mexico City on Sunday.\nHenry Romero/REUTERSSoldiers removed water from a flooded house in Mexico City on Sunday.\n\"All impacted customers have been offered alternative travel arrangements and United's service to Mexico City is now on schedule,\" said a United Airlines spokesperson.\nEven for those flights that reached Mexico on Sunday, some passengers were likely to wake up in a different city than expected.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-11T11:45:54Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.bbc.com/news/articles/cly39694g30o",
    "title": "Madonna urges Pope to visit Gaza 'before it's too late'",
    "summary": "Madonna urges Pope to visit Gaza 'before it's too late'1 day ago Share Save Paul Glynn Culture reporter Share SaveGetty Images Madonna released her remix album Veronica Electronica last monthMadonna has urged Pope Leo XIV to visit Gaza and bring his \"light to the children before it's too late\".\n\"Most Holy Father, please go to Gaza and bring your light to the children before it's too late,\" Madonna posted on Instagram.\nLast week the UN's humanitarian agency said the amount of aid entering Gaza continued to be \"far below the minimum required\".\nIn July, the new Pope renewed his call for a Gaza ceasefire after three people sheltering in the Catholic church in Gaza City were killed in an Israeli strike.\nThis includes while performing at London's O2 in 2023, when she told fans: \"It breaks my heart to see children suffering, teenagers suffering, elderly people suffering - all of it is heartbreaking, I'm sure you agree.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-08-12T14:37:56Z",
    "source": "BBC News"
  }
]