[
  {
    "url": "https://nextshark.com/korean-american-researcher-detained-weed-conviction",
    "title": "Korean American researcher held at airport for weeks over decade-old weed conviction",
    "summary": "Korean American researcher held at airport for weeks over decade-old weed convictionA 40-year-old scientist and legal permanent resident has been detained by the U.S. Customs and Border Protection at San Francisco International Airport since July 21.\nAccording to his legal team , he has previously traveled internationally for academic work without incident.\nSince his detention began, he has had almost no communication with family or counsel, and his legal team believes he may now be held at a facility in Arizona.\nAlarming trendKim’s detention comes amid a rise in cases where legal permanent residents are held over minor or decades-old offenses under stricter immigration enforcement.\nThis story is part of The Rebel Yellow Newsletter — a bold weekly newsletter from the creators of NextShark, reclaiming our stories and celebrating Asian American voices.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-06T15:30:53Z",
    "source": "NextShark"
  },
  {
    "url": "https://www.theverge.com/tech/720211/humble-bundle-wb-games-deal-sale",
    "title": "Get Batman: Arkham City, Shadow of Mordor, and 14 more games for $12",
    "summary": "The future of Warner Bros. Games is unclear, as it shut down several studios and canceled anticipated games earlier this year.\nBut there’s no arguing that the company’s back catalog of titles is full of gems, many of which are in Humble’s great $12 bundle.\nThrough August 27th, you can jump on this unbeatable deal that gets you 16 WB Games titles on Steam for just $12, with proceeds going to the Raiden Science Foundation.\nThis bittersweet bundle features an array of licensed and original open-world titles, fighting games, and first-person shooters from WB Games’ studios — most of which have either fallen from grace in recent years or have been shut down.\nOther highlights include Batman: Arkham City, Batman: Arkham Asylum, and the oft-overlooked Mad Max.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-06T20:39:51Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.aljazeera.com/news/2025/8/6/a-migrant-march-in-mexico-continues-despite-scrutiny-of-organisers-arrest",
    "title": "A migrant march in Mexico continues despite scrutiny of organiser’s arrest",
    "summary": "One of the organisers, Luis Garcia Villagran, was detained for alleged human trafficking in the lead-up to the march.\nWednesday’s march set out from the border city of Tapachula, near Guatemala, and nearly 300 migrants, asylum seekers and supporters took part.\nBut the demonstration was overshadowed by the arrest one day earlier of one of its leaders, prominent immigration activist Luis Garcia Villagran.\n“That is the crime,” she said, adding that Garcia Villagran was “not an activist”.\nMujica and Garcia Villagran have both been prominent voices in a movement to make legal immigration pathways more accessible.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-06T23:09:28Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://www.cnn.com/2025/08/05/us/video/us-citizen-arrest-border-patrol-digvid?cid=external-feeds_iluminar_yahoo",
    "title": "WATCH: US citizen, Kenny Laynez-Ambrosio, films his arrest by Border Patrol after being mistaken for a migrant",
    "summary": "How relevant is this ad to you?\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-05T19:27:19Z",
    "source": "CNN"
  },
  {
    "url": "https://www.bbc.com/news/articles/cj3lxzpkn87o",
    "title": "Dharali, Uttarakhand: More than 100 people missing after flash floods hit village",
    "summary": "More than 100 missing after flash floods in India2 days ago Share Save Nitin Ramola Reporting from Uttarkashi Nikita Yadav BBC News, Delhi Share SaveState Disaster Response Force Uttarkashi handout/EPA/Shutterstock Heavy rains and flash floods have caused severe damage in Uttarkashi districtMore than 100 people are missing and at least one has died after devastating flash floods in the northern Indian state of Uttarakhand.\nAbout 190 people have been rescued so far in the affected region, Uttarakhand Chief Minister Pushkar Singh Dhami said.\nNitin Ramola Roads leading to Dharali have been badly damagedDamaged roads and heavy rain have hampered rescue teams trying to reach Dharali.\nWeeks of heavy rain have pounded Uttarakhand, with Uttarkashi - home to Dharali village - among the worst hit by flooding.\nRescue efforts are slow due to heavy sludge and debris, but officials have deployed helicopters to aid operations.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-06T04:54:02Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/congress-member-says-us-push-130751718.html",
    "title": "Lebanese Shiite ministers walk out of a Cabinet meeting over plan to disarm Hezbollah",
    "summary": "BEIRUT (AP) — Shiite members of Lebanon's Cabinet walked out a government meeting on Thursday in protest of a proposed plan to disarm the Hezbollah militant group and political organization.\nThe rest of the Cabinet then voted in favor of the U.S.-backed plan to disarm the group and implement a ceasefire with Israel.\nAdvertisement AdvertisementAdvertisement AdvertisementWhile the Cabinet meeting was still underway, an Israeli strike on the road leading to Lebanon's main border crossing with Syria killed five people and injured 10 others, Lebanon's health ministry said.\nIsrael has accused Hezbollah of trying to rebuild its military capabilities and said it is protecting its border.\nA member of the U.S. Congress said that Washington will push Israel to withdraw from all of southern Lebanon if the Lebanese army asserts full control over the country.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-07T13:07:51Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/videos/ice-agents-detain-purdue-university-033527288.html",
    "title": "ICE agents detain Purdue University student in New York",
    "summary": "27,625 people played the daily Crossword recently.\nCan you solve it faster than others?\n27,625 people played the daily Crossword recently.\nCan you solve it faster than others?",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-08-05T03:35:27Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.aljazeera.com/video/by-the-numbers-3/2025/8/5/whos-seeking-asylum-in-europe-today",
    "title": "Who’s seeking asylum in Europe today?",
    "summary": "More from the same show",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-05T08:51:38Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://www.yahoo.com/news/articles/mexican-ranchers-struggle-adapt-tiny-040908246.html",
    "title": "Mexican ranchers struggle to adapt as a tiny parasite ravages their cattle exports to the US",
    "summary": "This year, Mexican ranchers have exported fewer than 200,000 head of cattle, which is less than half what they historically send in the same period.\nAdvertisement AdvertisementAdvertisement AdvertisementFor Ibarra Vargas, considered a comparatively small rancher by Sonora’s beef-centric standards, the inability to send his calves across the border has made him rethink everything.\nThe repeated bans on Mexican cows by U.S. authorities has pushed his family to branch into beekeeping, raising sheep and selling cow's milk.\nIn the past two months, they’ve sold more than 35,000 mature cows within Mexico at a significant loss.\nAdvertisement AdvertisementAdvertisement AdvertisementSome ranchers have also started retail beef sales through luxury butcher shops referred to as “meat boutiques.\"",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-08-05T04:09:08Z",
    "source": "Yahoo Entertainment"
  }
]