[
  {
    "id": "NDc=",
    "url": "https://www.yahoo.com/news/articles/ice-says-immigrant-died-sprawling-155137623.html",
    "title": "ICE says an immigrant who died in a sprawling Texas detention facility killed himself",
    "summary": "EL PASO, Texas (AP) — An immigrant from Nicaragua was found dead at a Texas immigration detention facility last week, federal officials said.\nVictor Manuel Diaz appears to have killed himself Wednesday at the sprawling tent complex at the U.S. Army's Fort Bill base in El Paso, Immigration and Customs Enforcement said in a statement.\nIt's the same facility where ICE said another detainee died earlier this month as staff members tried to keep him from killing himself.\nDiaz was swept up on Jan. 6 in the federal crackdown on immigration in Minnesota and sent to Texas, ICE said.\nThe detainee said at least one of the guards squeezed an arm around Lunas Campos' neck.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-01-19T15:51:37Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDg=",
    "url": "https://www.yahoo.com/news/articles/trumps-ice-force-sweeping-america-123300893.html",
    "title": "Trump's ICE force is sweeping America. Billions in his tax and spending cuts bill are paying for it",
    "summary": "Swelling ranks of ICE officers, to 22,000, in an expanding national force bigger than most police departments in America.\n“Public sentiment is everything,\" said Rep. Nydia M. Velázquez, D-N.Y., at a press conference at the Capitol with lawmakers supporting legislation to impeach Homeland Security Secretary Kristi Noem.\nHouse Speaker Mike Johnson, R-La., has warned Democrats that this is \"no time to be playing games” by stirring up the opposition to immigration enforcement officers in Minneapolis and other places.\nNoem has said the immigration enforcement officers are acting lawfully.\nThe legislation essentially doubled annual Homeland Security funding, adding $170 billion to be used over four years.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-01-20T12:33:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDk=",
    "url": "https://www.businessinsider.com/immigration-lawyer-ice-raids-advice-for-employers-minneapolis-2026-1",
    "title": "I'm an immigration lawyer in Minneapolis. People are scared — here's what employers and employees should know about their rights.",
    "summary": "There's a huge concentration of ICE enforcement right now in Minnesota, specifically here in the Twin Cities.\nLoan Huynh, an immigration attorney in Minneapolis, said that employees are scared due to ICE actions in the area, while employers are in a difficult position.\nOr if you get a call from one of your employees who says, 'I'm too scared to walk out of my car here.\nIndividuals have constitutional rights, and don't need to succumb to threatsWe're seeing situations where an individual will say, \"I don't want to speak with you,\" or, \"I have counsel.\nThey have constitutional rights that, just because they are being threatened by an individual, don't mean that they have to succumb to those threats or requests.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-01-20T18:32:35Z",
    "source": "Business Insider"
  },
  {
    "id": "NTA=",
    "url": "https://gothamist.com/news/sign-of-the-times-ny-asylum-seekers-arrested-at-routine-immigration-appointments",
    "title": "'Sign of the times': NY asylum-seekers arrested at routine immigration appointments",
    "summary": "Rafael Andres Rubio Bohorquez, a data analyst, was taken into custody Jan. 12, when he appeared for a scheduled asylum interview with U.S.\nCitizenship and Immigration Services, the agency that “oversees lawful immigration to the United States,” according to a lawsuit petitioning for his release.\nBut instead of sitting for the interview, he was arrested by U.S. Immigration and Customs Enforcement officers and whisked into detention, court records show.\nOne of her clients was detained at the New York asylum office in October.\nIn the New York City area, 58% percent of the immigrants arrested by ICE under Trump through mid-October had no criminal history.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2026-01-20T20:32:00Z",
    "source": "Gothamist"
  },
  {
    "id": "NTI=",
    "url": "https://abcnews.go.com/US/ice-detainee-dies-presumed-suicide-texas-detention-facility/story?id=129364093",
    "title": "ICE detainee dies of 'presumed suicide' at Texas detention facility, agency says",
    "summary": "The man was being held in a tent complex at the U.S. Army's Fort Bliss base.\nThis Aug. 7, 2025, satellite image shows construction of large white tents for a new immigrant detention center at Fort Bliss, a U.S. Army base outside El Paso, Texas.\nThis Aug. 7, 2025, satellite image shows construction of large white tents for a new immigrant detention center at Fort Bliss, a U.S. Army base outside El Paso, Texas.\nVictor Manuel Diaz, 36, of Nicaragua, died of a \"presumed suicide\" on Jan. 14 at Camp East Montana, a sprawling tent complex at the U.S. Army's Fort Bliss base in El Paso, ICE said Sunday.\nHe was pronounced dead following life-saving measures by on-site medical staff and El Paso emergency medical services personnel, according to ICE.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-01-20T01:20:29Z",
    "source": "ABC News"
  },
  {
    "id": "NTQ=",
    "url": "https://abcnews.go.com/US/lawyers-allege-dept-homeland-security-denying-legal-counsel/story?id=129335914",
    "title": "Lawyers allege Dept. of Homeland Security is denying legal counsel to Minnesota detainees",
    "summary": "Detainees are being held at the Whipple Federal Building in Minneapolis.\n“ICE agents were physically restricting me from seeing them,” said one immigration attorney, who asked not to be identified.\nREUTERS/Leah Millis Leah Millis/ReutersThe Department of Homeland Security denied that any constitutional violations are taking place at the Whipple Federal Building.\nThe Whipple building has been a primary facility where people detained during DHS' “Operation Metro Surge” are being temporarily held.\nThe immigration attorney also said access to an attorney by phone is different from access to an attorney in person.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2026-01-19T01:22:27Z",
    "source": "ABC News"
  },
  {
    "id": "NTY=",
    "url": "https://www.aljazeera.com/video/the-take-2/2026/1/19/aje-onl-tt_glb_omaryaghi_av_v2-190126",
    "title": "From a refugee family to Nobel Laureate: Omar Yaghi’s story",
    "summary": "Nobel laureate Omar Yaghi on how humble beginnings fueled breakthrough science against the climate crisis.\nNobel Laureate Dr. Omar Yaghi joins The Take after winning the 2025 Nobel Prize in Chemistry for developing metal-organic frameworks (MOFs), materials that can capture carbon and store hydrogen.\nBorn to a Palestinian refugee family in Amman, Yaghi tells the story of how hardship shaped his imagination, from getting fresh water only once a week to inventing systems that pull water from desert air.\nIn this episode:Dr. Omar Yaghi, Nobel Laureate in Chemistry, Professor at University of California, Berkeley and Atoco FounderEpisode credits:This episode was produced by Chloe K. Li and Melanie Marich with Phillip Lanos, Spencer Cline, Tamara Khandaker, Kylene Kiang, Sarí el-Khalili and our host, Malika Bilal.\nThe Take production team is Marcos Bartolomé, Sonia Bhagat, Spencer Cline, Sarí el-Khalili, Tamara Khandaker, Kylene Kiang, Phillip Lanos, Chloe K. Li, Melanie Marich, and Noor Wazwaz.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-01-19T18:47:06Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTc=",
    "url": "https://www.aljazeera.com/news/2026/1/21/us-justice-department-probes-minnesota-officials-amid-migration-raids",
    "title": "US Justice Department probes Minnesota officials amid migration raids",
    "summary": "The investigation will look into whether Minnesota officials blocked federal immigration agents from carrying out their duties.\nThe DOJ probe will review whether Minnesota state officials conspired to obstruct justice by preventing federal immigration officers from carrying out their duties, US broadcaster CBS News reported late on Tuesday.\nGovernor Walz confirmed the DOJ investigation in a statement on Tuesday, describing the move as “political theatre”.\n“This Justice Department investigation, sparked by calls for accountability in the face of violence, chaos and the killing of Renee Good, does not seek justice.\nMinneapolis Mayor Frey described the DOJ investigation as an attempt to intimidate state officials.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-01-21T04:43:15Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTg=",
    "url": "https://www.yahoo.com/news/articles/judge-refuses-block-dhs-policy-231016110.html",
    "title": "Judge refuses to block new DHS policy limiting Congress members' access to ICE facilities",
    "summary": "WASHINGTON (AP) — A federal judge refused Monday to temporarily block the Trump administration from enforcing a new policy requiring a week's notice before members of Congress can visit immigration detention facilities.\nRather, she said, plaintiffs' attorneys representing several Democratic members of Congress used the wrong \"procedural vehicle\" to challenge it.\nShe ruled Dec. 17 that it is likely illegal for ICE to demand a week’s notice from members of Congress seeking to visit and observe conditions in ICE facilities.\nAdvertisement AdvertisementAdvertisement AdvertisementA law bars DHS from using appropriated general funds to prevent members of Congress from entering DHS facilities for oversight purposes.\nGovernment attorneys have said it’s merely speculative for the legislators to be concerned that conditions in ICE facilities change over the course of a week.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-01-19T23:10:16Z",
    "source": "Yahoo Entertainment"
  }
]