[
  {
    "id": "NDc=",
    "url": "https://www.npr.org/2026/02/17/g-s1-110410/homeland-security-department-mclaughlin-departure",
    "title": "Top DHS spokesperson who became a face of Trump immigration policy is leaving",
    "summary": "Top DHS spokesperson who became a face of Trump immigration policy is leavingtoggle caption Jose Luis Magana/APTricia McLaughlin, the assistant secretary for public affairs at the Department of Homeland Security, is leaving the agency, the department confirmed on Tuesday.\nMcLaughlin has become the public face and voice defending the Trump administration's mass deportation policy and immigration tactics over the past year.\nAnd high-ranking immigration officials, including DHS Secretary Kristi Noem, have been summoned to Capitol Hill to testify on the immigration crackdown after immigration agents shot and killed Good and Pretti in Minneapolis.\nBeyond speaking on DHS' immigration initiatives, McLaughlin also fielded interviews and questions about Noem's handling of national disaster relief and resources , and other parts of the sprawling agency.\nHouse Minority Leader Hakeem Jeffries praised news of her departure online; \"Another MAGA extremist forced out of DHS.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-17T17:55:22Z",
    "source": "NPR"
  },
  {
    "id": "NDg=",
    "url": "https://www.npr.org/2026/02/17/nx-s1-5707449/local-police-immigration-cooperation-287g",
    "title": "Little-used ICE agreements with local police have exploded under Trump",
    "summary": "Little-used ICE agreements with local police have exploded under Trumptoggle caption Kayla Bartkowski/Getty ImagesThe use of a federal Immigration and Customs Enforcement program that deputizes local police for immigration enforcement has dramatically expanded under President Donald Trump's second term in office.\nRon DeSantis has effectively required local law enforcement to sign 287(g) agreements with ICE, which netted 40,000 arrests.\nMcLaughlin, the DHS spokesperson, rejected these criticisms: \"Allegations that 287(g) agreements with local law enforcement encourage 'racial profiling' are disgusting and categorically FALSE.\nAbigail Spanberger issued an executive order terminating 287(g) agreements between ICE and state agencies, which included the Virginia Department of Corrections.\nThat bill would prevent state agencies and employees from entering into 287(g) agreements and would end all existing deals by July.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-17T10:00:00Z",
    "source": "NPR"
  },
  {
    "id": "NDk=",
    "url": "https://www.bbc.com/news/articles/cx2d9yk2kpjo",
    "title": "How are UK passport rules changing for British dual nationals?",
    "summary": "Petra has now applied for a UK passport from Spain - but that had its own complications.\n\"They agreed to accept a notarised copy of my German passport so I did not have to send that off, but they also wanted my original citizenship certificate - which I don't have, it's in the UK,\" she explained.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-17T14:17:16Z",
    "source": "BBC News"
  },
  {
    "id": "NTA=",
    "url": "https://www.npr.org/2026/02/18/nx-s1-5699708/ice-observers-impeding-obstructing-interfering",
    "title": "The Trump administration is increasingly trying to criminalize observing ICE",
    "summary": "The Trump administration is increasingly trying to criminalize observing ICEtoggle caption Octavio Jones/AFP via Getty ImagesLike many people in the Twin Cities, Jess has been observing ICE officers: following them in her car and documenting their actions.\nEarlier this month, she was in North Minneapolis, when immigration agents told her and another observer they were impeding a federal investigation.\nFederal agents hopped out.\nNPR spoke with several other observers in Minnesota who said immigration officers told them they were impeding federal investigations.\nStancil has been public about following immigration officers, but he understands why others might feel intimidated.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-18T23:26:43Z",
    "source": "NPR"
  },
  {
    "id": "NTE=",
    "url": "https://www.businessinsider.com/moved-family-to-canada-little-planning-things-wish-i-knew-2026-2",
    "title": "My family moved to Canada with only 3 weeks of planning. It was chaotic, but we're still here 6 years later.",
    "summary": "Just a few weeks earlier, Hurricane Dorian had slammed into our home in the Bahamas, a country I'd lived in my entire life.\nMy family had spent 24 hours trapped in our attic, praying the roof would hold before evacuating to nearby Florida.\nHowever, in the wake of the disaster, the US authorities limited many Bahamians to stays of only a few weeks, our family among them.\nSix years later, I'm confident this move was the best decision we could have made for ourselves and our family.\nHowever, I still tell people, \"Don't move to a new country with only three weeks of planning!\"",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-18T16:24:01Z",
    "source": "Business Insider"
  },
  {
    "id": "NTI=",
    "url": "https://www.npr.org/2026/02/18/g-s1-110537/up-first-newsletter-cbs-anderson-cooper-mark-zuckerberg-iran-nuclear-program-dhs-tricia",
    "title": "Mark Zuckerberg faces a jury today. And, the top DHS spokesperson resigns her post",
    "summary": "Today's top storiesMeta CEO Mark Zuckerberg will take the stand in Los Angeles today in a trial that could reshape social media.\nThe plaintiffs say that the social media sites' impact on children's brains is similar to that of a slot machine and that the companies should be held accountable.\nIf the jury sides with the plaintiffs, the case could result in a multi-billion-dollar settlement and significant changes to social media apps' operations.\nIf they are in the country illegally, ICE will be notified, and they will be held in jail pending ICE removal.\n➡️ The warrant service officer model, similarly to the jail enforcement model, allows police to execute administrative warrants on migrants in their jails.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-18T12:42:06Z",
    "source": "NPR"
  },
  {
    "id": "NTM=",
    "url": "https://abcnews.com/Politics/democrats-send-counteroffer-white-house-dhs-funding-partial/story?id=130231108",
    "title": "Democrats send counteroffer on to White House on DHS funding as partial shutdown continues",
    "summary": "Democrats send counteroffer on to White House on DHS funding as partial shutdown continuesSenate Minority Leader Chuck Schumer speaks to reporters at the Capitol in Washington, Feb. 12, 2026.\nSenate Minority Leader Chuck Schumer speaks to reporters at the Capitol in Washington, Feb. 12, 2026.\nSenate Minority Leader Chuck Schumer speaks to reporters at the Capitol in Washington, Feb. 12, 2026.\nSenate Minority Leader Chuck Schumer speaks to reporters at the Capitol in Washington, Feb. 12, 2026.\nAs the partial government shutdown continues, Democrats have sent their counteroffer to Republicans and the White House -- outlining their demands to fund the Department of Homeland Security and reform the embattled agency.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-17T16:49:14Z",
    "source": "Abcnews.com"
  },
  {
    "id": "NTQ=",
    "url": "https://www.aljazeera.com/opinions/2026/2/19/migrants-are-not-responsible-for-the-uks-healthcare-crisis",
    "title": "Migrants are not responsible for the UK’s healthcare crisis",
    "summary": "This follows new data released by the Centre for Migration Control, suggesting that 752,000 migrants joined the GP register last year.\nBy 1971, about 31 percent of NHS doctors in England were born and qualified overseas.\nIn the 2010s, successive Conservative governments, while overseeing years of austerity and historically low funding growth in the health service, blamed migrants for its woes.\nThus, migrants do pay more to use the National Health Service.\nPerhaps when Britain releases itself from the idea that it is competing with migrants for care, it will realise that migrants are the care.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-19T10:19:23Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTc=",
    "url": "https://www.fox9.com/news/federal-judge-holds-government-attorney-contempt-violation-court-order",
    "title": "ICE in Minnesota: Judge holds government attorney in contempt for violation of court order",
    "summary": "Judge Laura Provinzino found Special Assistant United States Attorney Matthew Isihara in civil contempt during a Wednesday afternoon hearing.\nNo criminal historyThe backstory:The underlying case was filed on behalf of Rigoberto Soto Jimenez.\nAt the Wednesday hearing, Judge Provinzino demanded to know why, nearly a week later, his identification paperwork had not been returned.\nFollowing the contempt ruling, U.S. Attorney Daniel Rosen told the FOX 9 Investigators, \"Judge Provinzino's order is a lawless abuse of judicial power.\"\nThey expect to have the documents in hand on Thursday, and that would nullify any fines imposed by Judge Provinzino.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-02-19T01:42:25Z",
    "source": "FOX 9"
  },
  {
    "id": "NjA=",
    "url": "https://www.aljazeera.com/news/2026/2/17/us-immigration-judge-rejects-trump-bid-to-deport-columbia-student-mahdawi",
    "title": "US immigration judge rejects Trump bid to deport Columbia student Mahdawi",
    "summary": "An immigration judge in the United States has ruled against an attempt under President Donald Trump to deport Mohsen Mahdawi, a Columbia University student arrested last year for his protests against Israel’s genocide in Gaza.\nThe Trump administration attempted to transfer Mahdawi out of state to Louisiana, but a court order ultimately blocked it from doing so.\nMahdawi was ultimately released on April 30, after US Judge Geoffrey Crawford accused the Trump administration of doing “great harm” to someone who had committed no crime.\nIn some cases, the Trump administration has opened investigations into campuses where pro-Palestinian protests were prominent, accusing them of civil rights violations.\nLast July, Columbia University entered into a $200m settlement with the Trump administration, with a further $21m given to end a probe into allegations of religious-based harassment.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-02-17T23:34:29Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NjE=",
    "url": "https://www.snopes.com//fact-check/video-obama-people-pouring-over-border/",
    "title": "Old video of Obama saying US can't have 'half a million people pouring' over border spreads online",
    "summary": "Users who shared the video in January suggested it showed Obama echoing Trump's stance on immigration.\nThe video has been circulating online since 2024 and was previously shared by Elon Musk and others.\nWhile the caption focuses on him talking about the \"half a million people pouring over the border,\" Obama did have more to add.\nIn the video, Obama can be overheard saying the following (emphasis, ours):So this is not going to be a free ride.\nBut they can't have a situation where you just have half a million people pouring over the border without any kind of mechanism to control it.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2026-02-18T12:00:00Z",
    "source": "Snopes.com"
  }
]