[
  {
    "url": "https://www.bbc.com/news/articles/cy8v9jzn5zgo",
    "title": "Epping asylum hotel is a 'feeding ground for unrest'",
    "summary": "Asylum hotel a 'feeding ground for unrest'4 days ago Share Save Daniel Sandford UK correspondent at the High Court and Lewis Adams Essex Share SavePA Media Epping Forest District Council wants The Bell Hotel to be blocked from housing asylum seekersA hotel used by asylum seekers in Essex has become a \"feeding ground for unrest and protest\", the High Court has been told.\nEpping Forest District Council is seeking to block migrants lodging at The Bell Hotel in Epping, which was the scene of vociferous protests over the summer.\nLawyers for the authority accused Somani Hotels of \"sidestepping\" planning laws due to \"the lure of a trove of government-funded profits\".\nThe Home Office, which intervened in the case, argued the closure of asylum hotels must be \"structured\" and gradual.\nRepresenting Somani Hotels, Jenny Wigley KC said the business had been in financial decline \"for many years\".",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-10-15T11:44:34Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.theverge.com/news/801112/judge-orders-chicago-ice-agents-use-body-cams",
    "title": "Judge orders immigration agents in Chicago to use body cams",
    "summary": "He has over 18 years of experience, including 10 years as managing editor at Engadget.\nPosts from this author will be added to your daily email digest and your homepage feed.\nJudge Sara L. Ellis of the Federal District Court for the Northern District of Illinois said during a hearing Thursday morning that she would require ICE agents in Chicago engaged in “Operation Midway Blitz” to use body cameras.\nBut the logistics of enforcing her order are yet to be worked out, since Chicago was not included in earlier ICE body cam programs, and the government shutdown might complicate acquiring and issuing new equipment.\nAgents have been repeatedly documented using aggressive tactics, arresting elected officials, and have been spotted wearing face masks and no identifying badges while detaining people on the streets.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-16T19:08:33Z",
    "source": "The Verge"
  },
  {
    "url": "https://gizmodo.com/border-patrol-responds-like-a-petulant-child-to-controversy-over-its-antisemitic-video-2000673314",
    "title": "Border Patrol Responds Like a Petulant Child to Controversy Over Its Antisemitic Video",
    "summary": "A spokesperson for U.S. Border Patrol has finally issued a statement about the antisemitic social media video that the agency posted in August, but was just deleted this week.\nThe video and the responseThe Border Patrol video was posted months ago but went largely unnoticed by the broader public until Tuesday, when white supremacists on X started to post about it approvingly.\nAfter all the attention the video attracted, it seemed plausible that it had been deleted by Facebook moderators for hate speech violations.\nMeta gave us the run-around and wouldn’t say who had actually deleted the video.\nLast month, Gizmodo emailed the agency to inquire about a bizarre video that DHS had distributed, which featured video and music from Pokémon.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-17T13:20:00Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://abcnews.go.com/US/video/cartels-issuing-bounties-50000-hits-immigration-officials-dhs-126557451",
    "title": "Video Cartels issuing bounties up to $50,000 for hits on immigration officials, DHS says",
    "summary": "Cartels issuing bounties up to $50,000 for hits on immigration officials, DHS says There is credible intelligence that members of Mexican drug cartels have offered a \"tiered\" bounty system for hits against ICE and U.S. Customs and Border Protection officers, according to DHS.",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2025-10-15T18:38:24Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.theverge.com/news/799911/ipad-pro-thread-smart-home-apple-home-hub",
    "title": "The iPad just got the chip it needs to be a smart home controller",
    "summary": "Apple’s new M5-powered iPad Pro is the first iPad to officially support the Thread smart home protocol.\nAnd, if you already have a Thread border router but the power goes out, your iPad can step in to talk to battery-powered Thread devices such as smart locks.\nApple’s HomePod Mini (pictured), HomePod, and select Apple TV devices are Thread-enabled Apple Home hubs.\nWhile we’re all waiting for Apple’s long-rumored HomePod smart display to arrive, bringing back the iPad as a Home hub would be a welcome move.\nHowever, Thread-enabled Home hub capabilities would be more useful on lower-cost models or more compact ones, such as the iPad Mini — using a $1,000 M5 iPad Pro to run your smart home feels like overkill.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-15T19:28:29Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theatlantic.com/newsletters/archive/2025/10/week-of-bigotry-american-politics/684584/",
    "title": "It’s Not a Dog Whistle If Everyone Can Hear It",
    "summary": "Donald Trump’s 2016 campaign of racial grievance enabled him to shift the Court rightward with three new appointments.\nTrump himself has a long history of bigoted remarks, yet he has seized on bigoted comments by Black South Africans to justify inviting white South Africans to seek refuge in the United States.\nThe ability to use offensive language without social sanction is a core appeal of the MAGA movement for some supporters.\nAs The New York Times reports, this might include members of the far-right political party Alternative for Germany, or AfD.\nThe new Tron sequel (out now in theaters) travels beyond cyberspace but won’t leave the sci-fi nonsense behind, David Sims writes.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-16T22:52:00Z",
    "source": "The Atlantic"
  },
  {
    "url": "https://www.newyorker.com/news/the-lede/the-conflict-on-the-streets-of-chicago",
    "title": "The Conflict on the Streets of Chicago",
    "summary": "But it is hard to conclude that the protesters’ resistance constitutes a rebellion or an insurrection.\nTo many Chicagoans, the warlike atmosphere is the result of the increasing aggression of the federal government.\nWorthington, among others, has speculated that Trump is looking for a reason to put Chicago in an even tighter vise than it’s already in.\nSince March, Cohen has grown a sizable social-media following for posts that combine organizing rhetoric and legal and political analysis.\nPeyton was, until recently, a judge for the Chicago Immigration Court; Bondi fired her in early July.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-16T10:00:00Z",
    "source": "The New Yorker"
  },
  {
    "url": "https://www.yahoo.com/news/articles/israel-allow-gazas-rafah-crossing-061841331.html",
    "title": "Israel will allow Gaza's Rafah crossing to open, ramp up aid, broadcaster Kan reports",
    "summary": "JERUSALEM (Reuters) -Israel will allow Gaza's Rafah border crossing with Egypt to open on Wednesday and increase the amount of humanitarian aid coming into the enclave, public broadcaster Kan reported, after Hamas handed over more bodies of deceased hostages.\nSubject to Israel's security approval, Gazans who had left the enclave during the war will be allowed back in for the first time and others will be allowed to cross out through the Rafah crossing, Kan reported.\nSome 600 trucks carrying mainly food and medical supplies, as well as equipment needed for repairing damaged infrastructure, will be allowed in, Kan said.\nHours later Hamas handed four coffins over to Israel through the International Committee of the Red Cross.\nThree have so far been identified as Israeli hostages but there were doubts about the fourth body handed over, Israeli media reported.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-15T06:18:41Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://abcnews.go.com/US/los-angeles-county-declares-state-emergency-immigration-raids/story?id=126531481",
    "title": "Los Angeles County declares state of emergency over immigration raids",
    "summary": "A man waves the American flag in front of LAPD officers during the nationwide No Kings protest in Los Angeles, Calif., on June 14, 2025.\nA man waves the American flag in front of LAPD officers during the nationwide No Kings protest in Los Angeles, Calif., on June 14, 2025.\nLos Angeles County officials voted on Tuesday to declare a state of emergency over ongoing federal immigration raids.\n\"What’s happening in our communities is an emergency — and Los Angeles County is treating it like one,\" said Horvath in a press release.\nICE raids started in Los Angeles early June, prompting demonstrations that at times turned violent.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-10-15T01:21:05Z",
    "source": "ABC News"
  },
  {
    "url": "https://gizmodo.com/border-patrol-posts-instagram-propaganda-video-featuring-antisemitic-slurs-2000672645",
    "title": "Border Patrol Posts Instagram Propaganda Video Featuring Antisemitic Slurs",
    "summary": "A U.S. Border Patrol video featuring antisemitic lyrics went viral on X on Tuesday after far-right users discovered it had been posted to Facebook and Instagram.\nThe antisemitic Border Patrol videoThe video starts with footage of someone adjusting a bodycam before viewers see Border Patrol agents walking around with guns.\nAnother shot shows a truck hauling Border Patrol dune buggies, and then a shot in the desert where a dune buggy kicks up dust behind it.\nGizmodo saved a copy of the Border Patrol video before it was taken down from Instagram and Facebook.\nCorrection: This article originally stated that the Instagram video had been viewed 4.3 million times before it was deleted.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-15T17:40:55Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.cnn.com/2025/10/15/us/13-year-old-detained-ice-boston",
    "title": "Her 13-year-old boy was sent to an ICE detention facility. Now we’re learning more about how it happened",
    "summary": "“I only talk to him – never to any official who could explain what kind of place it is or what’s happening,” Berto told CNN, speaking in Portuguese.\n“Detention violates his right to due process under the Fifth Amendment,” said a habeas corpus petition filed Friday on Arthur’s case.\nHe remained there for more than 100 days before a federal judge ordered him to be released on bail.\nHe was released in May after another federal judge said the administration had failed to provide any evidence that Khan Suri’s detention was necessary.\n“This is my first child case,” Lattarulo told CNN.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-15T18:11:40Z",
    "source": "CNN"
  },
  {
    "url": "https://abcnews.go.com/Health/humanitarian-workers-detail-challenges-aid-gaza-despite-ceasefire/story?id=126524019",
    "title": "Humanitarian workers detail challenges getting aid into Gaza despite ceasefire",
    "summary": "Humanitarian aid workers told ABC News that they will face several challenges in delivering aid to Gaza.\nDrinking water needs to be desalinated, which is accomplished by desalination plants across Gaza, aid workers say.\nPalestinians collect aid parcels from aid trucks which entered from the Karem Abu Salem crossing, in Khan Yunis in the southern Gaza Strip, October 12, 2025.\nAid workers say entire sections in Gaza have been destroyed, making it difficult to find people who may be in need of aid.\n\"It's like being inside the skeleton of a city,\" Ingram said of visiting neighborhoods in Gaza City and Jabalia, just north of Gaza City.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-15T09:04:27Z",
    "source": "ABC News"
  },
  {
    "url": "https://abcnews.go.com/Politics/trump-confirms-authorized-cia-operations-venezuela-land-strikes/story?id=126563281",
    "title": "Trump confirms he's authorized CIA operations in Venezuela, looking into land strikes",
    "summary": "President Donald Trump speaks during a press conference in the Oval Office of the White House, October 15, 2025 in Washington.\nPresident Donald Trump speaks during a press conference in the Oval Office of the White House, October 15, 2025 in Washington.\nPresident Donald Trump speaks during a press conference in the Oval Office of the White House, October 15, 2025 in Washington.\nPresident Donald Trump speaks during a press conference in the Oval Office of the White House, October 15, 2025 in Washington.\nPresident Donald Trump on Wednesday confirmed he had authorized CIA action in Venezuela, and indicated his administration is exploring land strikes inside the South American country.",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2025-10-15T21:56:19Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/mahmoud-khalil-freely-travel-around-214723511.html",
    "title": "Mahmoud Khalil can freely travel around US as he fights his deportation case, judge rules",
    "summary": "NEW YORK (AP) — A federal judge has lifted travel restrictions for Mahmoud Khalil, allowing the Palestinian activist to speak at rallies and other events across the U.S. as he fights his deportation case brought by the Trump administration.\nKhalil, who was freed from a Louisiana immigration jail in June, had asked a federal magistrate judge to lift the restrictions that limited his travel to New York, New Jersey, Washington, D.C., Louisiana and Michigan.\nHammer granted the government’s request that Khalil alert U.S. Immigration and Customs Enforcement about his travel plans ahead of time.\nAdvertisement AdvertisementAdvertisement AdvertisementAfter missing the birth of his first child, he was released from the immigration jail in June by a separate federal judge.\nLast month, an immigration judge in Louisiana ruled that Khalil could be deported for failing to disclose information on his green card application.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-16T21:47:23Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://gizmodo.com/welcome-to-the-jobless-growth-economy-2000673236",
    "title": "Welcome to the ‘Jobless Growth’ Economy",
    "summary": "America is entering an era of “jobless growth,” according to analysts at Goldman Sachs.\nThe memo, written by economists David Mericle and Pierfrancesco Mei and spotted by Fortune, warns that the current market of “modest job growth alongside robust GDP growth” is likely the new normal going forward.\nThe thing about senior roles is that you need people with experience to fill them.\nThat hasn’t materialized even a little thus far, but the idea that it will has severely messed up the job market.\nOne thing is for sure: AI is going to be transformative for the economy.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-10-17T12:30:59Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.bbc.com/news/articles/cr43l19qn3ko",
    "title": "South Africa's Operation Dudula: The anti-migrant movement blocking foreigners from healthcare",
    "summary": "Two men wearing white T-shirts emblazoned with the slogan \"Operation Dudula – Mass Deportation\" were stationed at the entrance.\nDespite this being a potential flashpoint, there was a strange calmness and resignation as people knew that Operation Dudula activists had been violent in the past.\n\"As South Africans, we would come to the clinic, only to find that the medication we need is not available.\nSeveral major political parties, including the Economic Freedom Fighters and the Democratic Alliance, have also condemned Operation Dudula.\nSeveral Operation Dudula members have been arrested in recent weeks for blocking the entrances of public health facilities.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-10-17T23:45:08Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/justice-department-hiring-lawyers-decline-data-controversies-2025-10",
    "title": "The Trump administration wants to hire hundreds of new government lawyers. It's off to a slow start.",
    "summary": "The decline is notable because these roles typically represent the lion's share of legal muscle in US attorneys' offices and because the Trump administration has called for increasing hiring of assistant US attorneys.\nThe administration has proposed hiring more than 400 additional attorneys in the US Attorneys' Offices, bringing the total to 6,144.\nSome people who led or worked in US Attorneys' Offices said new hires are unlikely to be involved in such controversies.\nOnly a few new lawyer hires in US attorneys' offices are earmarked for immigration and border-related prosecutions.\nSeveral former prosecutors told Business Insider they're still encouraging young lawyers to seek out work in US attorneys' offices.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-10-16T18:25:31Z",
    "source": "Business Insider"
  },
  {
    "url": "https://abcnews.go.com/US/appeals-court-declines-lift-order-blocking-trump-deploying/story?id=126599445",
    "title": "Appeals court declines to lift order blocking Trump from deploying National Guard in Illinois, finding scant evidence of 'rebellion'",
    "summary": "Members of the Texas National Guard stand guard at an army reserve training facility on October 07, 2025 in Elwood, Illinois.\nMembers of the Texas National Guard stand guard at an army reserve training facility on October 07, 2025 in Elwood, Illinois.\nMembers of the Texas National Guard stand guard at an army reserve training facility on October 07, 2025 in Elwood, Illinois.\nMembers of the Texas National Guard stand guard at an army reserve training facility on October 07, 2025 in Elwood, Illinois.\nMembers of the Texas National Guard stand guard at an army reserve training facility on October 07, 2025 in Elwood, Illinois.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-17T00:44:32Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cpv1nk7dy4yo",
    "title": "Eleven killed after Israel hits bus in Gaza, Hamas-run civil defence says",
    "summary": "Eleven killed after Israel hits bus in Gaza, Hamas-run civil defence saysThe Israeli military said soldiers had fired at a \"suspicious vehicle\" that had crossed the so-called yellow line demarcating the area still occupied by Israeli forces in Gaza.\nGaza's Hamas-run civil defence says 11 people were killed, all from the same family, after the bus they were in was hit by an Israeli tank shell in northern Gaza.\nCivil defence spokesman Mahmud Bassal told AFP news agency the victims were killed while \"trying to check on their home\" in the area.\nIsraeli Defence Minister Israel Katz said on Friday the army would set up visual signs to indicate the location of the line.\nAs part of the US-brokered ceasefire deal, Israel freed 250 Palestinian prisoners in Israeli jails and 1,718 detainees from Gaza.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-10-18T14:39:50Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.usatoday.com/story/opinion/columnist/2025/10/15/ice-chicago-mike-johnson-violence/86694002007/",
    "title": "ICE shot a praying pastor with pepper balls. Top Republican says it's fine. | Opinion",
    "summary": "The House speaker was asked this question on Oct. 14: “We’ve seen images out of Chicago of federal agents shooting faith leaders with pepper balls and arresting journalists.\nI'm a teacher in Chicago: The only war here is the one the president is waging against us | OpinionICE agents shot projectiles at a pastor.\nIn September, ICE agents fired pepper balls and hit the Rev.\nWithout any warning, and without any order or request that I and others disperse, I was suddenly fired upon by ICE officers.\nLook, I realize this might sound controversial, but I’m firmly on the side of those who consider it bad to shoot priests in the head with pepper balls.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-15T16:35:26Z",
    "source": "USA Today"
  }
]