[
  {
    "id": "MzM=",
    "url": "https://www.wired.com/story/minnesota-sues-to-stop-ice-invasion/",
    "title": "Minnesota Sues to Stop ICE ‘Invasion’",
    "summary": "The 80-page complaint, filed in US district court in Minnesota, targets the US Department of Homeland Security and senior federal officials, including DHS secretary Kristi Noem.\nAt a press conference Monday afternoon, Minnesota attorney general Keith Ellison said the lawsuit is intended to stop what he described as an unlawful federal escalation.\nEllison said that the killing, along with subsequent federal rhetoric, left families and entire communities feeling unsafe in public spaces.\nShe was fatally shot by an ICE officer during a Minneapolis enforcement operation on January 7.\nPlaintiffs argue the federal operation violates the Tenth Amendment, federal administrative law, and long-standing limits on immigration enforcement.",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2026-01-12T22:42:45Z",
    "source": "Wired"
  },
  {
    "id": "MzQ=",
    "url": "https://www.npr.org/2026/01/12/nx-s1-5675315/minnesota-sues-to-block-trump-immigration-crackdown",
    "title": "Minnesota officials sue to block Trump's immigration crackdown as enforcement intensifies",
    "summary": "Minnesota officials sue to block Trump's immigration crackdown as enforcement intensifiestoggle caption John Locher/APMINNEAPOLIS — State officials are suing the Trump administration over the widespread immigration operation taking place across the Minneapolis region.\nMore than 2,000 federal immigration agents are in Minnesota, and that number is expected to increase.\nSponsor MessageThose were some of the questions federal immigration agents asked Joel Keleekai as he was charging his Tesla in a parking lot.\nBut the Trump administration has appeared to have shifted its tactics and, in Minnesota, become even more aggressive with its immigration crackdown.\nIllinois and the city of Chicago also took legal action Monday against the Trump administration over its immigration enforcement actions.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-12T23:51:04Z",
    "source": "NPR"
  },
  {
    "id": "MzU=",
    "url": "https://www.yahoo.com/news/articles/opinion-immigration-policy-collides-schools-184542249.html",
    "title": "Opinion: When Immigration Policy Collides With Schools, Students and the Community Suffer",
    "summary": "The answer, according to new research, is that the fear is already everywhere — even in schools where no enforcement actions have occurred.\nThe results are staggering: 70% report that students from immigrant families are expressing fear about their safety and their families’ well-being.\nNearly two-thirds report students missing school due to immigration policies and rhetoric.\nMinneapolis just demonstrated what happens when immigration policy collides with the school day: canceled classes, traumatized students and staff, a community in crisis.\nWhat is America going to do to keep young people safe — and build schools into the communities of belonging that every student deserves?",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-01-12T18:45:42Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzY=",
    "url": "https://www.npr.org/2026/01/11/nx-s1-5666843/venezuelas-exiles-in-chile-caught-between-hope-and-uncertainty",
    "title": "Venezuela's exiles in Chile caught between hope and uncertainty",
    "summary": "Venezuela's exiles in Chile caught between hope and uncertaintytoggle caption JAVIER TORRES/AFP via Getty ImagesSANTIAGO, Chile — Early last Saturday morning, Chile's capital awoke to the sound of jubilant cheers echoing between the tower blocks.\nNews had filtered through from Caracas of the U.S. operation to seize President Nicolás Maduro, and Chile's sizable Venezuelan diaspora could barely contain its joy.\n\"When they report crimes on the news, they only say the nationality of the perpetrator if they're foreign, installing a negative perception around Venezuelan migration,\" said Montesinos.\nKast has mooted detention facilities, border walls and ditches to halt illegal migration; and aggressive policies to pursue, detain and deport illegal migrants.\nSponsor MessageBut while uncertainty remains for many, nostalgia for Venezuela has got many in the diaspora in Chile dreaming of a return home.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-11T11:00:00Z",
    "source": "NPR"
  },
  {
    "id": "Mzc=",
    "url": "https://abcnews.go.com/US/driver-shot-portland-immigration-operation-charged-assault-doj/story?id=129135791",
    "title": "Driver shot during Portland immigration operation charged with assault: DOJ",
    "summary": "A photo posted to X by Attorney General Pamela Bondi, Jan. 12, 2025, with a caption stating that it is a damaged Border Patrol vehicle.\nA photo posted to X by Attorney General Pamela Bondi, Jan. 12, 2025, with a caption stating that it is a damaged Border Patrol vehicle.\nA photo posted to X by Attorney General Pamela Bondi, Jan. 12, 2025, with a caption stating that it is a damaged Border Patrol vehicle.\nA photo posted to X by Attorney General Pamela Bondi, Jan. 12, 2025, with a caption stating that it is a damaged Border Patrol vehicle.\nA Border Patrol agent then fired their service weapon twice at the driver of the truck, according to statements from Border Patrol agents, the complaint said.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-12T18:51:08Z",
    "source": "ABC News"
  },
  {
    "id": "Mzg=",
    "url": "https://www.yahoo.com/news/articles/know-warrants-most-immigration-agents-001021882.html",
    "title": "What to know about the warrants most immigration agents use to make arrests",
    "summary": "At the heart of the debate is a legal distinction largely unfamiliar to the public but central to immigration enforcement.\nHere is what to know about the limitations on the warrants that authorize most immigration related arrests.\nTypically, arrests carried out by Department of Homeland Security agencies are authorized by administrative warrants — sometimes known as immigration warrants — not judicial warrants.\nThat means people can legally refuse federal immigration agents entry into private property if the agents only have an administrative warrant.\nThe trainings also typically emphasize that an immigrant can refuse to open the door if law enforcement only has an administrative warrant.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-01-13T00:10:21Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mzk=",
    "url": "https://www.npr.org/2026/01/10/nx-s1-5673229/ice-protests-minneapolis-portland",
    "title": "Nationwide anti-ICE protests call for accountability after Renee Good's death",
    "summary": "Nationwide anti-ICE protests call for accountability after Renee Good's deathtoggle caption Spencer Platt/Getty ImagesPeople took to the streets in cities across the country this weekend to protest the Trump administration's immigration enforcement tactics following the death of Renee Good in Minneapolis, a 37-year-old woman who was shot and killed by a U.S. Immigration and Customs Enforcement (ICE) officer last week.\nSponsor MessagePeople demonstrated outside of hotels where ICE agents were believed to be staying.\nHomeland Security Secretary Kristi Noem on Sunday said the agency was sending \"hundreds more\" federal agents to Minneapolis Sunday and Monday to protect ICE agents.\nGood was killed the day after DHS launched a large-scale immigration enforcement operation in Minnesota set to deploy 2,000 immigration officers to the state.\nThere were no arrests during the protests, a spokesperson for the Metropolitan Police Department told NPR on Sunday.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-11T03:07:01Z",
    "source": "NPR"
  },
  {
    "id": "NDA=",
    "url": "https://www.bbc.com/news/articles/cly9n3r2p7zo",
    "title": "Hungary grants asylum to Polish ex-justice minister Zbigniew Ziobro",
    "summary": "Hungary grants asylum to Polish ex-justice minister2 days ago Share Save Adam Easton BBC News Warsaw correspondent Share SaveReuters Zbigniew Ziobro says he is a victim of political persecutionHungary has granted political asylum to Poland's former Justice Minister Zbigniew Ziobro who is facing charges of embezzlement.\nZiobro was justice minister between 2015 and 2023 under the previous right-wing PiS-led government, which is politically aligned to Hungarian Prime Minister Viktor Orban.\nWriting on X, Ziobro said: \"I have decided to accept the asylum granted to me by the government of Hungary due to the political persecution in Poland.\"\nI stand in opposition to a creeping dictatorship,\" Ziobro added, accusing Prime Minister Donald Tusk of waging a \"vendetta\" against him.\nZiobro is also accused of awarding Justice Fund grants to fire stations and women's associations without proper competition to bolster support for the government.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-12T13:57:56Z",
    "source": "BBC News"
  },
  {
    "id": "NDE=",
    "url": "https://www.yahoo.com/news/articles/minnesota-democrats-demanding-broader-investigation-171516735.html",
    "title": "Video captures Minneapolis immigration arrest in a city on edge after shooting of Renee Good",
    "summary": "In a dramatic scene similar to those playing out across Minneapolis, agents captured a man in the home just minutes after pepper spraying protesters outside who had confronted the heavily armed federal agents.\nVideo of the clash taken by The Associated Press showed some agents pushing back protesters while a distraught woman later emerged from the house with a document that federal agents presented to arrest the man.\nSigned by an immigration officer, the document — unlike a warrant signed by a judge — does not authorize forced entry into a private residence.\nA warrant signed by an immigration officer only authorizes arrest in a public area.\n“We’re seeing a lot of immigration enforcement across Minneapolis and across the state, federal agents just swarming around our neighborhoods,” said Jason Chavez, a Minneapolis city councilmember.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-01-11T17:15:16Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDI=",
    "url": "https://www.wired.com/story/what-to-do-if-ice-invades-your-neighborhood/",
    "title": "What to Do if ICE Invades Your Neighborhood",
    "summary": "If federal immigration agents are coming to your area—or have already arrived—you may be frantically making plans to lay low at home, or perhaps grabbing your whistle and lacing up your sneakers to join a neighborhood watch.\nOn Wednesday, a federal agent shot and killed 37-year-old Minneapolis resident and US citizen Renee Nicole Good in her car during an Immigration and Customs Enforcement (ICE) operation.\n\"There are now more ICE agents in Minnesota than there are combined in Minneapolis police force and St. Paul police force,” Minnesota Senator Amy Klobuchar said on Friday.\nNumerous sources told WIRED that their trainings and materials about interacting with federal immigration agents are actively evolving to reflect the current moment.\nBut this type of information, while still accurate, does not fully account for the chaotic intensity of current US immigration enforcement.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-01-13T10:30:00Z",
    "source": "Wired"
  },
  {
    "id": "NDM=",
    "url": "https://www.npr.org/sections/the-picture-show/2026/01/12/g-s1-105725/in-photos-a-week-of-protests-against-ice",
    "title": "In photos: A week of protests against ICE",
    "summary": "In photos: A week of protests against ICEtoggle caption Ben Hovland/MPRFollowing last week's fatal shooting of Renee Macklin Good, a 37-year-old woman in Minneapolis by an Immigration and Customs Enforcement officer, protests have continued to grow across the United States.\nNPR station photographers and freelance photographer Evan Frost have been on the ground over the past week documenting actions in Minneapolis, as well as Washington, D.C., Texas, Connecticut, and Massachusetts.\ntoggle caption Ben Hovland/MPRtoggle caption Evan Frost for NPRtoggle caption Evan Frost for NPRtoggle caption Tyrone Turner/WAMUtoggle caption Tyrone Turner/ WAMUtoggle caption Tyrone Turner/WAMUtoggle caption Ben Hovland/MPRtoggle caption Ben Hovland/MPRtoggle caption Mark Mirko/Connecticut Publictoggle caption Mark Mirko/Connecticut Publictoggle caption Mark Mirko/Connecticut Publictoggle caption Mark Mirko/Connecticut Publictoggle caption Lorianne Willett/KUT Newstoggle caption Lorianne Willett/KUT Newstoggle caption Lorianne Willett/KUT Newstoggle caption Robin Lubbock/WBURtoggle caption Evan Frost for NPR",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-12T23:45:00Z",
    "source": "NPR"
  },
  {
    "id": "NDQ=",
    "url": "https://abcnews.go.com/US/mamdani-outraged-after-new-york-city-council-employee/story?id=129149275",
    "title": "Mamdani 'outraged' after New York City Council employee detained by ICE",
    "summary": "New York City Mayor Zohran Mamdani speaks during a press conference at Grand Army Plaza in the Brooklyn borough of New York, on Jan. 2, 2026.\nNew York City Mayor Zohran Mamdani speaks during a press conference at Grand Army Plaza in the Brooklyn borough of New York, on Jan. 2, 2026.\nNew York City Mayor Zohran Mamdani speaks during a press conference at Grand Army Plaza in the Brooklyn borough of New York, on Jan. 2, 2026.\nNew York City Mayor Zohran Mamdani speaks during a press conference at Grand Army Plaza in the Brooklyn borough of New York, on Jan. 2, 2026.\nA New York City Council employee was detained during a \"routine\" immigration appointment on Long Island on Monday, according to city officials, who called the incident an \"egregious government overreach.\"",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-01-13T01:01:26Z",
    "source": "ABC News"
  },
  {
    "id": "NDU=",
    "url": "https://www.usatoday.com/story/news/nation/2026/01/13/michigan-ceo-resigns-minneapolis-anti-ice-protest/88155675007/",
    "title": "Michigan CEO resigns after remarks at Minneapolis anti-ICE protest",
    "summary": "ETA video circulating online shows a Michigan man shouting, “We executed one of you yesterday” at an anti-ICE protest in Minneapolis — the day after a mother of three was fatally shot in the head by an immigration agent in Minnesota.\nWe need the backup.”\"All you liberal, commie mother (expletive), keep your hands to yourself or you're going to get hurt today, alright?\nOn Jan. 10, Scott announced on LinkedIn that he had resigned as CEO and founder of Harmony Investment Group, a Troy-based private health care investment firm and search fund platform.\nThe footage of Scott’s remarks has drawn criticism online, with many users posting disapproval and negative comments on his social media accounts and LinkedIn.\nThe Detroit Free Press reached out to Scott, Harmony Investment Group and Scott’s former business partner for comment, but had not received responses as of publication.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-01-13T11:33:26Z",
    "source": "USA Today"
  },
  {
    "id": "NDY=",
    "url": "https://abcnews.go.com/US/live-updates/minneapolis-ice-shooting-live-updates/?id=129124338",
    "title": "Minneapolis ICE shooting live updates: 'No basis' for civil rights probe, DOJ says",
    "summary": "Joe Thompson, first assistant to the U.S. attorney speaks at a press conference, December 18, 2025 in Minneapolis, Minnesota.\nJoe Thompson, first assistant to the U.S. attorney speaks at a press conference, December 18, 2025 in Minneapolis, Minnesota.\nJoe Thompson, first assistant to the U.S. attorney speaks at a press conference, December 18, 2025 in Minneapolis, Minnesota.\nJoe Thompson, first assistant to the U.S. attorney speaks at a press conference, December 18, 2025 in Minneapolis, Minnesota.\nProtesters in Minneapolis continue to hit the streets and demand justice as ICE continues its operations.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2026-01-12T12:26:48Z",
    "source": "ABC News"
  }
]