[
  {
    "url": "https://www.bbc.com/news/articles/c2dnk0ee6pyo",
    "title": "Trump authorises National Guard deployment to Chicago",
    "summary": "Trump authorises deployment of 300 National Guard troops to Chicago2 days ago Share Save Christal Hayes Share SaveWatch: Protesters face off with ICE agents in Chicago, IllinoisUS President Donald Trump has authorised the deployment of 300 US troops to Chicago, to address what he said was out-of-control crime.\nA federal judge in Portland, Oregon, had temporarily blocked the deployment of troops there - though it appears to have tried to overcome this.\nOregon Governor Tina Kotek, a Democrat, applauded the court's decision and said that she hoped Trump respects the order and halts the deployment.\nTrump said on Monday that he would consider invoking the Insurrection Act to use the military if federal courts stopped his deployment of National Guard troops to US cities.\nMeanwhile, California's Governor Gavin Newsom said Trump had ordered 300 National Guard troops in California to deploy to Oregon after the judge's order.",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2025-10-05T01:31:08Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/using-helicopters-chemical-agents-immigration-194640056.html",
    "title": "Using helicopters and chemical agents, immigration agents become increasingly aggressive in Chicago",
    "summary": "Activists, residents and leaders say increasingly combative tactics used by federal immigration agents are sparking violence and fueling neighborhood tensions in the nation’s third-largest city.\nUsed initially to manage protesters, agents used it this week on city streets and during immigration operations, according to ICIRR.\nHowever, activists said immigration agents caused the multi-vehicle crash and detained the woman, who is a U.S. citizen.\nCivil rights organizations have blasted aggressive tactics by agents, while village officials have launched three separate criminal investigations against federal agents.\nAlso pending is an expected ruling on alleged violations of a 2022 consent decree on how federal immigration agents can make arrests in six states including Illinois.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-10-05T19:46:40Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/c740elm70z7o",
    "title": "Judge blocks Trump from sending National Guard from California to Portland",
    "summary": "Judge blocks Trump from sending troops from California to PortlandWatch: Federal officers and protesters face off outside Portland ICE facilityTrump has also authorised the deployment of National Guard troops from other states to Chicago, Illinois.\nThe decision late on Sunday came after the same court denied Trump's attempt to deploy Oregon's own National Guard members to Portland.\nA US federal judge has temporarily blocked President Donald Trump's administration from deploying National Guard troops from Texas and California to Portland, Oregon.\nJudge Immergut, who was appointed by Trump, said there was no evidence that recent protests in the city made the presence of federalised National Guard troops necessary.\nThe National Guard is the primary combat reserve of the Army and Air Force.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-06T00:24:34Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/c78nr234v5mo",
    "title": "A deserted rail station on Trump's route to peace where global interests collide",
    "summary": "\"We are on the Trump route, also known as Crossroads of Peace, the Silk Road, and the Zangezur Corridor,\" says Marut Vanyan, a local journalist.\nTrump's intervention could reshape the geopolitics of a region that Russia claims as its sphere of influence.\nMarut Vanyan stands close to the Aras river that separates Armenia from IranA future Trump route promises both \"unimpeded connectivity\" for Azerbaijan and \"full respect\" for Armenia's sovereignty.\nBoth nations' leaders say the Washington meeting has restored peace in their region and praise Trump's intervention as a game changer.\nThe Aras River that separates the Islamic Republic and Armenia is the very line the route is set follow.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-05T23:43:19Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/jensen-huang-nvidia-ceo-sponsor-h1bs-memo-2025-10",
    "title": "Nvidia will foot the bill for Trump's new visa fees. Here's what CEO Jensen Huang told staff.",
    "summary": "Nvidia CEO Jensen Huang told staff that the company will continue to sponsor H-1B visas and cover all associated costs following President Donald Trump's executive order last month that imposed a $100,000 fee on each new application.\nHuang reiterated his earlier support for the changes and shared personal reflections on immigration in the internal message, which Business Insider viewed.\n\"As one of many immigrants at Nvidia, I know that the opportunities we've found in America have profoundly shaped our lives,\" he wrote.\nIt's also one of the top sponsors of H-1B visas in the tech industry, with roughly 1,500 approvals in 2025.\nIf you have any questions about H-1B visas, please reach out to NVIDIA-Immigration.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-07T16:36:05Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.bbc.com/news/articles/c1792qwg85qo",
    "title": "H-1B visa fee: India wants to lure back its best minds from the US, but it won't be easy",
    "summary": "\"I've always wanted to start something of my own, but my immigration status in the US limited that freedom,\" Mr Hassan told the BBC.\nIn just the last six months, more than 200 NRIs [non-resident Indians] have reached out to explore return options,\" said Mr Hassan.\nTrump's $100,000 H-1B visa shock: Why US may lose more than India Other headhunters who scout for Indian talent from US universities corroborate this change in sentiment.\n\"The government will have to go out and actually identify individuals - including top-of-the-line scientists, professionals and entrepreneurs - it wants back.\nThat requires effort, and it needs to come straight from the top,\" Mr Baru told the BBC.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-05T22:52:47Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/india-issues-e-arrival-card-191807917.html",
    "title": "India Issues New ‘E-Arrival Card’ Required For All International Travelers — What To Know",
    "summary": "Since October 1, international travelers entering India are now required to complete a mandatory digital entry form with their personal details and contact information.\nKnown as the “E-Arrival Card,” the disembarkation form asks for a foreigner’s name, passport information, and the purpose of their visit.\nThe new E-Arrival Card must be completed and submitted at least 72 hours before getting to India.\n“A digital-first initiative by the Bureau of Immigration to simplify the arrival process and enhance the passenger experience, the e-Arrival card facility eliminates paper-based arrival cards, reducing queues and saving time for foreign travelers.”What Else Should Visitors Know About The New E-Arrival Card And Traveling To India?\nThe post India Issues New ‘E-Arrival Card’ Required For All International Travelers — What To Know appeared first on Travel Noire.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-06T19:18:07Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/videos/c1dqldyqx54o",
    "title": "'I can never be complete again', says mother of Nova festival victim",
    "summary": "Two years have passed since the Hamas attack on the Nova music festival, where hundreds of people were killed after fighters stormed the site.\nOn 7 October, Hamas gunmen crossed the border from Gaza and attacked dozens of sites killing around 1,200 people and taking more than 200 others hostage.\nBereaved families and survivors have gathered at the former festival site which has now been transformed into a memorial - garnished with flowers, tributes and candles.\n\"I can never be happy again\", said Orit Baron, the mother of Yuval Baron who was killed alongside her fiancé Moshe Shuva.\nAt least 67,173 people have been killed in Israel's subsequent military campaign in Gaza, according to the Hamas-run health ministry.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-07T15:46:32Z",
    "source": "BBC News"
  }
]