[
  {
    "url": "https://gizmodo.com/the-dhs-wants-you-to-forget-that-anakin-skywalker-also-descended-into-fascism-2000641374",
    "title": "The DHS Wants You to Forget That Anakin Skywalker Also Descended Into Fascism",
    "summary": "Darth Vader is the villain in Star Wars.\n“Not to spoil the plot, but as any Star Wars fans knows, Darth Vader is also Anakin Skywalker,” the DHS statement read.\nOutside of the wild stretch of assuming the American public understands that Darth Vader is Anakin Skywalker and that Skywalker is a hero, there is a lot to unpack here.\nAlso, we’d venture to guess most people who aren’t Star Wars fans don’t know about any of that.\nThe U.S. government has a long history of not really understanding Star Wars going back to Ronald Reagan’s use of the term in his defense platform.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-11T16:31:06Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.thedailybeast.com/maga-couple-regrets-trump-vote-after-terrifying-border-patrol-stop/",
    "title": "MAGA Couple Regrets Trump Vote After Terrifying Border Patrol Stop",
    "summary": "Two Trump voters allege that Border Patrol agents racially profiled them after they were stopped and questioned on the way to the dentist.\nGeorge told a San Diego NBC affiliate that the SUV put on a siren, pulled them over, and a group of masked Border Patrol agents got out to question them.\nIn a video of the interaction, a Border Patrol agent questions George through the car window.\nThe Border Patrol agent who questioned the Doliez's pulled down his mask during the questioning, but did not detail why he had reasonable suspicion to question the couple.\nBorder Patrol agents search George and Esmeralda Doilez's car at a camping site near San Diego.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-11T16:40:18Z",
    "source": "Daily Beast"
  },
  {
    "url": "https://www.bbc.com/news/articles/c04r5y5xv11o",
    "title": "Posing as a migrant to infiltrate a cross-Channel gang",
    "summary": "Here, one of our reporters who assumed a false identity and posed as a migrant, describes how he met one of the gang's senior members in a secret forest hideout.\nI have, at most, three hours of battery life left, and I need to get to the smuggler's secret camp, meet him, and get out safely.\nWith gang members monitoring everyone who enters the forest, I worry my advisers may end up exposing me rather than protecting me.\nI walk down a path to the smugglers' camp trying to remember the way I came in.\nIn person in the forest, Abdullah appears friendlier than most of the smugglers I have encountered.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-08-10T05:00:06Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cm2klzxldl6o",
    "title": "North Korea dismantles propaganda speakers at border",
    "summary": "North Korea dismantles propaganda speakers at border3 days ago Share Save Alex Kleiderman BBC News Share SaveAFP via Getty ImagesSouth Korea's military says North Korea has begun removing some of the loudspeakers used to broadcast propaganda across the border between the two countries.\nSouth Korean broadcasts had often featured K-pop songs and news reports while the North played unsettling noises, such as howling animals.\nIn a statement on Saturday, South Korea's military said it had \"detected North Korean troops dismantling propaganda loudspeakers in some parts along the front line from this morning\".\nBut speaking after South Korea suspended its broadcasts in June, organisations advocating to improve the human rights of North Koreans criticised the move.\nKIM JAE-HWAN/AFP via Getty Images South Korea began taking down some of its own speakers this week",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-08-09T12:34:26Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cyvnnj301l3o",
    "title": "More foreign criminals to be deported under expanded scheme",
    "summary": "More foreign criminals to be deported under expanded schemeHome Secretary Yvette Cooper says the changes are to prevent criminals from \"exploiting our immigration system\"Home Secretary Yvette Cooper says expansion of the scheme is to prevent foreign criminals from \"exploiting our immigration system\" and \"fast-track\" their removals.\nMore foreign criminals will be deported before their appeals against their removal are heard as the Home Office adds 15 new countries to its \"deport now, appeal later\" scheme.\nForeign Secretary David Lammy welcomed the decision and said the UK was working to increase the number of other countries where foreign criminals can be returned.\n\"Until Keir Starmer either commits to deporting all foreign criminals or stops rolling out the red carpet for migrants the world over, this problem is not going away.\"\nJustice Secretary Shabana Mahmood said that foreign criminals would be sent \"packing\" if they \"abuse our hospitality and break our laws\".",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-11T03:04:00Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/c4g66x4xr6zo",
    "title": "Hundreds march in London urging release of hostages held in Gaza",
    "summary": "Hundreds march in London urging release of hostages held in Gaza2 days ago Share Save Will Vernon BBC News, central London Maia Davies BBC News Share SaveEPAHundreds of pro-Israel demonstrators marched through central London on Sunday, demanding the release of hostages still held in Gaza and to show their support for the country.\nProtesters led by the UK's chief rabbi Sir Ephraim Mirvis and the Jewish direct action group Stop The Hate held Israeli flags and placards showing the faces of hostages.\nReuters Adam Ma'anit said the UK government could do more to help secure the release of hostages still being held in GazaIt is thought 20, of the remaining 50 hostages held in Gaza, are believed to be alive.\nSome protesters held pictures of Evyatar David - the 24-year-old who was shown looking emaciated and weak in a Hamas video released earlier this month, prompting outrage both in Israel and internationally.\nJulie, who did not want to give her second name, told the BBC that \"we need to carry on remembering\" the hostages.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-10T17:37:18Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/south-koreas-military-says-north-083410087.html",
    "title": "South Korea's military says North Korea is removing speakers from their tense border",
    "summary": "SEOUL, South Korea (AP) — South Korea’s military said Saturday it detected North Korea removing some of its loudspeakers from the inter-Korean border, days after the South dismantled its own front-line speakers used for anti-North Korean propaganda broadcasts, in a bid to ease tensions.\nSouth Korea’s Joint Chiefs of Staff didn’t disclose the sites where the North Koreans were removing speakers and said it wasn’t immediately clear whether the North would take all of them down.\nIn recent months, South Korean border residents have complained that North Korean speakers blasted irritating sounds, including howling animals and pounding gongs, in a tit-for-tat response to South Korean propaganda broadcasts.\nSouth Korea’s military began removing its speakers from border areas on Monday but didn't specify how they would be stored or whether they could be quickly redeployed if tensions flared again.\nSouth Korea’s previous conservative government resumed daily loudspeaker broadcasts in June last year, following a yearslong pause, in retaliation for North Korea flying trash-laden balloons toward the South.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-09T08:34:10Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/videos/rescue-operations-underway-flash-floods-155754093.html",
    "title": "Rescue operations underway after flash floods hit India’s Dharali",
    "summary": "STORY: :: Indian rescue crews step up search operations days after deadly flash floods hit a Himalayan village:: August 10, 2025:: Dharali, IndiaDrone footage showed houses in Dharali village buried in debris, with excavators removing boulders at the site of the mudslide.\nMultiple army personnel, villagers and laborers continue to remain missing, said Indo-Tibetan Border Police Commandant, Bhanu Pratap Singh on Saturday (August 9).\nAdvertisement AdvertisementAdvertisement AdvertisementDharali, a hamlet of about 200 people that stands more than 3,775 ft (1,150 m) above sea level, is a pit-stop for Hindu pilgrims climbing to the temple town of Gangotri.\nSeveral deadly flood disasters have taken place in the mountain range over the past decade or so, which experts have blamed on climate change and widespread developmental activities on its slopes.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-10T15:57:54Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/mexico-city-floods-flights-to-nowhere-airport-flooded-2025-8",
    "title": "Flights to Nowhere After Mexico City Airport Flooded",
    "summary": "Soldiers removed water from a flooded house in Mexico City on Sunday.\nSoldiers removed water from a flooded house in Mexico City on Sunday.\nHenry Romero/REUTERSSoldiers removed water from a flooded house in Mexico City on Sunday.\n\"All impacted customers have been offered alternative travel arrangements and United's service to Mexico City is now on schedule,\" said a United Airlines spokesperson.\nEven for those flights that reached Mexico on Sunday, some passengers were likely to wake up in a different city than expected.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-11T11:45:54Z",
    "source": "Business Insider"
  }
]