[
  {
    "id": "Mzg=",
    "url": "https://www.bbc.com/news/articles/c5yvvjw8pdvo",
    "title": "From Venezuela to immigration, Project 2025 provided Trump's roadmap",
    "summary": "The 2025 US National Security Strategy identifies China as a leading adversary and, in a section on the Western Hemisphere, states: \"The choice all countries should face is whether they want to live in an American-led world of sovereign countries and free economies or in a parallel one in which they are influenced by countries on the other side of the world.\"",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-22T00:02:26Z",
    "source": "BBC News"
  },
  {
    "id": "Mzk=",
    "url": "https://abcnews.com/Politics/americans-oppose-tactics-ice-enforce-immigration-laws-21/story?id=130280899",
    "title": "Americans oppose the tactics ICE is using to enforce immigration laws by 2:1 margin: Poll",
    "summary": "By a 2-to-1 margin, Americans oppose the tactics ICE is using to enforce immigration laws, 62% to 31%.\nBy a 13-point margin, Americans oppose abolishing ICE, 50% to 37%.\nOpinions are polarized: 7 in 10 Democrats support abolishing ICE, while 8 in 10 Republicans oppose it.\nMore than 4 in 10 Americans say they are \"not concerned\" or \"concerned but not upset\" over the situation in Minnesota.\nEvan Vucci/APBy an 8-point margin, Americans oppose denying federal funds to so-called sanctuary cities that limit their cooperation with ICE, 46% to 38%.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-20T11:03:50Z",
    "source": "Abcnews.com"
  },
  {
    "id": "NDE=",
    "url": "https://guessingheadlights.com/ice-agent-stopped-for-dui-asks-deputy-are-you-haitian-then-things-got-worse/",
    "title": "ICE Agent Stopped for DUI Asks Deputy: ‘Are You Haitian?’—Then Things Got Worse",
    "summary": "‘Are You Haitian?’: Agent Questions Deputy’s Nationality During StopThe encounter was already tense from the first words captured on bodycam.\nStruggling Sobriety Tests and a Plea Over CustodyThe video shows Deiseroth struggling with basic coordination tasks like walking in a straight line and reciting numbers.\nDeiseroth was booked into the Monroe County Jail on misdemeanor charges of driving under the influence and resisting without violence.\nAt the time the footage was released, Deiseroth remained on administrative leave pending the outcome of that review.\nSources: WPEC, NBC 6 South Florida, Florida Keys Weekly Newspapers",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-02-20T16:15:58Z",
    "source": "Guessingheadlights.com"
  },
  {
    "id": "NDI=",
    "url": "https://www.11alive.com/video/news/protests-grow-after-savannah-teacher-killed-in-ice-involved-car-chase/85-38b6a548-b918-4b85-8b8d-951c41ba4954",
    "title": "Protests grow after Savannah teacher killed in ICE-involved car chase",
    "summary": "Next up in 5Example video title will go here for this video",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-20T14:41:58Z",
    "source": "11Alive.com WXIA"
  },
  {
    "id": "NDM=",
    "url": "https://www.yahoo.com/news/articles/ice-begins-purchase-warehouses-owners-130708782.html",
    "title": "ICE begins to purchase warehouses, but some owners are backing out of deals",
    "summary": "In some cases, warehouse owners are refusing to sell.\nFloridaA TV reporter in Orlando spotted private contractors and federal officials last month touring a 439,945-square-foot (40,872-square-meter) industrial warehouse.\nAdvertisement AdvertisementPlans also are in the works to convert a warehouse in Oakwood into an ICE processing facility, Republican U.S. Rep. Andrew Clyde said in a statement, although no deed has been filed.\nKelly Ayotte sparred with federal officials after ICE disclosed plans to spend $158 million to convert a warehouse in Merrimack into a 500-bed processing center.\nThe announcement came just two days after ICE said it had made a “mistake” when it previously announced the purchase.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-21T13:07:08Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDY=",
    "url": "https://www.cbsnews.com/news/asylum-seeker-work-permits-trump-administration-restrictions/",
    "title": "Trump administration unveils plans to dramatically restrict work permits for asylum-seekers",
    "summary": "The Trump administration on Friday formally proposed a regulation that would dramatically restrict work permits for asylum-seekers, confirming a CBS News report about a plan to upend longstanding U.S. immigration policy.\nThat has generally allowed asylum applicants to request a work permit 150 days after they make their claim.\nBut a proposed Trump administration regulation unveiled Friday would suspend the acceptance of asylum work permit applications until U.S.\nCBS News revealed in June 2025 that Trump administration officials were developing a regulation to pause asylum-related work permits and impose stricter eligibility requirements for them.\nUnder the Trump administration, USCIS has severely tightened immigration programs, affecting broad swaths of immigrants, legal and illegal alike.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-20T20:17:27Z",
    "source": "CBS News"
  }
]