[
  {
    "id": "MzY=",
    "url": "https://www.npr.org/2026/02/23/nx-s1-5719485/italy-migrants-milan",
    "title": "In the shadow of the Olympics, migrants search for a welcome in Milan",
    "summary": "In the shadow of the Olympics, migrants search for a welcome in Milantoggle caption Valerio Muscella for NPRMILAN — Three Afghan men stand together in the freezing fog outside of Milan's central train station on a recent night — their first moments in Italy.\ntoggle caption Valerio Muscella for NPR\"Milan is and wants to be an open city — open to the world and to change,\" says Lamberto Bertolé, Milan's commissioner for health and welfare.\ntoggle caption Valerio Muscella for NPRThese efforts have reduced the number of people arriving in Italy by sea compared to 2023.\ntoggle caption Valerio Muscella for NPRFor some in the room this is a second attempt at settling in a European country.\ntoggle caption Valerio Muscella for NPRtoggle caption Valerio Muscella for NPRtoggle caption Valerio Muscella for NPR\"Imagine, after taking a very long time to get to your dream country and, to be told that you will be deported back to your home country after fighting for years to get here,\" she says.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-23T13:25:36Z",
    "source": "NPR"
  },
  {
    "id": "Mzg=",
    "url": "https://www.bbc.com/news/articles/c5yvvjw8pdvo",
    "title": "From Venezuela to immigration, Project 2025 provided Trump's roadmap",
    "summary": "The 2025 US National Security Strategy identifies China as a leading adversary and, in a section on the Western Hemisphere, states: \"The choice all countries should face is whether they want to live in an American-led world of sovereign countries and free economies or in a parallel one in which they are influenced by countries on the other side of the world.\"",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-22T00:02:26Z",
    "source": "BBC News"
  },
  {
    "id": "NDE=",
    "url": "https://www.npr.org/2026/02/24/nx-s1-5723914/ice-iran-deporatation-adoption-adoptee-veteran",
    "title": "A U.S. veteran adopted an orphan from Iran. Decades later, ICE is trying to deport her",
    "summary": "Decades later, ICE is trying to deport hertoggle caption Stella Kalinina for NPRAdopted from Iran at age two, she takes great pride in her quintessential American upbringing.\ntoggle caption Stella Kalinina for NPRShe's terrified to be deported to Iran given her father's military service and her Christian faith.\nIt's unclear exactly how many adoptees are in the same vulnerable position as the California woman.\ntoggle caption Stella Kalinina for NPRAdoptees have been deported in the past, often because a crime triggered their removal.\nThe California woman firmly believes that her parents took the necessary steps to naturalize her.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-24T11:00:00Z",
    "source": "NPR"
  },
  {
    "id": "NDI=",
    "url": "https://www.yahoo.com/news/articles/ice-begins-purchase-warehouses-owners-130708782.html",
    "title": "ICE begins to purchase warehouses, but some owners are backing out of deals",
    "summary": "In some cases, warehouse owners are refusing to sell.\nFloridaA TV reporter in Orlando spotted private contractors and federal officials last month touring a 439,945-square-foot (40,872-square-meter) industrial warehouse.\nAdvertisement AdvertisementPlans also are in the works to convert a warehouse in Oakwood into an ICE processing facility, Republican U.S. Rep. Andrew Clyde said in a statement, although no deed has been filed.\nKelly Ayotte sparred with federal officials after ICE disclosed plans to spend $158 million to convert a warehouse in Merrimack into a 500-bed processing center.\nThe announcement came just two days after ICE said it had made a “mistake” when it previously announced the purchase.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-21T13:07:08Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDM=",
    "url": "https://www.aljazeera.com/features/2026/2/24/yemens-mogadishu-somali-refugees-face-poverty-instability-in-aden",
    "title": "Yemen’s ‘Mogadishu’: Somali refugees face poverty, instability in Aden",
    "summary": "Aden, Yemen – Lying on the outskirts of Yemen’s interim capital, Aden, al-Basateen district starts where the paved roads end, stretching into narrow, sandy alleyways.\nIt reveals a decades-old refugee story in which Arabic blends with Somali and the faces harbour memories of a different place, across the sea.\nToday, local sources estimate the district’s population at more than 40,000, with people of Somali origin making up the majority.\nSome arrived as children holding the hands of relatives, while others were born in Aden and have known no other home.\nA mother of four, she was born in Aden to Somali parents.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-02-24T19:12:47Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDQ=",
    "url": "https://abcnews.com/US/maryland-sues-trump-administration-stop-construction-ice-detention/story?id=130426708",
    "title": "Maryland sues Trump administration to stop construction of ICE detention facility",
    "summary": "Maryland is suing the Trump administration to stop the construction of an immigration detention facility in the state, according to a complaint filed Monday.\n\"The Trump Administration will stop at nothing to pursue its extreme immigration agenda -- including breaking the law,\" Brown said in a statement.\nThe lawsuit says the purchase is part of a broader \"mass immigration detention scheme\" to convert warehouses across the country into detention centers as part of the administration's immigration crackdown.\n\"Defendants are purchasing warehouses across the country and seeking to retrofit them into immigration detention and processing centers that can hold tens of thousands of immigrants,\" the lawsuit states.\n“These will not be warehouses -- they will be very well-structured detention facilities meeting our regular detention standards,\" the statement said.",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2026-02-24T01:16:57Z",
    "source": "Abcnews.com"
  },
  {
    "id": "NDU=",
    "url": "https://www.yahoo.com/news/articles/maryland-sues-trump-administration-halt-212045952.html",
    "title": "Maryland sues Trump administration to halt construction of ICE facility",
    "summary": "By Jasper WardWASHINGTON, Feb 23 (Reuters) - Maryland Attorney General Anthony Brown said on Monday that the state had filed a lawsuit against the ‌Trump administration to halt construction of a new federal immigration detention center ‌in the state.\nAdvertisement AdvertisementThe Trump administration, according to Maryland's attorney general and government, purchased the property without conducting an environmental ‌review or receiving public input.\nThis would ​increase Immigration and Customs Enforcement's (ICE) total bed capacity ​to 92,600 at its detention ​centers.\nThere are currently more than 200 federal immigration detention centers in ‌the United States.\nThe move to increase ​detention centers in states ​across the U.S. states has been met with some bipartisan criticism.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-02-23T21:20:45Z",
    "source": "Yahoo Entertainment"
  }
]