[
  {
    "id": "NDY=",
    "url": "https://www.bbc.com/news/articles/cwyg2629g7do",
    "title": "Napier Barracks in Folkestone used for housing asylum seekers shuts",
    "summary": "Barracks used for housing asylum seekers closesThe site closed on Friday and will be handed over to a property developer for housing.\nNapier Barracks in Folkestone - a former military site - opened as accommodation for migrants in 2020.\nAn army barracks in Kent which has been used to house asylum seekers has closed, according to the Home Office.\nThe government had previously announced discussions had begun to use barracks in Crowborough in East Sussex and Inverness in Scotland to house about 900 male asylum seekers in total.\nNapier Barracks housed more than 300 asylum seekers at its peak, but was believed to have fewer than 100 residents ahead of its closure.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NDc=",
    "url": "https://www.yahoo.com/news/articles/ice-says-agent-fired-shots-223429583.html",
    "title": "ICE says an agent fired shots at a migrant who hit him and another agent with his SUV in Minnesota",
    "summary": "Last week, ICE agents and protesters clashed in neighboring Minneapolis.\nSt. Paul police said in a statement that they were called to the area by reports of shots being fired, only to learn that the ICE agent had fired the shots.\nICE agents saw the man getting into his SUV and approached the vehicle, McLaughlin said, identifying themselves as ICE agents.\nHe rammed his SUV into an ICE vehicle, striking the second agent, prompting the shots, which did not hit him, she said.\nAfter ramming another ICE vehicle, the man got out of his SUV and attempted to flee into his apartment, but agents brought him to the ground, McLaughlin said.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NDk=",
    "url": "https://abcnews.go.com/US/wireStory/ice-agent-fires-shots-man-after-hit-suv-128604749",
    "title": "ICE agent fires shots at man after being hit by SUV",
    "summary": "The man also bit an ICE agent as officers subdued him outside his apartment.\nSt. Paul police said in a statement that they were called to the area by reports of shots being fired, only to learn that the ICE agent had fired the shots.\nICE agents saw the man getting into his SUV and approached the vehicle, McLaughlin said, identifying themselves as ICE agents.\nHe rammed his SUV into an ICE vehicle, striking the second agent, prompting the shots, which did not hit him, she said.\nAfter ramming another ICE vehicle, the man got out of his SUV and attempted to flee into his apartment, but agents brought him to the ground, McLaughlin said.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NTA=",
    "url": "https://www.bbc.com/news/articles/cgex0lyl9dgo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "title": "Boy, 12, arrested over Swale council damage after refugee debate",
    "summary": "Boy, 12, arrested over damage after refugee debate\"Deliberate flooding caused water to pour through the ceiling,\" Swale Borough Council saysA 12-year-old boy has been arrested after a council had to close its office due to vandalism.\nKent Police said the boy, from Sittingbourne, was arrested on Tuesday on suspicion of criminal damage and later bailed.\nThe arrest followed reports to police of criminal damage after people in the public gallery disrupted a Swale Borough Council debate on 10 December about making the area a \"district of sanctuary\" for refugees.\nThe council later said its East Street, Sittingbourne, office was unable to open the following day as toilets and a lift were damaged, and \"deliberate flooding caused water to pour through the ceiling in several areas\".",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NTE=",
    "url": "https://www.jezebel.com/trump-admin-stops-reuniting-immigrant-children-families-orr-vetting-data-family-separation",
    "title": "Trump Admin Has Abruptly Stopped Reuniting Immigrant Children with Their Families",
    "summary": "Since the advent of the second Trump administration, though, that’s just what the ORR has increasingly become, according to former staffers.\nRoughly 2,400 kids are in ORR shelters of this sort at the moment, with the largest concentration of more than 800 in Texas.\nStill, up until November, kids were still being reunited with family members by ORR on a daily basis.\nEight immigration attorneys contacted for the piece agreed, saying that starting in early November, ORR stopped responding to letters and communications demanding the release of children to qualified sponsors.\nEven when threatened with litigation, ORR hasn’t explained to these attorneys why the kids aren’t being released.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NTI=",
    "url": "https://www.yahoo.com/news/videos/burundi-overwhelmed-tens-thousands-flee-170833505.html",
    "title": "Burundi 'overwhelmed' as tens of thousands flee eastern Congo",
    "summary": "NBA fines Nuggets coach David Adelman $35K for erupting at officials, leading to ejection in loss to RocketsDavid Adelman charged at an official and screamed, “You are f***ing terrible, man!” loud enough to be heard clearly on the broadcast on Saturday night.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NTM=",
    "url": "https://www.npr.org/2025/12/18/nx-s1-5648584/judge-hannah-dugan-guilty-obstruction-ice",
    "title": "A federal jury finds Milwaukee judge guilty of obstructing immigration agents",
    "summary": "A federal jury finds Milwaukee judge guilty of obstructing immigration agentstoggle caption Adela Tesnow/Pool via APMILWAUKEE — A federal jury found Milwaukee County Circuit Court Judge Hannah Dugan guilty Thursday of obstructing immigration agents as they attempted to arrest an undocumented immigrant defendant last April.\nFlores-Ruiz, a Mexican national, was arrested outside the courthouse after a short chase by the immigration agents and has since been deported.\nDuring the trial, federal agents testified Dugan seemed \"angry\" when she approached them in the public hallway where they were waiting to arrest Flores-Ruiz after his hearing.\nSponsor MessageDuring the government's closing argument, Assistant U.S. Attorney Kelly Watzka said Dugan conducted a \"round-up\" of federal agents and sent them to the chief judge's office.\nUntil President Trump's first term, courthouses were typically off-limits to federal authorities, including immigration agents.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NTQ=",
    "url": "https://www.npr.org/2025/12/19/nx-s1-5649339/trump-suspends-u-s-green-card-lottery-after-brown-university-and-mit-shootings",
    "title": "Trump suspends U.S. green card lottery after Brown University and MIT shootings",
    "summary": "Trump suspends U.S. green card lottery after Brown University and MIT shootingstoggle caption Mark Schiefelbein/APPresident Donald Trump suspended the green card lottery program on Thursday that allowed the suspect in the Brown University and MIT shootings to come to the United States.\nSponsor MessageNeves Valente, 48, is suspected in the shootings at Brown University that killed two students and wounded nine others, and the killing of an MIT professor.\nNearly 20 million people applied for the 2025 visa lottery, with more than 131,000 selected when including spouses with the winners.\nSponsor MessageTrump has long opposed the diversity visa lottery.\nHe has not been deterred if they are enshrined in law, like the diversity visa lottery, or the Constitution, as with a right to citizenship for anyone born on U.S. soil.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NTU=",
    "url": "https://www.desertsun.com/story/news/crime_courts/2025/12/19/indio-police-investigate-crash-involving-ice-agents-in-indio/87852401007/",
    "title": "ICE agents involved in crash in Indio, ICE also active in Palm Springs",
    "summary": "Federal agents conducting immigration enforcement recently swept across multiple Coachella Valley cities, officials said Friday, Dec. 19.\n\"ICE has been very active in our city over the last few days,\" Palm Springs Police Chief Andy Mills said in a video posted on social media.\n\"We've actually spoken with ICE agents and let them know we are not assisting them in any way shape or form.\"\nHe also specified that Indio Police was not involved in any ICE enforcement or investigative activity but merely had provided an emergency response to the crash.\nSam Morgen covers the city of Palm Springs for The Desert Sun.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NTY=",
    "url": "https://www.aljazeera.com/news/2025/12/19/tens-of-thousands-flee-dr-congo-to-burundi-after-rebel-takeover-of-key-city",
    "title": "Tens of thousands flee DR Congo to Burundi amid rebel takeover of key city",
    "summary": "UN refugee agency says women and children arriving ‘exhausted and severely traumatised’ after fleeing eastern DRC.\nThe UN refugee agency (UNHCR) said on Friday that Burundi had reached a “critical point” amid the influx of refugees and asylum seekers fleeing a surge in violence in the DRC’s South Kivu province.\nRefugees started crossing into Burundi on December 5, with numbers surging after M23 seized control of Uvira on December 10.\nIn Burundi, displaced families face difficult conditions at transit points and makeshift camps with minimal infrastructure, the UN said.\nThe rebel advance has given M23 control over substantial territory in the mineral-rich eastern DRC and severed a critical supply route for Congolese forces along the border with Burundi.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NTc=",
    "url": "https://www.theatlantic.com/family/2025/12/immigration-pronatalism-trump-vance/685275/",
    "title": "The Truth About Immigration That MAGA Doesn’t Acknowledge",
    "summary": "(My toddler son has only ever been cared for by immigrant women, myself among them.)\nWhen fewer immigrants are in the American workforce, economic research suggests, women may work less or have fewer babies—possibly both.\nSome researchers anticipate that the Trump administration’s ICE operations will affect immigrant child-care workers even more than Secure Communities did.\nThe relationship between affordable child care and fertility is fuzzy; many countries with subsidized day care and other benefits for parents nevertheless have low birth rates.\nBut some data suggest that as child care gets more expensive or less available, women have fewer kids.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NTg=",
    "url": "https://www.thedailybeast.com/minneapolis-police-chief-eviscerates-ice-goons-for-dragging-woman-down-the-street-christmas/",
    "title": "Police Chief Eviscerates ICE Goons for Dragging Woman Down Street",
    "summary": "A Minnesota police chief used a church pulpit to denounce President Donald Trump’s immigration raids amid outrage over ICE agents dragging an apparently pregnant woman down a snowy street.\nShe’s pregnant!” Another screamed, “Get her off of her f---ing stomach.”The woman was dragged down the street by two ICE agents as they sprayed CS gas at bystanders.\nThe woman was then dragged by one arm, as bystanders threw snowballs and demanded she be let go, as ICE agents fired pepper spray into the crowd.\nMinnesota Rep. Ilhan Omar has said ICE agents pulled over her 20-year-old U.S.-citizen son and demanded his passport.\nCommunity members hold banners as they show up to a press conference to demand accountability after ICE agents were spotted staging in a parking lot in Minneapolis.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NjA=",
    "url": "https://www.businessinsider.com/us-visa-requirements-social-media-review-what-to-know-h1b-2025-12",
    "title": "US Reviewing Socials of Some Visa Applicants. What You Should Know.",
    "summary": "Impact LinkThe United States is reviewing the social media accounts of some visa applicants, adding another hurdle for workers and other visitors to clear under the Trump administration.\nThe State Department said in June that certain visa applicants would have their online activity vetted as part of its screening process.\nConsular offices began conducting online presence reviews for H-1B applicants on December 15, but they're not the only ones affected.\nThose companies and many others are still smarting after Trump imposed the $100,000 fee on new H-1B visa applicants in September.\nThe widespread panic in corporate America forced the Trump administration to clarify that the fee would only apply to new visa applicants, not existing visa holders.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  }
]