[
  {
    "url": "https://www.bbc.com/news/articles/cy50yk5kvxno",
    "title": "'I was ready to die for the Taliban – teenagers must be careful who they trust’",
    "summary": "Maiwand Banayee Shamshato camp after Friday prayers in 1997Mr Banayee says that he felt increasingly vulnerable and helpless in Shamshato.\nBut after a few months in the Taliban, Mr Banayee says he started to question the path he was on.\nAfter two years, in 2004, Mr Banayee says he went to Ireland, which also rejected his claim for asylum.\nMr Banayee was allowed to stay and later became an Irish citizen.\nTerence White/AFP via Getty Images The Afghan civil war that uprooted Mr Banayee led many others in Kabul to flee their homes too",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2025-10-11T02:32:46Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.wired.com/story/happy-gilmore-producer-buys-spyware-maker-nso-group/",
    "title": "'Happy Gilmore' Producer Buys Spyware Maker NSO Group",
    "summary": "Under pressure from the Department of Justice, Apple removed a series of apps from its iOS App Store this month related to monitoring US Immigration and Customs Enforcement activity and archiving content related to ICE's actions.\nEach week, we round up the security and privacy news we didn’t report in depth ourselves.\nUse of mercenary spyware has increased within some US federal government agencies since the beginning of the Trump administration.\nWorkers have been moved to agencies including Immigration and Customs Enforcement, Customs and Border Protection, and the Federal Protective Service.\nUS Immigration and Customs Enforcement inked a $825,000 contract in May with TechOps Specialty Vehicles (TOSV), a Maryland-based company that manufactures equipment and vehicles for law enforcement.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-11T10:30:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.cnn.com/2025/10/10/travel/eu-entry-exit-system-explained",
    "title": "EES explained: The EU’s Entry/Exit system will change Europe travel rules.",
    "summary": "This will be done by capturing the biometric data of visitors — just as other countries, including the US, already do.\nThe system should be simple, checking faces and fingerprints against the biometric data already on record.\nThe first time a traveler encounters the system, they will have their photo and fingerprints taken, and passport data recorded.\nIf you have a biometric passport and there are E-gates at your border crossing, you should be able to enter with that.\nLegal residents will already have had their biometric data captured as part of the residency process.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-10-13T07:31:46Z",
    "source": "CNN"
  },
  {
    "url": "https://uk.news.yahoo.com/raf-spy-planes-patrol-russian-163011714.html",
    "title": "RAF spy planes patrol Russian border in response to Putin’s ‘hybrid war’",
    "summary": "Two RAF surveillance planes were deployed on a 12-hour mission to patrol Nato’s eastern frontier.\nThe RAF said the operation involved an RC-135 Rivet Joint electronic intelligence surveillance aircraft and a P-8A Poseidon maritime patrol aircraft.\nIt was a response to recent incursions into Nato airspace by Russian drones and fighter jets.\nBoth RAF aircraft were purpose-built for intelligence gathering.\nOn Sept 14, a Russian Geran drone strayed into Romanian airspace near Ukraine’s southern border, while on Sept 19, three Russian MiG-31 fighter jets violated Estonian airspace before circling for 12 minutes.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-11T16:30:11Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/retiring-early-guatemala-cheaper-healthcare-2025-10",
    "title": "I decided to retire early in Guatemala. I'm only getting half my pension, but the lower cost of healthcare makes it worth it.",
    "summary": "But because of the fact that I was not eligible for social security, I was only able to receive half of my pension.\nI will get the other half about six years from now when I turn 65, or whenever I choose to also tap into my social security.\nThere is no way in heck I wanted to be teaching up until I was 65 and then immediately go on social security.\nI have seen too many teachers where they're holding on until they turn 65, and then they're going to retire and go on social security, and six months later they're six feet under.\nIf there is an emergency, they're going to run over to that border before they dial 911 in the United States.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-12T10:39:01Z",
    "source": "Business Insider"
  }
]