[
  {
    "url": "https://www.bbc.com/news/articles/c4gerg74y71o",
    "title": "'People are angry': Behind the wave of asylum hotel protests",
    "summary": "The case has sparked a wider conversation about the effect of housing asylum seekers in hotels in communities across Britain.\nOne of the asylum seekers says that living in a hotel room 24 hours a day is messing with his mind.\nAsylum seekers would say they are seeking protection by coming to the UK, although some are ultimately judged not to be eligible for asylum status.\nThat comment, \"I don't know who they are\", lies at the heart of the opposition to asylum seekers in these communities.\nEpping Forest District Council's Conservative Leader, Chris Whitbread recently said that \"it is important to be transparent\" about asylum hotel information.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-08T23:03:08Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/hunger-disease-spreading-war-torn-150926777.html",
    "title": "Hunger and disease spreading in war-torn Sudan, WHO says",
    "summary": "LONDON (Reuters) -Hunger and disease are spreading in war-torn Sudan, with famine already present in several areas, 25 million people acutely food insecure and nearly 100,000 cholera cases recorded since last July, the World Health Organisation said on Friday.\n\"Relentless violence has pushed Sudan's health system to the edge, adding to a crisis marked by hunger, illness and despair,\" WHO Senior Emergency Officer Ilham Nour said in a statement.\nAdvertisement AdvertisementAdvertisement Advertisement\"Exacerbating the disease burden is hunger,\" she said, adding that about 770,000 children under 5 years old are expected to suffer from severe acute malnutrition this year.\nCholera has also hit a camp for Darfur refugees in neighbouring eastern Chad, the United Nations refugee agency said on Friday.\n(Reporting by Matthias Williams and Lewis Macdonald Editing by Miranda Murray)",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-08-08T15:09:26Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/cm2klzxldl6o",
    "title": "North Korea dismantles propaganda speakers at border",
    "summary": "North Korea dismantles propaganda speakers at border1 day ago Share Save Alex Kleiderman BBC News Share SaveAFP via Getty ImagesSouth Korea's military says North Korea has begun removing some of the loudspeakers used to broadcast propaganda across the border between the two countries.\nSouth Korean broadcasts had often featured K-pop songs and news reports while the North played unsettling noises, such as howling animals.\nIn a statement on Saturday, South Korea's military said it had \"detected North Korean troops dismantling propaganda loudspeakers in some parts along the front line from this morning\".\nBut speaking after South Korea suspended its broadcasts in June, organisations advocating to improve the human rights of North Koreans criticised the move.\nKIM JAE-HWAN/AFP via Getty Images South Korea began taking down some of its own speakers this week",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-08-09T12:34:26Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/congress-member-says-us-push-130751718.html",
    "title": "Lebanese Shiite ministers walk out of a Cabinet meeting over plan to disarm Hezbollah",
    "summary": "BEIRUT (AP) — Shiite members of Lebanon's Cabinet walked out a government meeting on Thursday in protest of a proposed plan to disarm the Hezbollah militant group and political organization.\nThe rest of the Cabinet then voted in favor of the U.S.-backed plan to disarm the group and implement a ceasefire with Israel.\nAdvertisement AdvertisementAdvertisement AdvertisementWhile the Cabinet meeting was still underway, an Israeli strike on the road leading to Lebanon's main border crossing with Syria killed five people and injured 10 others, Lebanon's health ministry said.\nIsrael has accused Hezbollah of trying to rebuild its military capabilities and said it is protecting its border.\nA member of the U.S. Congress said that Washington will push Israel to withdraw from all of southern Lebanon if the Lebanese army asserts full control over the country.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-07T13:07:51Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/trump-tariffs-latest-updates",
    "title": "The bulk of Trump's tariffs are finally here. We broke down what the latest updates mean for you.",
    "summary": "Trump has said the long-term benefits of tariffs will be worth some short-term pain.\nHere's where it all stands now that the bulk of Trump's big tariffs are finally in place.\n10% baseline tariff on most imports started in AprilThe 10% baseline tariff Trump announced on April 2 remains in effect for most countries.\nBessent said Trump's 145% tariff on Chinese goods would decrease to 30% for 90 days.\nChina, in turn, said it would lower its tariffs on American goods to 10% from 125% over the same time period.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-08-07T16:07:52Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/h-1b-visa-big-tech-immigration-green-card-2025-8",
    "title": "H-1B Visa: 7 Current or Ex Big Tech Workers Share Immigration Stories",
    "summary": "Business Insider spoke to seven current or former H-1B recipients who moved from India and found work in Big Tech.\nI've seen misconceptions about the H-1B visa that it is replacing US jobs.\nI also get paid similarly to my US colleagues, so I don't think it's fair to say H-1B visa holders are cheap labor.\nI kicked off the process for my Optional Practical Training and received my H-1B visa in the lottery on my first try.\nI relied on my employer for my H-1B visa status and was cautious of not violating my immigration status.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-08T04:05:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://abcnews.go.com/US/ice-detainee-found-hanging-neck-detention-facility-agency/story?id=124445669",
    "title": "ICE detainee found hanging by neck in detention facility, agency says",
    "summary": "Chaofeng Ge, a 32-year-old citizen of China in ICE custody, was pronounced dead by the Clearfield County coroner at approximately 6 a.m. on Tuesday, according to ICE.\nGe was found hanging by the neck and unresponsive in the shower room of his detention pod, ICE said.\nGe had been in ICE custody for only five days and was awaiting a hearing before the Department of Justice's Executive Office for Immigration Review, ICE said.\nHe was then taken into ICE custody and transported to the York ICE office for processing, ICE said.\n\"All people in ICE custody receive medical, dental and mental health intake screening within 12 hours of arriving at each detention facility, a full health assessment within 14 days of entering ICE custody or arrival at a facility, access to medical appointments and 24-hour emergency care,\" ICE said.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-07T14:32:28Z",
    "source": "ABC News"
  }
]