[
  {
    "id": "NDk=",
    "url": "https://www.wired.com/story/minnesota-sues-to-stop-ice-invasion/",
    "title": "Minnesota Sues to Stop ICE ‘Invasion’",
    "summary": "The 80-page complaint, filed in US district court in Minnesota, targets the US Department of Homeland Security and senior federal officials, including DHS secretary Kristi Noem.\nAt a press conference Monday afternoon, Minnesota attorney general Keith Ellison said the lawsuit is intended to stop what he described as an unlawful federal escalation.\nEllison said that the killing, along with subsequent federal rhetoric, left families and entire communities feeling unsafe in public spaces.\nShe was fatally shot by an ICE officer during a Minneapolis enforcement operation on January 7.\nPlaintiffs argue the federal operation violates the Tenth Amendment, federal administrative law, and long-standing limits on immigration enforcement.",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2026-01-12T22:42:45Z",
    "source": "Wired"
  },
  {
    "id": "NTA=",
    "url": "https://www.npr.org/2026/01/12/nx-s1-5675315/minnesota-sues-to-block-trump-immigration-crackdown",
    "title": "Minnesota officials sue to block Trump's immigration crackdown as enforcement intensifies",
    "summary": "Minnesota officials sue to block Trump's immigration crackdown as enforcement intensifiestoggle caption John Locher/APMINNEAPOLIS — State officials are suing the Trump administration over the widespread immigration operation taking place across the Minneapolis region.\nMore than 2,000 federal immigration agents are in Minnesota, and that number is expected to increase.\nSponsor MessageThose were some of the questions federal immigration agents asked Joel Keleekai as he was charging his Tesla in a parking lot.\nBut the Trump administration has appeared to have shifted its tactics and, in Minnesota, become even more aggressive with its immigration crackdown.\nIllinois and the city of Chicago also took legal action Monday against the Trump administration over its immigration enforcement actions.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-12T23:51:04Z",
    "source": "NPR"
  },
  {
    "id": "NTE=",
    "url": "https://www.yahoo.com/news/articles/opinion-immigration-policy-collides-schools-184542249.html",
    "title": "Opinion: When Immigration Policy Collides With Schools, Students and the Community Suffer",
    "summary": "The answer, according to new research, is that the fear is already everywhere — even in schools where no enforcement actions have occurred.\nThe results are staggering: 70% report that students from immigrant families are expressing fear about their safety and their families’ well-being.\nNearly two-thirds report students missing school due to immigration policies and rhetoric.\nMinneapolis just demonstrated what happens when immigration policy collides with the school day: canceled classes, traumatized students and staff, a community in crisis.\nWhat is America going to do to keep young people safe — and build schools into the communities of belonging that every student deserves?",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-01-12T18:45:42Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTI=",
    "url": "https://www.bbc.com/news/articles/c07xd024zexo",
    "title": "France bans 10 British 'far-right activists' over anti-migrant activity",
    "summary": "France bans 10 British 'far-right activists' over anti-migrant activity1 day ago Share Save Hafsa Khalil Share SavePA MediaTen British \"far-right activists\" have been banned from France after engaging in actions to stop migrants crossing the English Channel in small boats, the French interior ministry said on Wednesday.\nIt said the activists, who belonged to a group called Raise the Colours, had been searching for and destroying small boats along France's northern coast, and were involved in \"propaganda activity\".\nThe ministry said it became aware of the group's actions in December 2025 which were likely to cause \"serious disturbances to public order\".\nThe 10 British nationals are prohibited from entering and residing in France.\nIts website stated that it did not support \"vigilante behaviour, unauthorised activity, or attempts by individuals to take the law into their own hands\".",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2026-01-14T14:51:28Z",
    "source": "BBC News"
  },
  {
    "id": "NTM=",
    "url": "https://abcnews.go.com/US/driver-shot-portland-immigration-operation-charged-assault-doj/story?id=129135791",
    "title": "Driver shot during Portland immigration operation charged with assault: DOJ",
    "summary": "A photo posted to X by Attorney General Pamela Bondi, Jan. 12, 2025, with a caption stating that it is a damaged Border Patrol vehicle.\nA photo posted to X by Attorney General Pamela Bondi, Jan. 12, 2025, with a caption stating that it is a damaged Border Patrol vehicle.\nA photo posted to X by Attorney General Pamela Bondi, Jan. 12, 2025, with a caption stating that it is a damaged Border Patrol vehicle.\nA photo posted to X by Attorney General Pamela Bondi, Jan. 12, 2025, with a caption stating that it is a damaged Border Patrol vehicle.\nA Border Patrol agent then fired their service weapon twice at the driver of the truck, according to statements from Border Patrol agents, the complaint said.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-12T18:51:08Z",
    "source": "ABC News"
  },
  {
    "id": "NTQ=",
    "url": "https://abcnews.go.com/US/us-1st-time-50-years-experienced-negative-net/story?id=129175522",
    "title": "US, for 1st time in 50 years, experienced negative net migration in 2025: Report",
    "summary": "US, for 1st time in 50 years, experienced negative net migration in 2025: ReportUS Border patrol teams monitor the border with Mexico against any illegal crossings in El Paso, Texas, May 8, 2025.\nUS Border patrol teams monitor the border with Mexico against any illegal crossings in El Paso, Texas, May 8, 2025.\nUS Border patrol teams monitor the border with Mexico against any illegal crossings in El Paso, Texas, May 8, 2025.\nUS Border patrol teams monitor the border with Mexico against any illegal crossings in El Paso, Texas, May 8, 2025.\n\"Though a high degree of policy uncertainty remains, continued negative net migration for 2026 is also likely.\"",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-01-13T23:30:33Z",
    "source": "ABC News"
  },
  {
    "id": "NTU=",
    "url": "https://www.yahoo.com/news/articles/know-warrants-most-immigration-agents-001021882.html",
    "title": "What to know about the warrants most immigration agents use to make arrests",
    "summary": "At the heart of the debate is a legal distinction largely unfamiliar to the public but central to immigration enforcement.\nHere is what to know about the limitations on the warrants that authorize most immigration related arrests.\nTypically, arrests carried out by Department of Homeland Security agencies are authorized by administrative warrants — sometimes known as immigration warrants — not judicial warrants.\nThat means people can legally refuse federal immigration agents entry into private property if the agents only have an administrative warrant.\nThe trainings also typically emphasize that an immigrant can refuse to open the door if law enforcement only has an administrative warrant.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-01-13T00:10:21Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTY=",
    "url": "https://www.bbc.com/news/articles/cly9n3r2p7zo",
    "title": "Hungary grants asylum to Polish ex-justice minister Zbigniew Ziobro",
    "summary": "Hungary grants asylum to Polish ex-justice minister3 days ago Share Save Adam Easton BBC News Warsaw correspondent Share SaveReuters Zbigniew Ziobro says he is a victim of political persecutionHungary has granted political asylum to Poland's former Justice Minister Zbigniew Ziobro who is facing charges of embezzlement.\nZiobro was justice minister between 2015 and 2023 under the previous right-wing PiS-led government, which is politically aligned to Hungarian Prime Minister Viktor Orban.\nWriting on X, Ziobro said: \"I have decided to accept the asylum granted to me by the government of Hungary due to the political persecution in Poland.\"\nI stand in opposition to a creeping dictatorship,\" Ziobro added, accusing Prime Minister Donald Tusk of waging a \"vendetta\" against him.\nZiobro is also accused of awarding Justice Fund grants to fire stations and women's associations without proper competition to bolster support for the government.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-12T13:57:56Z",
    "source": "BBC News"
  },
  {
    "id": "NTc=",
    "url": "https://www.aljazeera.com/news/2026/1/14/france-bans-10-far-right-uk-activists-for-targeting-migrant-boats",
    "title": "France bans 10 far-right UK activists for targeting migrant boats",
    "summary": "Minister says ‘violent or hate-inciting actions have no place’ in France as ‘Raise the Colours’ activists banned.\nFrance has banned 10 British anti-migrant activists for attempting to stop migrants and asylum seekers from crossing into the United Kingdom on small boats, the French Ministry of Interior has announced.\nIt issued a ban against 10 Raise the Colours activists on Tuesday, effectively banning them from entering and residing in France, the ministry said.\nFar-right activists in the UK have seized on years of migrant and asylum seeker crossings from France – via the English Channel – to advance a hardline, anti-immigration agenda.\nAdvertisementLast year, far-right groups rallied in cities and towns across the UK, demanding that Prime Minister Keir Starmer’s government stop housing asylum seekers at hotels.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-01-14T14:43:38Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTg=",
    "url": "https://www.wired.com/story/what-to-do-if-ice-invades-your-neighborhood/",
    "title": "What to Do if ICE Invades Your Neighborhood",
    "summary": "If federal immigration agents are coming to your area—or have already arrived—you may be frantically making plans to lay low at home, or perhaps grabbing your whistle and lacing up your sneakers to join a neighborhood watch.\nOn Wednesday, a federal agent shot and killed 37-year-old Minneapolis resident and US citizen Renee Nicole Good in her car during an Immigration and Customs Enforcement (ICE) operation.\n\"There are now more ICE agents in Minnesota than there are combined in Minneapolis police force and St. Paul police force,” Minnesota Senator Amy Klobuchar said on Friday.\nNumerous sources told WIRED that their trainings and materials about interacting with federal immigration agents are actively evolving to reflect the current moment.\nBut this type of information, while still accurate, does not fully account for the chaotic intensity of current US immigration enforcement.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-01-13T10:30:00Z",
    "source": "Wired"
  },
  {
    "id": "NTk=",
    "url": "https://www.npr.org/sections/the-picture-show/2026/01/12/g-s1-105725/in-photos-a-week-of-protests-against-ice",
    "title": "In photos: A week of protests against ICE",
    "summary": "In photos: A week of protests against ICEtoggle caption Ben Hovland/MPRFollowing last week's fatal shooting of Renee Macklin Good, a 37-year-old woman in Minneapolis by an Immigration and Customs Enforcement officer, protests have continued to grow across the United States.\nNPR station photographers and freelance photographer Evan Frost have been on the ground over the past week documenting actions in Minneapolis, as well as Washington, D.C., Texas, Connecticut, and Massachusetts.\ntoggle caption Ben Hovland/MPRtoggle caption Evan Frost for NPRtoggle caption Evan Frost for NPRtoggle caption Tyrone Turner/WAMUtoggle caption Tyrone Turner/ WAMUtoggle caption Tyrone Turner/WAMUtoggle caption Ben Hovland/MPRtoggle caption Ben Hovland/MPRtoggle caption Mark Mirko/Connecticut Publictoggle caption Mark Mirko/Connecticut Publictoggle caption Mark Mirko/Connecticut Publictoggle caption Mark Mirko/Connecticut Publictoggle caption Lorianne Willett/KUT Newstoggle caption Lorianne Willett/KUT Newstoggle caption Lorianne Willett/KUT Newstoggle caption Robin Lubbock/WBURtoggle caption Evan Frost for NPR",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-12T23:45:00Z",
    "source": "NPR"
  },
  {
    "id": "NjA=",
    "url": "https://abcnews.go.com/US/mamdani-outraged-after-new-york-city-council-employee/story?id=129149275",
    "title": "Mamdani 'outraged' after New York City Council employee detained by ICE",
    "summary": "New York City Mayor Zohran Mamdani speaks during a press conference at Grand Army Plaza in the Brooklyn borough of New York, on Jan. 2, 2026.\nNew York City Mayor Zohran Mamdani speaks during a press conference at Grand Army Plaza in the Brooklyn borough of New York, on Jan. 2, 2026.\nNew York City Mayor Zohran Mamdani speaks during a press conference at Grand Army Plaza in the Brooklyn borough of New York, on Jan. 2, 2026.\nNew York City Mayor Zohran Mamdani speaks during a press conference at Grand Army Plaza in the Brooklyn borough of New York, on Jan. 2, 2026.\nA New York City Council employee was detained during a \"routine\" immigration appointment on Long Island on Monday, according to city officials, who called the incident an \"egregious government overreach.\"",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-01-13T01:01:26Z",
    "source": "ABC News"
  }
]