[
  {
    "url": "https://www.bbc.com/news/articles/c860py73pglo",
    "title": "Farage calls on police to share immigration status of charged suspects",
    "summary": "Farage calls on police to share immigration status of charged suspects3 days ago Share Save Alys Davies BBC News Share SaveEPA/ShutterstockNigel Farage has called on the police to release the immigration status of suspects charged with crimes following the arrest of two men in connection with the alleged rape of a 12-year-old girl in Warwickshire.\nThe Reform UK party leader said he \"absolutely\" thinks such details should be released when asked about the matter at a news conference on Monday.\nWarwickshire Police said once someone is charged with an offence, the force follows national guidance that does not include sharing ethnicity or immigration status.\nThe authorised professional practice followed by forces across the country, and cited by the College of Policing, says the same.\n\"I felt that in the wake of the Southport attacks, and I feel that ever more strongly today.\"",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-04T17:32:17Z",
    "source": "BBC News"
  },
  {
    "url": "https://uk.news.yahoo.com/small-boat-migrants-allowed-keep-102418203.html",
    "title": "Small boat migrants will be allowed to keep their phones, minister says",
    "summary": "Migrants who arrive in Britain on small boats will be able to keep their mobile phones, a minister has said.\nDame Angela Eagle, a Home Office minister, said the Government “doesn’t want absolutely every phone” from those who cross the Channel.\nDame Angela Eagle doesn’t want a blanket policy of seizing all migrants’ phones - Dan Kitwood/GettyDame Angela said the Home Office would not be seeking the phones of every migrant who arrived on a small boat.\n“We will close asylum hotels by the end of the Parliament.\nSmall boat crossings have reached 25,000 for the year so far, a record for this point in the year.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-04T10:24:18Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/c8deq8qm504o",
    "title": "Stamps to be replaced with biometrics at EU border from 12 October",
    "summary": "Biometrics to replace stamps at EU border from 12 OctoberIt was due to come into effect last November but has been beset by technological delays.\nThe Entry/Exit System (EES) will replace the current paper checks and will mean passengers from the UK will need to have their fingerprints and faces scanned to cross an EU border.\nStamps in people's passports will be replaced by biometric checks for people travelling in and out of the EU from 12 October, officials have confirmed.\nPassengers will be given hand-held devices to register in their cars, while French border checks have been implemented on British soil at the Port of Dover, the Eurotunnel's Folkestone end and Eurostar's St Pancras terminal.\nIn May, the UK and EU struck a deal which allowed for UK nationals to use EU e-gates - but only after the EES is introduced.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-08-01T10:39:33Z",
    "source": "BBC News"
  },
  {
    "url": "https://nextshark.com/korean-american-researcher-detained-weed-conviction",
    "title": "Korean American researcher held at airport for weeks over decade-old weed conviction",
    "summary": "Korean American researcher held at airport for weeks over decade-old weed convictionA 40-year-old scientist and legal permanent resident has been detained by the U.S. Customs and Border Protection at San Francisco International Airport since July 21.\nAccording to his legal team , he has previously traveled internationally for academic work without incident.\nSince his detention began, he has had almost no communication with family or counsel, and his legal team believes he may now be held at a facility in Arizona.\nAlarming trendKim’s detention comes amid a rise in cases where legal permanent residents are held over minor or decades-old offenses under stricter immigration enforcement.\nThis story is part of The Rebel Yellow Newsletter — a bold weekly newsletter from the creators of NextShark, reclaiming our stories and celebrating Asian American voices.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-06T15:30:53Z",
    "source": "NextShark"
  },
  {
    "url": "https://www.bbc.com/news/articles/ckgevynly99o",
    "title": "'Endless battle' with crime gangs taking over the high street",
    "summary": "\"It's shameful that this is happening,\" says Steve Hay, one of the Trading Standards team responsible for the closures.\nIt is just a glimpse of what one Trading Standards officer describes as an \"endless battle\" against the illegal tobacco and vape trade in Britain.\nResponses were gathered from 169 local Trading Standards teams, out of an estimated total of 187.\nTrading Standards officer Steve Hay breaks the window of a suspected 'stash car'On raids 40 miles away in Swansea, Trading Standards officers say the stash cars may contain drugs as well as counterfeit cigarettes.\n\"The amount of money [the gangs] they can make selling tobacco is greater than if they were selling drugs,\" he explains.",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2025-07-31T05:00:15Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/tunisian-musician-detained-la-living-035513539.html",
    "title": "A Tunisian musician was detained in LA after living in US for a decade. His doctor wife speaks out",
    "summary": "Her husband Rami Othmane, a Tunisian singer and classical musician, began carrying a receipt of his pending green card application around with him.\nDespite living in the U.S. for a decade as one of thousands of residents married to U.S. citizens, he was swept up in the crackdown.\nAdvertisement AdvertisementAdvertisement AdvertisementOn July 13, Othmane was stopped while driving to a grocery store in Pasadena.\nAdvertisement AdvertisementAdvertisement Advertisement“In Latin American culture, the serenade — to bring music to people — is an act of love and kindness.\nThey had a procedural hearing on Thursday where the judge verified his immigration status, and have a bail bond hearing scheduled for Tuesday.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-08-02T03:55:13Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/job-now-enforce-law-gwinnett-225820341.html",
    "title": "‘My job now is to enforce the law’: Gwinnett County Sheriff defends cooperation with ICE",
    "summary": "‘My job now is to enforce the law’: Gwinnett County Sheriff defends cooperation with ICEGwinnett County Sheriff Keybo Taylor defended his department’s cooperation with federal immigration officials Thursday, pushing back against what he called misinformation from community leaders following controversial charges against a Spanish-language journalist.\n“There’s a level of irresponsibility going on here when you have leaders that like to stroke fear surrounding immigration,” Taylor said.\nThree days later, the Gwinnett County Sheriff’s Office filed traffic charges against him for an alleged May incident where he recorded undercover deputies while driving.\nThe sheriff emphasized his office cooperates with ICE but within limits.\nMy job now is to enforce the law,” Taylor said.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-07-31T22:58:20Z",
    "source": "Yahoo Entertainment"
  }
]