[
  {
    "url": "https://www.bbc.com/news/articles/c7019x6rg3po",
    "title": "Man fined for refusing to remove balaclava at Epping protest",
    "summary": "Epping protester fined for not removing balaclava2 days ago Share Save Aimee Dexter Share SaveReuters Joshua Meadows, 18, refused to remove a face covering during a protest outside The Bell Hotel in EppingA protester who cited burkas when refusing to remove his face covering outside a hotel housing asylum seekers in Epping has been fined £276.\nJoshua Meadows, 18, from the Essex town, would not remove a \"full face\" balaclava when asked to do so by police during a protest at The Bell Hotel on 24 July, Chelmsford Magistrates' Court heard.\nProsecutor Celestia John-Baptiste said: \"He said he didn't know why he, as a white British person, could not wear a face covering when people could wear burkas.\"\nMeadows pleaded guilty to failing to remove an item when asked by a constable, and possession of cannabis.\n\"They were asked to remove the coverings, and all did so except for the defendant,\" she said.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-09-24T18:03:35Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.theverge.com/news/786323/uk-digital-id-plans-mandatory-immigration-crackdown",
    "title": "The UK announces mandatory digital ID plans",
    "summary": "The United Kingdom is introducing a national digital ID scheme in an effort to crack down on illegal migrant workers.\n“Digital ID is an enormous opportunity for the UK.\nPlans to introduce digital ID were announced in January, with the GOV.UK wallet app initially pitched to give UK citizens the option to digitize their driver’s licenses and make government-issued documents easier to access.\nThe GOV.UK wallet app is still in development, and described as “entirely optional” on the government website.\nThe UK currently has no citizen ID card and does not legally require people to carry photo ID, such as passports or driver’s licenses.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-09-26T11:16:58Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.bbc.com/news/articles/c179p4wvz29o",
    "title": "Trump UN speech: Seven years ago his audience laughed, this year they were silent",
    "summary": "Over almost an hour, he took aim at his opponents and their ideas, picking them off one by one as he toured the world.\nThe president even attacked the UN for a broken escalator and teleprompter that disrupted his visit and speech.\nUnder Trump, the US has withdrawn much of its UN funding, leaving the body forced to cut its humanitarian work around the world.\nTrump saved perhaps his biggest criticism for his European allies, attacking the continent for investing in renewable energy, and opening its borders to migration.\nWatch: How Trump lashed out at Europe in his UN speech",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-09-23T19:51:42Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/h1b-visa-transition-green-card-us-citizen-immigration-journey-2025-9",
    "title": "Came to US on H-1B Visa; How, Why I Became an American Citizen",
    "summary": "I came to the US on an F-1 student visa and became an American citizen a decade later.\nI came to the US on an F-1 student visa and became an American citizen a decade later.\nCourtesy of the authorI came to the US on an F-1 student visa and became an American citizen a decade later.\nThroughout my time here, I have had seven different immigration statuses in the US, including six years with an H-1B visa, before becoming an American citizen.\nMy husband sponsored my green cardBecause the H-1B visa is a \"double intent\" visa, I was allowed to apply for a green card or permanent residency.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-09-23T09:33:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/trump-immigration-prices-manufacturing-tariffs-america-economy-2025-9",
    "title": "Trump's Manufacturing, Immigration, Prices Priorities Are in Conflict",
    "summary": "The president wants to boost US manufacturing, cut down on immigration, and keep prices down all at once.\nIf there has been one throughline to the president's economic agenda, it's his desire to rebuild American manufacturing and get companies to make things here.\nThe most glaring deterrent for foreign companies looking to move some operations to America's shores is Trump's immigration crackdown.\nBut increased prices on foreign goods give domestic companies cover to raise their prices.\nIn an ideal world, there would be a boom in job growth, in manufacturing and otherwise, that disproportionately benefited American workers.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-09-25T08:08:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.aljazeera.com/news/2025/9/25/trump-officials-rally-global-leaders-for-restrictions-on-asylum-seekers",
    "title": "Trump officials rally global leaders for restrictions on asylum seekers",
    "summary": "On Thursday, Deputy Secretary of State Christopher Landau led a panel called “Global Refugee Asylum System: What Went Wrong and How to Fix It”, where he called upon other countries to crack down on asylum seekers.\n“If you have hundreds of thousands of fake asylum seekers, then what happens to the real asylum system?” Landau said.\nAmong the changes the Trump administration has sought is a reimagining of the asylum system, which started to take shape following World War II.\n“The asylum system has become a huge loophole in our migration laws,” Landau said.\nIn his speech to the UN General Assembly this week, Trump argued that accepting immigrants was “destroying” other countries.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-09-25T21:36:39Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://abcnews.go.com/US/ice-facilities-higher-alert-after-deadly-dallas-shooting/story?id=125918125",
    "title": "Dallas ICE shooter was targeting agents, not detainees: Officials",
    "summary": "FBI agents investigate the crime scene near a U.S. Immigration and Customs Enforcement office, Sept. 25, 2025, in Dallas.\nFBI agents investigate the crime scene near a U.S. Immigration and Customs Enforcement office, Sept. 25, 2025, in Dallas.\nFBI agents investigate the crime scene near a U.S. Immigration and Customs Enforcement office, Sept. 25, 2025, in Dallas.\nThe sniper who opened fire on the Dallas Immigration and Customs Enforcement field office, killing one detainee and wounding two detainees, was targeting ICE agents, not detainees, officials said, citing notes the suspect left behind.\nIt's clear from these notes that he was targeting ICE agents and ICE personnel,\" Larson said, calling it \"tragic irony\" that detainees, not agents, were shot.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-09-25T08:50:50Z",
    "source": "ABC News"
  }
]