[
  {
    "id": "NDA=",
    "url": "https://www.slashfilm.com/2069849/why-greenland-migration-first-terrifying-2026-movie/",
    "title": "Why Greenland: Migration Is The First Truly Terrifying Movie Of 2026",
    "summary": "This post contains spoilers for \"Greenland 2: Migration.\"\nHowever, \"Greenland\" differs from the usual disaster movie formula by telling a genuinely harrowing story that explores how humanity would react to, and suffer from, a catastrophic event.\n\"Greenland 2: Migration\" continues to showcase the bleaker side of disaster fare — and it's even more brutal than its predecessor.\nDirected by Ric Roman Waugh from a script by Chris Sparling and Mitchell LaFortune, \"Greenland 2: Migration\" combines disaster movie thrills with post-apocalyptic savagery.\nOn paper, \"Greenland 2: Migration\" sounds like every other post-apocalyptic disaster movie.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-01-09T13:00:00Z",
    "source": "/FILM"
  },
  {
    "id": "NDQ=",
    "url": "https://www.npr.org/2026/01/11/nx-s1-5666843/venezuelas-exiles-in-chile-caught-between-hope-and-uncertainty",
    "title": "Venezuela's exiles in Chile caught between hope and uncertainty",
    "summary": "Venezuela's exiles in Chile caught between hope and uncertaintytoggle caption JAVIER TORRES/AFP via Getty ImagesSANTIAGO, Chile — Early last Saturday morning, Chile's capital awoke to the sound of jubilant cheers echoing between the tower blocks.\nNews had filtered through from Caracas of the U.S. operation to seize President Nicolás Maduro, and Chile's sizable Venezuelan diaspora could barely contain its joy.\n\"When they report crimes on the news, they only say the nationality of the perpetrator if they're foreign, installing a negative perception around Venezuelan migration,\" said Montesinos.\nKast has mooted detention facilities, border walls and ditches to halt illegal migration; and aggressive policies to pursue, detain and deport illegal migrants.\nSponsor MessageBut while uncertainty remains for many, nostalgia for Venezuela has got many in the diaspora in Chile dreaming of a return home.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-11T11:00:00Z",
    "source": "NPR"
  },
  {
    "id": "NDU=",
    "url": "https://www.vox.com/podcasts/474801/asylum-immigration-border-trump",
    "title": "How the US shut the door on asylum-seekers",
    "summary": "Trump has moved aggressively to curtail asylum-seekers’ entrance into the US, as well as to force ones already in the country to leave.\nThey believe that most people who are coming into the country this way are not legitimate asylum-seekers, and they’re maybe coming for economic reasons.\nThey’ve really come into office with a blitz of policies to try and shut that system down.\nThis is really one of the most novel and surprising things that the Trump administration has tried.\nDo you think there’s any possibility that Congress is going to actually make any meaningful changes to our asylum system?",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-01-09T22:18:33Z",
    "source": "Vox"
  },
  {
    "id": "NDY=",
    "url": "https://www.yahoo.com/news/articles/congress-debating-possible-consequences-ice-140539114.html",
    "title": "Congress is debating the possible consequences for ICE and even Noem after Renee Good's killing",
    "summary": "But Good’s killing, at least the fifth known death since the administration launched its mass deportation campaign, could change the political dynamic.\nAdvertisement AdvertisementAdvertisement Advertisement“The videos I’ve seen from Minneapolis yesterday are deeply disturbing,” said Sen. Lisa Murkowski, R-Alaska, in a statement.\nAdvertisement AdvertisementAdvertisement AdvertisementAs anti-ICE demonstrations erupt in cities in the aftermath of Good’s death, Democrats have pledged to use any available legislative lever to apply pressure on the administration to change the conduct of ICE officers.\n“Nobody wants to see people get shot,” said Rep. Rich McCormick, R-Ga.“Let’s do the right thing and just be reasonable.\nAnd the reasonable thing is not to obstruct ICE officers and then accelerate while they’re standing in front of your car,” he said.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-01-10T14:05:39Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDc=",
    "url": "https://www.npr.org/2026/01/10/g-s1-105387/new-video-minnesota-shooting-officer-perspective",
    "title": "New video shows fatal Minnesota ICE shooting from officer's perspective",
    "summary": "New video shows fatal Minnesota ICE shooting from officer's perspectivetoggle caption John Locher/APMINNEAPOLIS — A Minnesota prosecutor on Friday called on the public to share with investigators any recordings and evidence connected to the fatal shooting of Renee Good as a new video emerged showing the final moments of her encounter with an immigration officer.\n\"Many of you have been told this law enforcement officer wasn't hit by a car, wasn't being harassed, and murdered an innocent woman,\" Vance said.\nThe video demonstrates that the officers didn't perceive Good to be a threat, said John P. Gross, a professor at the University of Wisconsin Law School who has written extensively about officers shooting at moving vehicles.\nThat evening, hundreds protested and marched outside two hotels in downtown Minneapolis where immigration enforcement agents were supposed to be staying.\nSponsor MessageThe government is also shifting immigration officers to Minneapolis from sweeps in Louisiana, according to documents obtained by The Associated Press.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-10T06:18:03Z",
    "source": "NPR"
  },
  {
    "id": "NDk=",
    "url": "https://www.thedailybeast.com/federal-agents-shoot-man-and-woman-in-portland/",
    "title": "Border Patrol Agents Shoot 2 During Traffic Stop",
    "summary": "U.S. federal agents shot two people in Portland, Oregon, on Thursday afternoon.\n“Two people are in the hospital following a shooting involving federal agents,” Portland police said in a statement.\nIn a statement, Department of Homeland Security Assistant Secretary Tricia McLaughlin said the incident began during a “targeted vehicle stop” by Border Patrol agents.\nThe FBI said in a statement it was investigating an “assault” involving two Customs and Border Patrol agents.\n“Earlier this afternoon, two people were injured by federal agents in the Hazelwood neighborhood.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-01-09T00:08:24Z",
    "source": "Daily Beast"
  },
  {
    "id": "NTA=",
    "url": "https://www.npr.org/2026/01/10/nx-s1-5673229/ice-protests-minneapolis-portland",
    "title": "Nationwide anti-ICE protests call for accountability after Renee Good's death",
    "summary": "Nationwide anti-ICE protests call for accountability after Renee Good's deathtoggle caption Spencer Platt/Getty ImagesPeople took to the streets in cities across the country this weekend to protest the Trump administration's immigration enforcement tactics following the death of Renee Good in Minneapolis, a 37-year-old woman who was shot and killed by a U.S. Immigration and Customs Enforcement (ICE) officer last week.\nPeople demonstrated outside of hotels where ICE agents were believed to be staying.\nHomeland Security Secretary Kristi Noem on Sunday said the agency was sending \"hundreds more\" federal agents to Minneapolis Sunday and Monday to protect ICE agents.\nGood was killed the day after DHS launched a large-scale immigration enforcement operation in Minnesota set to deploy 2,000 immigration officers to the state.\nThere were no arrests during the protests, a spokesperson for the Metropolitan Police Department told NPR on Sunday.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-11T03:07:01Z",
    "source": "NPR"
  },
  {
    "id": "NTE=",
    "url": "https://abcnews.go.com/US/video/cellphone-video-officer-shows-moment-leading-fatal-shooting-129068454",
    "title": "Video Cellphone video from officer shows moment leading up to fatal shooting of Renee Good",
    "summary": "Cellphone video from officer shows moment leading up to fatal shooting of Renee Good Tensions continue to flare in Minneapolis after an Immigration and Customs Enforcement officer fatally shot the 37-year-old woman on Wednesday.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-09T22:24:31Z",
    "source": "ABC News"
  },
  {
    "id": "NTI=",
    "url": "https://www.bbc.com/news/articles/cvgpnwnqygro",
    "title": "Thousands march and dozens arrested in Minneapolis protests against ICE",
    "summary": "Thousands march and dozens arrested in Minneapolis protests against ICE1 day ago Share Save Ana Faguy Share SaveWatch: Thousands march in Minneapolis in protest against ICEThousands of people joined another night of protests in Minneapolis on Saturday, following the death of a woman who was shot by a US Immigration and Customs Enforcement (ICE) agent in the city.\nMinneapolis police estimated \"tens of thousands of people\" attended the \"ICE out of Minnesota\" rally and march, which started in Powderhorn Park on Saturday.\nWatch: Video filmed by ICE agent who shot Minneapolis woman has emergedOfficials said another hotel in the city was also targeted and had window and graffiti damage.\nShe told CNN that Good had \"weaponised\" her car\" to attack ICE agents in the city of Minneapolis.\nThe Minneapolis mayor added that the city's local law enforcement were \"outnumbered by the number of ICE agents and beyond\".",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2026-01-10T19:56:50Z",
    "source": "BBC News"
  },
  {
    "id": "NTQ=",
    "url": "https://www.yahoo.com/news/videos/two-hospitalized-shooting-involving-federal-001932736.html",
    "title": "Two hospitalized after shooting involving federal agents in Portland",
    "summary": "Two people were hospitalized after a shooting involving Customs and Border Patrol agents in Portland, Oregon, according to officials.\nThe conditions of the victims are unknown at this time.\nNBC News' Dana Griffin has the latest developments.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-09T00:19:32Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTU=",
    "url": "https://www.yahoo.com/news/articles/minnesota-democrats-demanding-broader-investigation-171516735.html",
    "title": "Video captures Minneapolis immigration arrest in a city on edge after shooting of Renee Good",
    "summary": "In a dramatic scene similar to those playing out across Minneapolis, agents captured a man in the home just minutes after pepper spraying protesters outside who had confronted the heavily armed federal agents.\nVideo of the clash taken by The Associated Press showed some agents pushing back protesters while a distraught woman later emerged from the house with a document that federal agents presented to arrest the man.\nSigned by an immigration officer, the document — unlike a warrant signed by a judge — does not authorize forced entry into a private residence.\nA warrant signed by an immigration officer only authorizes arrest in a public area.\n“We’re seeing a lot of immigration enforcement across Minneapolis and across the state, federal agents just swarming around our neighborhoods,” said Jason Chavez, a Minneapolis city councilmember.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-01-11T17:15:16Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTY=",
    "url": "https://www.tmz.com/2026/01/08/federal-immigration-agents-shoot-two-people-portland/",
    "title": "CBP Agents Shoots Two In Portland, Listen To Dispatch Audio",
    "summary": "The feds say the agent \"fired a defensive shot\" out of fear for his life and safety ... and the driver fled the scene with his passenger.\nDHS also says the alleged gang member here was recently involved in a shooting in Portland.\nAnother shooting involving federal immigration agents and civilians ... and this time the feds shot two people in Oregon.\nPlay video content FreedomNews.TVThe Portland shooting comes one day after an ICE agent shot and killed a woman in Minneapolis.\nPortland is not a 'training ground' for militarized agents, and the 'full force' threatened by the administration has deadly consequences.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2026-01-09T00:46:34Z",
    "source": "TMZ"
  },
  {
    "id": "NTc=",
    "url": "https://www.vox.com/policy/474842/ice-enforcement-operation-culture-violence-minneapolis-border",
    "title": "The violent “randomness” of ICE’s deportation campaign",
    "summary": "And what specifically changed in the way ICE operates domestically?\nI put these questions to David Hausman, a UC Berkeley School of Law assistant professor and the faculty director of the Deportation Data Project, a database of individual-level immigration enforcement cases.\nHow does domestic immigration enforcement now compare to how it used to work before Trump?\nBefore this current administration and going back to at least the first Obama administration, ICE was really an agency that didn’t conduct many arrests.\nAnd as a result, ICE arrests out in the community were very, very rare.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-01-09T23:27:56Z",
    "source": "Vox"
  },
  {
    "id": "NTg=",
    "url": "https://www.theatlantic.com/newsletters/2026/01/ice-shooting-minneapolis-portland/685577/",
    "title": "ICE Wasn’t Always Like This",
    "summary": "On Wednesday, an ICE officer shot and killed Renee Nicole Good, a mother of three and a U.S. citizen, in the streets of Minneapolis.\nAs my colleague Caitlin Dickerson explains in her latest story, the president and his advisers have exerted “overwhelming pressure” on immigration enforcement.\nWill Gottsegen: To what extent is ICE no longer subject to some of the guardrails that once helped keep it in check?\nThe pressure that ICE officers are facing is unprecedented, and it’s not just the pressure to carry out as many deportations as possible—the administration is actually celebrating aggression.\nWill: How does this pressure on ICE officers affect immigration-enforcement operations?",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-01-10T00:13:00Z",
    "source": "The Atlantic"
  }
]