[
  {
    "id": "NDc=",
    "url": "https://www.bbc.com/news/articles/ce3kkvkdpw0o",
    "title": "First asylum seekers moved into Crowborough former military site",
    "summary": "Mahmood said: \"I will bring forward site after site until every asylum hotel is closed and returned to local communities.\"\nMahmood said she would defend \"vigorously\" any legal challenges to moving asylum seekers into sites like Crowborough.\nWealden District Council leader James Partridge said housing asylum seekers at Crowborough was the wrong decision.\nKim Bailey, who chairs Crowborough Shield, told BBC Radio Sussex housing asylum seekers in camps costs a \"hell of a lot more\" than hotels.\n\"All asylum seekers will have been screened against policing, criminality and immigration databases before arriving,\" it added.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2026-01-22T11:03:11Z",
    "source": "BBC News"
  },
  {
    "id": "NDg=",
    "url": "https://www.yahoo.com/news/articles/trump-officials-immigration-lawyers-ice-013612595.html",
    "title": "What Trump officials and immigration lawyers say about ICE detaining a 5-year-old",
    "summary": "Neighbors and school officials say that federal immigration officers used the preschooler as “bait” by telling him to knock on the door to his house so that his mother would answer.\nFederal officials say the father was in the U.S. illegally, without offering details.\nAdvertisement AdvertisementAdvertisement AdvertisementBovino and ICE officials criticize media coverageAt a news conference Friday, Border Patrol Commander at Large Greg Bovino criticized what he called the “false media narrative” about the case.\nThe directive says that ICE should allow parents and guardians to make alternate care arrangements for the children before their detention.\nAdvertisement AdvertisementAdvertisement AdvertisementIt does not specify what happens when the parents say that they want their child to stay with them.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-24T01:36:12Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDk=",
    "url": "https://abcnews.go.com/US/top-ice-official-accuses-father-detained-5-year/story?id=129500186",
    "title": "Top ICE official accuses father of detained 5-year-old of 'abandoning his child'",
    "summary": "Liam Conejo Ramos, 5, is detained by U.S. Immigration and Customs Enforcement officers after arriving home from preschool, Jan. 20, 2026, in a Minneapolis suburb.\nLiam Conejo Ramos, 5, is detained by U.S. Immigration and Customs Enforcement officers after arriving home from preschool, Jan. 20, 2026, in a Minneapolis suburb.\nA top federal official has accused the father of a 5-year-old detained by Immigration and Customs Enforcement of \"abandoning his child,\" despite school officials saying the boy's mother was home and begged for him.\nICE agents stand next to Liam Conejo Ramos, a five-year-old that school officials said was detained in Minneapolis, Minnesota, January 20, 2026.\nThe family has a pending asylum case and no order of deportation, officials at Conejo Ramos' school said in a statement.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-24T01:36:06Z",
    "source": "ABC News"
  },
  {
    "id": "NTA=",
    "url": "https://www.npr.org/2026/01/24/nx-s1-5687276/man-shot-dead-minneapolis",
    "title": "Man shot dead by federal immigration officers in Minneapolis",
    "summary": "Man shot dead by federal immigration officers in Minneapolistoggle caption Erin Trieb for NPRA man shot Saturday morning by federal immigration officers in Minneapolis has died, federal and local officials said.\nThe incident marks the third shooting involving federal immigration agents in Minneapolis this month.\n\"Today, federal agents beat and then shot multiple times and killed 37-year-old Alex Jeffrey Pretti, a U.S. citizen, a Minneapolis resident, and a V.A.\n\"Eyewitness video shows, once again, reckless, violent, and dangerous federal agents taking the life of a Minnesotan.\"\ntoggle caption Erin Trieb for NPRtoggle caption Erin Trieb for NPRBystander video, posted to social media and not independently confirmed by NPR, appears to contradict DHS' account of the shooting.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-24T19:01:37Z",
    "source": "NPR"
  },
  {
    "id": "NTE=",
    "url": "https://www.bbc.com/news/videos/cgqegq0kj02o",
    "title": "Watch: Federal and state officials give conflicting accounts of Alex Pretti's death",
    "summary": "Officials provided differing accounts of Alex Pretti's death after an altercation with federal agents in Minneapolis on Saturday.\nHomeland Security Secretary Kristi Noem said Pretti \"reacted violently\" when approached by law enforcement officers.\nHowever, Minnesota Governor Tim Walz described the claims as \"nonsense\", blaming federal officers deployed to the city for \"sowing chaos and violence\".\nRead more on this story here.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-01-25T06:14:24Z",
    "source": "BBC News"
  },
  {
    "id": "NTI=",
    "url": "https://www.businessinsider.com/ice-shooting-alex-pretti-minnesota-corporations-deescalation-peace-target-allianz-2026-1",
    "title": "The CEOs of Minnesota's largest companies call for 'de-escalation' of tensions after second fatal ICE shooting",
    "summary": "The CEOs of Minnesota's most prominent businesses are calling for local, state, and federal officials to find a solution as tensions skyrocket the day after federal agents shot and killed a second person in Minneapolis.\nThe letter called for an \"immediate de-escalation of tensions\" and for state, local, and federal officials to \"work together to find real solutions.\"\nPresident Donald Trump's immigration policies have long been the subject of sharp debate among business and tech leaders, many of whom have sought to curry favor during the president's second term.\nAfter the latest fatal shooting in Minneapolis, some business and tech leaders themselves took to social media to say their piece.\n\"There is far more outrage from tech leaders over a wealth tax than masked ICE agents terrorizing communities and executing civilians in the streets,\" Dyer wrote on X.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-01-25T20:02:30Z",
    "source": "Business Insider"
  },
  {
    "id": "NTM=",
    "url": "https://www.npr.org/2026/01/22/g-s1-106927/house-spending-homeland-immigration",
    "title": "House approves spending bills despite many Democrats' objections to ICE funds",
    "summary": "House approves spending bills despite many Democrats' objections to ICE fundstoggle caption Zayrha Rodriguez/NPRThe House passed the final slate of funding measures Thursday covering large swaths of the federal government, sending the package to the Senate ahead of a Jan. 30 deadline to avert a partial shutdown.\nJust seven House Democrats voted for the bill funding the Department of Homeland Security through September, citing Immigration and Customs Enforcement tactics in Minneapolis and elsewhere.\n\"ICE is totally out of control using taxpayer dollars to brutalize American citizens and law-abiding immigrant families,\" House Minority Leader Hakeem Jeffries told reporters Thursday.\nThe final legislation also holds funding for ICE flat, while reducing the budget for enforcement and removal operations by $115 million and cutting detention bed capacity.\n\"The hard truth is that Democrats must win political power to enact the kind of accountability we need.\"",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-22T22:15:16Z",
    "source": "NPR"
  },
  {
    "id": "NTQ=",
    "url": "https://abcnews.go.com/Politics/vance-minneapolis-calls-local-officials-lower-temperature-amid/story?id=129469961",
    "title": "Vance, in Minneapolis, calls on local officials to 'lower the temperature' amid anti-ICE protests",
    "summary": "At the same time, he admitted law enforcement there had made \"mistakes.\"\nFederal agents hold a person down as they are surrounded by tear gas used to deter protesters in Minneapolis, Minnesota, January 21, 2026.\nYou have a federal law enforcement official engaging in federal law enforcement action, that's a federal issue.\nJim Watson/AFP via Getty Images\"What I did say is that when federal law enforcement officers violate the law, that is typically something that federal officials would look into.\nFederal immigration agents listen to Vice President JD Vance speak at Royalston Square in Minneapolis, Minnesota, January 22, 2026.",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2026-01-23T00:13:12Z",
    "source": "ABC News"
  },
  {
    "id": "NTU=",
    "url": "https://www.npr.org/2026/01/23/nx-s1-5686733/minnesotans-day-of-ice-protests",
    "title": "Minnesotans turn out in the frigid cold to protest Trump's immigration crackdown",
    "summary": "They often then show up in protest — honking, whistling, yelling and filming — when federal agents make arrests.\nThere are now as many as 3,000 federal immigration officers in the state.\nThis week, federal officers detained a 5-year-old boy and his father in the northern suburb of Columbia Heights.\nSponsor MessageOfficials with the school district there say federal agents used the child as \"bait\" to draw family members out of the home.\nSome U.S. Citizens are also speaking out about being stopped or detained by immigration agents.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-23T22:10:38Z",
    "source": "NPR"
  },
  {
    "id": "NTY=",
    "url": "https://www.npr.org/2026/01/25/nx-s1-5687875/minneapolis-shooting-minnesota-ice-alex-pretti-dhs-investigation",
    "title": "Videos and eyewitnesses refute federal account of Minneapolis shooting",
    "summary": "Videos and eyewitnesses refute federal account of Minneapolis shootingtoggle caption Zaydee Sanchez for NPRMinnesota officials are pushing to ensure they can help investigate the shocking fatal shooting of 37-year-old intensive care nurse Alex Pretti .\nThere has been no evidence that NPR has verified of Pretti brandishing his handgun at any time during the encounter with federal agents.\nGregory Bovino, the immigration official commanding the operation in Minneapolis told CNN on Sunday that \"the victims are the Border Patrol agents.\nWalz said the state is creating a log of evidence for possible future prosecution of immigration agents.\nSponsor Message\"They're trying to have the narrative be that the people are the aggressors,\" she told NPR.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-25T20:00:00Z",
    "source": "NPR"
  },
  {
    "id": "NTg=",
    "url": "https://www.aljazeera.com/news/2026/1/23/us-officers-detain-5-year-old-boy-as-minnesota-immigration-raids-continue",
    "title": "US officers detain 5-year-old boy as Minnesota immigration raids continue",
    "summary": "School official says the child, Liam Conejo Ramos, was ‘essentially’ used ‘as bait to apprehend his father, who is seeking asylum in the US.\nUS Immigration and Customs Enforcement (ICE) officers have detained a five-year-old boy arriving home from preschool in Minnesota, after allegedly using him “as bait” to apprehend his father, who has a pending asylum case.\nFederal agents took the child, Liam Conejo Ramos, from a running car while it was in the family’s driveway on Tuesday afternoon, Columbia Heights Public Schools Superintendent Zena Stenvik said during a news conference on Wednesday.\nAre they supposed to let a five-year-old child freeze to death?\nUS federal agents have arrested some 3,000 people in immigration raids across Minnesota in recent weeks, according to Greg Bovino, a US Customs and Border Protection official.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-01-23T02:05:49Z",
    "source": "Al Jazeera English"
  }
]