[
  {
    "id": "Mzg=",
    "url": "https://www.bbc.com/news/articles/cwyg2629g7do",
    "title": "Napier Barracks in Folkestone used for housing asylum seekers shuts",
    "summary": "Barracks used for housing asylum seekers closesThe site closed on Friday and will be handed over to a property developer for housing.\nNapier Barracks in Folkestone - a former military site - opened as accommodation for migrants in 2020.\nAn army barracks in Kent which has been used to house asylum seekers has closed, according to the Home Office.\nThe government had previously announced discussions had begun to use barracks in Crowborough in East Sussex and Inverness in Scotland to house about 900 male asylum seekers in total.\nNapier Barracks housed more than 300 asylum seekers at its peak, but was believed to have fewer than 100 residents ahead of its closure.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-20T08:57:03Z",
    "source": "BBC News"
  },
  {
    "id": "Mzk=",
    "url": "https://www.yahoo.com/news/articles/ice-says-agent-fired-shots-223429583.html",
    "title": "ICE says an agent fired shots at a migrant who hit him and another agent with his SUV in Minnesota",
    "summary": "Last week, ICE agents and protesters clashed in neighboring Minneapolis.\nSt. Paul police said in a statement that they were called to the area by reports of shots being fired, only to learn that the ICE agent had fired the shots.\nICE agents saw the man getting into his SUV and approached the vehicle, McLaughlin said, identifying themselves as ICE agents.\nHe rammed his SUV into an ICE vehicle, striking the second agent, prompting the shots, which did not hit him, she said.\nAfter ramming another ICE vehicle, the man got out of his SUV and attempted to flee into his apartment, but agents brought him to the ground, McLaughlin said.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-21T22:34:29Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDA=",
    "url": "https://abcnews.go.com/US/wireStory/ice-agent-fires-shots-man-after-hit-suv-128604749",
    "title": "ICE agent fires shots at man after being hit by SUV",
    "summary": "The man also bit an ICE agent as officers subdued him outside his apartment.\nSt. Paul police said in a statement that they were called to the area by reports of shots being fired, only to learn that the ICE agent had fired the shots.\nICE agents saw the man getting into his SUV and approached the vehicle, McLaughlin said, identifying themselves as ICE agents.\nHe rammed his SUV into an ICE vehicle, striking the second agent, prompting the shots, which did not hit him, she said.\nAfter ramming another ICE vehicle, the man got out of his SUV and attempted to flee into his apartment, but agents brought him to the ground, McLaughlin said.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-21T23:09:55Z",
    "source": "ABC News"
  },
  {
    "id": "NDE=",
    "url": "https://www.yahoo.com/news/articles/trump-set-expand-immigration-crackdown-110305167.html",
    "title": "Trump set to expand immigration crackdown in 2026 despite brewing backlash",
    "summary": "Trump has already surged immigration agents into major U.S. cities, where they swept through neighborhoods and clashed with residents.\nThe expanded deportation plans come despite growing signs of political backlash ahead of next year’s midterm elections.\nOther local elections and polling have suggested rising concern among voters wary of aggressive immigration tactics.\nThe Trump administration has taken aim at legal immigrants as well.\nAdministration officials earlier this year exempted such businesses from enforcement on Trump’s orders, then quickly reversed, Reuters reported at the time.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-22T10:27:05Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDI=",
    "url": "https://uk.news.yahoo.com/pope-leos-us-bishops-critics-140243897.html",
    "title": "Pope Leo's new US bishops are critics of Trump's migrant crackdown",
    "summary": "In his first seven months as pope, Leo has appointed new Catholic bishops in cities across the U.S., from San Diego to Austin to Pittsburgh.\nHe reiterated an earlier endorsement of a November statement by the U.S. bishops' conference, which decried Trump's immigration crackdown.\nTrump, who once called the late Pope Francis \"disrespectful\" for criticizing the president's immigration policies, has not responded ⁠directly to Leo's criticisms.\nBISHOPS ATTEND PROTESTS, ACCOMPANY IMMIGRANTS TO COURTFour of Leo's choices as U.S. bishops are ‍immigrants themselves.\nAdvertisement AdvertisementAdvertisement AdvertisementPittsburgh Bishop Mark Eckman, appointed by Leo in June, called immigration policies \"cruel and inhumane\" ‌in a November open letter.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-22T14:06:36Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDM=",
    "url": "https://www.yahoo.com/news/articles/federal-judge-decide-whether-kilmar-050513736.html",
    "title": "Judge allows Kilmar Abrego Garcia to remain free while she considers immigration issues",
    "summary": "(AP) — A federal judge on Monday questioned whether government officials could be trusted to follow orders barring them from taking Kilmar Abrego Garcia into immigration custody or deporting him.\nAbrego Garcia's mistaken deportation and imprisonment in El Salvador in March has galvanized both sides of the immigration debate.\nAdvertisement AdvertisementAdvertisement AdvertisementXinis ordered Abrego Garcia released from immigration custody on Dec. 11 after determining that the government had no viable plan for deporting him.\nInside the courtroom, Abrego Garcia sat with at least half a dozen defense team members while a lone government attorney sat across from them.\nAdvertisement AdvertisementAdvertisement AdvertisementIn addition to the Maryland case, Abrego Garcia is fighting the human smuggling charges in Tennessee.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-22T05:05:13Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDU=",
    "url": "https://www.businessinsider.com/us-visa-requirements-social-media-review-what-to-know-h1b-2025-12",
    "title": "US Reviewing Socials of Some Visa Applicants. What You Should Know.",
    "summary": "Impact LinkThe United States is reviewing the social media accounts of some visa applicants, adding another hurdle for workers and other visitors to clear under the Trump administration.\nThe State Department said in June that certain visa applicants would have their online activity vetted as part of its screening process.\nConsular offices began conducting online presence reviews for H-1B applicants on December 15, but they're not the only ones affected.\nThose companies and many others are still smarting after Trump imposed the $100,000 fee on new H-1B visa applicants in September.\nThe widespread panic in corporate America forced the Trump administration to clarify that the fee would only apply to new visa applicants, not existing visa holders.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-20T23:09:52Z",
    "source": "Business Insider"
  },
  {
    "id": "NDY=",
    "url": "https://www.businessinsider.com/google-microsoft-apple-h1b-visa-delay-warnings-memos-2025-12",
    "title": "Read the memos Google, Apple, Microsoft, and ServiceNow sent visa workers warning them not to travel",
    "summary": "Google, Apple, Microsoft, and ServiceNow have all sent advisories to visa-holding employees in recent days, warning them against international travel and describing appointment delays stretching up to a year.\nIf their visa stamp expires and they travel abroad, they must obtain a new stamp at a consulate before re-entering the US.\nBelow are the full texts of the internal memos sent to employees at these companies, obtained by Business Insider, which reveal how corporate America is responding to the visa processing slowdown.\nWe don't know if rescheduling is ongoing, for those whose original visa appointments have not been changed.\nThank you, BALAppleApple also sent memos to visa-holding workers warning them of extended delays in visa processing.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-12-22T00:41:07Z",
    "source": "Business Insider"
  },
  {
    "id": "NDg=",
    "url": "https://www.cbsnews.com/news/dhs-undocumented-migrants-self-deportation-offer-increased/",
    "title": "DHS increases offer for undocumented migrants to $3,000 if they voluntarily leave by end of 2025",
    "summary": "The smartphone app is modeled off the Biden administration's CBP One platform.\nUnder the Trump administration's policy, migrants are instructed to use the platform to signal their intent to depart.\nAs of May 2025, U.S. Immigration and Customs Enforcement estimated the average cost to arrest, detain and remove an undocumented migrant is approximately $17,000.\nIn October, the U.S. government announced plans to grant migrant teenagers a $2,500 stipend if they choose to return to their home countries voluntarily, CBS News previously reported.\nDHS says that since January 2025, 1.9 million undocumented immigrants have \"voluntarily self-deported,\" with \"tens of thousands\" doing so through the CBP Home program specifically.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-12-22T12:00:00Z",
    "source": "CBS News"
  }
]