[
  {
    "url": "https://gizmodo.com/border-patrol-responds-like-a-petulant-child-to-controversy-over-its-antisemitic-video-2000673314",
    "title": "Border Patrol Responds Like a Petulant Child to Controversy Over Its Antisemitic Video",
    "summary": "A spokesperson for U.S. Border Patrol has finally issued a statement about the antisemitic social media video that the agency posted in August, but was just deleted this week.\nThe video and the responseThe Border Patrol video was posted months ago but went largely unnoticed by the broader public until Tuesday, when white supremacists on X started to post about it approvingly.\nAfter all the attention the video attracted, it seemed plausible that it had been deleted by Facebook moderators for hate speech violations.\nMeta gave us the run-around and wouldn’t say who had actually deleted the video.\nLast month, Gizmodo emailed the agency to inquire about a bizarre video that DHS had distributed, which featured video and music from Pokémon.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-17T13:20:00Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://ca.news.yahoo.com/canadian-snowbirds-fingerprinted-photographed-u-080000001.html",
    "title": "Canadian snowbirds fingerprinted and photographed at U.S. border as part of new requirement",
    "summary": "Several Canadian snowbirds reported they were fingerprinted and photographed at the U.S. border this month when registering for their winter stay, which U.S. Customs and Border Protection (CBP) told CBC News is now standard procedure.\nThe snowbirds knew they’d have to comply with a new registration requirement for travellers staying in the United States longer than 29 days.\nAir travellers are typically exempt from the registration requirement, because they’re issued an electronic arrival record (I-94) when entering the U.S.\nU.S. immigration lawyer Jennifer Behm says if snowbirds pre-register online or register at the border, they’ll likely be sent to secondary inspection, which automatically means they’ll be fingerprinted and photographed.\nAdvertisement AdvertisementAdvertisement Advertisement“It does not replace the requirement for an I-94, nor is it relevant to the entry process for Canadian citizens,” said Turner.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-19T08:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.cbsnews.com/chicago/news/judge-homeland-security-federal-agents-chicago-body-cameras/",
    "title": "Judge tells Homeland Security that Chicago agents wearing body cameras was \"not a suggestion\"",
    "summary": "A federal judge again Friday ordered agents in Chicago for immigration operations to wear and turn on their body cameras, telling them \"that was not a suggestion.\"\nU.S. District Judge Sara Ellis issued the order Thursday, citing concerns about increasingly violent clashes between federal agents deployed in Operation Midway Blitz and the public, and their use of tear gas against protesters.\nEllis said her order requires any federal agents working under Operation Midway Blitz to wear body cameras and keep them on during all \"law enforcement activities.\"\nFederal agents at large wear body cameras but federal agents in Chicago have not been.\nA spokesperson for the Department of Homeland Security called the ruling an \"extreme act of judicial activism.\"",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-19T16:15:28Z",
    "source": "CBS News"
  },
  {
    "url": "https://www.bbc.com/weather/articles/c0jdp9wynn7o",
    "title": "Rising temperatures are threatening UK trees - but these species could save our forests",
    "summary": "Some of the United Kingdom's most valued trees are struggling to keep pace with climate change and increasing extreme weather.\n\"We are very concerned that changing conditions are putting our trees under significant stress,\" warns Dr Eleanor Tew from Forestry England.\nTo future-proof our forests, a 'species for the future' list has been released highlighting thirty trees likely to thrive in a warmer climate.\nIt includes familiar names like oak, birch, and alder, alongside less common species such as coast redwood and Corsican pine, which it is hoped will lead to a more resilient woodland.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-19T04:12:39Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.maximepeabody.com/blog/immigration-in-canada",
    "title": "Criticizing Immigration Laws is Not Racist",
    "summary": "“I’m not racist, but”, “I don’t want to sound racist, but”, is what I’ve been hearing from some of my Canadian friends in recent conversations.\nGrowing up in Canada, our immigration policy was a source of pride.\nFirst, as the title of this blog post claims, I’d like to emphasize the fact that you can critique government policies, and even immigration policies, without being racist.\nSecond, I’d like to point out that it is actually a great concern that people are afraid to speak up.\nNow, when I claim that it isn’t racist to criticize immigration policy, am I saying that this is 100% always the case?",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2025-10-19T17:53:06Z",
    "source": "Maximepeabody.com"
  },
  {
    "url": "https://gizmodo.com/welcome-to-the-jobless-growth-economy-2000673236",
    "title": "Welcome to the ‘Jobless Growth’ Economy",
    "summary": "America is entering an era of “jobless growth,” according to analysts at Goldman Sachs.\nThe memo, written by economists David Mericle and Pierfrancesco Mei and spotted by Fortune, warns that the current market of “modest job growth alongside robust GDP growth” is likely the new normal going forward.\nThe thing about senior roles is that you need people with experience to fill them.\nThat hasn’t materialized even a little thus far, but the idea that it will has severely messed up the job market.\nOne thing is for sure: AI is going to be transformative for the economy.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-17T12:30:59Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.bbc.com/news/articles/cr43l19qn3ko",
    "title": "South Africa's Operation Dudula: The anti-migrant movement blocking foreigners from healthcare",
    "summary": "Two men wearing white T-shirts emblazoned with the slogan \"Operation Dudula – Mass Deportation\" were stationed at the entrance.\nDespite this being a potential flashpoint, there was a strange calmness and resignation as people knew that Operation Dudula activists had been violent in the past.\n\"As South Africans, we would come to the clinic, only to find that the medication we need is not available.\nSeveral major political parties, including the Economic Freedom Fighters and the Democratic Alliance, have also condemned Operation Dudula.\nSeveral Operation Dudula members have been arrested in recent weeks for blocking the entrances of public health facilities.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-17T23:45:08Z",
    "source": "BBC News"
  },
  {
    "url": "https://abcnews.go.com/US/appeals-court-declines-lift-order-blocking-trump-deploying/story?id=126599445",
    "title": "Appeals court declines to lift order blocking Trump from deploying National Guard in Illinois, finding scant evidence of 'rebellion'",
    "summary": "Members of the Texas National Guard stand guard at an army reserve training facility on October 07, 2025 in Elwood, Illinois.\nMembers of the Texas National Guard stand guard at an army reserve training facility on October 07, 2025 in Elwood, Illinois.\nMembers of the Texas National Guard stand guard at an army reserve training facility on October 07, 2025 in Elwood, Illinois.\nMembers of the Texas National Guard stand guard at an army reserve training facility on October 07, 2025 in Elwood, Illinois.\nMembers of the Texas National Guard stand guard at an army reserve training facility on October 07, 2025 in Elwood, Illinois.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-10-17T00:44:32Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cpv1nk7dy4yo",
    "title": "Eleven killed after Israel hits bus in Gaza, Hamas-run civil defence says",
    "summary": "Eleven killed after Israel hits bus in Gaza, Hamas-run civil defence saysThe Israeli military said soldiers had fired at a \"suspicious vehicle\" that had crossed the so-called yellow line demarcating the area still occupied by Israeli forces in Gaza.\nGaza's Hamas-run civil defence says 11 people were killed, all from the same family, after the bus they were in was hit by an Israeli tank shell in northern Gaza.\nCivil defence spokesman Mahmud Bassal told AFP news agency the victims were killed while \"trying to check on their home\" in the area.\nIsraeli Defence Minister Israel Katz said on Friday the army would set up visual signs to indicate the location of the line.\nAs part of the US-brokered ceasefire deal, Israel freed 250 Palestinian prisoners in Israeli jails and 1,718 detainees from Gaza.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-10-18T14:39:50Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/c7v8e1484n5o",
    "title": "Father 'finally home', says daughter of dead hostage returned to Israel",
    "summary": "Father 'finally home', says daughter of dead hostage returned to Israel1 day ago Share Save Ian Aikman and Rachel Hagan Share SaveHostages and Missing Families Forum Ronen Engel was killed on 7 October, the Israeli military saidThe daughter of one of the latest dead hostages to be returned to Israel from Gaza has said her father is \"finally home\".\nThey are the 11th and 12th of 28 dead hostages to be returned under the ceasefire deal.\nThe second dead hostage returned was identified by Israel on Sunday as Sonthaya Akrasri, a Thai agricultural worker who was killed on 7 October while living at Kibbutz Be'eri.\nAs part of the US-brokered ceasefire deal, Hamas also returned all 20 living hostages to Israel.\nReuters Hamas says it has been working to recover the remains of dead hostages beneath the rubble left by Israeli attacks on the Gaza Strip",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-18T20:52:26Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.techdirt.com/2025/10/17/trumps-cisa-raid-pulling-cybersecurity-experts-off-critical-infrastructure-defense-to-process-deportation-paperwork/",
    "title": "Trump’s CISA Raid: Pulling Cybersecurity Experts Off Critical Infrastructure Defense To Process Deportation Paperwork",
    "summary": "Trump’s CISA Raid: Pulling Cybersecurity Experts Off Critical Infrastructure Defense To Process Deportation Paperworkfrom the seems-bad deptLast week we covered how Trump’s immigration theater was pulling federal agents off child sex crimes, drug interdiction, and terrorism investigations to chase landscapers and line cooks instead.\nNow we’re learning the administration is also pulling hundreds of cybersecurity professionals away from defending America’s critical infrastructure so they can help process deportation paperwork.\nThe people being reassigned include staff from the Cybersecurity and Infrastructure Security Agency (CISA), the very federal agency, created during the first Trump administration, responsible for coordinating cybersecurity across federal agencies and helping protect America’s critical infrastructure from cyberattacks.\nSo we’re specifically targeting the people whose job it is to improve the cybersecurity of federal agencies and coordinate with international partners on cybersecurity threats.\nThe reality is that CISA was created in 2018 under Trump himself, and its actual mission is defending critical infrastructure from cyberattacks.",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2025-10-17T16:25:00Z",
    "source": "Techdirt"
  },
  {
    "url": "https://www.cbsnews.com/news/israel-military-gaza-hamas-strikes-ceasefire/?ftag=YHF4eb9d17",
    "title": "Israel launches retaliatory strikes in Gaza after saying Hamas targeted its forces, killing 2 IDF soldiers",
    "summary": "Earlier Sunday, Israel's military said it hit multiple targets in the Gaza Strip using aircraft and artillery, after it accused Hamas of shooting at Israeli soldiers.\nAn Israeli military official told CBS News that Hamas had targeted its soldiers with a rocket-propelled grenade and sniper fire.\n\"The IDF will continue to enforce the ceasefire agreement and will respond forcefully to any violation of the agreement,\" the Israeli military said in a statement.\nIsrael has released 150 bodies of Palestinians back to Gaza, including 15 on Sunday, according to the Hamas-run Gaza Health Ministry.\nThe next stages of the ceasefire are expected to focus on disarming Hamas, Israeli withdrawal from additional areas it controls in Gaza and future governance of the devastated territory.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-19T14:56:27Z",
    "source": "CBS News"
  },
  {
    "url": "https://www.theverge.com/tech/801684/meta-ray-ban-display-review-smart-glasses-ai-wearables",
    "title": "The future I saw through the Meta Ray-Ban Display amazes and terrifies me",
    "summary": "Then it tells me my battery is low and that for Meta AI to work properly, I need a better internet connection.\nBut as an able-bodied, sighted person, I’ve never found the Meta AI features that useful in my day-to-day life.\nAs for capturing photos and videos, I wish the Display had the better camera resolution of the second-gen Ray-Ban Meta glasses.\nSame goes if you have low-vision or blindness in the right eye, because Meta can’t swap the display to the left lens.\nTrust issuesThe most common reaction I’ve gotten both online and in person regarding the Meta Ray-Ban Display glasses is, “Those are actually cool.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-17T18:30:04Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.bbc.com/news/articles/ckgz85g6pj0o",
    "title": "Wrongfully imprisoned for more than 40 years, Pennsylvania man now faces deportation by ICE",
    "summary": "Now, Mr Vedam's legal team is fighting a deportation order and his family is determined to get him out of custody, for good.\nThe 1980 murderMore than 40 years ago, Mr Vedam was convicted of murdering his once-roommate Tom Kinser, a 19-year-old college student.\nEarlier this month, Centre County District Attorney Bernie Cantorna said he would not pursue a new trial against Mr Vedam.\nBut when they arrested him, ICE cited the immigration order as their reasoning for quickly detaining him in a different Pennsylvania facility.\nICE did not respond to the BBC's request for comment, but told other US outlets that Mr Vedam will remain in custody pending his deportation.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-10-18T20:12:09Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/longest-us-government-shutdowns-ranked",
    "title": "The longest government shutdowns in US history, ranked",
    "summary": "Congress has failed to agree on a funding bill to keep the government open.\nCongress has failed to agree on a funding bill to keep the government open.\nAndrew Harnik/Getty ImagesCongress has failed to agree on a funding bill to keep the government open.\nAndrew Harnik/Getty Imageslighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-10-17T18:52:13Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.cnn.com/2025/10/18/travel/travel-news-nazi-underground-city",
    "title": "Deep underground, the Nazis built a city for thousands of soldiers. Now it’s a tourist attraction",
    "summary": "The Kingsway Exchange Tunnels in February 2025 12 photos The London Tunnels: A mile-long series of tunnels under Chancery Lane tube station in London is set to be turned into a major tourist attraction.\nMaureen O'Hare/CNN Tunnels and shafts: The tunnels were built between 1940 and 1942 as a deep-level air raid shelter during World War II.\nMaureen O'Hare/CNN Periods of obsolescence: They were constructed in just 18 months, but were never put to use as a shelter.\nMaureen O'Hare/CNN Powerhouse: “Anything you think is interesting, we’ll think is interesting and we’d keep it,” says London Tunnels CEO Angus Murray.\nMaureen O'Hare/CNN Inspiration for James Bond: Writer Ian Fleming worked here in 1944 when it was the underground base of Britain’s top-secret Special Operations Executive.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-18T10:00:53Z",
    "source": "CNN"
  },
  {
    "url": "https://gothamist.com/news/federal-agents-handcuff-detain-people-outside-midtown-migrant-shelter",
    "title": "Two men arrested by federal agents outside Midtown migrant shelter, feds say",
    "summary": "The Department of Homeland Security confirmed Friday evening it arrested Cristofer Xavier Hernandez Villegas and Ali Eloy Uribe-Gil outside the hotel Thursday.\nGothamist obtained phone footage filmed outside of the hotel showing one person being taken into custody by law enforcement wearing FBI and ICE/HSI vests.\n“As the mayor has consistently stated, New York City does not participate in civil immigration enforcement,” said mayoral spokesperson Liz Garcia.\nThe Adams administration first announced its plans to close the Row Hotel shelter in August and said it would not renew its lease, which expires in April.\nThe hotel housed around 3,600 migrants during the peak of the migrant crisis in January 2024, and was the first and largest city hotel to be converted into a migrant shelter.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-18T00:00:00Z",
    "source": "Gothamist"
  },
  {
    "url": "https://www.bbc.com/news/articles/cj3zemk2j4ro",
    "title": "'No Kings' protests: where does Democratic opposition go next?",
    "summary": "After 'No Kings' protests, where does Democratic opposition go next?\nJust down the street from the No Kings gathering in the nation's capital, the White House responded to the protests with derision.\nThe pain from the shutdown – particularly for those in the Democratic coalition – is only going to increase as the weeks go by.\nThe reality is that Democratic leaders in the Senate will ultimately have to find a way out of the crisis.\nElections for governor and state legislatures could provide a barometer for whether the anti-Trump sentiment on display at the \"No Kings\" protests translates into electoral success for Democrats.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-19T20:48:40Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cn8xlx53jn6o",
    "title": "Mamdani, Cuomo and Sliwa spar over housing, city noise and Trump",
    "summary": "They tangled over housing, Israel and Gaza, and President Donald Trump, with frontrunner Zohran Mamdani pressing main competitor Andrew Cuomo during the heated two-hour debate.\nBut Cuomo attacked Mamdani for his views, calling the New York state assemblyman a \"divisive personality across the board\".\nCuomo, meanwhile, positioned himself as the only candidate experienced enough to deal with the current White House, warning \"it will be Mayor Trump\" if Mamdani is elected.\nThe former governor rebutted that the case brought by New York State Attorney General Letitia James, who investigated the misconduct claims, \"was political\".\nAs the founder of the Guardian Angels, a New York City organization devoted to crime prevention, he seized the opportunity to connect with voters.",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2025-10-17T02:43:13Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.aljazeera.com/gallery/2025/10/19/photos-millions-of-us-protesters-hold-anti-trump-no-kings-rallies",
    "title": "Millions of US protesters hold anti-Trump ‘No Kings’ rallies",
    "summary": "Huge crowds took to the streets in all 50 states of the United States to hold “No Kings” protests, expressing anger over President Donald Trump’s hardline policies, while Republicans ridiculed them as “Hate America” rallies.\nOrganisers said seven million people attended protests spanning from New York to Los Angeles on Saturday, with demonstrations taking place in small cities across the US heartland and even near Trump’s home in Florida.\nDemonstrators condemned what they described as the Republican billionaire’s strong-arm tactics, including attacks on the media, political opponents, and undocumented immigrants.\nIn Los Angeles, protesters floated a giant balloon portraying Trump in a nappy.\nAddressing the crowd outside the US Capitol, progressive Senator Bernie Sanders warned of the dangers facing democracy under Trump.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-19T07:33:39Z",
    "source": "Al Jazeera English"
  }
]