[
  {
    "id": "NDc=",
    "url": "https://www.yahoo.com/news/articles/u-could-block-asylum-public-163024770.html",
    "title": "U.S. could block asylum on public health grounds under Trump regulation",
    "summary": "By Ted HessonWASHINGTON, Dec 29 (Reuters) - The U.S. could deny migrants at the U.S.-Mexico border access to asylum under a newly finalized regulation ​drafted during the COVID-19 pandemic in President Donald Trump's first term.\nThe ‌regulation, which goes into effect on Wednesday, allows U.S. authorities to bar asylum based on \"emergency public ‌health concerns generated by a communicable disease,\" according to a copy posted in the Federal Register on Monday.\nAdvertisement AdvertisementAdvertisement AdvertisementThe restrictions would not have any immediate effect but would provide the Trump administration with another tool to turn away would-be asylum seekers at ⁠the U.S.-Mexico border.\nAdvocates have criticized the use of health emergencies to broadly deny access to asylum, saying U.S. ⁠law has been twisted to fulfill Trump's goal ​of turning away migrants.\nIn addition to asylum, the measure also allows federal ‌agencies to deny another form of protection known as \"withholding of removal.\"",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-29T16:35:42Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDk=",
    "url": "https://www.yahoo.com/news/articles/us-justice-department-sues-virginia-175439524.html",
    "title": "US Justice Department sues Virginia over in-state tuition for migrants",
    "summary": "By Nate RaymondDec 30 (Reuters) - The U.S. Department of Justice has filed a lawsuit challenging a Virginia law that makes immigrants in the country illegally eligible for reduced in-state tuition ​and financial aid at the state's public colleges and universities.\nThe Justice Department argues the measure ‍conflicts with federal immigration law in violation of the U.S. Constitution because it gives educational benefits to illegal immigrants that are denied to U.S. citizens from other states.\n\"This Department of Justice will not tolerate American students being treated like second-class citizens in their own country.\"\nThe Justice Department filed the lawsuit in Richmond federal court days before Republican Governor Glenn Youngkin leaves office and hands ⁠control to Democrat Abigail Spanberger.\nAdvertisement AdvertisementAdvertisement AdvertisementUnder Trump, the Justice Department has ⁠filed at least six lawsuits challenging similar policies in Texas, Kentucky, Illinois, Oklahoma, Minnesota and California.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-30T17:54:39Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTA=",
    "url": "https://abc7news.com/post/san-francisco-loses-21-immigration-judges-100-nationwide-many-reportedly-explanation/18331917/",
    "title": "21 immigration judges fired in San Francisco, many reportedly without explanation",
    "summary": "21 immigration judges fired in San Francisco, many reportedly without explanationSAN FRANCISCO (KGO) -- Immigration advocates are sounding the alarm as more immigration judges are getting fired in San Francisco.\nAt least 21 immigration judges serving the San Francisco Bay Area have been fired.\nOn Nov. 21, the week before Thanksgiving, he says he was one of five judges fired on the same day.\nPart of the law indicates that as an immigration judge, we should use our independent decision making, authority and discretion as independent immigration judges.\nMORE: Federal judge orders SF ICE building to improve 'inhumane' conditions immediatelyWith approximately four immigration judges left in San Francisco, Professor Hing is concerned San Francisco's backlog will worsen at a time.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-30T15:04:56Z",
    "source": "KGO-TV"
  },
  {
    "id": "NTE=",
    "url": "https://www.yahoo.com/news/articles/dhs-says-real-id-dhs-170537669.html",
    "title": "DHS Says REAL ID, Which DHS Certifies, Is Too Unreliable To Confirm U.S. Citizenship",
    "summary": "Only the government could spend 20 years creating a national ID that no one wanted and that apparently doesn't even work as a national ID.\nIn a December 11 court filing, Philip Lavoie, the acting assistant special agent in charge of DHS' Mobile, Alabama, office, stated that, \"REAL ID can be unreliable to confirm U.S.\nLavoie's declaration says that the agents \"needed to further verify his U.S. citizenship because each state has its own REAL ID compliance laws, which may provide for the issuance of a REAL ID to an alien and therefore based on HSI Special Agent training and experience, REAL ID can be unreliable to confirm U.S.\nContrary to the cheeky first sentence of this story, DHS insists that REAL ID is not a national ID system, and that it doesn't involve a centralized national database.\nThe post DHS Says REAL ID, Which DHS Certifies, Is Too Unreliable To Confirm U.S.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-31T17:05:37Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTQ=",
    "url": "https://newrepublic.com/post/204835/cbp-official-greg-bovino-arrest-us-citizens",
    "title": "Border Patrol Chief Admits They’re Arresting U.S. Citizens",
    "summary": "Justice officials were initially worried that Homan wouldn’t be able to get a security clearance, but when he did, federal prosecution planned to monitor him during his time as border czar to see if he continued to move corruptly.\nBut the probe was eventually dropped by Kash Patel’s FBI—even as Justice Department internal documents pointed to proof of Homan’s CAVA bag bribe.\nTrump didn’t agree to send that list until December 3, and when he did, it was incomplete.\nNow, the White House has been forced to fully defend Homan while ignoring the fact that the federal government was actively investigating him for bribery.\n“Tom Homan is a career law enforcement officer and lifelong public servant who is doing a phenomenal job on behalf of President Trump and the country.”",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-31T15:58:29Z",
    "source": "The New Republic"
  },
  {
    "id": "NTU=",
    "url": "https://abcnews.go.com/Politics/judge-documents-suggest-top-doj-officials-pushed-prosecute/story?id=128792629",
    "title": "Judge says documents suggest top DOJ officials may have pushed to prosecute Kilmar Abrego Garcia after wrongful deportation",
    "summary": "Judge says documents suggest top DOJ officials may have pushed to prosecute Kilmar Abrego Garcia after wrongful deportationKilmar Abrego Garcia, with his wife Jennifer Vasquez Sura, departs following a Temporary Restraining Order hearing at the at the federal court house in Greenbelt, Maryland, Dec. 22, 2025.\nKilmar Abrego Garcia, with his wife Jennifer Vasquez Sura, departs following a Temporary Restraining Order hearing at the at the federal court house in Greenbelt, Maryland, Dec. 22, 2025.\nAbrego Garcia was released from immigration custody earlier this month, and is seeking to have the criminal case dismissed, claiming he is the victim of selective and vindictive prosecution.\nThe federal judge said the documents may contradict the government's argument that the decision to prosecute Abrego Garcia \"was made locally and that there were no outside influences.\"\nThe Trump administration claimed he was a member of the criminal gang MS-13, which Abrego Garcia denies.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-12-30T23:29:13Z",
    "source": "ABC News"
  },
  {
    "id": "NTg=",
    "url": "https://www.rt.com/africa/630187-uk-imposes-visa-curbs-drc/",
    "title": "UK imposes visa curbs on African nation",
    "summary": "According to the ministry, the three African countries have repeatedly hindered Britain’s attempts to deport thousands of undocumented migrants and individuals with criminal records.\n“The days of Britain being a soft touch for illegal migrants and foreign criminals are over,” Shabana Mahmood said on X.\nHowever, the ministry noted that Angola and Namibia have since pledged to improve their procedures and accept the return of illegal migrants and criminals.\n“Further, countries that refuse the return of their citizens will lose the privilege of entering the UK,” the Home Office noted.\nThe UK Home Office reported a record 111,084 asylum applications between June 2024 and June 2025, marking a 14% increase year-on-year.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-12-29T10:27:10Z",
    "source": "RT"
  }
]