[
  {
    "id": "Mzc=",
    "url": "https://www.bbc.com/news/articles/cq57j559eq4o",
    "title": "Blind refugee dies in New York after released by immigration",
    "summary": "Video from body-worn cameras released by Buffalo police shows the man holding two black rods when officers appear, and repeatedly saying \"sorry.\"\nWhen he does not drop the rods after repeated requests to do so, the officer deploy tasers, and he walks forward swinging the rods until one officer wrestles him to the ground.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-28T03:48:28Z",
    "source": "BBC News"
  },
  {
    "id": "Mzg=",
    "url": "https://www.bbc.com/news/articles/cly07pyde00o",
    "title": "UK asylum claims drop slightly in 2025 as small boat arrivals rise by 13%",
    "summary": "And although many people relate asylum seekers with those people seen arriving on British beaches, a similar proportion in recent years has been made up of claims from people who had previously arrived in the UK on work, study or visitor visas, or on other leave with relevant documentation.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-26T12:23:57Z",
    "source": "BBC News"
  },
  {
    "id": "NDA=",
    "url": "https://calmatters.org/justice/2026/02/alpr-border-patrol-caltrans/",
    "title": "How Border Patrol ALPRs are changing life on California border- CalMatters",
    "summary": "In summary Southern California residents are noticing new license plate readers that appear to be operated by the Border Patrol.\nCordero is concerned about the use of new automated license plate readers along the U.S.-Mexico border in California.\nBorder Patrol provides little information about its use of license plate readers on its website.\nPhoto by Zoë Meyers for CalMattersNewsom vetoed a bill to strengthen California license plate reader law last fall.\nPulling over grandmaAn Associated Press investigation published in November revealed that Border Patrol had hidden license plate readers in ordinary traffic safety equipment.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-26T18:27:11Z",
    "source": "CALmatters"
  },
  {
    "id": "NDE=",
    "url": "https://news.slashdot.org/story/26/02/26/127223/americans-are-leaving-the-us-in-record-numbers",
    "title": "Americans Are Leaving the US in Record Numbers",
    "summary": "Give a man a fish, and you feed him for a day.\nTeach a man to fish, and he'll invite himself over for dinner.\n- Calvin Keegan",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-02-26T12:07:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "NDI=",
    "url": "https://www.aljazeera.com/news/2026/2/26/near-blind-rohingya-refugee-dies-after-us-agents-left-him-far-from-home",
    "title": "Near-blind Rohingya refugee dies after US agents left him far from home",
    "summary": "Nurul Amin Shah Alam, 56, was a nearly blind Rohingya refugee from Rakhine state in Myanmar, family members said.\nShah Alam had been missing since February 19, when US Border Patrol agents dropped him off at a coffee shop following his release from a county jail.\nMayor of Buffalo Sean Ryan, a Democrat, said in a statement on Wednesday that Shah Alam’s death was preventable and the result of “inhumane” decision-making by federal immigration authorities.\n“Border Patrol agents offered him a courtesy ride, which he chose to accept to a coffee shop, determined to be a warm, safe location near his last known address, rather than be released directly from the Border Patrol station,” the agency said.\nShah Alam’s death comes as an immigration crackdown enforced by the administration of US President Donald Trump is facing increased scrutiny.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-02-26T08:39:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDM=",
    "url": "https://www.aljazeera.com/video/newsfeed/2026/2/27/near-blind-rohingya-refugee-found-dead-after-border-patrol-release",
    "title": "Near-blind Rohingya refugee found dead after border patrol release",
    "summary": "NewsFeed Near-blind Rohingya refugee found dead after border patrol releaseOutrage in New York after 56-year-old Rohingya refugee Nurul Amin Shah Alam, nearly-blind and medically vulnerable, was found dead days after US Border Patrol agents released him at a Tim Hortons restaurant miles from home.\nOfficials say it was a “courtesy ride”.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-27T20:27:17Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDQ=",
    "url": "https://www.aljazeera.com/news/2026/2/27/deadly-journeys-refugees-migrants-risk-everything-to-reach-europe",
    "title": "Deadly journeys: Refugees, migrants risk everything to reach Europe",
    "summary": "Qualified riskThe risks of travelling to and through Libya are well known among migrants and refugees.\nAdvertisementA report, issued by the UN Human Rights Office in February, painted a bleak picture of life for refugees and irregular migrants in Libya.\nIn it, researchers described an environment where traffickers and armed groups could conduct widespread and systematic abuse against migrants with impunity.\nSpeaking from Libya’s capital Tripoli, Ola described being beaten and held prisoner by one of the militias in Zuwara, which is in western Libya.\nIt was very bad; it had salt in it.”“I did not have a [reputation for taking risks] in my country,” Ola said.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-02-27T12:24:50Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDU=",
    "url": "https://www.yahoo.com/news/articles/irs-broke-law-disclosing-confidential-202746624.html",
    "title": "The IRS broke the law by disclosing confidential information to ICE 42,695 times, judge says",
    "summary": "WASHINGTON (AP) — A federal judge said Thursday that the IRS broke the law by disclosing confidential taxpayer information “approximately 42,695 times\" to Immigration and Customs Enforcement.\nU.S. District Judge Colleen Kollar-Kotelly found that the IRS had erroneously shared the taxpayer information of thousands of people with the Department of Homeland Security as part of the agencies’ controversial agreement to share information on immigrants for the purpose of identifying and deporting people illegally in the U.S.\nThe government is appealing the case, but the Thursday ruling is significant because Romo's declaration supports the decision on appeal.\nAdvertisement AdvertisementIn declining the preliminary injunction request, Judge Harry T. Edwards wrote that the nonprofit groups “are unlikely to succeed on the merits of their claim,” since the information the agencies are sharing isn’t covered by the IRS privacy statute.\nStill, two separate court orders have blocked the agencies from massive transfers of taxpayer information and blocked ICE from acting upon any IRS data in its possession.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-02-26T20:27:46Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDY=",
    "url": "https://www.cbc.ca/news/world/us-ny-buffalo-myanmar-migrant-death-9.7106756",
    "title": "Police investigating Myanmar refugee's death after his release from U.S. federal immigration custody",
    "summary": "Homicide detectives are investigating the circumstances of Shah Alam's death, the spokesperson said.\nBuffalo Mayor Sean Ryan, a Democrat, said in a statement Wednesday that Shah Alam's death was preventable and the result of \"inhumane\" decision-making by federal immigration authorities.\nShah Alam was released on bail this month after he had agreed to a plea deal, the district attorney's office said.\nFollowing Shah Alam's arrest, U.S. Immigration and Customs Enforcement issued an immigration detainer, a formal request to take custody of a non-citizen after his scheduled release from criminal detention.\nWhen Shah Alam did not understand police commands to drop his curtain rod, they arrested him, his son said.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-02-26T15:55:27Z",
    "source": "CBC News"
  }
]