[
  {
    "url": "https://www.bbc.com/news/articles/c4gerg74y71o",
    "title": "'People are angry': Behind the wave of asylum hotel protests",
    "summary": "The case has sparked a wider conversation about the effect of housing asylum seekers in hotels in communities across Britain.\nOne of the asylum seekers says that living in a hotel room 24 hours a day is messing with his mind.\nAsylum seekers would say they are seeking protection by coming to the UK, although some are ultimately judged not to be eligible for asylum status.\nThat comment, \"I don't know who they are\", lies at the heart of the opposition to asylum seekers in these communities.\nEpping Forest District Council's Conservative Leader, Chris Whitbread recently said that \"it is important to be transparent\" about asylum hotel information.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-08T23:03:08Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/hunger-disease-spreading-war-torn-150926777.html",
    "title": "Hunger and disease spreading in war-torn Sudan, WHO says",
    "summary": "LONDON (Reuters) -Hunger and disease are spreading in war-torn Sudan, with famine already present in several areas, 25 million people acutely food insecure and nearly 100,000 cholera cases recorded since last July, the World Health Organisation said on Friday.\n\"Relentless violence has pushed Sudan's health system to the edge, adding to a crisis marked by hunger, illness and despair,\" WHO Senior Emergency Officer Ilham Nour said in a statement.\nAdvertisement AdvertisementAdvertisement Advertisement\"Exacerbating the disease burden is hunger,\" she said, adding that about 770,000 children under 5 years old are expected to suffer from severe acute malnutrition this year.\nCholera has also hit a camp for Darfur refugees in neighbouring eastern Chad, the United Nations refugee agency said on Friday.\n(Reporting by Matthias Williams and Lewis Macdonald Editing by Miranda Murray)",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-08-08T15:09:26Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/c04r5y5xv11o",
    "title": "Posing as a migrant to infiltrate a cross-Channel gang",
    "summary": "Here, one of our reporters who assumed a false identity and posed as a migrant, describes how he met one of the gang's senior members in a secret forest hideout.\nI have, at most, three hours of battery life left, and I need to get to the smuggler's secret camp, meet him, and get out safely.\nWith gang members monitoring everyone who enters the forest, I worry my advisers may end up exposing me rather than protecting me.\nI walk down a path to the smugglers' camp trying to remember the way I came in.\nIn person in the forest, Abdullah appears friendlier than most of the smugglers I have encountered.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-08-10T05:00:06Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cm2klzxldl6o",
    "title": "North Korea dismantles propaganda speakers at border",
    "summary": "North Korea dismantles propaganda speakers at border2 days ago Share Save Alex Kleiderman BBC News Share SaveAFP via Getty ImagesSouth Korea's military says North Korea has begun removing some of the loudspeakers used to broadcast propaganda across the border between the two countries.\nSouth Korean broadcasts had often featured K-pop songs and news reports while the North played unsettling noises, such as howling animals.\nIn a statement on Saturday, South Korea's military said it had \"detected North Korean troops dismantling propaganda loudspeakers in some parts along the front line from this morning\".\nBut speaking after South Korea suspended its broadcasts in June, organisations advocating to improve the human rights of North Koreans criticised the move.\nKIM JAE-HWAN/AFP via Getty Images South Korea began taking down some of its own speakers this week",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-08-09T12:34:26Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/south-koreas-military-says-north-083410087.html",
    "title": "South Korea's military says North Korea is removing speakers from their tense border",
    "summary": "SEOUL, South Korea (AP) — South Korea’s military said Saturday it detected North Korea removing some of its loudspeakers from the inter-Korean border, days after the South dismantled its own front-line speakers used for anti-North Korean propaganda broadcasts, in a bid to ease tensions.\nSouth Korea’s Joint Chiefs of Staff didn’t disclose the sites where the North Koreans were removing speakers and said it wasn’t immediately clear whether the North would take all of them down.\nIn recent months, South Korean border residents have complained that North Korean speakers blasted irritating sounds, including howling animals and pounding gongs, in a tit-for-tat response to South Korean propaganda broadcasts.\nSouth Korea’s military began removing its speakers from border areas on Monday but didn't specify how they would be stored or whether they could be quickly redeployed if tensions flared again.\nSouth Korea’s previous conservative government resumed daily loudspeaker broadcasts in June last year, following a yearslong pause, in retaliation for North Korea flying trash-laden balloons toward the South.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-08-09T08:34:10Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/h-1b-visa-big-tech-immigration-green-card-2025-8",
    "title": "H-1B Visa: 7 Current or Ex Big Tech Workers Share Immigration Stories",
    "summary": "Business Insider spoke to seven current or former H-1B recipients who moved from India and found work in Big Tech.\nI've seen misconceptions about the H-1B visa that it is replacing US jobs.\nI also get paid similarly to my US colleagues, so I don't think it's fair to say H-1B visa holders are cheap labor.\nI kicked off the process for my Optional Practical Training and received my H-1B visa in the lottery on my first try.\nI relied on my employer for my H-1B visa status and was cautious of not violating my immigration status.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-08T04:05:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.yahoo.com/news/videos/rescue-operations-underway-flash-floods-155754093.html",
    "title": "Rescue operations underway after flash floods hit India’s Dharali",
    "summary": "STORY: :: Indian rescue crews step up search operations days after deadly flash floods hit a Himalayan village:: August 10, 2025:: Dharali, IndiaDrone footage showed houses in Dharali village buried in debris, with excavators removing boulders at the site of the mudslide.\nMultiple army personnel, villagers and laborers continue to remain missing, said Indo-Tibetan Border Police Commandant, Bhanu Pratap Singh on Saturday (August 9).\nAdvertisement AdvertisementAdvertisement AdvertisementDharali, a hamlet of about 200 people that stands more than 3,775 ft (1,150 m) above sea level, is a pit-stop for Hindu pilgrims climbing to the temple town of Gangotri.\nSeveral deadly flood disasters have taken place in the mountain range over the past decade or so, which experts have blamed on climate change and widespread developmental activities on its slopes.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-08-10T15:57:54Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.cnn.com/2025/08/08/politics/gimenez-resolution-strip-ramirez-homeland-security-committee-house",
    "title": "Rep. Gimenez pushes to strip Rep. Ramirez of committee assignment after saying she’s ‘a proud Guatemalan before I am an American’",
    "summary": "Congressional news National security Federal agencies See all topics FollowRepublican Rep. Carlos Gimenez is introducing a resolution that would remove Illinois Rep. Delia Ramirez from the House Homeland Security Committee, citing recent comments the Democrat made at a summit in Mexico City.\nEverything I am, I owe to this exceptional country of limitless opportunities,” Gimenez said in part in a statement.\n“I am the most progressive member of Congress on the Committee on Homeland Security.\nRamirez is not the only Democrat who could be removed from the House Homeland Security Committee in September.\nGOP Rep. Clay Higgins has introduced a privileged resolution to censure Democratic Rep. LaMonica McIver, which would also remove her from the panel.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-08-08T19:15:30Z",
    "source": "CNN"
  }
]