[
  {
    "id": "MTc=",
    "url": "https://www.wired.com/story/leading-us-research-lab-appears-to-be-squeezing-out-foreign-scientists/",
    "title": "Leading US Research Lab Appears to Be Squeezing Out Foreign Scientists",
    "summary": "One of the US government’s top scientific research labs is taking steps that could drive away foreign scientists, a shift lawmakers and sources tell WIRED could cost the country valuable expertise and damage the agency’s credibility.\nThe National Institute of Standards and Technology (NIST) helps determine the frameworks underpinning everything from cybersecurity to semiconductor manufacturing.\nMany of the agency’s thousands of employees, postdoctoral scientists, contractors, and guest researchers are brought in from around the world for their specialized expertise.\nThe staffer, who spoke on the condition of anonymity because they were not authorized to speak to the media, says the Department of Commerce, which oversees NIST, originally pushed for banning all foreign researchers.\nNIST spokesperson Rich Press said the agency would respond to the lawmakers' letter \"through the appropriate channels.\"",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-20T10:00:00Z",
    "source": "Wired"
  },
  {
    "id": "NDI=",
    "url": "https://www.npr.org/2026/02/19/g-s1-110721/trump-administration-refugees-memo-arrest",
    "title": "Refugees in the U.S. could be arrested under a new immigration memo",
    "summary": "Refugees must either get a green card within a year, or \"present themselves to the agency\" to avoid detention, according to a Feb. 18 memo from the U.S.\nCitizenship and Immigration Services and Immigration and Customs Enforcement.\nThe memo was filed as a part of documents submitted in a federal court case tied to refugees who were arrested in Minnesota.\nIt also states that refugees may be placed in immigration detention while their application for a green card is being considered.\nRefugees are required to apply for permanent residence, or a green card, after they've been in the country for at least a year.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-19T15:10:49Z",
    "source": "NPR"
  },
  {
    "id": "NDQ=",
    "url": "https://www.npr.org/2026/02/18/nx-s1-5699708/ice-observers-impeding-obstructing-interfering",
    "title": "The Trump administration is increasingly trying to criminalize observing ICE",
    "summary": "The Trump administration is increasingly trying to criminalize observing ICEtoggle caption Octavio Jones/AFP via Getty ImagesLike many people in the Twin Cities, Jess has been observing ICE officers: following them in her car and documenting their actions.\nEarlier this month, she was in North Minneapolis, when immigration agents told her and another observer they were impeding a federal investigation.\nFederal agents hopped out.\nNPR spoke with several other observers in Minnesota who said immigration officers told them they were impeding federal investigations.\nStancil has been public about following immigration officers, but he understands why others might feel intimidated.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-18T23:26:43Z",
    "source": "NPR"
  },
  {
    "id": "NDU=",
    "url": "https://abcnews.com/Politics/americans-oppose-tactics-ice-enforce-immigration-laws-21/story?id=130280899",
    "title": "Americans oppose the tactics ICE is using to enforce immigration laws by 2:1 margin: Poll",
    "summary": "By a 2-to-1 margin, Americans oppose the tactics ICE is using to enforce immigration laws, 62% to 31%.\nBy a 13-point margin, Americans oppose abolishing ICE, 50% to 37%.\nOpinions are polarized: 7 in 10 Democrats support abolishing ICE, while 8 in 10 Republicans oppose it.\nMore than 4 in 10 Americans say they are \"not concerned\" or \"concerned but not upset\" over the situation in Minnesota.\nEvan Vucci/APBy an 8-point margin, Americans oppose denying federal funds to so-called sanctuary cities that limit their cooperation with ICE, 46% to 38%.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-20T11:03:50Z",
    "source": "Abcnews.com"
  },
  {
    "id": "NDY=",
    "url": "https://www.businessinsider.com/moved-family-to-canada-little-planning-things-wish-i-knew-2026-2",
    "title": "My family moved to Canada with only 3 weeks of planning. It was chaotic, but we're still here 6 years later.",
    "summary": "Just a few weeks earlier, Hurricane Dorian had slammed into our home in the Bahamas, a country I'd lived in my entire life.\nMy family had spent 24 hours trapped in our attic, praying the roof would hold before evacuating to nearby Florida.\nHowever, in the wake of the disaster, the US authorities limited many Bahamians to stays of only a few weeks, our family among them.\nSix years later, I'm confident this move was the best decision we could have made for ourselves and our family.\nHowever, I still tell people, \"Don't move to a new country with only three weeks of planning!\"",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-18T16:24:01Z",
    "source": "Business Insider"
  },
  {
    "id": "NDc=",
    "url": "https://www.thedailybeast.com/ice-barbie-kristi-noem-makes-stunning-claim-in-bid-to-buy-luxury-jet-with-mile-high-privacy-chamber/",
    "title": "ICE Barbie’s Secret Mile-High Double Bed Pictured",
    "summary": "New images have revealed the plush queen-size bed in a private cabin aboard the luxury aircraft Kristi Noem has been using to jet around the country with her alleged lover-slash-adviser.\nSix pillows sit atop the vast mattress, with an armchair and what appears to be a mirrored wardrobe to the right of the bedside.\nNoem is understood to use the aircraft to jet around the country with her alleged lover, Lewandowski.\nNBC NewsDHS officials have reportedly told OMB that if the application is approved, the aircraft will be used for both deportations and official Cabinet business.\nAlong with the bedroom and queen-size bed, the plane also features a kitchen, living space, bar, showers, and several large TV sets.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-19T12:38:17Z",
    "source": "Daily Beast"
  },
  {
    "id": "NDg=",
    "url": "https://guessingheadlights.com/ice-agent-stopped-for-dui-asks-deputy-are-you-haitian-then-things-got-worse/",
    "title": "ICE Agent Stopped for DUI Asks Deputy: ‘Are You Haitian?’—Then Things Got Worse",
    "summary": "‘Are You Haitian?’: Agent Questions Deputy’s Nationality During StopThe encounter was already tense from the first words captured on bodycam.\nStruggling Sobriety Tests and a Plea Over CustodyThe video shows Deiseroth struggling with basic coordination tasks like walking in a straight line and reciting numbers.\nDeiseroth was booked into the Monroe County Jail on misdemeanor charges of driving under the influence and resisting without violence.\nAt the time the footage was released, Deiseroth remained on administrative leave pending the outcome of that review.\nSources: WPEC, NBC 6 South Florida, Florida Keys Weekly Newspapers",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-02-20T16:15:58Z",
    "source": "Guessingheadlights.com"
  },
  {
    "id": "NDk=",
    "url": "https://www.11alive.com/video/news/protests-grow-after-savannah-teacher-killed-in-ice-involved-car-chase/85-38b6a548-b918-4b85-8b8d-951c41ba4954",
    "title": "Protests grow after Savannah teacher killed in ICE-involved car chase",
    "summary": "Next up in 5Example video title will go here for this video",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-20T14:41:58Z",
    "source": "11Alive.com WXIA"
  },
  {
    "id": "NTA=",
    "url": "https://www.yahoo.com/news/articles/ice-begins-purchase-warehouses-owners-130708782.html",
    "title": "ICE begins to purchase warehouses, but some owners are backing out of deals",
    "summary": "In some cases, warehouse owners are refusing to sell.\nFloridaA TV reporter in Orlando spotted private contractors and federal officials last month touring a 439,945-square-foot (40,872-square-meter) industrial warehouse.\nAdvertisement AdvertisementPlans also are in the works to convert a warehouse in Oakwood into an ICE processing facility, Republican U.S. Rep. Andrew Clyde said in a statement, although no deed has been filed.\nKelly Ayotte sparred with federal officials after ICE disclosed plans to spend $158 million to convert a warehouse in Merrimack into a 500-bed processing center.\nThe announcement came just two days after ICE said it had made a “mistake” when it previously announced the purchase.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-21T13:07:08Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTE=",
    "url": "https://www.aljazeera.com/opinions/2026/2/19/migrants-are-not-responsible-for-the-uks-healthcare-crisis",
    "title": "Migrants are not responsible for the UK’s healthcare crisis",
    "summary": "This follows new data released by the Centre for Migration Control, suggesting that 752,000 migrants joined the GP register last year.\nBy 1971, about 31 percent of NHS doctors in England were born and qualified overseas.\nIn the 2010s, successive Conservative governments, while overseeing years of austerity and historically low funding growth in the health service, blamed migrants for its woes.\nThus, migrants do pay more to use the National Health Service.\nPerhaps when Britain releases itself from the idea that it is competing with migrants for care, it will realise that migrants are the care.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-19T10:19:23Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTI=",
    "url": "https://www.rt.com/africa/632775-eu-states-considering-deportation-hubs-africa/",
    "title": "EU states to establish deportation centers in Africa – Greek official",
    "summary": "Asylum seekers whose claims have been rejected will be transferred to the “return hubs,” Migration Minister Thanos Plevris has saidGreece is working with four European allies to establish migrant deportation centers outside the European Union (EU), with Africa the preferred destination, the country’s migration minister has said.\nGreek Migration Minister Thanos Plevris has said that Athens is coordinating with Germany, the Netherlands, Austria, and Denmark to create “return hubs” for asylum seekers whose claims have been rejected.\nEU member states have increasingly explored measures to curb irregular migration, including proposed deals involving Rwanda, which have sparked political and legal scrutiny.\nIn December 2025, 19 EU member states, including Greece, urged the European Commission to help fund “return hubs” outside the bloc, describing them as “innovative solutions” to address the influx.\nSimilar arrangements have also been pursued by the US, with the Trump administration deporting migrants to African countries including Cameroon, Eswatini, South Sudan and Ghana.",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2026-02-19T13:13:43Z",
    "source": "RT"
  },
  {
    "id": "NTM=",
    "url": "https://www.courier-journal.com/story/news/local/2026/02/19/haucks-corner-chef-in-ice-custody/88614238007/",
    "title": "Louisville chef taken into ICE custody during routine diversion meeting",
    "summary": "Feb. 19, 2026 Updated Feb. 20, 2026, 11:23 a.m.\nA Louisville attorney and owners of a Germantown restaurant are speaking out after a man was taken into U.S. Immigration and Customs Enforcement custody while at a routine probation meeting Feb. 10.\nAttorney Frank Mascagni said Aldo Renato Soto-Pantoja, 33, was meeting with a pretrial diversion program officer Feb. 10 when he was escorted into another room where ICE then placed him into custody.\nMascagni was first contacted about representing Soto-Pantoja by an employee at Hauck's Corner, a popular restaurant where Soto-Pantoja works as a chef.\nAlways eager to learn and better himself, all the man did was work and take care of his family,\" Rosenberg said.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-02-19T23:46:46Z",
    "source": "Courier Journal"
  }
]