[
  {
    "url": "https://www.bbc.com/news/articles/cq50n5pd2ejo",
    "title": "Paralegal sacked after offering to help dodge £60k illegal working fines",
    "summary": "Paralegal sacked after offering to help dodge £60k illegal working finesWatch: Undercover filming of alleged negotiation to fix a fineMr Hussain previously said he categorically denied \"all allegations, insinuations, and claims\".\nA paralegal who was secretly filmed telling a BBC undercover reporter how he can help businesses avoid fines of up to £60,000 for employing illegal workers, has been sacked.\nOur investigation also uncovered a man at the centre of an immigration crime group who said he had \"customers in every city\" and could enable illegal working.\nHe said: \"Sometimes we might have to make documents,\" said Mr Hussain, such as \"business agreements\".\nDuring the whole meeting with Mr Hussain, a man known as Shaxawan was present in the room.",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2025-11-18T00:28:34Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/migrants-thought-were-court-routine-120326269.html",
    "title": "Migrants thought they were in court for a routine hearing. Instead, it was a deportation trap",
    "summary": "Over several months, reporters for The Associated Press observed immigration court proceedings in 21 cities.\nOn the hearing date, federal agents communicate directly with DHS lawyers, who act as prosecutors in immigration courts.\nAdvertisement AdvertisementAdvertisement AdvertisementLack of independence limits immigration court’s authorityAlmost from the outset, immigration courts were plagued by a lack of resources, authority and judicial independence.\nFrom the bench at immigration court in Cleveland, she prided herself on listening carefully to each person’s asylum claim.\nMigrants rush to federal court to seek release from detentionThe gutting of the immigration court has driven migrants to one place where standards of judicial independence are upheld: federal court.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-11-19T12:03:26Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/ckgzge16vkdo",
    "title": "More than 250 arrested in Charlotte as immigration crackdown escalates",
    "summary": "More than 250 arrested in Charlotte as immigration crackdown escalatesUS Border Patrol agents have arrested more than 250 people in Charlotte since SaturdayBut local lawmakers and residents have railed against the detainments, which the federal government has dubbed \"Operation Charlotte's Web\".\nMore than 250 people have been arrested in Charlotte, North Carolina, as part of President Donald Trump's escalating crackdown on undocumented immigration, US officials say.\nThe city's mayor, also a Democrat, urged federal agents to operate with \"respect\" for the city's values.\nLike other cities subject to immigration crackdowns, some migrants in Charlotte are staying home for fear of federal agents in the city, according to local media reports.\n\"Once again, I call on federal agents to target violent criminals, not neighbors walking down the street, going to church, or putting up Christmas decorations,\" he wrote.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-11-20T15:20:12Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.cbsnews.com/news/charlotte-immigration-crackdown-north-carolina-ended-sheriff/?ftag=YHF4eb9d17",
    "title": "Sheriff's office says federal immigration crackdown in Charlotte, N.C., has ended, but DHS denies it's over",
    "summary": "A federal immigration crackdown based in Charlotte, North Carolina's largest city, is now over, a local law enforcement agency said Thursday.\nA U.S. Border Patrol agent stands outside a Home Depot store on Nov. 19, 2025 in Charlotte, North Carolina.\nFederal officials have offered few details about those arrested.\nImmigration officials have blanketed the country since January, pushing detention counts to all-time highs above 60,000.\nBig cities and small towns across the country are targeted daily amid higher-profile pushes in places such as Portland, Oregon, where more than 560 immigration arrests were made in October.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-11-20T18:15:43Z",
    "source": "CBS News"
  },
  {
    "url": "https://www.azcentral.com/story/news/local/arizona-environment/2025/11/18/adelita-grijalva-joins-rally-against-trump-border-wall-construction/87213721007/",
    "title": "Border wall opponents rally as Trump closes a 27-mile gap across a remote Arizona valley",
    "summary": "Construction crews are closing a 27-mile gap in the border wall, blocking migration for people and wildlife.\n'Day or night, they're watching you'Even before the decline, few of the migrants or smugglers likely crossed in the San Rafael Valley, according to Steve “Moon” Saultz.\nSaultz showed up at the border construction site for a Saturday protest that attracted about 200 people.\n“The San Rafael Valley is special,” Grijalva said.\nSan Rafael Valley resident Kate Scott helped organize the rally and joined friends in creating wildlife-themed banners to hang at the event celebrating not just the jaguar but pronghorns, bears, coyotes and others.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-11-18T12:01:25Z",
    "source": "AZCentral"
  },
  {
    "url": "https://www.yahoo.com/news/articles/chicago-street-vendor-couple-defiant-110749525.html",
    "title": "A Chicago street vendor couple has a defiant response to immigration arrests: Stick to the routine",
    "summary": "Sidewalk traffic on 26th Street is livelier than many commercial areas in Chicago, even with the immigration crackdown.\nThe couple met while working at a Mexican restaurant in Little Village.\nOn weekends they head to Little Village, where they work 11-hour days.\n“Those folks undercutting American businesses, is that right?” Bovino, a frequent presence in Chicago's Little Village, said in a recent interview.\nThey recently headed to Little Village to buy supplies for their business when word came on social networks that Bovino was in the area making arrests.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-11-21T11:07:49Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.thedailybeast.com/pope-leo-torches-trumps-extremely-disrespectful-agenda/",
    "title": "Pope Leo Torches Trump’s ‘Extremely Disrespectful’ Agenda",
    "summary": "Pope Leo XIV has launched a fresh volley at Donald Trump over his administration’s immigration policies.\nWhile speaking to reporters at Castel Gandolfo, his papal vacation residence outside Rome, the first American pope doubled down on his criticism of Trump’s mission to root out illegal immigration in the country.\nAlex Brandon/Pool via ReutersMany Catholic advocates have argued that the president’s practices conflict with Christian teaching.\nClergy have been among the protesters against Trump's immigration tactics, including in New York earlier this year.\nThe Trump administration announced last month it had carried out more than 527,000 deportations so far this year.",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2025-11-19T14:39:58Z",
    "source": "Daily Beast"
  },
  {
    "url": "https://www.yahoo.com/news/articles/man-accused-captaining-migrant-boat-031515641.html",
    "title": "Man accused of captaining migrant boat that capsized, killing 4, is charged",
    "summary": "SAN DIEGO (AP) — Federal officials on Monday charged a man believed to be the captain of a boat carrying migrants that capsized near San Diego, killing four passengers.\nThe man, a Mexican national, was charged with two counts of bringing people into the country illegally.\nAdvertisement AdvertisementAdvertisement AdvertisementOne man was trapped inside the cabin below deck when the boat overturned and submerged with him and several others inside, the complaint said.\nHe was freed after Border Patrol agents flipped the boat over.\nAnother man was a passenger on the boat and charged for being deported and trying to enter the U.S. again illegally.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-11-18T03:15:15Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.thedailybeast.com/border-patrol-goons-arrest-women-at-gunpoint-for-honking-car-horn-in-charlotte-north-carolina/",
    "title": "Border Patrol Goons Arrest Women at Gunpoint for Honking Car Horn",
    "summary": "Border Patrol detain one of the women for alerting others to their presence.\nWCNC/YouTubeA second woman, also a U.S. citizen, was arrested moments earlier, according to a report from WCNC Charlotte.\nAccording to the women’s family members, who spoke to WCNC, the pair were accused of honking their car horn to alert neighbors that Border Patrol was conducting operations nearby.\nThe incident unfolded amid a surge of federal immigration enforcement across the region as the Department of Homeland Security (DHS) carries out new Trump-era directives.\nThe increased presence of federal immigration agents in Charlotte has sparked protests.",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2025-11-19T13:19:10Z",
    "source": "Daily Beast"
  },
  {
    "url": "https://www.yahoo.com/news/articles/appeals-court-pauses-order-restricting-221141791.html",
    "title": "Appeals court pauses order restricting use of force by immigration agents in Chicago-area crackdown",
    "summary": "CHICAGO (AP) — A federal appeals court on Wednesday temporarily halted an order restricting the use of force by federal immigration agents in the Chicago area, calling it “overbroad” and “too prescriptive.”But the7th U.S.\nCircuit Court of Appeals also cautioned against “overreading” its stay and said a quick appeal process could lead to a “more tailored and appropriate” order.\nHe oversaw about 230 agents from U.S. Customs and Border Protection in the Chicago area starting in September.\nAfter North Carolina, federal border agents are expected to be deployed to New Orleans.\nThe immigration operation in the Chicago area has triggered multiple lawsuits, including allegations about inhumane conditions at a federal immigration center.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-11-19T22:11:41Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/lebanon-ready-negotiate-reach-agreement-205540969.html",
    "title": "Lebanon ready to negotiate to reach an agreement that would end Israeli strikes, president says",
    "summary": "BEIRUT (AP) — Lebanon is ready to negotiate to reach an agreement that would end Israeli strikes on the country and lead to Israeli withdrawal from five border hills it has occupied since the Israel-Hezbollah war ended last year, President Joseph Aoun said Friday.\nIn a televised speech marking Independence Day, Aoun added that Lebanese troops are ready to deploy in all points from where Israeli troops withdraw.\nIsrael said recently that Hezbollah is trying to rebuild its capabilities after it was weakened by the Israel-Hezbollah war.\nThe latest Israel-Hezbollah war began Oct. 8, 2023, a day after Hamas attacked southern Israel, after Hezbollah fired rockets into Israel in solidarity with Hamas.\nIsrael launched a widespread bombardment of Lebanon for two months last year that severely weakened Hezbollah, followed by a ground invasion.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-11-21T20:55:40Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/us-send-250-border-agents-232851824.html",
    "title": "US to send 250 border agents to Louisiana, Mississippi next month, AP reports",
    "summary": "WASHINGTON (Reuters) -The U.S. Department of Homeland Security is planning to deploy about 250 federal ​border agents to Louisiana and Mississippi aiming to arrest around ‌5,000 people in the two states, the Associated Press reported on Tuesday, ‌citing documents and three people familiar.\n\"Every day, DHS enforces the laws of the nation across the country,\" Assistant Homeland Security Secretary Tricia McLaughlin said.\nSpokespeople for Louisiana Governor Jeff Landry and Mississippi Governor Tate Reeves did not immediately respond to requests for comment.\nThe planned expansion to Louisiana and Mississippi will take place against the backdrop of an aggressive immigration crackdown by ‍the Trump administration.\nTrump's Border Czar Tom Homan ⁠told Fox News earlier on Tuesday that there are plans to increase enforcement operations in ‌New York City.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-11-18T23:28:51Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/federal-prosecutors-dismiss-charges-against-173451542.html",
    "title": "Federal prosecutors move to dismiss charges against woman shot by Border Patrol agent in Chicago",
    "summary": "CHICAGO (AP) — Federal prosecutors moved Thursday to dismiss charges against a woman who was shot several times by a Border Patrol agent last month during the federal immigration crackdown in the Chicago area.\nProsecutors had accused Marimar Martinez, 30, and Anthony Ruiz, 21, of using their vehicles to strike and box in Border Patrol agent Charles Exum’s SUV on Oct. 4 on Chicago’s southwest side.\nAdvertisement AdvertisementAdvertisement AdvertisementThe case against Martinez and Ruiz wasn't the only one prosecutors sought to drop Thursday.\nParente claimed body camera footage contradicted federal prosecutors' narrative of Martinez's actions.\nMartinez and Ruiz were both released pending trial after a judge noted they had no prior criminal record.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-11-20T17:34:51Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.wired.com/story/social-security-data-shared-with-dhs-target-immigrants/",
    "title": "Social Security Data Is Openly Being Shared With DHS to Target Immigrants",
    "summary": "Last week, the Social Security Administration (SSA) quietly updated a public notice to reveal that the agency would be sharing “citizenship and immigration information” with the Department of Homeland Security (DHS).\nThis data sharing was already happening: WIRED reported in April that the Trump administration had already started pooling sensitive data from across the government for the purpose of immigration enforcement.\nThis public notice issued by SSA makes that official, months after the fact.\nThe SORN from SSA is just the latest confirmation of exactly how much data is being shared in ways experts tell WIRED is “unprecedented.”Much of this data sharing begins with misinformation about the data at hand.\nLeland Dudek, who served as acting commissioner for the Social Security Administration between February and May 2025, led the agency when members of DOGE first appeared.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-11-18T11:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.cbsnews.com/news/israeli-military-strikes-lebanon-gaza-kill-dozens-people/?ftag=YHF4eb9d17",
    "title": "Israeli military strikes in Lebanon, Gaza kill dozens of people",
    "summary": "Meanwhile, hospitals in Gaza said Israeli strikes killed at least 21 Palestinians.\nIsrael's military said Hezbollah was working to reestablish itself and rebuild its capacity in southern Lebanon, without providing evidence.\nIsraeli strikes kill 21 in GazaHospitals in Gaza said at least 21 Palestinians were killed in Israeli strikes Wednesday on both sides of the yellow line established in last month's ceasefire.\nThe boundary splits the enclave in two, leaving the border zone under Israeli military control while the area beyond it is meant to serve as a safe zone.\nThe Israeli military said its strikes responded to militants who had opened fire on Israeli forces in Khan Younis earlier in the day.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-11-19T19:20:19Z",
    "source": "CBS News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/border-patrol-spreads-charlotte-nc-213353813.html",
    "title": "Border Patrol spreads from Charlotte to NC foothills",
    "summary": "We’ve gotten several reports of agent sightings along Highway 70 in Hickory, 24 hours after deputies confirmed Border Patrol agents would be in the city.\nALSO READ >> CMS absences nearly triple as Border Patrol conducts operations in cityOne woman who was in the parking lot says those workers had been picking up trash along Highway 321.\nIn Newton, several businesses are closed over concerns about border patrol coming to Catawba County.\nRELATED >> Daily Update: Border Patrol in Charlotte, Nov. 19One food store reopened this morning, but many of their customers stayed away.\nFaherty and Channel 9 did reach out to the commander of the Border Patrol about the arrests in Lenoir and asked if he wanted to do an interview.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-11-19T21:33:53Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://abcnews.go.com/US/federal-agents-begin-immigration-operations-raleigh-mayor/story?id=127620994",
    "title": "Local officials say immigration enforcement surge in Charlotte, North Carolina, ending after more than 250 arrests",
    "summary": "Local officials say immigration enforcement surge in Charlotte, North Carolina, ending after more than 250 arrestsBorder Patrol commander Greg Bovino looks on during an immigration raid on the streets of Charlotte, North Carolina, Nov. 17, 2025.\nBorder Patrol commander Greg Bovino looks on during an immigration raid on the streets of Charlotte, North Carolina, Nov. 17, 2025.\nBorder Patrol commander Greg Bovino looks on during an immigration raid on the streets of Charlotte, North Carolina, Nov. 17, 2025.\nBorder Patrol commander Greg Bovino looks on during an immigration raid on the streets of Charlotte, North Carolina, Nov. 17, 2025.\nA federal immigration crackdown dubbed Charlotte's Web has concluded in North Carolina's largest city after netting more than 250 arrests, local officials said on Thursday.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-11-18T11:41:06Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.theatlantic.com/newsletters/2025/11/border-patrol-durham-north-carolina-immigration-crackdown/685027/",
    "title": "Border Patrol’s Chaotic Week in North Carolina",
    "summary": "Last week, Leonardo Williams, the mayor of Durham, North Carolina, received a call from the office of Governor Josh Stein.\nIn Durham, where I live, sightings of apparent CBP agents around Durham continued throughout Tuesday.\nKeeping local officials in the dark seems to be part of the Trump administration’s plan.\nLike them, the North Carolina governor and the mayors of Charlotte, Durham, and Raleigh are all Democrats.\nAll Durham officials and residents can do is wait and see if it’s really over.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-11-21T23:41:00Z",
    "source": "The Atlantic"
  },
  {
    "url": "https://www.bbc.com/news/articles/c20p3x7vr34o",
    "title": "Shelters plea for Gazans as winter rains raise fears of more disease and death",
    "summary": "With a majority of the population displaced by two-years of a devastating war, most Gazans now live in tents - many of them makeshift.\nThey have been clearing up after widespread flooding due to a winter storm that began on Friday.\nOn Sunday, Cogat wrote on X: \"We call on international organizations to coordinate more tents and tarpaulins and other winter humanitarian responses.\"\nInternational aid groups are hoping that the CMCC - which will oversee implementation of President Trump's 20-point Gaza peace plan - will help ease restrictions on their work.\n\"They need a tent today, they don't need a promise of a beachfront structure in five years.\"",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-11-18T00:33:53Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.cbc.ca/news/politics/cbsa-refugee-asylum-one-touch-9.6986851",
    "title": "Border officers' union raises security concerns about use of automation during asylum intakes",
    "summary": "The head of the union representing Canada’s border officers is suggesting the government's move toward automating the refugee claimant process is creating security gaps.\nUnder the One Touch process, an eligible claimant is assessed by an officer and has their biometrics, like fingerprint impressions and photos, taken.\nThe senior CBSA official also said names and biometric information is run against border security and law enforcement databases.\nDuring a news conference earlier on Thursday, Conservative immigration critic Michelle Rempel Garner called the union’s comments “super concerning” and said her party is seeking more information.\nThe government has promised to hire 1,000 new border officers as part of its border security strategy.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-11-20T21:55:07Z",
    "source": "CBC News"
  }
]