[
  {
    "url": "https://www.theverge.com/news/801112/judge-orders-chicago-ice-agents-use-body-cams",
    "title": "Judge orders immigration agents in Chicago to use body cams",
    "summary": "He has over 18 years of experience, including 10 years as managing editor at Engadget.\nPosts from this author will be added to your daily email digest and your homepage feed.\nJudge Sara L. Ellis of the Federal District Court for the Northern District of Illinois said during a hearing Thursday morning that she would require ICE agents in Chicago engaged in “Operation Midway Blitz” to use body cameras.\nBut the logistics of enforcing her order are yet to be worked out, since Chicago was not included in earlier ICE body cam programs, and the government shutdown might complicate acquiring and issuing new equipment.\nAgents have been repeatedly documented using aggressive tactics, arresting elected officials, and have been spotted wearing face masks and no identifying badges while detaining people on the streets.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-16T19:08:33Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.bbc.com/news/articles/cy8v9jzn5zgo",
    "title": "Epping asylum hotel is a 'feeding ground for unrest'",
    "summary": "Asylum hotel a 'feeding ground for unrest'4 days ago Share Save Daniel Sandford UK correspondent at the High Court and Lewis Adams Essex Share SavePA Media Epping Forest District Council wants The Bell Hotel to be blocked from housing asylum seekersA hotel used by asylum seekers in Essex has become a \"feeding ground for unrest and protest\", the High Court has been told.\nEpping Forest District Council is seeking to block migrants lodging at The Bell Hotel in Epping, which was the scene of vociferous protests over the summer.\nLawyers for the authority accused Somani Hotels of \"sidestepping\" planning laws due to \"the lure of a trove of government-funded profits\".\nThe Home Office, which intervened in the case, argued the closure of asylum hotels must be \"structured\" and gradual.\nRepresenting Somani Hotels, Jenny Wigley KC said the business had been in financial decline \"for many years\".",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-10-15T11:44:34Z",
    "source": "BBC News"
  },
  {
    "url": "https://gizmodo.com/border-patrol-responds-like-a-petulant-child-to-controversy-over-its-antisemitic-video-2000673314",
    "title": "Border Patrol Responds Like a Petulant Child to Controversy Over Its Antisemitic Video",
    "summary": "A spokesperson for U.S. Border Patrol has finally issued a statement about the antisemitic social media video that the agency posted in August, but was just deleted this week.\nThe video and the responseThe Border Patrol video was posted months ago but went largely unnoticed by the broader public until Tuesday, when white supremacists on X started to post about it approvingly.\nAfter all the attention the video attracted, it seemed plausible that it had been deleted by Facebook moderators for hate speech violations.\nMeta gave us the run-around and wouldn’t say who had actually deleted the video.\nLast month, Gizmodo emailed the agency to inquire about a bizarre video that DHS had distributed, which featured video and music from Pokémon.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-17T13:20:00Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://abcnews.go.com/US/video/cartels-issuing-bounties-50000-hits-immigration-officials-dhs-126557451",
    "title": "Video Cartels issuing bounties up to $50,000 for hits on immigration officials, DHS says",
    "summary": "Cartels issuing bounties up to $50,000 for hits on immigration officials, DHS says There is credible intelligence that members of Mexican drug cartels have offered a \"tiered\" bounty system for hits against ICE and U.S. Customs and Border Protection officers, according to DHS.",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2025-10-15T18:38:24Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.theverge.com/news/799911/ipad-pro-thread-smart-home-apple-home-hub",
    "title": "The iPad just got the chip it needs to be a smart home controller",
    "summary": "Apple’s new M5-powered iPad Pro is the first iPad to officially support the Thread smart home protocol.\nAnd, if you already have a Thread border router but the power goes out, your iPad can step in to talk to battery-powered Thread devices such as smart locks.\nApple’s HomePod Mini (pictured), HomePod, and select Apple TV devices are Thread-enabled Apple Home hubs.\nWhile we’re all waiting for Apple’s long-rumored HomePod smart display to arrive, bringing back the iPad as a Home hub would be a welcome move.\nHowever, Thread-enabled Home hub capabilities would be more useful on lower-cost models or more compact ones, such as the iPad Mini — using a $1,000 M5 iPad Pro to run your smart home feels like overkill.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-10-15T19:28:29Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.yahoo.com/news/articles/israel-allow-gazas-rafah-crossing-061841331.html",
    "title": "Israel will allow Gaza's Rafah crossing to open, ramp up aid, broadcaster Kan reports",
    "summary": "JERUSALEM (Reuters) -Israel will allow Gaza's Rafah border crossing with Egypt to open on Wednesday and increase the amount of humanitarian aid coming into the enclave, public broadcaster Kan reported, after Hamas handed over more bodies of deceased hostages.\nSubject to Israel's security approval, Gazans who had left the enclave during the war will be allowed back in for the first time and others will be allowed to cross out through the Rafah crossing, Kan reported.\nSome 600 trucks carrying mainly food and medical supplies, as well as equipment needed for repairing damaged infrastructure, will be allowed in, Kan said.\nHours later Hamas handed four coffins over to Israel through the International Committee of the Red Cross.\nThree have so far been identified as Israeli hostages but there were doubts about the fourth body handed over, Israeli media reported.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-10-15T06:18:41Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.theatlantic.com/newsletters/archive/2025/10/week-of-bigotry-american-politics/684584/",
    "title": "It’s Not a Dog Whistle If Everyone Can Hear It",
    "summary": "Donald Trump’s 2016 campaign of racial grievance enabled him to shift the Court rightward with three new appointments.\nTrump himself has a long history of bigoted remarks, yet he has seized on bigoted comments by Black South Africans to justify inviting white South Africans to seek refuge in the United States.\nThe ability to use offensive language without social sanction is a core appeal of the MAGA movement for some supporters.\nAs The New York Times reports, this might include members of the far-right political party Alternative for Germany, or AfD.\nThe new Tron sequel (out now in theaters) travels beyond cyberspace but won’t leave the sci-fi nonsense behind, David Sims writes.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-16T22:52:00Z",
    "source": "The Atlantic"
  },
  {
    "url": "https://abcnews.go.com/US/los-angeles-county-declares-state-emergency-immigration-raids/story?id=126531481",
    "title": "Los Angeles County declares state of emergency over immigration raids",
    "summary": "A man waves the American flag in front of LAPD officers during the nationwide No Kings protest in Los Angeles, Calif., on June 14, 2025.\nA man waves the American flag in front of LAPD officers during the nationwide No Kings protest in Los Angeles, Calif., on June 14, 2025.\nLos Angeles County officials voted on Tuesday to declare a state of emergency over ongoing federal immigration raids.\n\"What’s happening in our communities is an emergency — and Los Angeles County is treating it like one,\" said Horvath in a press release.\nICE raids started in Los Angeles early June, prompting demonstrations that at times turned violent.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-10-15T01:21:05Z",
    "source": "ABC News"
  }
]