[
  {
    "id": "Mzk=",
    "url": "https://www.bbc.com/news/articles/cwyg2629g7do",
    "title": "Napier Barracks in Folkestone used for housing asylum seekers shuts",
    "summary": "Barracks used for housing asylum seekers closesThe site closed on Friday and will be handed over to a property developer for housing.\nNapier Barracks in Folkestone - a former military site - opened as accommodation for migrants in 2020.\nAn army barracks in Kent which has been used to house asylum seekers has closed, according to the Home Office.\nThe government had previously announced discussions had begun to use barracks in Crowborough in East Sussex and Inverness in Scotland to house about 900 male asylum seekers in total.\nNapier Barracks housed more than 300 asylum seekers at its peak, but was believed to have fewer than 100 residents ahead of its closure.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDA=",
    "url": "https://www.jezebel.com/trump-admin-stops-reuniting-immigrant-children-families-orr-vetting-data-family-separation",
    "title": "Trump Admin Has Abruptly Stopped Reuniting Immigrant Children with Their Families",
    "summary": "Since the advent of the second Trump administration, though, that’s just what the ORR has increasingly become, according to former staffers.\nRoughly 2,400 kids are in ORR shelters of this sort at the moment, with the largest concentration of more than 800 in Texas.\nStill, up until November, kids were still being reunited with family members by ORR on a daily basis.\nEight immigration attorneys contacted for the piece agreed, saying that starting in early November, ORR stopped responding to letters and communications demanding the release of children to qualified sponsors.\nEven when threatened with litigation, ORR hasn’t explained to these attorneys why the kids aren’t being released.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDE=",
    "url": "https://www.yahoo.com/news/videos/burundi-overwhelmed-tens-thousands-flee-170833505.html",
    "title": "Burundi 'overwhelmed' as tens of thousands flee eastern Congo",
    "summary": "Airbnb vs. hotel — which offers the better value?\nBefore you book your next trip, consider the accommodations that make the most sense for the way you want to travel.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDI=",
    "url": "https://www.npr.org/2025/12/18/nx-s1-5648584/judge-hannah-dugan-guilty-obstruction-ice",
    "title": "A federal jury finds Milwaukee judge guilty of obstructing immigration agents",
    "summary": "A federal jury finds Milwaukee judge guilty of obstructing immigration agentstoggle caption Adela Tesnow/Pool via APMILWAUKEE — A federal jury found Milwaukee County Circuit Court Judge Hannah Dugan guilty Thursday of obstructing immigration agents as they attempted to arrest an undocumented immigrant defendant last April.\nFlores-Ruiz, a Mexican national, was arrested outside the courthouse after a short chase by the immigration agents and has since been deported.\nDuring the trial, federal agents testified Dugan seemed \"angry\" when she approached them in the public hallway where they were waiting to arrest Flores-Ruiz after his hearing.\nSponsor MessageDuring the government's closing argument, Assistant U.S. Attorney Kelly Watzka said Dugan conducted a \"round-up\" of federal agents and sent them to the chief judge's office.\nUntil President Trump's first term, courthouses were typically off-limits to federal authorities, including immigration agents.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDM=",
    "url": "https://www.npr.org/2025/12/19/nx-s1-5649339/trump-suspends-u-s-green-card-lottery-after-brown-university-and-mit-shootings",
    "title": "Trump suspends U.S. green card lottery after Brown University and MIT shootings",
    "summary": "Trump suspends U.S. green card lottery after Brown University and MIT shootingstoggle caption Mark Schiefelbein/APPresident Donald Trump suspended the green card lottery program on Thursday that allowed the suspect in the Brown University and MIT shootings to come to the United States.\nSponsor MessageNeves Valente, 48, is suspected in the shootings at Brown University that killed two students and wounded nine others, and the killing of an MIT professor.\nNearly 20 million people applied for the 2025 visa lottery, with more than 131,000 selected when including spouses with the winners.\nSponsor MessageTrump has long opposed the diversity visa lottery.\nHe has not been deterred if they are enshrined in law, like the diversity visa lottery, or the Constitution, as with a right to citizenship for anyone born on U.S. soil.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDQ=",
    "url": "https://www.desertsun.com/story/news/crime_courts/2025/12/19/indio-police-investigate-crash-involving-ice-agents-in-indio/87852401007/",
    "title": "ICE agents involved in crash in Indio, ICE also active in Palm Springs",
    "summary": "Federal agents conducting immigration enforcement recently swept across multiple Coachella Valley cities, officials said Friday, Dec. 19.\n\"ICE has been very active in our city over the last few days,\" Palm Springs Police Chief Andy Mills said in a video posted on social media.\n\"We've actually spoken with ICE agents and let them know we are not assisting them in any way shape or form.\"\nHe also specified that Indio Police was not involved in any ICE enforcement or investigative activity but merely had provided an emergency response to the crash.\nSam Morgen covers the city of Palm Springs for The Desert Sun.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDU=",
    "url": "https://www.aljazeera.com/news/2025/12/19/tens-of-thousands-flee-dr-congo-to-burundi-after-rebel-takeover-of-key-city",
    "title": "Tens of thousands flee DR Congo to Burundi amid rebel takeover of key city",
    "summary": "UN refugee agency says women and children arriving ‘exhausted and severely traumatised’ after fleeing eastern DRC.\nThe UN refugee agency (UNHCR) said on Friday that Burundi had reached a “critical point” amid the influx of refugees and asylum seekers fleeing a surge in violence in the DRC’s South Kivu province.\nRefugees started crossing into Burundi on December 5, with numbers surging after M23 seized control of Uvira on December 10.\nIn Burundi, displaced families face difficult conditions at transit points and makeshift camps with minimal infrastructure, the UN said.\nThe rebel advance has given M23 control over substantial territory in the mineral-rich eastern DRC and severed a critical supply route for Congolese forces along the border with Burundi.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDY=",
    "url": "https://www.theatlantic.com/family/2025/12/immigration-pronatalism-trump-vance/685275/",
    "title": "The Truth About Immigration That MAGA Doesn’t Acknowledge",
    "summary": "(My toddler son has only ever been cared for by immigrant women, myself among them.)\nWhen fewer immigrants are in the American workforce, economic research suggests, women may work less or have fewer babies—possibly both.\nSome researchers anticipate that the Trump administration’s ICE operations will affect immigrant child-care workers even more than Secure Communities did.\nThe relationship between affordable child care and fertility is fuzzy; many countries with subsidized day care and other benefits for parents nevertheless have low birth rates.\nBut some data suggest that as child care gets more expensive or less available, women have fewer kids.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDc=",
    "url": "https://www.businessinsider.com/us-visa-requirements-social-media-review-what-to-know-h1b-2025-12",
    "title": "US Reviewing Socials of Some Visa Applicants. What You Should Know.",
    "summary": "Impact LinkThe United States is reviewing the social media accounts of some visa applicants, adding another hurdle for workers and other visitors to clear under the Trump administration.\nThe State Department said in June that certain visa applicants would have their online activity vetted as part of its screening process.\nConsular offices began conducting online presence reviews for H-1B applicants on December 15, but they're not the only ones affected.\nThose companies and many others are still smarting after Trump imposed the $100,000 fee on new H-1B visa applicants in September.\nThe widespread panic in corporate America forced the Trump administration to clarify that the fee would only apply to new visa applicants, not existing visa holders.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDg=",
    "url": "https://www.yahoo.com/news/articles/supreme-court-sides-immigration-judges-190757076.html",
    "title": "Supreme Court sides with immigration judges in speech case for now, rebuffing Trump administration",
    "summary": "WASHINGTON (AP) — The Supreme Court sided with immigration judges on Friday, rebuffing the Trump administration for now in a case with possible implications for federal workers as the justices weigh expanding presidential firing power.\nThe solicitor general asked the Supreme Court to quickly freeze the ruling as he pushes to have the immigration judges’ case removed from federal court.\n“The restrictions on immigration judges’ free speech rights are unconstitutional, and it’s intolerable that this prior restraint is still in place,” Krishnan said.\nIn recent months, the Trump administration's crackdown on immigration has included firing dozens of immigration judges who are seen by his allies as too lenient.\nThe court has sided with the Trump administration about two dozen times on issues ranging from immigration to federal funding.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDk=",
    "url": "https://abcnews.go.com/US/milwaukee-judge-found-guilty-felony-obstruction-helping-undocumented/story?id=128524404",
    "title": "Milwaukee judge found guilty of felony obstruction in helping undocumented man evade arrest",
    "summary": "Wisconsin-based Judge Hannah Dugan arrives for the first day of trial in Milwaukee, Wisconsin, December 15, 2025.\nWisconsin-based Judge Hannah Dugan arrives for the first day of trial in Milwaukee, Wisconsin, December 15, 2025.\nWisconsin-based Judge Hannah Dugan arrives for the first day of trial in Milwaukee, Wisconsin, December 15, 2025.\nWisconsin-based Judge Hannah Dugan arrives for the first day of trial in Milwaukee, Wisconsin, December 15, 2025.\nWisconsin-based Judge Hannah Dugan arrives for the first day of trial in Milwaukee, Wisconsin, December 15, 2025.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTA=",
    "url": "https://www.nakedcapitalism.com/2025/12/ethnic-cleansing-trump-style-administration-moves-to-send-asylum-seekers-to-uganda-honduras-and-ecuador.html",
    "title": "Ethnic Cleansing, Trump Style: Administration Moves to Send Asylum Seekers to Uganda, Honduras and Ecuador",
    "summary": "Hellgate earlier reported on the new Trump administration tactic, which sets the stage for potential third-country removals on a large scale in the coming months.\n“The Department is moving to pretermit the respondent’s asylum application,” the Trump administration attorney said.\nNow, in order to keep their asylum claims alive, people will have to submit a written motion to the court.\nRemy called the latest Trump administration tactic “a slaughter,” saying it’s even worse than the masked federal agents stalking immigration court hallways arresting people seemingly at random.\nNow you’ve just seen asylum be completely cut off.”The jury is still out on how immigration judges will rule on the motions to pretermit asylum claims.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTE=",
    "url": "https://www.yahoo.com/news/articles/trump-suspends-green-card-lottery-051548859.html",
    "title": "Trump suspends green card lottery program that let Brown University, MIT shootings suspect into US",
    "summary": "President Donald Trump suspended the green card lottery program on Thursday that allowed the suspect in the Brown University and MIT shootings to come to the United States.\nNearly 20 million people applied for the 2025 visa lottery, with more than 131,000 selected when including spouses with the winners.\nTrump has long opposed the diversity visa lottery.\nWhile pursuing mass deportation, Trump has sought to limit or eliminate avenues to legal immigration.\nHe has not been deterred if they are enshrined in law, like the diversity visa lottery, or the Constitution, as with a right to citizenship for anyone born on U.S. soil.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  }
]