[
  {
    "id": "NTQ=",
    "url": "https://www.npr.org/2026/02/09/nx-s1-5707217/somali-asylum-cases-rescheduled",
    "title": "Immigration courts fast-track hearings for Somali asylum claims",
    "summary": "Immigration courts fast-track hearings for Somali asylum claimstoggle caption Charles Rex Arbogast/APDozens of asylum cases filed by Somali migrants in immigration courts were suddenly rescheduled and recategorized over the weekend, according to four lawyers interviewed by NPR.\nPresident Trump's rhetoric toward Somali immigrants, as well as his administration's emphasis on deportations, raises concern that the notices represent the first step toward the removal without due process of Somali asylum applicants in the country.\nDifferent types of hearingsThere are generally two kinds of hearings in immigration court: master calendar and individual merits hearings.\nLast spring, a memo sent to EOIR staff encouraged immigration judges to deny \"legally deficient asylum cases without a hearing.\"\nHe characterized Somali immigrants as \"garbage\" during a Cabinet meeting in early December, adding, \"they contribute nothing.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-09T17:41:01Z",
    "source": "NPR"
  },
  {
    "id": "NTU=",
    "url": "https://uk.news.yahoo.com/trump-border-tsar-warned-immigration-215021755.html",
    "title": "Trump’s border tsar warned immigration crackdown would upset public",
    "summary": "Donald Trump’s border tsar warned months ago that the administration’s aggressive and sweeping immigration crackdown risked losing public support.\nIn a June 16 interview for NBC, published for the first time on Monday, Mr Homan said: “I think the vast majority of the American people think criminal illegal aliens need to leave.\nIn the face of cross-party and nationwide outcry following the deaths of Renee Good and Alex Pretti, both 37, Mr Trump pledged to “de-escalate”.\nHe replaced Mr Bovino, the hardline “commander at large” of Border Control who had been leading the immigration operation in the city, with Mr Homan to diffuse the tensions and scale back its most aggressive tactics.\nThere has been a 2,450 per cent increase in the number of people with no criminal record being held in ICE detention, according to a new report by the American Immigration Council.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-02-09T21:50:21Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTY=",
    "url": "https://www.bbc.com/news/articles/cy9y3n43192o",
    "title": "Number of homeless refugees in England soars, BBC has found",
    "summary": "Once an asylum seeker is given refugee status they have 28 days to move out of government-funded accommodation - usually a house in multiple occupation (HMO) or a hotel - and find their own housing.\nAt the same time, they must find work or, if necessary, apply for universal credit.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2026-02-06T00:05:26Z",
    "source": "BBC News"
  },
  {
    "id": "NTc=",
    "url": "https://www.yahoo.com/news/articles/leadership-changes-minnesota-tensions-among-182440908.html",
    "title": "Leadership changes in Minnesota follow tensions among agencies over immigration enforcement tactics",
    "summary": "In Congress, the Department of Homeland Security is increasingly under attack by Democrats who want to rein in immigration enforcement.\n“In targeted enforcement operations, we go out there.\nThe Border Patrol does.”The Border Patrol's high-profile raids, including a helicopter landing on the roof of a Chicago apartment building that involved agents rappelling down, rankled ICE officials.\nMany were replaced by current or retired officials from CBP, the Border Patrol's parent agency.\nHoman's arrival in Minnesota and his emphasis on “targeted enforcement” mark a subtle but unmistakable shift, at least in tone.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-06T18:24:40Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTg=",
    "url": "https://www.yahoo.com/news/articles/us-moves-deport-5-old-200241547.html",
    "title": "US moves to deport 5-year-old detained in Minnesota",
    "summary": "By Jasper WardWASHINGTON, Feb 6 (Reuters) - The U.S. Department of Homeland Security said on Friday it is seeking to deport ​a 5-year-old Ecuadorean boy who was detained in Minnesota last month.\n\"These are regular removal proceedings,\" ⁠department spokesperson Tricia McLaughlin ‌said, adding, \"This is standard procedure and there is nothing retaliatory about enforcing the nation’s immigration laws.\"\nLawyers for Liam and ‍the Department of Justice did not immediately respond to requests for comments.\nThe Trump administration defended the move, with the Department of Homeland Security accusing Conejo Arias of being in the U.S. illegally, without providing additional details.\nAdvertisement AdvertisementProtests have ⁠erupted across Minnesota in opposition to the deployment of immigration agents, who have fatally ‌shot two U.S. citizens in the state.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-02-06T20:02:41Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTk=",
    "url": "https://www.npr.org/2026/02/06/nx-s1-5701432/minneapolis-ice-air-deportation-flights",
    "title": "Minneapolis now has daily deportation flights. One man has been documenting them",
    "summary": "Federally chartered deportation flights on ICE Air, as the Department of Homeland Security calls it , aren't new.\nBut in Trump's second term, their frequency and scope has essentially doubled, according to ICE Flight Monitor, an advocacy initiative that keeps watch.\ntoggle caption Jaida Grey Eagle\"It's just happening in the background,\" says Benson, motioning to the rest of the airport.\nBut in recent months, he's started tracking these ICE flights in and out of Minneapolis, counting the people loaded on as they are forced to leave the state.\ntoggle caption Jaida Grey EagleHe says sometimes the weight of what he's witnessing each day catches up with him.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-06T10:00:00Z",
    "source": "NPR"
  },
  {
    "id": "NjA=",
    "url": "https://www.bbc.com/news/videos/c86v6p1djvqo",
    "title": "ICE protester speaks out after White House shared fake arrest image",
    "summary": "US civil rights lawyer and activist Nekima Levy Armstrong says she was \"disgusted\" after the White House posted an image of her arrest which was edited to show her in tears.\nShe was detained for organising a protest against Immigration and Customs Enforcement (ICE) in a Minnesota church last month.\nBBC Verify's Jake Horton spoke to Levy Armstrong about the manipulated image and the backlash she has faced.\nProduced by Tom Joyner.\nGraphics by Mark Edwards.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-07T23:59:43Z",
    "source": "BBC News"
  },
  {
    "id": "NjE=",
    "url": "https://abcnews.go.com/US/judge-orders-3-families-returned-us-after-finding/story?id=129897419",
    "title": "Judge orders 3 families returned to US after finding agents used 'lies' to deport them",
    "summary": "Judge orders 3 families returned to US after finding agents used 'lies' to deport themIn this Aug. 26, 2011, file photo, the Homeland Security logo is seen shortly before a press conference at FEMA headquarters in Washington, D.C.\nIn this Aug. 26, 2011, file photo, the Homeland Security logo is seen shortly before a press conference at FEMA headquarters in Washington, D.C.\nIn this Aug. 26, 2011, file photo, the Homeland Security logo is seen shortly before a press conference at FEMA headquarters in Washington, D.C.\nIn the eight-page ruling, Judge Sabraw found that the government's removal of the families rendered the protections of the settlement \"illusory.\"\nA spokesperson with the Department of Homeland Security did not immediately respond to a request for comment from ABC News.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-06T22:17:53Z",
    "source": "ABC News"
  },
  {
    "id": "NjI=",
    "url": "https://www.npr.org/2026/02/06/nx-s1-5703603/court-records-chicago-immigration-raid-was-about-squatters-not-venezuelan-gangs",
    "title": "Court records: Chicago immigration raid was about squatters, not Venezuelan gangs",
    "summary": "Court records: Chicago immigration raid was about squatters, not Venezuelan gangstoggle caption Sergio Martínez-Beltrán/NPRNewly revealed arrest records show that a high-profile immigration raid on a South Shore Chicago apartment building last year that became a symbol of President Trump's harsh immigration tactics actually targeted squatters, not Venezuelan gang members.\nOn multiple occasions, the Trump administration has said the building was frequented by members of Tren de Aragua, a Venezuelan gang.\nSponsor MessageBut arrest records for two of the men show the government's stated reason for the raid was to take out squatters, not gang members.\n\"They have no legal authority to be addressing purported squatters; that is not within the purview of the federal government.\"\nNPR went inside the building days after the raid and found it dilapidated, with graffiti on walls and doors.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-06T10:19:00Z",
    "source": "NPR"
  },
  {
    "id": "NjQ=",
    "url": "https://www.aljazeera.com/news/2026/2/6/nothing-retaliatory-us-seeks-deportation-of-5-year-old-liam-conejo-ramos",
    "title": "‘Nothing retaliatory’: US seeks deportation of 5-year-old Liam Conejo Ramos",
    "summary": "Lawyers for the Ecuadorian asylum seeker have speculated the Trump administration is seeking ‘retaliatory’ actions.\nThe United States Department of Homeland Security (DHS) has revealed it will continue to seek the deportation of five-year-old Liam Conejo Ramos and his father Adrian Conejo Arias, after their recent return to Minnesota.\nPhotos went viral of Conejo Ramos standing in the snow, dressed in floppy blue bunny ears, with an immigration agent grabbing onto his Spiderman backpack.\nThe detention of Conejo Ramos and his father had been among the high-profile flashpoints during the crackdown.\nConejo Ramos and his father arrived in the US from Ecuador.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-06T23:13:30Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "Nzc=",
    "url": "https://www.bbc.com/news/articles/c20z4254524o",
    "title": "South Korea: Official expelled from party for remark on 'importing' foreign women",
    "summary": "The Vietnamese Embassy in Seoul had condemned Kim's remarks, saying in a statement on Facebook that his words were \"not simply a matter of expression but a matter of values and attitudes towards migrant women and minority groups\".",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-02-09T09:45:29Z",
    "source": "BBC News"
  }
]