[
  {
    "id": "NDQ=",
    "url": "https://www.npr.org/2026/01/31/nx-s1-5695221/anti-ice-protesters-call-for-national-action-against-federal-immigration-tactics",
    "title": "Anti-ICE protesters call for national action against federal immigration tactics",
    "summary": "Anti-ICE protesters call for national action against federal immigration tacticstoggle caption Kristin Wright/NPRProtesters across the U.S. on Saturday demonstrated against the federal government's immigration enforcement tactics in Minneapolis.\nThe group 50501 called on communities to shut \"ICE Out of Everywhere\" in a national day of action.\nThe group is also requesting that the retailer publicly affirm solidarity with immigrants and opposition to ICE's recent immigration operations.\nThey carried signs and chanted \"boycott target,\" \"ice out,\" and \"I believe that we will win.\"\nHe says he just returned to D.C. from Minneapolis, where he joined faith leaders for a demonstration at Target's headquarters.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-01T02:27:55Z",
    "source": "NPR"
  },
  {
    "id": "NDU=",
    "url": "https://abcnews.go.com/Politics/trump-continues-defend-homan-noem-amid-immigration-enforcement/story?id=129731874",
    "title": "Trump continues to defend Homan, Noem amid immigration enforcement backlash",
    "summary": "President Donald Trump arrives for the premiere of first lady Melania Trump's movie \"Melania\" at The John F. Kennedy Memorial Center For The Performing Arts, Jan. 29, 2026, in Washington.\nPresident Donald Trump arrives for the premiere of first lady Melania Trump's movie \"Melania\" at The John F. Kennedy Memorial Center For The Performing Arts, Jan. 29, 2026, in Washington.\nPresident Donald Trump arrives for the premiere of first lady Melania Trump's movie \"Melania\" at The John F. Kennedy Memorial Center For The Performing Arts, Jan. 29, 2026, in Washington.\nPresident Donald Trump took to social media to show his support for two of his administration leaders amid the leadership shakeup following last week's fatal shooting in Minneapolis.\nBorder czar Tom Homan speaks during a news conference about ongoing immigration enforcement operations on January 29, 2026 in Minneapolis, Minnesota.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2026-01-31T18:29:01Z",
    "source": "ABC News"
  },
  {
    "id": "NDY=",
    "url": "https://www.yahoo.com/news/articles/man-sentenced-4-years-prison-195240655.html",
    "title": "Man sentenced to 4 years in prison for throwing Molotov cocktail during LA immigration protest",
    "summary": "LOS ANGELES (AP) — A 23-year-old man was sentenced to four years in federal prison after he admitted throwing a Molotov cocktail at Los Angeles County sheriff’s deputies during protests against immigration raids across the region last spring.\nSheriff's deputies responded to a large protest that day at which demonstrators were throwing rocks and other items outside a Home Depot where U.S. Border Patrol agents had gathered.\nAdvertisement AdvertisementAccording to the plea agreement obtained by the Los Angeles Times, Galvez admitted that he went behind a wall, lit the Molotov cocktail and then hurled it toward where he had seen the deputies.\nThe incendiary device landed in a grassy area near the foot of a protester and about 15 feet (4.5 meters) from the deputies, according to the plea agreement.\nGalvez threw the device “intending to obstruct, interfere with, and impede the LASD deputies who were lawfully engaged in performance of official duties,” according to the agreement.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-01T19:52:40Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDc=",
    "url": "https://www.businessinsider.com/anti-ice-out-protests-national-shutdown-trump-administration-2026-1",
    "title": "Anti-ICE Protests Take Place Nationwide",
    "summary": "Protests across the nation took place amid the Trump administration's immigration enforcement efforts.\nProtests across the nation took place amid the Trump administration's immigration enforcement efforts.\nStephen Maturen/Getty ImagesProtests across the nation took place amid the Trump administration's immigration enforcement efforts.\nStephen Maturen/Getty Imageslighning bolt icon An icon in the shape of a lightning bolt.\nThe protests come amid growing tensions in communities where the Trump administration has deployed federal agents.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-01-31T01:36:49Z",
    "source": "Business Insider"
  },
  {
    "id": "NDg=",
    "url": "https://www.businessinsider.com/ice-minneapolis-immigration-crackdown-rift-target-employees-leadership-ceo-2026-1",
    "title": "ICE Minneapolis Crackdown: Rift Between Target Employees, Leadership",
    "summary": "When Minneapolis became ground zero for the Trump administration's immigration crackdown, Suzie joined an informal mutual-aid network of Target employees.\nBack in 2020, after George Floyd was killed less than 4 miles from Target's Minneapolis headquarters, Target scaled up its DEI programs.\nChristopher Juhn/Anadolu via Getty ImagesAt the team level, employees say, there has been patience and flexibility from managers and coworkers.\nMany Target employees in Minneapolis say they're balancing their work lives with community work.\nAbbie Parr/AP PhotoSeveral other employees say they've lost their sense of pride in being Target employees since the company shifted to a more cautious approach.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-01-31T09:17:02Z",
    "source": "Business Insider"
  },
  {
    "id": "NDk=",
    "url": "https://kottke.org/26/02/0048286-propublica-the-two-federa",
    "title": "ProPublica: “The two federal immigration agents who fired on...",
    "summary": "This site is made possible by member support.\n💞Big thanks to Arcustech for hosting the site and offering amazing tech support.\nWhen you buy through links on kottke.org, I may earn an affiliate commission.\nThanks for supporting the site!\nhome of fine hypertext products since 1998.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-01T21:22:13Z",
    "source": "kottke.org"
  },
  {
    "id": "NTA=",
    "url": "https://www.businessinsider.com/tech-ai-boycott-february-protest-ice-scott-galloway-2026-2",
    "title": "'Unsubscribe' and 'opt out': A new Big Tech boycott to protest ICE has begun",
    "summary": "Thousands of protesters in Minneapolis demonstrated against ICE on January 31.\nJen Golbeck/SOPA Images/LightRocket via Getty ImagesThousands of protesters in Minneapolis demonstrated against ICE on January 31.\nThere may, however, be another way, according to Scott Galloway, a marketing professor at New York University famous for his critiques of Big Tech.\nScott Galloway is calling on Americans to \"unsubscribe\" and \"opt out\" in February.\nAnna Webber/Getty Images for Vox MediaThe anti-ICE movementRegular protests against the tactics of ICE and Border Patrol personnel have gripped the country for months.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2026-01-31T21:46:08Z",
    "source": "Business Insider"
  },
  {
    "id": "NTE=",
    "url": "https://www.npr.org/2026/02/01/nx-s1-5689031/minnesota-citizens-detained-ice",
    "title": "Minnesota citizens detained by ICE are left rattled, even weeks later",
    "summary": "She said the ICE officers told her to move her car, but the scene was chaotic and she received multiple instructions at once.\nEven if a drawdown occurs, they'll leave behind a changed community, including many citizens questioned and detained by immigration officers in recent weeks.\nOlson says even if the Minnesota immigration crackdown eases, these same concerns could arise elsewhere.\nEven citizens who were not arrested but still questioned are rattled after run-ins with immigration officers.\ntoggle caption Jaida Grey Eagle for NPR\"I said, 'Sir, what happens if the immigration officers stop me?'",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-01T10:00:00Z",
    "source": "NPR"
  },
  {
    "id": "NTI=",
    "url": "https://www.npr.org/sections/the-picture-show/2026/01/30/g-s1-108087/photos-thousands-once-again-protest-ice-in-minneapolis-and-across-the-u-s",
    "title": "Photos: Thousands once again protest ICE in Minneapolis and across the U.S.",
    "summary": "Photos: Thousands once again protest ICE in Minneapolis and across the U.S.toggle caption Jaida Grey Eagle for NPRFor the second week in a row, thousands of people in downtown Minneapolis marched to protest the presence of immigration enforcement agents in their city.\nDemonstrations were also organized in other U.S. cities, including Los Angeles, Boston, New York, and Portland, Maine.\nThese protests came after the Department of Justice announced a civil rights probe into the shooting death of Minneapolis resident and ICU nurse Alex Pretti but not of Renee Macklin Good, a 37-year-old mother of three who was shot and killed by an ICE agent on January 7.toggle caption Jaida Grey Eagle for NPRtoggle caption Adam Gray/AP/FR172090 APtoggle caption Jaida Grey Eagle for NPRtoggle caption Joseph Prezioso/AFP via Getty Imagestoggle caption Spencer Platt/Getty Imagestoggle caption Jae C. Hong/APtoggle caption Frederic J. Brown/AFP via Getty Imagestoggle caption Jaida Grey Eagle for NPRtoggle caption Robert F. Bukaty/APtoggle caption Stephen Maturen/Getty Imagestoggle caption Stephen Maturen/Getty Imagestoggle caption Jaida Grey Eagle for NPR",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-31T02:20:00Z",
    "source": "NPR"
  },
  {
    "id": "NTM=",
    "url": "https://www.npr.org/2026/01/31/nx-s1-5695219/judge-wont-halt-immigration-enforcement-surge-minnesota",
    "title": "Judge says she won't halt the immigration enforcement surge as a lawsuit proceeds",
    "summary": "Judge says she won't halt the immigration enforcement surge as a lawsuit proceedstoggle caption Alex Brandon/APMINNEAPOLIS — A federal judge says she won't halt the immigration enforcement surge in Minnesota and the Twin Cities as a lawsuit over it proceeds.\nJudge Katherine M. Menendez on Saturday denied a preliminary injunction sought in a lawsuit filed this month by state Attorney General Keith Ellison and the mayors of Minneapolis and St. Paul.\nThe lawsuit sought a quick order to halt the enforcement action or limit its scope.\nIn her ruling, the judge relied heavily on whether that argument was likely to ultimately succeed in court.\nState and local officials argued that the surge is retaliation after the federal government's initial attempts to withhold federal funding to try to force immigration cooperation failed.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-01-31T17:58:41Z",
    "source": "NPR"
  },
  {
    "id": "NTQ=",
    "url": "https://www.yahoo.com/news/videos/john-fetterman-goes-off-anti-194504065.html",
    "title": "John Fetterman Goes Off on Anti-ICE Protesters on Fox News: 'Don't Ever Ever Dox People and Target Their Families'",
    "summary": "LIVE from San Francisco, Matt Harmon and Nate Tice kick off our Super Bowl week coverage with a special fantasy pod.\nThe two look at the path the New England Patriots and Seattle Seahawks took to the Super Bowl and how other teams can emulate their paths next year.\nIn the second half of the show we go through Nate Tice's latest mock draft and do a deep dive on the skill players and their fits with certain teams.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2026-02-01T19:45:04Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTU=",
    "url": "https://www.yahoo.com/news/videos/5-old-liam-conejo-ramos-180552481.html",
    "title": "5-year-old Liam Conejo Ramos and father return to Minnesota from Texas detention facility",
    "summary": "Five-year-old Liam Conejo Ramos and his father, who were detained by immigration officers in Minnesota and held at an ICE facility in Texas, have been released, following a judge’s order.\nThey have returned to Minnesota, according to Texas Rep. Joaquin Castro.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2026-02-01T18:05:52Z",
    "source": "Yahoo Entertainment"
  }
]