[
  {
    "url": "https://www.bbc.com/news/articles/cjr0lx7n0y3o",
    "title": "Two military sites earmarked as asylum seeker accommodation",
    "summary": "Two military sites earmarked as asylum seeker accommodation3 days ago Share Save Nick Eardley, Political correspondent and Maia Davies Share SavePA MediaHundreds of asylum seekers could be housed in two military sites in Inverness and East Sussex as the government seeks to end the use of hotels.\nDefence Minister Luke Pollard told BBC Breakfast that the sites were not \"luxury accommodation by any means,\" but \"adequate for what is required\".\nThe National Audit Office concluded in March 2024 that large sites such as military bases would cost more than hotels to accommodate asylum seekers.\nHe would not be drawn on how many asylum seekers were to be moved or when that would happen.\nA Home Office spokesperson said: \"We are furious at the level of illegal migrants and asylum hotels.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-10-28T00:50:46Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cvgkpjdzv74o",
    "title": "Buxton: Why one small town with very little immigration turned to Reform UK",
    "summary": "It was such concerns that helped Reform UK win control of Derbyshire County Council in May.\nIn May, Reform UK won in one Buxton county council ward and came a close second to the Conservatives in the other.\nYet six months ago, in the county council elections in Buxton, almost a third of those who voted backed Reform UK.\n\"The younger crowd are very much against it [Reform UK] while the older crowd are very much for them.\"\nReform UK councillor Melandra Smith was elected to one of Buxton's two county council seats in MayAmong the new Reform UK councillors is Melandra Smith, who won one of the two Buxton seats.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-28T06:02:37Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.co.uk/sounds/play/p0mcbndg",
    "title": "(Another) Plan to Close Migrant Hotels",
    "summary": "Available for over a yearToday, hundreds of asylum seekers could be housed in two military sites in Inverness and East Sussex as the government seeks to end the use of hotels.\nThere are around 32,000 asylum seekers currently being housed in hotels.\nAdam and Chris discuss whether this will help with government’s pledge to end the use of asylum hotels by 2029.\nIf you want to listen, just say \"Ask BBC Sounds to play Newscast”.\nIf you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd Newscast brings you daily analysis of the latest political news stories from the BBC.",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2025-10-28T19:41:00Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.wired.com/story/cbp-searched-a-record-number-of-phones-at-the-us-border-over-the-past-year/",
    "title": "CBP Searched a Record Number of Phones at the US Border Over the Past Year",
    "summary": "Over the Past year, United States Customs and Border Protection staff searched more phones and electronic devices at the border than ever before, according to new statistics published by the government agency.\nPhone searches jumped around 17 percent during the past 12 months—with a marked increase over the past six months.\nBorder officials have broad powers that allow them to search people’s phones when they enter the US—including citizens and green card holders.\nAirports and border zones generally fall outside Fourth Amendment protections that require warrants for device searches to take place.\nEarlier this year the CBP put out a request for new tech to help it search for data on people’s phones.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-10-28T15:26:29Z",
    "source": "Wired"
  },
  {
    "url": "https://www.theatlantic.com/ideas/archive/2025/10/zero-immigration-trump-ice/684728/",
    "title": "America’s Impending Population Collapse",
    "summary": "In the buoyant decades after World War II, net migration was low compared with the Ellis Island era of the early 20th century, but still positive.\nIt may be powerful enough to bring net migration down to zero, perhaps for some time.\nWe know because the United States has tried it before.\nThe number of native-born American workers in prime age has been stuck since 2013, and it is not expected to start growing.\nThe United States has always been a nation of expansion: It has never before experienced population shrinkage year after year.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-29T10:30:00Z",
    "source": "The Atlantic"
  },
  {
    "url": "https://abcnews.go.com/US/border-patrol-chief-ordered-meet-judge-daily-chicago/story?id=126942383",
    "title": "Border Patrol chief ordered to meet with judge daily on Chicago immigration crackdown",
    "summary": "U.S. Customs and Border Patrol commander Gregory Bovino (C) arrives to federal court at Dirksen Federal Building in Chicago, Illinois, October 28, 2025.\nU.S. Customs and Border Patrol commander Gregory Bovino (C) arrives to federal court at Dirksen Federal Building in Chicago, Illinois, October 28, 2025.\nWatch \"Nightline\" on ABC on Tuesday for special coverage of the federal enforcement actions in Chicago.\nUS Customs and Border Patrol Commander Gregory Bovino (C) arrives to federal court at Dirksen Federal Building in Chicago, Illinois on October 28, 2025.\nIf they are using tear gas, they better be able to back it up.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-10-28T18:15:53Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cly9rxlvp85o",
    "title": "Hadush Kebatu: Migrant sex offender given £500 after threat to disrupt deportation",
    "summary": "Meanwhile, Kebatu told Sky News he had tried to hand himself in to a police officer the day before he was re-arrested - but was ignored.\nSources say the decision to make the payment to Kebatu was made by the removal team, not ministers.\nAnnouncing Kebatu's removal earlier on Wednesday, Home Secretary Shabana Mahmood said: \"Last week's blunder should never have happened - and I share the public's anger that it did.\"\nHome Office Minister of State Alex Norris told BBC Breakfast: \"We accept this was a blunder - we're really angry about it as I know the public are.\"\nEpping Forest's Conservative MP, Neil Hudson, told BBC Radio 4's Today programme that the community would be \"very relieved\" by Kebatu's removal.",
    "category": "immigration",
    "bias": "right",
    "publishedAt": "2025-10-29T06:01:57Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.cnet.com/home/security/digital-rights-group-tells-amazon-ring-owners-to-turn-off-cameras-this-halloween/",
    "title": "Digital Rights Group Tells Amazon Ring Owners to Turn Off Cameras This Halloween",
    "summary": "Fight for the Future, a digital rights group, has issued a warning to Amazon Ring owners, urging them to turn off and cover their cameras during Halloween.\nThe safety advisory comes in response to Amazon's recent partnership with Flock.\nFlock calls itself \"a public safety technology ecosystem\" that develops security hardware and software systems, including automated license plate recognition software and security cameras.\nStop using Ring cameras altogether.\nDownload, print, and hang this information sheet about the partnership between Ring, Amazon, and ICE to ensure neighbors are aware.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-10-30T22:24:11Z",
    "source": "CNET"
  },
  {
    "url": "https://www.tallahassee.com/story/news/local/state/2025/10/28/state-replaces-larry-keefe-as-immigration-enforcement-director/86943126007/",
    "title": "Larry Keefe out as Florida immigration enforcement director",
    "summary": "AI-assisted summary Florida's State Board of Immigration approved over $4.1 million in reimbursements to 15 local law enforcement agencies for immigration enforcement.\nAlso, Larry Keefe, known for his role in arranging migrant flights, has been replaced as the State Immigration Enforcement Council's executive director.\nAnthony Coker, Florida's first U.S. Immigration and Customs Enforcement liaison, will succeed Keefe.\nThe state of Florida has suddenly replaced the head of its State Board of Immigration Enforcement.\nThe federal government also has awarded Florida $38 million for the state's immigration efforts, with $10 million of that going to local law enforcement.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-28T14:56:07Z",
    "source": "Tallahassee Democrat"
  },
  {
    "url": "https://www.yahoo.com/news/articles/good-ice-us-takeaways-chicago-100810665.html",
    "title": "'We have to be good or ICE will get us': Takeaways from Chicago children caught in immigration raids",
    "summary": "CHICAGO (AP) — Just before noon on a sunny Friday earlier this month, federal immigration agents threw tear gas canisters onto a busy Chicago street, just outside of an elementary school and a children’s play cafe.\nAdvertisement AdvertisementAdvertisement AdvertisementWhy did the agents tear gas a residential neighborhood?\nThe SUV’s passenger side window rolled down and a masked man inside threw the tear gas canisters onto the street.\nThat morning, another teacher gave her a whistle with instructions to blow it if immigration agents were nearby.\nMore tear gas?",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-28T10:08:10Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/cly4jz9zr50o",
    "title": "S Korea announces lowering of tariffs as part of new US trade deal",
    "summary": "South Korea's presidential aide, Kim Yong-beom, said the two sides will reduce reciprocal tariffs from 25% to 15%, as was agreed earlier this year.\nSouth Korea will also invest $350bn (£265bn) in the US, including $200bn in cash investment and $150bn in shipbuilding, Kim said.\n\"We had a tremendous meeting today with South Korea\", Trump said of his discussions with South Korean President Lee Jae Myung, adding that \"a lot was determined\".\nNoting the long-standing tensions between North and South Korea, Trump said \"we will see what we can do to get that all straightened out\".\nChinese interference became a common trope in conspiracy theories about former South Korean president Yoon Suk Yeol.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-29T09:00:10Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/c17pn74p87xo",
    "title": "Newspaper headlines: 'Reeves eyes income tax rise' and 'prostate test would save thousands'",
    "summary": "'Reeves eyes income tax rise' and 'prostate test would save thousands'The Daily Telegraph says Rachel Reeves is considering a 2p rise in income tax in next month's Budget - and that she could become the first chancellor since the 1970s to raise the basic rate.\nIt says Reeves might opt for a scheme floated by the Resolution Foundation think tank, which offsets the increase with a cut in National Insurance.\nThe i says Sir Keir Starmer has paved the way for \"manifesto-breaking income tax hikes\" - in what it calls a political gamble to find cash to boost growth.\nThe Times reports that a European trial has offered \"compelling new evidence\" in favour of a screening programme for prostate cancer.\nIt says it found screening all men over 50 would save thousands of lives in Britain.",
    "category": "immigration",
    "bias": "lean right",
    "publishedAt": "2025-10-30T01:44:19Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.aljazeera.com/news/2025/10/30/trump-announces-lowest-refugee-admission-cap-in-us-history-at-7500",
    "title": "Trump announces lowest refugee admission cap in US history at 7,500",
    "summary": "Washington, DC – United States President Donald Trump has announced the lowest refugee admission cap in the country’s history, limiting entry to just 7,500 people for the fiscal year 2026.\nTrump’s refugee cap is the lowest since Congress passed the Refugee Act of 1980, which codified a formal process for admitting and relocating refugees to the US.\nThe US Refugee Act allows presidents to set a cap on the number of annual refugee admissions, but there is no bottom limit.\nHe added that, for decades, the US refugee programme has admitted “people fleeing ethnic cleansing and other horrors”.\nThat order also prioritised humanitarian relief, including refugee admissions, to white South Africans, on the basis that they were “victims of unjust racial discrimination”.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-10-30T19:32:14Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://www.bbc.com/news/articles/c24lzd32yjeo",
    "title": "Nigerian Nobel laureate Wole Soyinka says his US visa revoked",
    "summary": "Nigerian Nobel laureate Wole Soyinka says US revoked his visaWole Soyinka earlier tore up his US green card in protest against Trump's 2016 election.\nNigerian Nobel laureate Wole Soyinka has said the US revoked his visa and banned him from the country.\nThe Nobel laureate has previously held permanent residency in the US but renounced it in 2016, tearing up his green card in protest of President Donald Trump's election.\nThe green card is a permanent residence permit for the US - prized by many African immigrants to the US.\nSoyinka has long been critical of the Trump administration's radical stance on immigration and linked the visa revocation to his outspoken criticism.",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-29T06:58:14Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/man-spent-43-years-prison-121451053.html",
    "title": "A man who spent 43 years in prison before his conviction was overturned now faces deportation",
    "summary": "Vedam never pursued it then because of the murder conviction.\nVedam, where were you born?’Vedam and Kinser were 19-year-old friends with parents on the Penn State faculty when Kinser went missing.\nAn older daughter was born in State College, but “Subu,” as he was known, was born when the family was back in India in 1961.\nThey returned to State College for good before his first birthday, and became the family that welcomed new members of the Indian diaspora to town.\nStill, she finds the Vedam case “truly extraordinary” given the constitutional violations involved.",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-29T12:14:51Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.theregister.com/2025/10/29/us_foreigner_facial_scans/",
    "title": "Uncle Sam wants to scan your face on the way in – and out",
    "summary": "Planning to visit the United States in the near future?\nThe rule is also lifting age restrictions on storing biometric data.\n\"I never thought that I would be prone to this sort of identity mix up, and this has only happened since the facial recognition technology was implemented,\" they said.\n\"Facial recognition technology is prone to error, yet Customs and Border Protection Agents trust it implicitly.\"\n\"DHS is following the law by developing and implementing a comprehensive biometric entry/exit system to match records of aliens entering and departing the United States.\"",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-29T15:35:36Z",
    "source": "Theregister.com"
  },
  {
    "url": "https://www.bbc.com/news/articles/cly91lj9y47o",
    "title": "Dependants of Gaza students can come to UK, government says",
    "summary": "Visas are only available to dependants of students on government-funded courses such as Chevening scholarships, or those studying for PhDs and other research-based higher degrees.\nIt marks a reversal of the original policy which only supported the evacuation of the students themselves.\nPartners and children of some Gazan PhD and master's students coming to study in the UK will be now able to join them, the government has confirmed.\n\"Students coming from Gaza to the UK have suffered an appalling ordeal after two years of conflict,\" the government spokesperson said.\n\"That is why we are supporting the evacuation of dependants of students on scholarships who are eligible to study here under the immigration rules on a case-by-case basis.\"",
    "category": "immigration",
    "bias": "left",
    "publishedAt": "2025-10-30T01:01:29Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/c1d0x39x270o",
    "title": "Sir David Attenborough backs bid to buy Rothbury Estate",
    "summary": "Sir David Attenborough backs bid to buy estate3 days ago Share Save Evie Lake North East and Cumbria Share SaveThe Wildlife Trust/PA Rothbury Estate in Northumberland is a 15-sq-mile (38.8-sq-km) tract of former grouse moor, woodland and farmlandSir David Attenborough has championed a bid by conservationists to raise £30m to buy the entirety of a vast upland estate.\nWith a year to go to raise the £30m needed to secure the entire estate, or risk it being broken up and sold off, Sir David has urged people to back the bid.\nIn a video, the naturalist and broadcaster said time was running out to save Rothbury Estate.\nRothbury Estate was owned by the Duke of Northumberland's youngest son, Lord Max Percy, and had been in the family for about 700 years.\nThe partnership between Northumberland Wildlife Trust and the Wildlife Trusts was given two years in October 2024 to raise the £30m needed to buy all of the estate.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-10-29T06:11:24Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.aljazeera.com/news/2025/10/29/dutch-vote-in-knife-edge-election-seen-as-litmus-test-for-far-right",
    "title": "Centre-left party leads far-right in Netherlands election exit poll",
    "summary": "Polls suggest anti-Islam lawmaker Geert Wilders and his Freedom Party on course to win largest number of seats.\nThe centre-left D66 party is on course to be the biggest party in the next Dutch parliament, ahead of the far-right Freedom Party, according to exit polls.\nThe exit poll projects that D66 will win 27 seats in the 150-seat parliament, with the Freedom Party on 25 seats.\nThe right-wing VVD was projected to win 23 seats, while the left-wing Greens-Labour party was projected to win 20 seats.\nAhelbarra noted that D66 has been on a “spectacular rise” in the polls while there are indications Wilder’s Freedom Party is losing momentum.",
    "category": "immigration",
    "bias": "lean left",
    "publishedAt": "2025-10-29T06:50:14Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://www.techdirt.com/2025/10/28/border-patrol-chief-greg-bovino-ordered-to-explain-why-personally-violated-a-court-order-on-force-usage/",
    "title": "Border Patrol Chief Greg Bovino Ordered To Explain Why Personally Violated A Court Order On Force Usage",
    "summary": "Border Patrol Chief Greg Bovino Ordered To Explain Why Personally Violated A Court Order On Force Usagefrom the 'i'm-an-asshole'-probably-not-an-acceptable-excuse deptGregory Bovino probably only answers to two people.\nThat would be the other person Bovino is willing to answer to, even if that person isn’t actually his boss at that point in time.\n[A] CalMatters investigation, in partnership with Evident and Bellingcat, found that Border Patrol officials misrepresented the very basics of their high-profile, large-scale immigration raid.\nData obtained from U.S. Customs and Border Protection reveal that Border Patrol had no prior knowledge of criminal or immigration history for 77 of the 78 people arrested.\nAnd then he basically said he’d continue to ignore court orders because they’re not the boss of him (paraphrasing).",
    "category": "immigration",
    "bias": "center",
    "publishedAt": "2025-10-28T16:32:41Z",
    "source": "Techdirt"
  }
]