[
  {
    "id": "Ng==",
    "url": "https://www.yahoo.com/news/articles/irans-traders-frustrated-economic-losses-160902483.html",
    "title": "Iran's traders, frustrated by economic losses, turn against clerics",
    "summary": "They only think about their own benefits,\" said a trader at Tehran’s centuries-old Grand Bazaar, speaking ‌on condition of anonymity.\nIran’s rulers, while acknowledging economic difficulties, have blamed their longtime foes the U.S. and Israel for fomenting the unrest.\nAdvertisement AdvertisementAdvertisement AdvertisementA combination of international sanctions and the Guards' sprawling economic empire has limited the government's ability to ease the dire economic situation.\nAdvertisement AdvertisementAdvertisement AdvertisementThe Guards now control vast sectors of the economy, from oil to transportation, communications, and construction.\nAnother trader said the crisis was not over, as the Guards have long proved adept at defending their economic interests.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-12T16:13:11Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDc=",
    "url": "https://ca.news.yahoo.com/turkey-cautions-against-foreign-intervention-151432842.html",
    "title": "Turkey cautions against foreign intervention in Iran",
    "summary": "ANKARA, Jan 12 (Reuters) - Turkey said on Monday that any foreign intervention in neighbouring Iran would lead to greater crises in the country ​and the region, and it called for U.S. and Iranian negotiations ‌to resolve existing problems.\nIran is facing its biggest demonstrations since 2022 and U.S. President Donald Trump has ‌threatened to get involved if force is used against protesters.\nNATO member Turkey does not wish to see chaos in Iran despite \"certain problems within Iranian society and government\", Omer Celik, spokesperson for Turkey's ruling AK Party, said.\n\"We believe that foreign intervention will lead to even worse consequences, and that intervention provoked by Israel in particular will lead to even greater crises.\"\nTrump and Turkish President Tayyip Erdogan have close personal ties.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-12T15:24:18Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDg=",
    "url": "https://www.yahoo.com/news/articles/iranian-mp-warns-greater-unrest-094734513.html",
    "title": "Trump urges Iranians to keep protesting, says 'help is on its way'",
    "summary": "By Susan Heavey and Elwely ElwellyWASHINGTON, Jan 13 (Reuters) - U.S. President Donald Trump urged Iranians on Tuesday to keep protesting and said help was on the way, without giving details, as Iran's clerical establishment pressed its crackdown against the biggest demonstrations in years.\nHELP IS ON ITS WAY,\" Trump said ​in a post on Truth Social, adding he had canceled all meetings with Iranian officials until the \"senseless killing\" of protesters stopped.\nAdvertisement AdvertisementAdvertisement AdvertisementOn Monday evening, Trump announced 25% import tariffs on products from any country doing business with Iran - a major oil exporter.\nTrump has also said ⁠more military action is among options he is weighing to punish ‌Iran over the crackdown.\nIran's authorities have taken a dual approach, cracking down while also calling protests over ​economic problems legitimate.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-13T09:51:42Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDk=",
    "url": "https://ca.finance.yahoo.com/news/trading-houses-beat-us-majors-115729637.html",
    "title": "Trading houses beat US majors to first deals for Venezuelan oil",
    "summary": "Trump met top oil executives at the White House on Friday as his administration outlines a long-term plan to raise $100 billion to boost Venezuelan oil output.\nThe U.S. government tapped the giant merchant houses because they were better suited to quickly get Venezuelan oil exports flowing again, four industry sources familiar with the negotiations said.\n\"Securing and marketing the initial barrels of Venezuelan crude oil was done at record speed to benefit both the American and Venezuelan people,\" a White House official told Reuters.\nGLOBAL NETWORK ADDED TO TRADERS' APPEALThe trading houses competed with Chevron to secure the supply deals.\nChevron is the only U.S. oil major that operates in Venezuela, as a minority partner in joint ventures with Venezuelan state oil firm PDVSA.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-12T11:57:29Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTA=",
    "url": "https://abcnews.go.com/International/iran-protests-646-killed-activists-trump-weighs-military/story?id=129156635",
    "title": "Iran protests: Trump suggests Americans should leave; over 2,400 killed, group says",
    "summary": "Trump said he thinks \"it's a good idea\" for Americans to evacuate from Iran.\nLater Tuesday, he told reporters that he will be receiving \"accurate numbers\" on how many protesters have been killed in Iran soon and \"we'll act accordingly.\"\nCiting \"escalating\" protests and increased security measures, the State Department also urged Americans to leave Iran.\nFILE - Protesters march on a bridge in Tehran, Iran, on Dec. 29, 2025.\nSecurity forces monitor a pro-government rally, Jan. 12, 2026, in Tehran, Iran.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-13T11:04:08Z",
    "source": "ABC News"
  },
  {
    "id": "NTE=",
    "url": "https://www.aljazeera.com/video/the-bottom-line/2026/1/11/after-maduro-is-the-us-driving-global-instability",
    "title": "After Maduro: Is the US driving global instability?",
    "summary": "America First foreign policy means that the United States is becoming a country that opposes the rule of law, free trade and collective security, argues Ian Bremmer, president of the risk analysis firm Eurasia Group.\nBremmer tells host Steve Clemons that the international system built by the US over decades “was going to reach a geopolitical bust” regardless of the advent of President Donald Trump.\nWashington’s decision to project power in Venezuela, coupled with rhetoric threatening Greenland, “makes the US more unreliable for its allies”, according to Bremmer, “and a much bigger driver of geopolitical risk on the global stage”.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-01-11T19:18:04Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTI=",
    "url": "https://abcnews.go.com/Politics/military-options-trump-iran-after-warning-big-trouble/story?id=129142628",
    "title": "Some of the military options Trump could consider against Iran after warning about protests",
    "summary": "White House press secretary Karoline Leavitt listens as President Donald Trump speaks to reporters while in flight on Air Force One to Joint Base Andrews, Md., Jan. 11, 2026.\nAt the same time, Leavitt said the Iran regime’s public messaging is different from the private messaging being communicated to the White House.\nHowever, with that said, the president has shown he's unafraid to use military options if and when he deems necessary,\" Leavitt added.\nBrendan Smialowski/AFP via Getty ImagesThe State Department has been posting in Farsi in recent days on X, including one post warning Tehran: \"Don't play games with President Trump.\"\nBut another major military operation in Iran is considered by experts to be less likely by Trump than other options because of the risks involved.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-12T23:47:39Z",
    "source": "ABC News"
  },
  {
    "id": "NTM=",
    "url": "https://www.bbc.com/news/articles/c4g3kw5ezepo",
    "title": "Greenland chooses Denmark over US, island's PM Jens-Frederik Nielsen says",
    "summary": "Denmark is a fellow Nato member and Prime Minister Mette Frederiksen has warned that military force would spell the end of the trans-Atlantic defence alliance.\nUnder existing agreements with Denmark, the US has the power to bring as many troops as it wants to Greenland.\nThe Greenlandic prime minister said they were \"facing a geopolitical crisis\", but the island's position was clear: \"If we have to choose between the United States and Denmark here and now, we choose Denmark,\" he said.\nGreenland does not want to be owned by the United States.\nGreenland does not want to be governed by the United States.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-13T15:31:16Z",
    "source": "BBC News"
  },
  {
    "id": "NTQ=",
    "url": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/13/eu-mercosur-trade-pact-signals-limits-of-trump-s-hardball-diplomacy-in-latin-america",
    "title": "EU-Mercosur trade pact signals limits of Trump’s hardball diplomacy in Latin America",
    "summary": "Gli elettori hanno sostenuto la scelta di Trump in entrambe le elezioni.\n“Il ritorno della preminenza dell’America nell’emisfero occidentale, guidata dal presidente Trump, è indiscutibile”, ha dichiarato Anna Kelly, portavoce della Casa Bianca, in un comunicato.\n“Tutte le azioni di politica estera del Presidente hanno ripristinato la forza americana dopo quattro anni di debolezza sotto la guida di Joe Biden”.\n“In un momento in cui gli Stati Uniti stanno rompendo lo status quo, alcune parti dell’America Latina sembrano sostenerlo”, ha detto.\n“È un campanello d’allarme per gli Stati Uniti”.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-13T10:06:31Z",
    "source": "Internazionale.it"
  }
]