[
  {
    "id": "MQ==",
    "url": "https://www.businessinsider.com/china-economy-great-people-shortage-hurt-global-economy-birth-rate-2026-1",
    "title": "China's Shrinking Population Is Getting Smaller. the Risks Are Growing.",
    "summary": "China's population is shrinking — and the decline is accelerating.\nIf things don't change, China's shrinking and aging population poses serious long-term risks for the country's economy.\nA smaller working-age population in China could also hurt the global economy, which has relied on China's booming productivity and economic growth.\nThe population of mainland China began shrinking in 2022, when it declined by 850,000 people after years of falling birth rates.\nThere is little evidence these efforts have been successful at lifting birth rates.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-01-19T19:06:00Z",
    "source": "Business Insider"
  },
  {
    "id": "Mg==",
    "url": "https://uk.finance.yahoo.com/news/gold-prices-greenland-trump-oil-pound-latest-112134371.html",
    "title": "Gold prices surge past $4,800 on jitters over Greenland dispute",
    "summary": "Gold prices extended recent gains on Wednesday morning, surging on concerns about escalating tensions over US president Donald Trump's push to take over Greenland.\nGold futures (GC=F) jumped 2% to $4,863.50 per ounce at the time of writing, while spot gold was up 2.1% at $4,862.20.\nRead more: Stocks muted as Trump arrives in Davos amid Greenland rowEscalating tensions over Trump's pursuit of Greenland has fuelled demand for so-called safe haven investments, seeing investors flock to gold (GC=F), driving prices higher.\nConcerns about the potential economic fallout of renewed geopolitical tensions also continued to weigh on oil prices on Wednesday morning.\nThe pound dipped 0.3% against the dollar (GBPUSD=X) on Wednesday morning, as the latest UK inflation reading came in higher than expected.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-21T11:21:34Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "OA==",
    "url": "https://www.wired.com/china-issue/",
    "title": "23 Ways You’re Already Living in the Chinese Century",
    "summary": "While the president of this country is promising to make America great again as he strips it for parts, Chinese business and political leaders have quietly seized the moment.\nThis is not to say that China’s economy, let alone its repressive totalitarian government, runs perfectly.\nBut today there’s almost no limit to what is created in China, then eagerly consumed by the rest of the world.\nWIRED’s reporters have chronicled the transformation in the Made in China newsletter—and now we’re bringing you this special issue.\nHere are 23 ways China is rewiring the future.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2026-01-20T11:00:00Z",
    "source": "Wired"
  },
  {
    "id": "OQ==",
    "url": "https://www.aljazeera.com/news/2026/1/21/new-zealand-pm-christopher-luxon-calls-national-election-for-november-7",
    "title": "New Zealand PM Christopher Luxon calls national election for November 7",
    "summary": "New Zealanders are set to go to the polls later this year amid a sluggish economy and rising unemployment.\nNew Zealand will hold a national election on November 7, the country’s centre-right prime minister has said.\nChristopher Luxon announced the election date on Wednesday as he touted his government’s record on the economy and crime.\nLuxon’s National Party formed a coalition with the populist New Zealand First and pro-business ACT parties after delivering a crushing defeat to the centre-left Labour Party at the 2023 election.\nCoalition governments are the norm in New Zealand because of the country’s mixed-member proportional system, which replaced first-past-the-post voting in 1996.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-21T06:09:05Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MTE=",
    "url": "https://www.yahoo.com/news/articles/us-futures-sink-trump-warns-064219353.html",
    "title": "US futures sink after Trump warns of higher tariffs for 8 countries over Greenland issue",
    "summary": "BANGKOK (AP) — European shares mostly fell and U.S. stock futures skidded Monday after U.S. President Donald Trump threatened to slap a 10% extra tariff on imports from eight European countries because they oppose having America take control of Greenland.\nGermany's DAX lost 1.3% to close at 24,960.33 and the CAC 40 in Paris fell 1.9% to 8,101.96.\nStrong exports, despite Trump's higher tariffs on imports from China, helped to offset relatively weak domestic demand.\nAdvertisement AdvertisementAdvertisement AdvertisementThis week will bring a broader mix of earnings from airlines, industrial companies, and technology companies.\nThe price of gold resumed its upward climb, gaining 1.8%, while the price of silver jumped 6.2%.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-19T06:42:19Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzQ=",
    "url": "https://nukeproof.org/",
    "title": "Manifesto for European Data Sovereignty",
    "summary": "It’s time to take back control togetherEurope has the talent, the technology and the willpower.\nWhat we lack is cohesive action.\nA patchwork of local providers, startups, MSPs, and telcos struggles to compete with global hyperscalers on scale, capability and cost.\nNukeProof exists to bring these players together, forming a coalition that enables Europe to stand strong on its own terms.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-01-21T11:44:48Z",
    "source": "Nukeproof.org"
  },
  {
    "id": "Mzc=",
    "url": "https://finance.yahoo.com/news/company-owned-president-trump-surprises-170000891.html",
    "title": "Company owned by President Trump surprises observers with unexpected partnership: 'To guarantee America's dominance'",
    "summary": "Photo Credit: Getty ImagesPresident Donald Trump's social media company, Trump Media & Technology Group, announced a shocking pivot into cleaner energy.\nTAE Technologies, a California-based nuclear fusion startup, is partnering with Trump Media & Technology Group in a deal valued at more than $6 billion.\nThe agreement would make the combined company one of the world's first publicly traded nuclear fusion firms.\nWhile the Trump administration views nuclear fusion as an economic opportunity more than a climate solution, the benefits to the environment could be substantial.\nEach side would own roughly half of the combined company, with Trump Media CEO Devin Nunes and Binderbauer serving as co-CEOs.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-20T17:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDQ=",
    "url": "https://www.nature.com/articles/d41586-026-00102-0",
    "title": "The US is quitting 66 global agencies: what does it mean for science?",
    "summary": "The United States is leaving some of the world’s oldest and most influential scientific networks involved in biodiversity research, climate science and conservation.\nThe United States is leaving the Intergovernmental Panel on Climate Change (IPCC), which advises countries on the latest climate science.\nThe statement adds that the IPCC will continue to “make decisions by consensus among its member governments at its regular plenary sessions”.\nMore than moneyThe United States contributes around one-fifth of the United Nations’ budget, a little less than its share of the world economy.\nThe United States will also remain part of UN conventions that regulate trade of endangered species and protect migratory animals.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-20T00:00:00Z",
    "source": "Nature.com"
  },
  {
    "id": "NTE=",
    "url": "https://www.npr.org/2026/01/20/g-s1-106532/up-first-newsletter-trump-world-leaders-immigration-detention-college-football-champion",
    "title": "Trump leaks world leaders' messages. And, Indiana wins its first national title",
    "summary": "Trump leaks world leaders' messages.\nOvernight, Trump shared messages he received from world leaders, including one from France's President Emmanuel Macron, who tried flattery and then proposed discussing Greenland over dinner.\nNow, world leaders are meeting face-to-face at the World Economic Forum in Davos, where Trump is scheduled to speak on Wednesday.\nHowever, some world leaders do not see it the same way the Trump administration does, NPR's Danielle Kurtzleben tells Up First.\n➡️ State and city leaders say working with ICE undermines trust and cooperation between local law enforcement and immigrant communities, hindering crime prevention.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-20T12:19:41Z",
    "source": "NPR"
  },
  {
    "id": "NTU=",
    "url": "https://sg.finance.yahoo.com/news/exclusive-indias-central-bank-proposes-054224570.html",
    "title": "Exclusive-India's central bank proposes linking BRICS' digital currencies, sources say",
    "summary": "The Reserve Bank of India (RBI) has recommended ​to the government that a proposal connecting the central bank digital currencies (CBDCs) be included on the agenda for the 2026 BRICS summit, the sources said.\nIf the recommendation is accepted, a proposal to link the digital currencies of BRICS members would be put ‌forward for the first time.\nThe South African central bank declined to comment.\nThe RBI's proposal to link BRICS' CBDCs for cross-border trade finance and tourism has not been previously reported.\nWhile none of the BRICS members have fully launched their digital currencies, all five main members have been running pilot projects.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-19T05:42:24Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTk=",
    "url": "https://www.npr.org/2026/01/19/nx-s1-5621791/winter-olympics-venues-milan-cortina",
    "title": "The 2026 Olympics are the most widespread in history. See what's happening where",
    "summary": "Here's a guide to the 2026 Olympic venues.\nAlpine skiing will take place at Tofane Alpine Skiing Centre, named after one of the most dramatic mountain groups in the Eastern Dolomites.\nThe Anterselva Biathlon Arena has the largest spectator capacity of any of this year's Olympic venues, set to accommodate up to 19,000 people per session.\nSponsor MessageMen's Alpine skiing, as well as the new sport of ski mountaineering, are happening in Bormio, a historic ski resort in the Italian Alps.\nOlympic events in the cluster are spread across two of its villages, Tesero and Predazzo.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-19T10:00:00Z",
    "source": "NPR"
  },
  {
    "id": "NjE=",
    "url": "https://www.npr.org/2026/01/20/nx-s1-5678927/trump-world-order-foreign-policy",
    "title": "As Trump dismantles the existing world order, his version is still taking shape",
    "summary": "As Trump dismantles the existing world order, his version is still taking shapetoggle caption Ariana Cubillos/APPresident Harry Truman led the construction of the global order from the smoldering ruins of World War II.\nSponsor MessageIn his first term, Trump sought to keep the U.S. out of foreign conflicts.\nIn his second term, Trump has often turned to military force.\nHe says that in several places, including Venezuela, \"I'm not sure what side of that divide President Trump is on.\nAs this old order breaks down, Trump's version is still taking shape.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-20T10:02:00Z",
    "source": "NPR"
  },
  {
    "id": "NjI=",
    "url": "https://www.bbc.com/news/articles/c0lx7j1lrwro",
    "title": "Greenland: Europe is ditching its softly-softly approach to Trump",
    "summary": "Confronted over Greenland, Europe is ditching its softly-softly approach to Trump2 days ago Share Save Katya Adler Europe Editor Share SaveBBCSomething in Europe has snapped.\nEuropean leaders are telling President Trump they'll support him in prioritising Arctic security, so there's no need for him to go it alone over Greenland.\nCanada, which President Trump had threatened to make the 51st state of the US, has just agreed to a limited trade deal with Beijing.\nBut Tara Varma insists that the Peace Board isn't about peace.\nGetty Images Asked if he was prepared to use force to seize Greenland, President Trump said, \"No comment\", sending chills down the spine of many GreenlandersTransatlantic relations aren't broken yet, though they are damaged.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2026-01-20T01:04:54Z",
    "source": "BBC News"
  },
  {
    "id": "NjM=",
    "url": "https://sg.news.yahoo.com/live/us-embassy-asks-singapore-businesses-for-larger-gifts-for-semiquincentennial-singapore-weighs-invitation-to-trumps-board-of-peace-singapore-live-news-040027365.html",
    "title": "US Embassy asks Singapore businesses for 'larger gifts' for Semiquincentennial; Singapore weighs invitation to Trump’s Board of Peace: Singapore live news",
    "summary": "Singapore has been invited to join US President Donald Trump’s proposed Board of Peace and is assessing the offer, the Ministry of Foreign Affairs (MFA) says.\n(Photo: REUTERS/Kevin Lamarque) (REUTERS / Reuters)Singapore has been invited to join US President Donald Trump’s proposed Board of Peace, the Ministry of Foreign Affairs confirmed.\nExplainer: Trump’s “Board of Peace”What is Trump’s “Board of Peace”?\nThe Board of Peace is a proposed international body initiated by former US President Donald Trump.\nUnder the proposed charter, he would hold significant authority over membership terms and expulsions, subject to a two-thirds board vote.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-01-20T04:00:27Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NjQ=",
    "url": "https://www.bbc.com/news/articles/cx2lej7d52po",
    "title": "Lyse Doucet: Trump is shaking the world order more than any president since WW2",
    "summary": "Lyse Doucet: Trump is shaking the world order more than any president since WW22 days ago Share Save Lyse Doucet Chief international correspondent Share SaveWatch: BBC asks Trump if breakup of Nato is price he is willing to pay for GreenlandOn day one, he put the world on notice.\nBut, in the past century, no American president has threatened to seize the land of a longtime ally and rule it against their people's will.\nNo US leader has so brutally broken political norms and threatened long-standing alliances which have underpinned the world order since the end of World War Two.\nRubio has been one of the principal voices trying to backpedal Trump's threats on Greenland, underlining that he wants to buy this vast strategic ice sheet, not invade it.\nPresident Trump now owns it, bolstered by his fervent backers on his team, with his belief that America can act at will in its backyard, and beyond, to protect American interests.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-01-20T20:18:43Z",
    "source": "BBC News"
  },
  {
    "id": "NjU=",
    "url": "https://abcnews.go.com/Politics/1-year-trumps-2nd-term-seismic-shifts-foreign/story?id=129350162",
    "title": "1 year into Trump's 2nd term, here are some of the seismic shifts in foreign and domestic policies",
    "summary": "During every single day of the Trump administration, I will very simply put America First,\" Trump vowed during his inaugural address.\nPresident Donald Trump and Ukrainian President Volodymyr Zelensky meet in the Oval Office at the White House, Feb. 28, 2025.\nThey fell short of that goal, but the White House has since reached deals or frameworks with dozens of America's trading partners.\nThe White House has also made significant carve-outs for some goods that cannot be produced or grown in the U.S. such as coffee and bananas.\nChanges to the White HouseTrump has also made his mark on the physical space of the White House.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-01-20T10:15:40Z",
    "source": "ABC News"
  },
  {
    "id": "Njc=",
    "url": "https://www.bbc.com/news/articles/c24g6pj2071o",
    "title": "Putin invited to join US-led Gaza 'Board of Peace', Trump says",
    "summary": "Putin invited to join US-led Gaza 'Board of Peace', Trump saysWashington has asked various world leaders to sit on the board.\nPresident Donald Trump has confirmed he invited Vladimir Putin to join a US-proposed Gaza \"Board of Peace\".\nThe Board of Peace will be made up of world leaders, with President Trump as its chairman, according to the White House.\nAsked on Monday if he had invited Putin to join the Board of Peace, Trump told reporters in Florida: \"Yes [...] these are world leaders.\n\"He'll join, but he doesn't have to join,\" Trump added.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-20T08:51:31Z",
    "source": "BBC News"
  },
  {
    "id": "Njg=",
    "url": "https://ca.news.yahoo.com/china-distances-itself-greenland-issue-090031789.html",
    "title": "China distances itself from Greenland issue but warns against US dependence",
    "summary": "U.S. President Donald Trump's ambition to wrest sovereignty over Greenland from Denmark has rattled ‌NATO members and prompted a rethink of Europe's traditional security dependence on the United States.\nAdvertisement AdvertisementAdvertisement AdvertisementTrump has also threatened to rain trade tariffs on Europe if it resists his demand to acquire the Arctic ‍island.\nThe EU's foreign policy chief, Kaja Kallas, cautioned that transatlantic tariffs would play into the hands of China and Russia, both of which would benefit from \"divisions among allies\".\nYet Chinese state media did not hold back comments this week, urging Europe to reassess its dependence on the United States for security.\nThe Greenland crisis is a call for Europe to bolster strategic autonomy and diversify partnerships, it said.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-21T09:00:31Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Njk=",
    "url": "https://www.bbc.com/news/articles/c4g5345ylk0o",
    "title": "Trump says he will '100%' carry out Greenland tariffs threat, as EU vows to protect its interests",
    "summary": "Trump says he will '100%' carry out Greenland tariffs threat, as EU vows to protect its interests2 days ago Share Save Thomas Mackintosh and Tabby Wilson Share SaveSean Gallup/Anna Moneymaker/Getty Images Kaja Kallas, the EU's foreign policy chief, said the bloc has \"no interest to pick a fight, but we will hold our ground\".\nDonald Trump has vowed to \"100%\" follow through on his threat to impose tariffs on European countries who oppose his demand to take control of Greenland.\nAsked if he would follow through on the tariff threat, Trump told NBC News: \"I will, 100%.\"\nDanish foreign minister Lars Løkke Rasmussen said that Europe had to show President Trump tariff threats were \"not the way forward\".\nGreenland is a part of the Kingdom of Denmark, and Norway fully supports the Kingdom of Denmark on this matter,\" Støre added.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2026-01-19T21:46:09Z",
    "source": "BBC News"
  },
  {
    "id": "NzA=",
    "url": "https://www.yahoo.com/news/articles/irans-top-diplomat-issues-most-051608462.html",
    "title": "Iran offers first government-issued death toll from protest crackdown, one far lower than activists",
    "summary": "DUBAI, United Arab Emirates (AP) — Iran offered its first government-issued death toll Wednesday following a crackdown on nationwide protests, giving a far lower figure than activists abroad as the country’s theocracy tries to reassert control after unrest recalling the chaos surrounding its 1979 Islamic Revolution.\nThe U.S.-based Human Rights Activists News Agency said the death toll early Thursday was at least 4,902, with many more feared dead.\nAdvertisement AdvertisementAdvertisement AdvertisementThe Associated Press has been unable to independently assess the death toll, in part due to authorities cutting access to the internet and blocking international calls into the country.\nProtest death toll risesAdvertisement AdvertisementAdvertisement AdvertisementThe death toll exceeds that of any other round of protest or unrest in Iran in decades, and recalls the chaos surrounding the 1979 revolution that brought the Islamic Republic into being.\nComments from officials have led to fears of some of those detained being put to death in Iran, one of the world’s top executioners.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-21T05:16:08Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NzE=",
    "url": "https://www.yahoo.com/news/articles/vietnams-communist-party-begins-congress-001037451.html",
    "title": "Vietnam's Communist Party begins week-long congress to choose leader",
    "summary": "By Francesco GuarascioHANOI, Jan 19 (Reuters) - Hundreds of delegates from Vietnam's ruling Communist Party gathered on Monday under tight security for a congress that will select the single-party country's top leader and set economic goals for the remainder of the decade.\nLam, photographed smiling in state media as he entered the congress venue on Monday, is expected to address delegates on Tuesday.\nAdvertisement AdvertisementAdvertisement AdvertisementRISK-TAKING LEADERLam, 68, has launched several major reforms during his brief tenure as party chief, the country's most powerful job.\nECONOMIC GROWTH, SECURITY TOP NEXT FIVE-YEAR AGENDAThe congress' delegates represent 5.6 million party members in ​a country of 100 million.\nThe party intends to increase its defence forces, especially in border areas, the draft text says.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-19T00:10:37Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NzI=",
    "url": "https://www.bbc.com/news/articles/c1507x8njzwo",
    "title": "'Minor electrical issue' on Air Force One delays Trump Davos visit",
    "summary": "Air Force One was grounded due to a \"minor electrical issue\", according to the White House.\nThe plane returned to Joint Base Andrews in Maryland and Trump left for Switzerland on another aircraft.\nHe will travel onwards to the World Economic Forum in Davos, where he is expected to deliver a speech later.\nFollow live updatesAir Force One is technically a radio call signal and would be designated for any Air Force aircraft with the US president aboard, rather than a specific plane.\nCurrently, there are two Boeing 747-200B series in the Air Force passenger fleet, which have been in use since 1990.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-21T08:30:16Z",
    "source": "BBC News"
  },
  {
    "id": "NzM=",
    "url": "https://www.vox.com/politics/475793/trump-and-greenland-latest-stories-and-updates",
    "title": "Trump and Greenland: Latest stories and updates",
    "summary": "President Donald Trump has again elevated Greenland to a central place in his foreign policy, renewing a long-running push that has unsettled US allies.\nDenmark and Greenland swiftly rejected the idea, issuing a joint statement underscoring that sovereignty and borders are protected by international law.\nOther European leaders, including French President Emmanuel Macron, voiced support for Denmark and Greenland.\nTrump has floated buying or annexing Greenland since his first term, but his rhetoric has intensified during his second.\nWhile US officials already enjoy close military cooperation with Greenland and Denmark, Trump’s approach has raised fresh concerns about relations with America’s allies.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-01-20T20:04:35Z",
    "source": "Vox"
  }
]