[
  {
    "id": "Mg==",
    "url": "https://sg.finance.yahoo.com/news/reaction-us-india-tariff-deal-022821112.html",
    "title": "Reaction to the US-India tariff deal",
    "summary": "For foreign investors though, the next hurdle is the Indian rupee, which means ⁠the market may look less like a one-way beta trade and ‌more like a dispersion market.\"\nLAKSHMAN VENKITARAMAN, ASSOCIATE PORTFOLIO MANAGER, WASTACH GLOBAL, SALT LAKE CITY:\"We believe the trade deal improves ​investor sentiment toward India.\nWhile the U.S. is India’s largest trading partner, exports to the U.S. account for less than 5% of India’s GDP.\nNonetheless, U.S.-India trade frictions have weighed on foreign ‌investor perception.\nThis has been compounded by a global trade focused on AI, which has disproportionately benefited markets such as Taiwan and Korea.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-03T02:28:21Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NQ==",
    "url": "https://beincrypto.com/ripple-secures-emi-license-xrp-price-impact/",
    "title": "XRP Gains 3% as Ripple Achieves Key License in Europe",
    "summary": "XRP gained nearly 3% after Ripple reached a fresh regulatory breakthrough in Europe.\nThe company confirmed that it has secured full approval of its Electronic Money Institution (EMI) license in Luxembourg.\nFor context, an EMI license permits companies to issue electronic money, process payments, and offer digital financial services under firm regulatory oversight.\nThis license grants Ripple “passporting” rights, allowing it to operate in all other EU member states with a single approval.\nThe development comes around a month after Ripple received both an EMI license and crypto-asset registration from the UK’s Financial Conduct Authority (FCA).",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-03T04:46:43Z",
    "source": "BeInCrypto"
  },
  {
    "id": "MTU=",
    "url": "https://www.businessinsider.com/alibaba-cofounder-joe-tsai-shares-2-traits-good-employees-2026-2",
    "title": "Alibaba's cofounder Joe Tsai shares 2 traits good employees should have",
    "summary": "Joe Tsai said that employees need to have an ownership mindset.\nJoe Tsai said that employees need to have an ownership mindset.\nTAAF via Getty ImagesJoe Tsai said that employees need to have an ownership mindset.\nTAAF via Getty ImagesInnovation can be hard when you've been around a while, but instilling these two values in employees can help, says Alibaba's cofounder and chairman.\nThe tech giant has staged a significant comeback in the last two years, driven by AI innovation and the restructuring of its e-commerce business.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2026-02-05T05:17:53Z",
    "source": "Business Insider"
  },
  {
    "id": "MzI=",
    "url": "https://www.bbc.com/news/articles/cpwng25114ro",
    "title": "Russian hits Ukraine energy sites in 'most powerful blow\" so far this year",
    "summary": "We have met residents who have had no heating in their homes for days, in some cases weeks.\nThey sleep in hats and coats, and under piles of blankets, but it is still bitterly cold.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-03T11:08:12Z",
    "source": "BBC News"
  },
  {
    "id": "MzQ=",
    "url": "https://www.businessinsider.com/how-nato-soldiers-are-trained-75-miles-arctic-circle-2026-2",
    "title": "How NATO soldiers are trained 75 miles north of the Arctic Circle",
    "summary": "Among the many challenges NATO soldiers face in the unforgiving Arctic environment, frozen weapons pose a serious risk.\nExtreme cold can cause firearms to malfunction, leaving soldiers vulnerable.\nAt the same time, overheating weapons can create additional complications, forcing troops to carefully manage their equipment in harsh conditions.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-03T18:24:55Z",
    "source": "Business Insider"
  },
  {
    "id": "Mzc=",
    "url": "https://abcnews.go.com/International/video/russia-launches-huge-attack-ukraines-energy-system-129828305",
    "title": "Video Russia launches huge attack on Ukraine’s energy system",
    "summary": "Russia launches huge attack on Ukraine’s energy system Russia launched a huge attack overnight on Ukraine’s energy system during some of the coldest days of the winter.\nIt follows what was supposed to be a week-long ceasefire on striking energy targets.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-03T22:53:29Z",
    "source": "ABC News"
  },
  {
    "id": "NDI=",
    "url": "https://www.barchart.com/story/news/980/it-seems-like-china-listens-to-everything-i-say-elon-musk-says-china-is-out-executing-the-u-s-on-energy-by-using-his-playbook",
    "title": "‘It Seems Like China Listens to Everything I Say’: Elon Musk Says China Is Out-Executing the U.S. on Energy By Using His Playbook",
    "summary": "Musk’s argument hinges on a distinction that rarely makes it into public energy debates: peak power versus average power.\nHe pointed to China , noting that the country is producing massive battery packs, scaling electric vehicle manufacturing, and deploying solar at unprecedented levels.\nThey're certainly making massive battery packs, like really massive battery pack output.\nFrom an economic and policy perspective, Musk’s framing elevates batteries to the same strategic importance as power generation itself.\nMusk’s thesis is simple but disruptive: the U.S. doesn’t need to wait for breakthroughs to dramatically increase energy output.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-03T18:10:40Z",
    "source": "Barchart.com"
  },
  {
    "id": "NDQ=",
    "url": "https://www.vox.com/the-highlight/476083/energy-abundance-access-electricty-progress-africa-oceania-energy-poverty",
    "title": "Who on Earth still doesn’t have electricity?",
    "summary": "Average life expectancies surged from 30s to 70s as expanding electricity access improved sanitation, helped people warm up in the cold, cool off in the heat, preserve their food, and get better medical care.\n“It used to be that we thought about energy-poor countries versus energy-rich countries,” Min said.\n“Democracies actually do a better job at reaching more remote and rural communities,” Min said.\nIt shows that connecting communities to electricity is not simply a matter of technology and money, but governance.\n“That is not transformative energy access,” Min said.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-04T16:30:51Z",
    "source": "Vox"
  },
  {
    "id": "NDU=",
    "url": "https://tech.slashdot.org/story/26/02/03/190223/google-plots-big-expansion-in-india-as-us-restricts-visas",
    "title": "Google Plots Big Expansion in India as US Restricts Visas",
    "summary": "Getting the job done is no excuse for not following the rules.\nCorollary: Following the rules will not get the job done.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-03T19:02:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "NDc=",
    "url": "https://ca.news.yahoo.com/taiwans-envoy-canada-says-fear-223136923.html",
    "title": "Taiwan's envoy to Canada says fear of China may be delaying trade deal",
    "summary": "Taiwan's representative in Canada says he is concerned the Liberal government may be deliberately delaying the signing of a trade agreement with Taipei to preserve its relationship with China.\nCarney says he's 'never afraid'Carney dismissed Tseng's concerns Wednesday, insisting his government is capable of conducting trade with both Taiwan and China.\nWe have trade relations with Taiwan.\nBut we're focusing on strengthening our trade relations with China.\nAs part of its \"One China\" policy, Canada maintains unofficial but significant relations with Taiwan in economic, cultural and people-to-people exchanges, Global Affairs Canada spokesperson Samantha Lafleur said in an email.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-04T22:31:36Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDg=",
    "url": "https://abcnews.go.com/International/iran-seek-fair-equitable-talks-us-president/story?id=129804741",
    "title": "Iran to seek 'fair and equitable' talks with US, president says",
    "summary": "Iran's president said he had instructed his foreign minister to pursue talks.\nIran to seek 'fair and equitable' talks with US, president saysIn this handout picture provided by Iranian presidency, Iran's President Masoud Pezeshkian addresses cabinet members, as they visit of the tomb of Khomeini in Tehran on January 31, 2026, ahead of the 47th anniversary of the 1979 Islamic Revolution.\nLONDON -- Iranian President Masoud Pezeshkian said on Tuesday that he had instructed his country's foreign minister to pursue \"fair and equitable\" talks with the United States.\nHe said that Iran would seek talks that were \"guided by the principles of dignity, prudence, and expediency.\"\nPezeshkian didn't detail where those talks, if confirmed, might take place, but said Iran would seek a \"suitable\" location, \"one free from threats and unreasonable expectations.\"",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-03T07:31:00Z",
    "source": "ABC News"
  },
  {
    "id": "NDk=",
    "url": "https://abcnews.go.com/International/russia-hits-ukraine-energy-targets-hundreds-drones-missiles/story?id=129805309",
    "title": "Russia hits Ukraine energy targets with hundreds of drones, missiles, ahead of talks",
    "summary": "Ukraine's air force said Russia launched 71 missiles and 450 drones into the country overnight, of which 38 missiles and 412 drones were shot down or suppressed.\nUkrainian Energy Minister Denys Shmyhal said that thermal power plants powering parts of Kyiv, Kharkiv and Dnipro were among the targets of the strike.\nPeople take shelter in a metro station during a Russian attack on Kyiv, Ukraine, on Feb. 3, 2026.\nUkraine's state energy company Ukrenergo reported \"a significant number of power outages in Kyiv, Kyiv, Kharkiv, Vinnytsia and Odesa regions,\" which it attributed to the \"massive\" overnight attack.\nUkrainian servicemen hit a Russian missile during a Russian missile and drone strike on Kyiv, Ukraine, on Feb. 3, 2026.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-03T15:44:12Z",
    "source": "ABC News"
  },
  {
    "id": "NTE=",
    "url": "https://www.aljazeera.com/opinions/2026/2/3/what-would-be-the-impact-of-a-us-attack-on-iran",
    "title": "What would be the impact of a US attack on Iran?",
    "summary": "As military assets have been accumulated, Trump has threatened that if Iran does not agree to a deal, “the next attack will be far worse” than last June’s US attack on Iranian nuclear facilities.\nAdvertisementThe impact of any US military action against Iran would principally depend on the attack’s type, scale, and targets, potentially triggering a severe crisis in Iran, across the region, and globally.\nIn Iran, an attack could lead to the consolidation of power.\nAn attack on Iran similar to the one last year could well result in the Iranian people rallying behind the flag and rejecting regime change for several reasons.\nAdvertisementFacing Washington’s continuing escalatory rhetoric and track record of regime change operations, Iran has adopted a so-called madman strategy, simultaneously issuing conciliatory and confrontational signals.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-03T18:07:04Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTI=",
    "url": "https://www.businessinsider.com/american-russian-chinese-fighter-jets-singapore-air-show-display-compare-2026-2",
    "title": "US, Russian, Chinese Fighters Fly at Display Event, How They Compare",
    "summary": "More than 100 cameramen were on-site to capture footage of the flying display on Tuesday.\nMore than 100 cameramen were on-site to capture footage of the flying display on Tuesday.\nRoslan RAHMAN / AFP via Getty ImagesMore than 100 cameramen were on-site to capture footage of the flying display on Tuesday.\nA flying display provides limited insight into the combat performance of these fighters, though it does showcase their capabilities in maneuverability.\nA Royal Australian Air Force F-35 fighter jet participates in the air display at the Singapore Airshow.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2026-02-05T05:03:27Z",
    "source": "Business Insider"
  },
  {
    "id": "NTM=",
    "url": "https://www.aljazeera.com/news/2026/2/4/us-iran-nuclear-talks-set-for-oman-on-friday-tehran-confirms",
    "title": "US-Iran nuclear talks set for Oman on Friday, Tehran confirms",
    "summary": "Iranian Foreign Minister Abbas Araghchi announced that nuclear talks with the US will take place in Oman on Friday.\nIranian Foreign Minister Abbas Araghchi has confirmed that nuclear talks between his country and the United States will take place this week in Oman.\n“I’m grateful to our Omani brothers for making all necessary arrangements,” the foreign minister wrote on social media.\nOn Tuesday, Iranian President Masoud Pezeshkian wrote on social media that he has instructed the country’s foreign minister to “pursue fair and equitable negotiations”.\nThe US later briefly joined the war, bombing several Iranian nuclear sites.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-04T22:13:40Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTQ=",
    "url": "https://www.aljazeera.com/news/2026/2/4/can-us-iran-diplomacy-work-inside-the-narrow-window-for-talks",
    "title": "Can US-Iran diplomacy work? Inside the narrow window for talks",
    "summary": "Iran wants talks with the US to stabilise before inviting regional nations to join, as Trump sends mixed messages.\nTehran, Iran – In Tehran, the question is no longer whether diplomacy is under way, but whether it can move fast enough to stay ahead of escalation.\nBut the official confirmed that other regional nations would not be involved in talks at the moment, despite proposals to also include them in the negotiations.\nInstead, Iran wants the talks format with the US to stabilise first, the official added.\nOver the past few days, Iran and regional nations have intensified their diplomacy.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-04T10:10:29Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTU=",
    "url": "https://www.slashgear.com/2091713/who-has-90-percent-worlds-nuclear-weapons-russia-united-states/",
    "title": "Who Has Nearly 90% Of The World's Nuclear Weapons?",
    "summary": "From the sailing ship to the stirrup, these advances have pushed the world into new directions, and chief among them is nuclear weapons.\nAfter the war, nuclear weapons became the tentpole of military and foreign policy, and other nations have followed the U.S. in developing their own arsenals.\nAs of writing, there are nine countries with nuclear weapons: Russia, China, the United Kingdom, India, North Korea, France, Pakistan, Israel, and the U.S.\nIt should be noted that Israel has never confirmed whether it has nuclear weapons, despite most international agencies believing that it does.\nWhile that's a lot of nukes, just two countries collectively hold 86.8% of the world's nuclear weapons, with the remaining split between the other seven.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-03T16:00:00Z",
    "source": "SlashGear"
  },
  {
    "id": "NTY=",
    "url": "https://www.aljazeera.com/news/2026/2/3/trump-petro-meeting-just-how-icy-are-us-colombia-relations",
    "title": "Trump-Petro meeting: Just how icy are US-Colombia relations?",
    "summary": "Last month, tempers rose again when Trump threatened to target Colombia militarily for allegedly flooding the US with illegal drugs.\nBut these efforts have been interrupted at times, such as during the Cold War, by geopolitics and in relation to Colombia’s war on the drug trade.\nEmergence of FARCSecurity relations between the US and Colombia deepened during the second world war.\nIn 1943, Colombia offered its territory for US air and naval bases while Washington provided training for Colombian soldiers.\nWeeks later, the Trump administration also imposed sanctions on the Colombian president, who is set to leave office following a presidential election in May.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-03T13:48:04Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTc=",
    "url": "https://www.project-syndicate.org/commentary/india-will-struggle-to-join-middle-powers-alliance-due-to-foreign-policy-mindset-by-ajay-shah-2026-02",
    "title": "India’s Middle-Power Dilemma",
    "summary": "Email requiredPassword required Remember me?\nPlease enter your email address and click on the reset-password button.\nIf your email exists in our system, we'll send you an email with a link to reset your password.\nPlease note that the link will expire twenty-four hours after the email is sent.\nIf you can't find this email, please check your spam folder.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-02-04T13:16:43Z",
    "source": "Project Syndicate"
  }
]