[
  {
    "id": "Mjk=",
    "url": "https://finance.yahoo.com/news/indonesia-tightens-control-nickel-us-041040093.html",
    "title": "Indonesia tightens control on nickel as the US and China scramble for critical minerals",
    "summary": "The move could still ripple through global EV supply chains as the United States and China compete for critical minerals.\nMore from Yahoo Scout How is Indonesia tightening control over global nickel supply?\nJakarta hoped that control over nickel would underpin a fully domestic EV industry, from mining and batteries to finished cars.\nChina has sourced nickel from Indonesia for decades, but the relationship deepened after Jakarta banned raw ore exports in 2020, drawing a surge of Chinese investment into smelters.\nNickel shipments to China jumped, with imports of nickel matte — a semiprocessed material used in battery chemicals and alloys — rising nearly 28-fold between 2020 and 2023, more than 90% of it from Indonesia, according to trade data.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-18T04:10:40Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzY=",
    "url": "https://www.businessinsider.com/ukrainian-strikes-hit-russian-factory-black-sea-oil-security-source-2026-2",
    "title": "Ukrainian strikes hit a Russian explosive materials plant 1,000 miles away and a major Black Sea oil terminal, security official says",
    "summary": "Impact LinkUkraine carried out long-range drone attacks overnight against a key Black Sea oil terminal and a plant making components for explosives located deep inside Russia, a security official told Business Insider on Tuesday.\nDrones struck the Tamannaftogaz oil terminal in Russia's Krasnodar region, hitting one of the largest ports in the Black Sea region, a source in the Security Service of Ukraine (SBU) said.\nThe facility is recognized as an important piece of Russian oil logistics in the Black Sea.\nThe attacks have led to a slight decline in Russian oil refining over the past year.\nValentyn Ogirenko/REUTERSThe sanctioned plant — one of the largest producers of methanol in Russia and Europe — is used to make chemical components for explosives and other military-related materials, the SBU source said.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-17T18:03:12Z",
    "source": "Business Insider"
  },
  {
    "id": "NTY=",
    "url": "https://www.businessinsider.com/canadian-airlines-pull-back-from-flights-to-the-us-2026-2",
    "title": "Canadian airlines are pulling back from flights to the US, with one leaving the country entirely",
    "summary": "Air Transat won't be flying to the US this summer.\nAir Transat won't be flying to the US this summer.\nJanValls/Urbanandsport /NurPhoto via Getty ImagesAir Transat won't be flying to the US this summer.\nAt the moment, Air Transat flies from Montreal to Orlando and to Fort Lauderdale, and from Quebec City to Fort Lauderdale.\nAn airline spokesperson told Business Insider that its presence in the US \"remains very marginal today,\" with only two of its 67 destinations in the US.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-17T16:25:17Z",
    "source": "Business Insider"
  },
  {
    "id": "NTg=",
    "url": "https://uk.news.yahoo.com/hezbollah-rejects-disarmament-plan-governments-171743951.html",
    "title": "Hezbollah rejects disarmament plan and government's four-month timeline",
    "summary": "Lebanon's cabinet tasked the army in August 2025 with drawing up and ​beginning to implement a plan to bring all armed groups' weapons under state control, a bid aimed primarily at disarming Hezbollah after its devastating war with Israel in 2024.\n\"The required time frame is four months, renewable depending on available capabilities, Israeli attacks and field obstacles,” he said.\nHezbollah has rejected the disarmament effort as a misstep ​while Israel continues to target Lebanon, and Shi'ite ministers walked ​out of the cabinet session in ​protest.\nIsrael has said Hezbollah's disarmament is a security priority, arguing that the group's ‌weapons outside Lebanese state control pose a ​direct threat to its ​security.\nIsraeli officials say any disarmament plan must be fully and effectively implemented, especially in areas close to the border, and that continued Hezbollah military activity constitutes a violation of ​relevant international resolutions.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-17T17:18:08Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTk=",
    "url": "https://www.aljazeera.com/news/2026/2/19/venezuelas-rodriguez-colombias-petro-say-they-will-meet-soon",
    "title": "Venezuela’s Rodriguez, Colombia’s Petro say they will meet ‘soon’",
    "summary": "Petro said he had invited Rodriguez to meet in the border city of Cucuta to discuss energy cooperation and infrastructure projects.\nVenezuela’s interim President Delcy Rodriguez has announced that she and Colombian President Gustavo Petro agreed to hold a bilateral meeting to discuss security issues, as well as economic and energy matters.\nSpeaking in La Guajira, Colombia’s northernmost border region with Venezuela, Petro said he had invited Rodriguez to meet in the border city of Cucuta to discuss energy cooperation and infrastructure projects.\nPetro, the Colombian president, was not among the leaders to shun Venezuela during Maduro’s years in power.\n“The past elections in Venezuela were not free,” Petro wrote on social media, blasting Maduro for having ignored “Colombia’s request for maximum transparency”.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-19T02:39:06Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NjI=",
    "url": "https://www.bbc.com/news/articles/cp81kw4pzd2o",
    "title": "US and EU trade deals put India on global stage but challenges remain",
    "summary": "March has not even begun and Delhi has concluded the \"mother of all trade deals\" with the European Union and also what's now being termed the \"father of all trade deals\" with the United States - even though grave concerns remain about the asymmetric nature of the interim agreement which, many say, is stacked heavily in favour of the US.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-18T00:02:20Z",
    "source": "BBC News"
  },
  {
    "id": "NjM=",
    "url": "https://abcnews.com/International/us-ukraine-russia-peace-talks-geneva-expected-resume/story?id=130256516",
    "title": "Day 2 of US-Ukraine-Russia peace talks in Geneva conclude, official says",
    "summary": "Day 2 of US-Ukraine-Russia peace talks in Geneva conclude, official saysProtesters hold placards and Ukrainian flags amid talks between Russian, Ukrainian and U.S. negotiators in Geneva, Switzerland, on Feb. 17, 2026.\nProtesters hold placards and Ukrainian flags amid talks between Russian, Ukrainian and U.S. negotiators in Geneva, Switzerland, on Feb. 17, 2026.\nProtesters hold placards and Ukrainian flags amid talks between Russian, Ukrainian and U.S. negotiators in Geneva, Switzerland, on Feb. 17, 2026.\nProtesters hold placards and Ukrainian flags amid talks between Russian, Ukrainian and U.S. negotiators in Geneva, Switzerland, on Feb. 17, 2026.\nProtesters hold placards and Ukrainian flags amid talks between Russian, Ukrainian and U.S. negotiators in Geneva, Switzerland, on Feb. 17, 2026.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-02-18T09:21:37Z",
    "source": "Abcnews.com"
  },
  {
    "id": "NjY=",
    "url": "http://nymag.com/intelligencer/article/aocs-munich-stumble-is-a-warning-to-the-left.html",
    "title": "AOC’s Munich Stumble Is a Warning to the Left",
    "summary": "Her appearance at the Munich Security Conference — one of the world’s premier foreign-policy events — seemed to be a step in the direction of higher office.\nThough she acquitted herself well in a majority of the interviews and panels in Munich, one stumble stood out — demonstrating she hasn’t yet fully conceived a foreign-policy vision.\nIt’s also a warning for progressives: It’s vital to approach certain foreign-policy and national-security issues, including China’s potential invasion of Taiwan, in a more sophisticated manner.\nIt would have been acceptable for AOC to state, flat out, that deploying American troops against a global superpower is a last resort.\nRight now, there are few genuinely sophisticated voices on the left when it comes to global affairs.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-17T17:31:14Z",
    "source": "New York Magazine"
  },
  {
    "id": "Njc=",
    "url": "https://www.aljazeera.com/news/2026/2/19/houthi-threats-and-us-iran-conflict-escalate-ramadan-fears-in-yemen",
    "title": "Houthi threats and US-Iran conflict escalate Ramadan fears in Yemen",
    "summary": "Sanaa, Yemen – Ahmed Abdu, 28, parked his motorbike near a hall under construction in the al-Jiraf neighbourhood of Sanaa.\nAs Yemen enters this new Ramadan, memories of last year’s United States-led aerial campaign, Operation Rough Rider, are resurfacing in Sanaa.\nThe two-month operation, which Washington said targeted Houthi military infrastructure, killed at least 224 civilians, many of them in Ramadan last year.\nAdvertisementThe protest expressed solidarity with and support for Houthi allies, Iran and Lebanon’s Hezbollah, against the US and Israel.\nAdvertisementFor Sanaa resident Ahmed Abdu, it does not matter who wins any future conflict in the country.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-19T05:27:24Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "Njg=",
    "url": "https://www.bbc.com/news/articles/c875pey8vy2o",
    "title": "US to withdraw troops from Syria amid Iran tensions",
    "summary": "The official noted that the decision to remove the roughly 1,000 remaining troops from Syria is part of a conditions-based transition, and that the US remains ready to respond to any threats in the region.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-02-19T01:14:47Z",
    "source": "BBC News"
  },
  {
    "id": "Njk=",
    "url": "https://alltoc.com/world/what-did-iran-do-in-the-strait-of-hormuz",
    "title": "What did Iran do in the Strait of Hormuz?",
    "summary": "What happened and why it mattersIran temporarily closed part of the Strait of Hormuz while conducting naval drills as indirect nuclear talks with U.S. envoys took place in Geneva.\nThe episode is significant for three reasons:The Strait is a global chokepoint: a substantial share of the world’s seaborne oil passes through these waters, so any disruption carries immediate economic and energy-market implications.\nWhat to watch nextWhether Iran repeats temporary closures or expands drills.\nHow oil markets and insurers respond — prices and shipping costs can move quickly.\nShort-term impacts are already visible: oil prices ticked higher on the drills and markets are watching for further escalation.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-17T18:09:19Z",
    "source": "Alltoc.com"
  },
  {
    "id": "NzA=",
    "url": "https://www.npr.org/2026/02/18/g-s1-110560/australia-bans-a-citizen-with-alleged-is-links-from-returning-from-syria",
    "title": "Australia bans a citizen with alleged IS links from returning from Syria",
    "summary": "Australia bans a citizen with alleged IS links from returning from Syriatoggle caption Baderkhan Ahmad/AP/APMELBOURNE, Australia — Australia's government banned an Australian citizen with alleged ties to the militant Islamic State group from returning home from a detention camp in Syria, the latest development in the case of fraught repatriation of families of IS fighters.\nThe woman was planning to join another 33 Australians — 10 women and 23 children — and fly on Monday from Damascus, Syria, to Australia, Home Affairs Minister Tony Burke said Wednesday.\nThe Australian government had acted on news that the group planned to leave Syria, Burke said.\nThe laws were were introduced to in 2019 to prevent defeated Islamic State fighters from returning to Australia.\nSponsor MessageAustralian governments have repatriated Australian women and children from Syrian detention camps on two occasions.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-18T16:53:00Z",
    "source": "NPR"
  },
  {
    "id": "NzE=",
    "url": "https://indianexpress.com/article/books-and-literature/jihad-glocal-terror-south-asia-pakistan-afghanistan-taliban-anju-gupta-10538725/",
    "title": "From global jihad to glocal terror: Ex-DGP Anju Gupta on why the threat is now harder to detect",
    "summary": "The nature of the global threat has changed, but the threat is as serious as it was—in fact, harder to detect because it has diffused.\nBefore the British, before Pakistan, India was always a direct neighbour for thousands of years.\nThis tilt is transactional and is about Afghanistan, Iran, and Saudi Arabia.\nAnju Gupta: Pakistan may lend clandestine support, but open support against Iran?\nGlocal Terror in South Asia: Tracing the Roots in Geopolitics and the Tragedy of Afghanistan by Anju GuptaSimon & Schuster India256 pagesRs 699",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-18T10:44:15Z",
    "source": "The Indian Express"
  },
  {
    "id": "NzI=",
    "url": "https://uk.news.yahoo.com/suspected-russian-shadow-fleet-tanker-105825950.html",
    "title": "Suspected Russian shadow fleet tanker GRINCH allowed to leave France after paying fine",
    "summary": "MARSEILLE, France, Feb 17 (Reuters) - French authorities have let the seized oil ‌tanker GRINCH leave territorial waters after ‌the company owning the vessel had to pay a ​penalty worth \"several million euros,\" French Foreign Minister Jean-Noel Barrot said on Tuesday.\nRussia will no ‌longer be ⁠able to finance its war with impunity through a ghost fleet ⁠off our coasts,\" Barrot said in a post on X.\nThe vessel named GRINCH was ​seized in ​the Mediterranean on ​last month, and ‌then diverted to anchor off the French port city of Marseille, on suspicion of being part of the shadow fleet that lets Russia export oil despite sanctions.\nAdvertisement AdvertisementAdvertisement AdvertisementThe vessel ‌had left the Russian ​port of Murmansk in ​early January, ​sailing under a Comoros flag, ‌French authorities have said.\nThe company ​owning the ​ship was ordered to pay a penalty for not being able to ​justify its ‌flag, French authorities added in a ​statement.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-17T11:17:49Z",
    "source": "Yahoo Entertainment"
  }
]