[
  {
    "url": "https://www.bbc.com/news/articles/cvg4rwne0ggo",
    "title": "Steve Witkoff praises Jonathan Powell's 'tireless efforts' on Gaza",
    "summary": "Witkoff praises PM aide's 'tireless efforts' on Gaza1 day ago Share Save Kate Whannel political reporter, and Henry Zeffman chief political correspondent Share SaveEPA Steve Witkoff (pictured) praised UK National Security Adviser Jonathan Powell's \"incredible input and tireless efforts\"The US Middle East envoy Steve Witkoff has praised the \"incredible input and tireless efforts\" of the UK's National Security Adviser Jonathan Powell in bringing about the ceasefire in Gaza.\nThe specific and personal praise for Powell from Witkoff is a boost to the national security adviser at a moment of political vulnerability.\nHowever, on Monday, Witkoff publicly lauded the UK's involvement and specifically the role of Jonathan Powell.\nYou heard what Steve Witkoff said about him today in relation to the role he has played behind the scenes.\"\nGetty Images Powell (left) met Qatar's Prime Minister and Foreign Minister Mohammed bin Abdulrahman bin Jassim Al-Than (right) in September",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-10-13T10:54:28Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.co.uk/sounds/play/p0m83h8w",
    "title": "Israel-Gaza: Why Is Hamas Recalling Fighters?",
    "summary": "Available for over a yearToday, we look at the progress of the Trump peace plan for Israel and Gaza as Hamas recalls 7,000 fighters to reassert control over Gaza amid fears of renewed internal violence.\nThe Hamas mobilisation had been widely anticipated amid growing uncertainty about who will govern Gaza once the war ends.\nThe ceasefire appears to have held but Israeli hostages and Palestinian prisoners are yet to be released.\nIf you want to listen, just say \"Ask BBC Sounds to play Newscast”.\nIf you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd Newscast brings you daily analysis of the latest political news stories from the BBC.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-10-11T18:17:00Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.livenowfox.com/news/trump-tomahawk-missiles-russia-ukraine-war",
    "title": "Trump may send Tomahawk missiles to Ukraine to end war",
    "summary": "articleThe Brief President Donald Trump told reporters Sunday that he could consider sending Tomahawk missiles to Ukraine.\nTrump spoke with Ukrainian President Volodymyr Zelenskyy about possibly distributing the weapons to the country to settle the war with Russia.\nPresident Donald Trump said that he might send long-range Tomahawk missiles to Ukraine if Russia doesn’t end their war with the country.\nReuters reported that Tomahawk missiles have a range of 1,550 miles, which has the capabilities to strike deeper into Russian territory.\nLast week, Trump told reporters that before he agreed to send Tomahawks, he wanted to know how Ukraine would use the missiles because he doesn’t want to intensify the war between Russia and Ukraine.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-13T15:53:53Z",
    "source": "Livenowfox.com"
  },
  {
    "url": "https://www.businessinsider.com/russia-unleashed-new-surge-drone-attacks-on-ukraines-rail-network-2025-10",
    "title": "Russia is unleashing a new surge of exploding drone attacks on Ukraine's rail network",
    "summary": "Russia has ramped up its attacks on Ukraine's rail network since August.\nRussia has ramped up its attacks on Ukraine's rail network since August.\nRussia has been carrying out attacks against Ukraine's rail network since the early days of the war.\nIn an October 4 social media post, Svyrydenko said that Moscow also uses missiles to \"systematically\" attack Ukraine's rail network.\nRussia's new campaign against Ukraine's rail network comes as part of the broader expansion of its drone attacks against the country.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-13T16:03:23Z",
    "source": "Business Insider"
  },
  {
    "url": "https://finance.yahoo.com/news/trump-threatens-china-export-controls-020648114.html",
    "title": "Trump threatens China with export controls on Boeing parts",
    "summary": "By Dan Catchpole and Steve HollandWASHINGTON (Reuters) -The United States could impose export controls on Boeing (BA) plane parts as part of Washington's response to Chinese export limits on rare earth minerals, President Donald Trump said on Friday.\nDuring clashes with Trump over trade, Beijing in April ordered Chinese airlines to temporarily stop taking deliveries of new Boeing jets.\nThey (China) have a lot of Boeing planes, and they need parts, and lots of things like that,\" Trump told reporters at the White House, when asked what items could the U.S. impose export controls on.\nU.S. export controls on Western-supplied parts for the C919 have significantly slowed production of that aircraft.\nAs of September, COMAC had delivered only five of the 32 jets Chinese customers expect this year.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-11T02:06:48Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/czxklen5p2qo",
    "title": "First German state visit to UK for 27 years announced",
    "summary": "First German state visit to UK for 27 years announcedSuch state visits are used to reinforce alliances and to encourage trade, with the German trip following last month's state visit by US President Donald Trump.\nThe visit by President Frank-Walter Steinmeier, from 3 to 5 December, will be the first German state visit to the UK in 27 years.\nThe president of Germany will visit the UK later this year, Buckingham Palace has announced.\nThe last German state visit to the UK was in December 1998, by President Roman Herzog, where he became the first head of state to visit Windsor Castle after the fire of 1992.\nThe King and Queen will be travelling to meet Pope Leo next week, for a rearranged state visit to the Vatican.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-13T11:09:58Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/china-very-concerned-pakistan-afghanistan-094639143.html",
    "title": "China is very concerned about Pakistan-Afghanistan clashes, foreign ministry says",
    "summary": "BEIJING (Reuters) -China is concerned about recent clashes between Pakistan and Afghanistan and has asked the two countries to protect its nationals and investments in the region, Beijing's foreign ministry said on Monday.\nChina shares a border with Afghanistan and Pakistan in its western region and has sought to play a mediating role in calming hostilities between the two sides, who were allies until recently.\nAdvertisement AdvertisementAdvertisement Advertisement\"China is willing to continue to play a constructive role in improving and developing Pakistan-Afghanistan relations,\" foreign ministry spokesperson Lin Jian said during a regular press briefing.\nIn August, China's Foreign Minister Wang Yi attended a meeting with Pakistani and Afghan counterparts in Kabul, calling for strengthening exchanges at all levels.\nIn an informal trilateral meeting weeks earlier, hosted by Beijing, China said Kabul and Islamabad had agreed to upgrade their diplomatic ties.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-13T09:46:39Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/c93xpqgzkv0o",
    "title": "Trump says Ukraine may get Tomahawk missiles to use against Russia",
    "summary": "Trump says he may send Tomahawk missiles to UkraineZelensky has said he will meet Trump in Washington on Friday for talks that will focus on air defence and long-range capabilities.\nAsked by reporters on Air Force One on Sunday whether he would provide Kyiv with Tomahawks, Trump replied: \"We'll see...\nUS President Donald Trump is considering sending long-range Tomahawk cruise missiles to Ukraine.\nTomahawk missiles have a range of 2,500 km (1,500 miles), which would put Moscow within reach of Ukraine.\nComments by Medvedev in August led Trump to say he had ordered two nuclear submarines to move closer to Russia.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-13T03:40:00Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.macrumors.com/2025/10/13/iphone-air-to-launch-in-china-this-week/",
    "title": "iPhone Air to Launch in China This Week",
    "summary": "The iPhone Air will be available for pre-order in China this Friday, Apple CEO Tim Cook today said on Weibo during a visit to the country.\nApple initially postponed the release of the ‌iPhone Air‌ in China while it worked with mainland authorities to resolve regulatory issues related to the device's eSIM requirement.\nThe iPhone 17, 17 Pro, and 17 Pro Max already went on sale with the global launch as normal.\nAt 5.6mm thick, the ‌iPhone Air‌ does not have a physical SIM slot, and is limited to eSIM-only operation.\nThe ‌iPhone Air‌ starts from 7,999 yuan in China.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-13T13:56:39Z",
    "source": "MacRumors"
  }
]