[
  {
    "id": "NDM=",
    "url": "https://www.businessinsider.com/ukraine-attacks-russian-shadow-fleet-tanker-in-mediterranean-first-time-2025-12",
    "title": "Ukrainian drones hit a Russian 'shadow fleet' tanker in the Mediterranean Sea for the first time, security official says",
    "summary": "The oil tanker Qendil in the Mediterranean Sea before the attack.\nThe oil tanker Qendil in the Mediterranean Sea before the attack.\nScreengrab via Security Service of Ukraine videoThe oil tanker Qendil in the Mediterranean Sea before the attack.\nScreengrab via Security Service of Ukraine videoUkrainian forces used long-range drones to strike an oil tanker said to be part of Russia's \"shadow fleet\" in the Mediterranean Sea for the first time, a security source told Business Insider on Friday.\nA source in the Security Service of Ukraine, the SBU, called the drone attack an \"unprecedented special operation\" that targeted and critically damaged the tanker Qendil.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NTk=",
    "url": "https://www.bbc.com/news/articles/czxgrl4937yo",
    "title": "Thailand bombs near Poipet casino hub on Cambodian border",
    "summary": "Thailand bombs near Cambodia's Poipet border crossingPoipet is known for being a major casino hub and the biggest land crossing between the two countriesThe renewed fighting this month has killed at least 21 people in Thailand and 17 in Cambodia, while displacing around 800,000, officials say.\nCambodia's defence ministry said Thai forces dropped two bombs, while the Thai side said that they targeted a facility storing rocket systems.\nThailand says it has bombed a \"logistics centre\" near the Cambodian town of Poipet, known for being a major casino hub and the biggest land crossing between the two countries.\nIn a statement, the Cambodian defence ministry said Thai forces dropped two bombs in the area of Poipet municipality at around 11:00 am (0400 GMT) Thursday.\nThe century-old border dispute between the South East Asian neighbours dramatically escalated on 24 July with a Cambodian rocket barrage into Thailand, followed by Thai air strikes.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NjE=",
    "url": "https://www.bbc.com/news/articles/ckgmpnr4ex2o",
    "title": "UK names Christian Turner as ambassador to US, replacing Peter Mandelson",
    "summary": "UK names Christian Turner as ambassador to US, replacing Peter Mandelson3 days ago Share Save Tom Bennett , London and Bernd Debusmann Jr , White House Share SaveReutersThe UK has named career diplomat Christian Turner as its new ambassador to the US, Downing Street has confirmed.\nThe previous ambassador, Lord Peter Mandelson, was sacked by UK Prime Minister Sir Keir Starmer after evidence, including emails and photos, emerged showing his continued association with the paedophile Jeffery Epstein.\nTurner has spent nearly 30 years working across Whitehall and the Foreign Office.\nThe White House said it looked \"forward to working with Ambassador Turner to further enhance the strong relationship between the United States ‍and United ‌Kingdom\", according to a statement sent to Reuters news agency.\nAFP via Getty Images Peter Mandelson (right) announced US-UK trade agreement alongside Donald Trump in May",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NjI=",
    "url": "https://abcnews.go.com/International/russia-preparing-year-war-despite-peace-talks-zelenskyy/story?id=128511257",
    "title": "Russia preparing for another year of war despite peace talks, Zelenskyy says",
    "summary": "Putin said Russia would achieve its goals either through talks or through war.\nRussia preparing for another year of war despite peace talks, Zelenskyy saysRussia's President Vladimir Putin and Chief of the General Staff Valery Gerasimov attend an expanded meeting of the Russian Defence Ministry Board at the National Defence Control Centre in Moscow, December 17, 2025.\nLONDON -- Ukrainian President Volodymyr Zelenskyy said in an address on Wednesday that Russia is preparing \"the coming year as a year of war,\" despite ongoing U.S.-brokered peace talks to end Moscow's full-scale invasion of its neighbor.\nZelenskyy said Russian President Vladimir Putin sent \"signals\" of Moscow's aggressive intent in remarks made on Wednesday, saying the bellicose comments were intended \"not only for us.\"\n\"If the opposing side and their foreign patrons refuse to engage in substantive talks, Russia will achieve the liberation of its historical lands by military means.\"",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "Njc=",
    "url": "https://www.yahoo.com/news/articles/syria-welcomes-permanent-repeal-sweeping-154748606.html",
    "title": "Syria welcomes the permanent repeal of sweeping US sanctions",
    "summary": "DAMASCUS, Syria (AP) — Syria’s government and its allies on Friday welcomed the final lifting of the most draconian sanctions imposed on the country in recent decades.\nThey argued that the sanctions were preventing international investors from launching reconstruction projects and blocking Syria from rebuilding its battered economy and infrastructure.\nSome lawmakers had pushed for making the repeal conditional on steps by the new Sunni Islamist-dominated Syrian government to protect religious minorities, among other measures.\nAl-Sharaa thanked the leaders of all three countries, along with Trump, in a speech celebrating the end of the sanctions.\nThe Saudi foreign ministry commended \"the significant and positive role played by US President Donald Trump” in lifting the sanctions.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NzA=",
    "url": "https://finance.yahoo.com/news/europe-stumbles-attempt-sidestep-trump-090000409.html",
    "title": "Europe Stumbles in Its Attempt to Bypass Trump’s World Order",
    "summary": "Ursula von der Leyen was supposed to sign the European Union’s largest free-trade agreement on Saturday, proving the bloc’s standing as a geoeconomic force.\nBrazilian President Luiz Inacio Lula da Silva said earlier this week the time was now or never.\nOfficials say they will try again to sign the deal on Jan. 12, but there’s no guarantee.\nIt especially wants to prove it can move outside the orbit of China and the US, which have increasingly antagonistic trade relationships with Europe.\n“This is Europe’s independence moment,” von der Leyen said earlier this week, ahead of a summit when EU leaders would tackle funding options for Ukraine as well as Mercosur.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NzE=",
    "url": "https://finance.yahoo.com/news/china-launches-113-billion-free-054238950.html",
    "title": "China launches $113 billion free-trade experiment on Hainan island",
    "summary": "Foreign firms will also be able to operate in service ‌sectors that are restricted on the mainland.\n\"China aims to build the Hainan Free Trade Port into an important gateway that leads the country's opening-up into a new era,\" ⁠an editorial by the state news agency Xinhua said.\nForeign direct ‌investment into China fell 10.4% year-on-year in the first three quarters of 2025, official data shows.\nIf liberalisation succeeds in Hainan, economists say policymakers may feel emboldened to expose more of China's economy to market forces.\n\"In addition to boosting Hainan's tourism sector, the plan should also encourage more foreign investment and manufacturing,\" she added.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  },
  {
    "id": "NzM=",
    "url": "https://www.yahoo.com/news/articles/us-announces-massive-package-arms-024715230.html",
    "title": "US announces massive package of arms sales to Taiwan valued at more than $10 billion, angering China",
    "summary": "WASHINGTON (AP) — President Donald Trump's administration has announced a massive package of arms sales to Taiwan valued at more than $10 billion that includes medium-range missiles, howitzers and drones, drawing an angry response from China.\nIf approved by Congress, it would be the largest-ever U.S. weapons package to Taiwan, exceeding the total amount of $8.4 billion in U.S. arms sales to Taiwan during President Joe Biden's Democratic administration.\nThey also include 60 self-propelled howitzer systems and related equipment worth more than $4 billion and drones valued at more than $1 billion.\nThe eight sales agreements amount to $11.15 billion, according to Taiwan's Defense Ministry.\nTaiwan's Defense Ministry in a statement Thursday expressed gratitude to the U.S. over the arms sale, which it said would help Taiwan maintain “sufficient self-defense capabilities” and bring strong deterrent capabilities.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-21T11:11:13Z",
    "source": "BBC News"
  }
]