[
  {
    "url": "https://www.wired.com/story/how-to-travel-to-china/",
    "title": "What to Know About Traveling to China for Business",
    "summary": "Amid growing tensions and an escalating trade war between the United States and China, international business travelers may be understandably wary about traveling to the Chinese mainland.\nEach week there are 50 round-trip flights directly from the US to China, and in some cases China has made it easier to obtain business visas.\nWhen Stone Fish sees on-the-record comments from people working at global and US-based companies, he tends to see optimism about traveling to China and the environment there.\n“But when you have private conversations with them,” he says, “they’re a lot more pessimistic, and traveling to China on a business trip is more challenging than it used to be.”It wasn’t long ago that China was welcoming swelling numbers of foreigners, and international businesses and business travelers, across its borders.\nForeign companies were rushing to do business in China.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-08-06T13:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.bbc.com/news/articles/cj4wn1j7w1jo",
    "title": "Why Putin and Trump's relationship has soured",
    "summary": "Putin and Trump's relationship has soured - but behind the posturing, a Ukraine deal is still possible4 days ago Share Save Steve Rosenberg • @BBCSteveR Russia Editor Share SaveBBCListen to Steve read this article Has the relationship between Donald Trump and Vladimir Putin gone off the rails?\nAt times it seemed as if Vladimir Putin and Donald Trump were in the same carriage, moving in the same direction.\nHe made four trips here in just over two months, spending hours in talks with Vladimir Putin.\nSo far, there is no sign that Vladimir Putin will yield to pressure from Washington.\nAfter all, so far in Ukraine Vladimir Putin hasn't budged from his maximalist demands on territory, Ukraine's neutrality and the future size of the Ukrainian army.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-08-04T23:22:06Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/c5yl6eegv63o",
    "title": "Despite Trump’s peace calls, Russian attacks on Ukraine double since inauguration",
    "summary": "According to Ukrainian military intelligence, ballistic missile construction in Russia grew by 66% over the past year.\nDuring this period, Russian attacks on Ukraine briefly fell when compared with the final weeks of the Biden administration.\nAttacks peaked early last month, when Moscow launched 748 drones and missiles towards Ukraine on 9 July, according to the Ukrainian Air Force data.\nWhile Trump has expressed anger at the escalating Russian attacks on several occasions, his mounting frustration does not appear to have had an impact on Moscow's strategy.\nThe growing attacks have renewed calls for the US to send fresh supplies of Patriot anti-air batteries to Ukraine.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-08-05T23:35:07Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cn845mm7xemo",
    "title": "Putin not swayed by Trump's Ukraine war ultimatum",
    "summary": "Putin not swayed by Trump's Ukraine war ultimatumPresident Putin was speaking during a visit to the Valaam Monastery in north-western RussiaUkrainian President Volodymyr Zelensky said he was ready to meet Putin \"any time\".\n\"All disappointments arise from inflated expectations,\" Putin said, in an apparent reference to Trump's \"disappointment\" with the Russian leader for not bringing an end to the war.\nWhen in July Trump announced his original 50-day deadline for Russia to end the war, Putin didn't react.\nWhen that was reduced to 10-12 days, Putin said nothing.\nTrump may claim to be \"disappointed\" with Putin for not making peace - but the Russian leader is unrepentant.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-08-01T19:38:15Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/russia-economy-oil-gas-energy-revenue-war-funding-india-trump-2025-8",
    "title": "The key pillar of Russia's war chest is cracking. The timing couldn't be worse.",
    "summary": "Russian President Vladimir Putin's administration is under increasing pressure to end the war in Ukraine.\nRussian President Vladimir Putin's administration is under increasing pressure to end the war in Ukraine.\nGetty ImagesRussian President Vladimir Putin's administration is under increasing pressure to end the war in Ukraine.\nLast week, Trump announced a 25% tariff on Indian goods and a \"penalty\" for its purchases of Russian oil.\nHowever, the bigger risk is if other major Russian oil buyers also start to avoid buying the commodity.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-08-06T07:39:29Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.bbc.com/news/articles/c74dzk744nvo",
    "title": "Sussex couple detained in Iran allowed to call home for first time",
    "summary": "Couple detained in Iran allowed first call home3 days ago Share Save Share SaveFamily handout Lindsay and Craig Foreman, from East Sussex, were arrested in JanuaryA British couple detained in Iran have been allowed their first phone calls home after several months of no direct contact.\nLindsay and Craig Foreman, from East Sussex, were on a once-in-a-lifetime trip around the world when they were detained by Iranian authorities in January and charged with espionage.\nMr Bennett, from Folkestone in Kent, said his parents were \"holding strong\".\nIt was revealed on Monday that Mr and Ms Foreman had been separated and were being held in what Mr Bennett called \"Iran's worst prisons\".\nWhile Mr Bennett said it was \"amazing\" to hear their voices, he continued that eyes should be \"firmly on the real issues\".",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-08-05T16:53:36Z",
    "source": "BBC News"
  },
  {
    "url": "https://abcnews.go.com/International/trump-envoy-witkoff-head-russia-chance-ukraine-talks/story?id=124336363",
    "title": "Trump envoy Witkoff to head to Russia for 'last chance' Ukraine ceasefire talks",
    "summary": "Trump envoy Witkoff to head to Russia for 'last chance' Ukraine ceasefire talksPeople wait for transportation at a bus stop next to a recruitment advert of the Ukrainian Armed Forces in Kyiv, Ukraine, on August 3, 2025, 2025.\nPeople wait for transportation at a bus stop next to a recruitment advert of the Ukrainian Armed Forces in Kyiv, Ukraine, on August 3, 2025, 2025.\nPeople wait for transportation at a bus stop next to a recruitment advert of the Ukrainian Armed Forces in Kyiv, Ukraine, on August 3, 2025, 2025.\nPeople wait for transportation at a bus stop next to a recruitment advert of the Ukrainian Armed Forces in Kyiv, Ukraine, on August 3, 2025, 2025.\nPeople wait for transportation at a bus stop next to a recruitment advert of the Ukrainian Armed Forces in Kyiv, Ukraine, on August 3, 2025, 2025.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-08-04T10:19:03Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.businessinsider.com/russia-economy-inflation-down-pmi-gdp-growth-central-bank-tradeoff-2025-8",
    "title": "Russia's inflation fight is working — at the cost of growth",
    "summary": "Russian President Vladimir Putin's administration has managed to keep his country's economy humming despite sweeping Western sanctions, but there are growing pressures.\nRussian President Vladimir Putin's administration has managed to keep his country's economy humming despite sweeping Western sanctions, but there are growing pressures.\n\"Current inflationary pressures, including underlying ones, are declining faster than previously forecast,\" Russia's central bank said last month.\nRussia's inflation fell from 8.2% in the first quarter to 4.8% in the second quarter, prompting its central bank to lower its key interest rate from 20% to 18%.\nRussia's central bank now finds itself walking a tightrope: keeping inflation in check while avoiding a deeper downturn.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-08-04T05:32:18Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/news/754269/trump-intel-ceo-lip-bu-tan-china",
    "title": "Trump demands CEO of Intel resign over ties to China",
    "summary": "President Donald Trump has called for Lip-Bu Tan to immediately resign as Intel’s CEO over his reported ties to Chinese tech firms.\nThe demand follows Arkansas Senator Tom Cotton questioning Intel’s board chairman whether Tan’s alleged connections to China would conflict with security regulations.\n“The CEO of INTEL is highly CONFLICTED and must resign, immediately,” Trump posted on Truth Social.\nThank you for your attention to this problem!”Tan was named Intel’s CEO in March to overhaul the struggling chipmaker’s business, after the board ejected his predecessor, Pat Gelsinger, three and a half years into a projected four-year turnaround plan.\nLast month, Intel said it’s laying off 24,000 employees this year and axing planned projects in Germany and Poland.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-08-07T14:25:28Z",
    "source": "The Verge"
  },
  {
    "url": "https://ca.news.yahoo.com/exclusive-putin-doubts-potency-trumps-104738158.html",
    "title": "Putin doubts potency of Trump's ultimatum to end the war, sources say",
    "summary": "FORCES ADVANCEThe first source said Putin was privately concerned about the recent deterioration of U.S. ties.\nAdvertisement AdvertisementAdvertisement AdvertisementRodgers, the author, said Putin has invested his political reputation and legacy in the war in Ukraine.\nRussia's military General Staff has told Putin that the Ukrainian front will crumble in two or three months, the first person said.\nAdvertisement AdvertisementAdvertisement Advertisement'HE'S MADE THREATS BEFORE'Trump's sanctions threat was \"painful and unpleasant,\" but not a catastrophe, the second source said.\nAdvertisement AdvertisementAdvertisement AdvertisementThe source called the offer a \"fantastic chance,\" but said stopping a war was much more difficult than starting it.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-08-05T10:47:38Z",
    "source": "Yahoo Entertainment"
  }
]