[
  {
    "url": "https://www.bbc.com/news/articles/c0e99yqv332o",
    "title": "Trump says he will try to get back territory for Ukraine in talks with Putin",
    "summary": "Trump says he will try to get back territory for Ukraine in talks with Putin2 days ago Share Save Rachel Hagan & Laura Gozzi BBC News Share SaveWatch: 'We're going to change the battle lines' Trump on the war in UkraineUS President Donald Trump has said he will try to get some territory back for Ukraine during his meeting with Russian President Vladimir Putin on Friday.\nWe're going to try to get some of that territory back for Ukraine,\" he told a news conference at the White House.\nTrump claimed that he could know within two minutes of meeting Putin whether progress was possible.\nTrump said he will update European leaders if Putin proposes a \"fair deal\" during the talks, adding that he would speak to Ukraine's President Volodymyr Zelensky first \"out of respect\".\nTrump has previously blamed Zelensky for the war in Ukraine, which was sparked by Russia's full-scale invasion of the country in February 2022.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-08-11T17:00:17Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/c2077gwjlvxo",
    "title": "North Koreans tell BBC they are sent to work 'like slaves' in Russia",
    "summary": "North Koreans tell BBC they are being sent to work 'like slaves' in Russia1 day ago Share Save Jean Mackenzie Seoul correspondent Share SaveBBC The BBC understands more than 50,000 North Koreans will eventually be sent to work in RussiaThousands of North Koreans are being sent to work in slave-like conditions in Russia to fill a huge labour shortage exacerbated by Russia's ongoing invasion of Ukraine, the BBC has learned.\n'Like slaves': North Koreans sent to work in Russia\"Waking up was terrifying, realising you had to repeat the same day over again,\" said another construction worker, Tae, who managed to escape Russia last year.\nThe sudden influx means North Korean workers are now \"everywhere in Russia,\" the official added.\nRussian government figures show that more than 13,000 North Koreans entered the country in 2024, a 12-fold increase from the previous year.\n\"Russia is suffering a severe labour shortage right now and North Koreans offer the perfect solution.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-08-12T05:10:26Z",
    "source": "BBC News"
  },
  {
    "url": "https://gizmodo.com/nvidias-six-word-response-to-china-2000641571",
    "title": "Nvidia’s Six-Word Response to China",
    "summary": "“Embedding backdoors and kill switches into chips would be a gift to hackers and hostile actors,” the company wrote.\nThe Deal That Sparked the FireThis new firestorm in Beijing was ignited by the unconventional deal Nvidia just struck with Washington.\nTo return to China after months of a federal ban, the company agreed to pay the Trump administration 15% of the revenue generated by its H2O chip sales there.\nTrump then dismissed the H2O chips as “obsolete” and “an old chip that China already has.”The president’s comments perfectly capture the absurd tightrope Nvidia is now forced to walk.\nThe U.S. President is calling it old news, while Chinese state media is calling it a security risk.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-08-11T20:16:50Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://gizmodo.com/weapons-runs-to-big-70m-global-opening-in-debut-weekend-2000641198",
    "title": "‘Weapons’ Runs to Big $70M Global Opening in Debut Weekend",
    "summary": "And the answer to that question is a resounding “yes.”Per Variety, Zach Cregger’s sophomore outing earned $70 million worldwide.\nFor the family-focused crowd—well, the other part of that crowd, since Weapons is about missing kids—Freakier Friday also did pretty well.\nDisney’s legacy sequel starring Lindsay Lohan and Jamie Lee Curtis made $44.5 million worldwide, led largely by its domestic take of $29 million.\nAnd Superman continues to hold strong with $578.8 million worldwide.\nAfter becoming the highest-grossing domestic Superman movie last week, it’s poised to make (or exceed) $600 million worldwide before it hits streaming on August 26.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-08-10T21:00:28Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.yahoo.com/news/articles/prominent-chinese-diplomat-liu-jianchao-060406583.html",
    "title": "Prominent Chinese diplomat Liu Jianchao taken for questioning, sources say",
    "summary": "BEIJING (Reuters) -Senior Chinese diplomat Liu Jianchao, widely seen as a potential foreign minister, was taken away by authorities for questioning in early August, five people familiar with the matter said.\nAdvertisement AdvertisementAdvertisement Advertisement\"It removes a frontrunner to succeed Wang Yi and deprives China of a potential next steward for China's foreign policy.\"\nAnother diplomat who met his aides around that time said they were very confident that he would soon be promoted to foreign minister.\nUnusually for a Chinese diplomat, he served two successive postings in China's anti-corruption bureaucracy between 2015 and 2018, when he helped track down corrupt officials who fled overseas.\nA person familiar with China's foreign ministry said that Liu was liked and well-respected by Chinese diplomats for his outstanding ability and warm, friendly demeanour.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-08-11T06:04:06Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/chinese-ships-slam-into-each-other-while-chasing-philippine-vessel-2025-8",
    "title": "Chinese ships slam into one another during a South China Sea chase, Philippine Coast Guard video shows",
    "summary": "A Chinese navy warship and a China Coast Guard cutter crashed into one another in the South China Sea on Monday while chasing a Philippine Coast Guard vessel, video footage shows.\nAs it closed in on the Philippine vessel, the Chinese coast guard ship suddenly slammed into a larger Chinese Navy destroyer that unexpectedly passed between the Philippine vessel and the Chinese cutter.\nHere is a longer video capturing the collision between the PLA Navy 164 and the China Coast Guard 3104.\nThe collision came amid the latest in a long list of confrontations between China and the Philippines in the South China Sea.\nThe Philippines has accused Chinese Coast Guard vessels of engaging in dangerous and provocative maneuvers with its ships in the past.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-08-11T14:31:38Z",
    "source": "Business Insider"
  },
  {
    "url": "https://gizmodo.com/nvidia-just-dodged-an-8-billion-bullet-thanks-to-donald-trump-2000641188",
    "title": "Nvidia Just Dodged an $8 Billion Bullet, Thanks to Donald Trump",
    "summary": "According to the Financial Times, the breakthrough came after Huang’s visit to the White House on August 6 to meet with President Donald Trump.\nTo prevent this, the U.S. has imposed strict export controls, blocking the sale of top-tier AI chips to China.\nThe Power of Personal DiplomacyReversing this policy took months of intense diplomacy and lobbying, culminating in Huang’s personal visits to the White House.\nDuring a White House AI summit last month, Trump admitted he had initially considered taking antitrust action against the chip giant before he got to know its CEO.\nWith the $8 billion revenue threat now averted and the $50 billion China market reopened, investors will be watching closely when Nvidia reports its quarterly earnings later this month.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-08-10T13:18:16Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.wired.com/story/the-plastic-bottles-we-throw-into-the-pacific-are-infesting-the-beaches-of-central-america/",
    "title": "Central American Beaches Are Being Overrun With Local and Foreign Plastic",
    "summary": "A Coca-Cola bottle from 2002 was found on Robinson Crusoe Island, a World Biosphere Reserve, in Chile.\nThese discarded pieces of packaging were collected in a new macro-study that looked at the origin of plastic bottle pollution on beaches and cities along Latin America’s Pacific coastline.\nIt found that across the region, Central American countries are most affected by coastal plastic pollution, and underscores the urgency of confronting this major problem.\nAn environmentalist searches for plastic waste and packaging dumped on El Esterón beach in Intipuca, El Salvador, in October 2024.\nThis study reveals surprising data, given that more than half of the bottles and caps collected had visible dates.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-08-12T09:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.theverge.com/news/757428/donald-trump-nvidia-amd-ai-chip-sales-china",
    "title": "US demands cut of Nvidia sales in order to ship AI chips to China",
    "summary": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more.\nThe Trump administration has ordered Nvidia and AMD to pay the federal government a 15 percent cut of their AI chip sales revenue to China, according to reports from The New York Times and The Financial Times.\nNvidia CEO Jensen Huang reportedly reached an agreement with President Donald Trump just days before the Commerce Department granted the companies licenses to sell AI chips.\n“I said, ‘Listen, I want 20 percent if I’m going to approve this for you, for the country,’” Trump said.\nAfter the Trump administration put restrictions on AI chip sales to China in April, both companies confirmed last month that they would soon resume shipments once they received licenses.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-08-11T14:54:48Z",
    "source": "The Verge"
  },
  {
    "url": "https://abcnews.go.com/International/zelenskyy-putin-preparing-end-war-despite-trump-summit/story?id=124567946",
    "title": "Trump, Vance to meet virtually with Zelenskyy ahead of Putin summit",
    "summary": "President Donald Trump and Vice President JD Vance will take part in a virtual meeting on Wednesday with Ukrainian President Volodymyr Zelenskyy and European allies, two U.S. officials confirmed to ABC News.\nZelenskyy emphasized there were no demands or concrete proposals from the U.S., just discussions, and it's still unclear to him what exactly Russian President Vladimir Putin told Witkoff.\nThe Ukrainian president also said he was told that since a meeting with him and Trump already took place, one between Putin and Trump logically followed.\nThe White House officially announced the summit between Trump and Putin will take place in Anchorage, Alaska, on Friday.\nOn Monday, Zelenskyy suggested that Putin is not ready to end the fighting, despite Friday's meeting in Alaska.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-08-12T08:21:24Z",
    "source": "ABC News"
  }
]