[
  {
    "id": "Mg==",
    "url": "https://www.npr.org/2025/12/31/g-s1-104088/up-first-newsletter-flu-cases-surge-venezuela-iran-protests",
    "title": "Why flu cases are surging this season. And, protests erupt in Iran over the economy",
    "summary": "Why flu cases are surging this season.\nToday's top storiesThe flu season is off to a rough start this year.\nInstead, this year's flu vaccine appears to be mismatched against the virus because it was formulated before the strain emerged.\nIran is experiencing its largest protests in years as thousands of people, unhappy with the state of the economy, flood the streets.\nHere's how NPR's Word of the Week has evolved into a long-standing tradition.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-12-31T12:30:43Z",
    "source": "NPR"
  },
  {
    "id": "Nw==",
    "url": "https://www.bbc.com/news/articles/cqj2llkjv8vo",
    "title": "Protests spread across Iran for third day after currency hits record low",
    "summary": "Protests spread across Iran for third day after currency hits record lowThe Iranian government said it \"recognises the protests\" and would listen \"with patience, even if it is confronted with harsh voices\".\nThe protests began on Sunday after shopkeepers in Tehran's Grand Bazaar staged a strike when the Iranian rial hit a record low against the US dollar on the open market.\nProtests and strikes in Iran over inflation and currency devaluation have spread from the capital, Tehran, to several other cities on a third day of unrest.\nDuring a 12-day war between Israel and Iran in June, the US carried out air strikes on key Iranian uranium enrichment sites.\nIran's supreme leader has repeatedly said that Israel's government hoped mass protests would erupt in Iran during the war and topple the regime.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-12-30T16:31:18Z",
    "source": "BBC News"
  },
  {
    "id": "NDM=",
    "url": "https://www.aljazeera.com/news/2025/12/29/protests-strikes-after-irans-economic-situation-rapidly-deteriorates",
    "title": "Protests, strikes after Iran’s economic situation rapidly deteriorates",
    "summary": "Iranians are further squeezed every day amid a tanking economy, an energy crisis, water bankruptcy and lethal pollution.\nFor years, Iran has also been dealing with an exacerbating energy crisis, which has periodically contributed to deadly air pollution that claims tens of thousands of lives each year.\nThe attacks also significantly damaged or destroyed most of Iran’s nuclear facilities, which were under the supervision of the International Atomic Energy Agency (IAEA).\nHundreds of people were killed, over 20,000 people were arrested, and several people were executed in connection with the protests before they subsided.\nAuthorities blamed foreign influence and “rioters” trying to destabilise the country, as they did with previous rounds of protests.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-29T15:08:24Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTM=",
    "url": "https://www.bbc.com/news/articles/c4g5gq19n9zo",
    "title": "Turkey detains 357 suspected IS members in nationwide raids",
    "summary": "Turkey detains 357 suspected IS members in nationwide raids2 days ago Share Save Sofia Ferreira Santos Share SaveX/Ali Yerlikaya A video shared on social media by Turkey's interior minister appears to show several people being detainedMore than 350 suspected Islamic State group (IS) members have been detained as part of nationwide police operations in Turkey.\nInterior Minister Ali Yerlikaya said 357 suspects were apprehended across 21 provinces in coordinated raids on Tuesday morning.\nThe interior minister also shared a video appearing to show dozens of counter-terrorism officers taking part in the operations and detaining several people.\nIt also noted 41 of those detained had suspected links to the clash in Yalova on Monday.\nInterior minister Yerlikaya said another 16 individuals had been detained in Yalova for making \"provocative posts\" on social media.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-30T10:38:53Z",
    "source": "BBC News"
  },
  {
    "id": "NTY=",
    "url": "https://www.businessinsider.com/trump-trade-war-average-tariffs-deescalate-china-usmca-bofa-ceo-2025-12",
    "title": "The trade war is de-escalating and settling around 15% tariffs, Bank of America's CEO says",
    "summary": "Tariffs are settling around 15% for many countries, Bank of America CEO Brian Moynihan saidTariffs are settling around 15% for many countries, Bank of America CEO Brian Moynihan said Anna Moneymaker/Getty ImagesTariffs are settling around 15% for many countries, Bank of America CEO Brian Moynihan said Anna Moneymaker/Getty Imageslighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nImpact LinkBank of America CEO Brian Moynihan said the Trump administration's trade policy is showing signs of de-escalation after a year in which tariffs unsettled businesses.\nBut what initially disrupted planning and purchasing decisions is now becoming clearer, Moynihan said, with Bank of America's internal outlook pointing toward a broad tariff floor.\n\"To go from a 10% across the board, to 15% for the broad base of countries, not a huge impact,\" Moynihan said.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-12-29T05:07:01Z",
    "source": "Business Insider"
  },
  {
    "id": "NTk=",
    "url": "https://www.yahoo.com/news/articles/beijing-condemns-demolition-monument-honoring-005817911.html",
    "title": "Beijing condemns the demolition of a monument honoring the Chinese community in Panama",
    "summary": "PANAMA CITY (AP) — China on Monday condemned the demolition of a monument honoring the Chinese community in Panama, the latest development as the Trump administration pushes for the Central American nation to distance itself from Beijing.\nPanama's president echoed the condemnation, blaming local authorities and pledging that the monument would be rebuilt.\nOvernight, videos circulated on social media showing large excavators tearing down the monument, which commemorated 150 years of Chinese presence in Panama and Chinese migrants who helped build railroads and the Panama Canal.\nSome members of the Chinese community staged a protest at the site while some businesses said they would shut down in protest.\nAdvertisement AdvertisementAdvertisement Advertisement“They helped build our interoceanic railway, they helped build the Panama Canal, and they're helping our country's economy,” he said, speaking of the Chinese community in Panama.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-12-30T00:58:17Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NjA=",
    "url": "https://www.bbc.com/news/articles/c4g4g5lgngvo",
    "title": "Ukraine denies drone attack on Putin's residence",
    "summary": "Ukraine denies drone attack on Putin's residence2 days ago Share Save Amy Walker Share SaveEPAPresident Volodymyr Zelensky has denied allegations by Russia that Ukraine launched a drone attack on one of President Vladimir Putin's residences, and accused Moscow of trying to derail peace talks.\nRussia's Foreign Minister Sergei Lavrov claimed Kyiv had launched an attack over Sunday night using 91 long-range unmanned aerial vehicles (UAVs) on Putin's state residence in Russia's northwestern Novgorod region.\nZelensky dismissed the claim as \"typical Russian lies\", intended to give the Kremlin an excuse to continue attacks on Ukraine.\n\"Almost a day passed, and Russia still hasn't provided any plausible evidence to its accusations of Ukraine's alleged 'attack on Putin's residence'.\n\"I don't trust Putin and he doesn't want success for Ukraine,\" Zelensky added.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-12-29T17:02:50Z",
    "source": "BBC News"
  },
  {
    "id": "NjE=",
    "url": "https://www.yahoo.com/news/articles/pakistan-premier-offers-complete-solidarity-171951057.html",
    "title": "Pakistan’s premier offers 'complete solidarity' to Saudi Crown Prince after Yemen port strike",
    "summary": "ISLAMABAD (AP) — Pakistan’s Prime Minister spoke by telephone with the Saudi Crown Prince Mohammed bin Salman on Wednesday to express his “complete solidarity” with the Kingdom following this week's Saudi bombing of Yemen's port city of Mukalla, the prime minister’s office said.\nAccording to the statement, Shehbaz Sharif also stressed the need to maintain regional peace and stability through dialogue and diplomacy.\nIt said the crown prince also expressed his intention to pay an official visit to Pakistan next year.\nSaudi Arabia has long maintained close economic, religious, and security ties with Pakistan, while the UAE has also helped Islamabad with loans in recent years.\nIn 2024, Pakistan said the UAE had committed to investing up to $10 billion in Pakistan.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-31T17:19:51Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NjI=",
    "url": "https://www.yahoo.com/news/articles/tokyo-expresses-concern-beijing-over-093000704.html",
    "title": "Beijing hits back at 'extremely hypocritical' critics of PLA drills around Taiwan",
    "summary": "Beijing has hit back against concerns raised by foreign countries, including Japan, over its military drills around Taiwan, accusing critics of being \"extremely hypocritical\".\nBeijing launched massive live-fire drills and blockade exercises around Taiwan on Monday and Tuesday, firing rockets and mobilising destroyers and missile launchers.\nThe People's Liberation Army (PLA) said the drills served as a warning to \"independence forces\" and against external interference.\nMeanwhile, Tokyo also said on Wednesday that Chinese coastguard vessels had patrolled near the Diaoyu Islands, another flashpoint, for a record number of days this year.\nThe Diaoyu Islands, northeast of Taiwan in the East China Sea, consist of five uninhabited islets and three reefs.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-31T09:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NjQ=",
    "url": "https://www.yahoo.com/news/articles/why-feud-between-tokyo-beijing-093000905.html",
    "title": "Why the feud between Tokyo and Beijing could rage on for a while yet",
    "summary": "Nearly two months after Japan's new prime minister enraged Beijing with her remarks on Taiwan, the issue is not going away.\nSanae Takaichi set off a diplomatic firestorm in November when she suggested that Japan could justify a military response if Beijing attacked Taiwan.\nWu said Japan's involvement in the South China Sea and the Taiwan Strait in the past decade was partly fuelling Beijing's concerns.\nThis article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century.\nCopyright © 2025 South China Morning Post Publishers Ltd. All rights reserved.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-29T09:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NjU=",
    "url": "https://www.yahoo.com/news/articles/us-pledges-2-billion-humanitarian-111233712.html",
    "title": "US pledges $2 billion in new UN model for delivery of humanitarian assistance",
    "summary": "U.N. data shows total U.S. humanitarian contributions to the U.N. fell to about $3.38 billion in 2025, equating to about 14.8% of the global sum.\nThis ⁠was down sharply from $14.1 billion the prior year, and ‌a peak of $17.2 billion in 2022.\nAdvertisement AdvertisementAdvertisement AdvertisementJeremy Lewin, State Department Under Secretary of State for Foreign Assistance, Humanitarian Affairs and Religious Freedom, said further countries ​would be added as more money is contributed to the mechanism.\nFletcher ​said that donors would have \"specific requirements\" around which countries and what type of work should ​be funded.\nLewin said the focus of the ‍funding was on life-saving assistance, while funding ⁠for climate-related and other projects that were not a priority for the administration would be cut out.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-29T17:39:59Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NjY=",
    "url": "https://abcnews.go.com/International/russian-official-threatens-zelenskyy-moscow-claims-kyiv-attacked/story?id=128774157",
    "title": "Russian official threatens Zelenskyy as Moscow claims Kyiv attacked Putin residence",
    "summary": "LONDON -- A top Russian official on Monday issued personal threats against Ukrainian President Volodymyr Zelenskyy after Russia claimed that Ukraine launched a drone attack on one of Russian President Vladimir Putin's official residences.\nUkrainian President Volodymyr Zelenskyy attends a joint news conference in Palm Beach, Florida, on Dec. 28, 2025.\nWhen pressed on whether there was any evidence that Putin's residence was actually attacked, Trump said it's possible it didn't happen.\nRussian President Vladimir Putin holds his annual end-of-year press conference in Moscow, December 19, 2025.\nLavrov said that Russia does not intend to withdraw from the negotiation process following the alleged attack.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-30T10:01:23Z",
    "source": "ABC News"
  },
  {
    "id": "Njc=",
    "url": "https://www.bbc.com/news/articles/c8xdxz48l7yo",
    "title": "UAE says it will withdraw from Yemen after Saudi strike on separatist-held port",
    "summary": "UAE says it will withdraw from Yemen after Saudi strike on separatist-held port2 days ago Share Save David Gritten Share SaveEPA The UAE-backed Southern Transitional Council (STC) seeks independence for southern YemenThe United Arab Emirates has said it will withdraw its remaining forces from Yemen, after Saudi Arabia backed a demand from the Yemeni presidential council for them to leave within 24 hours.\nThe Emirati announcement followed an air strike by a Saudi-led military coalition on what it said was a weapons shipment for UAE-backed separatist forces in the southern port of Mukalla.\nThe UAE denied the shipment contained weapons and expressed \"deep regret\" at the Saudi accusations.\nThe strongly worded statement issued by Saudi Arabia's foreign ministry on Tuesday morning said it was working to \"contain the escalatory steps\" taken recently by the Southern Transitional Council (STC), which seeks independence for southern Yemen.\nAFP The Saudi-led coalition air strike on Mukalla destroyed a number of military vehicles and pick-up trucks",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-12-30T14:08:40Z",
    "source": "BBC News"
  },
  {
    "id": "Njg=",
    "url": "https://www.aljazeera.com/news/2025/12/30/saudi-led-coalition-strikes-yemeni-port-over-unauthorised-weapons-shipment",
    "title": "After Saudi Arabia’s Yemen strike, UAE rejects support for separatists",
    "summary": "Head of PLC, Rashad ⁠al-Alimi, ​said after the air strikes all forces from the UAE must leave Yemen within 24 hours.\nSaudi Arabia said it hopes the UAE will respond to the demand, adding it’s committed to the “security, stability, and sovereignty of Yemen”.\nThe Saudi Press Agency quoted the cabinet as saying Saudi Arabia will not hesitate to “take the necessary steps to confront any threat” to its security.\n“Little by little, the UAE started the habit of undertaking foreign policy and independent decisions in Yemen without going back to Saudi Arabia,” Barakat said.\nThe STC official also tried to portray the internationally recognised government of Yemen as a “clear enemy” since it is allegedly “inciting Saudi Arabia against us”.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-30T06:26:18Z",
    "source": "Al Jazeera English"
  }
]