[
  {
    "url": "https://www.theverge.com/news/786885/trump-calls-for-firing-microsoft-lisa-monaco",
    "title": "Trump’s new target: Microsoft head of global affairs Lisa Monaco",
    "summary": "is a senior editor and founding member of The Verge who covers gadgets, games, and toys.\nPosts from this author will be added to your daily email digest and your homepage feed.\nAfter successfully manipulating Intel CEO Lip-Bu Tan and eventually failing to cancel Jimmy Kimmel, President Donald Trump has named his next target for retribution: Microsoft head of global affairs Lisa Monaco.\nTrump writes that he’s already stripped Monaco of security clearances, but suggests that her role at Microsoft now lets her access “Highly Sensitive Information.”Image: Truth SocialIt’s not clear why Trump took this moment to go after Monaco, but it’s possible he’s just now becoming aware of her Microsoft role.\nMicrosoft declined to comment on this story to The Verge.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-09-26T22:40:46Z",
    "source": "The Verge"
  },
  {
    "url": "https://gizmodo.com/airports-in-denmark-shut-down-as-mysterious-drones-spotted-2000663805",
    "title": "Airports in Denmark Shut Down as Mysterious Drones Spotted",
    "summary": "Denmark is on edge after mysterious drones were spotted above four airports across the country late Wednesday and early Thursday.\nAt least five Danish airports saw the drones overnight, including at Aalborg and Billund airports, which had to close for hours, according to the BBC.\nSkrydstrup air base, where at least one drone was also spotted, is home to F-35 and F-16.\nDenmark has told NATO allies that “state actors” were behind the drone incursions, according to Reuters, but it’s unclear whether they’ve definitively identified Russia yet.\nPresident Trump promised to end the war between Russia and Ukraine before he even took office, but has obviously failed to deliver.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-09-25T20:40:29Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.bbc.com/news/articles/c179p4wvz29o",
    "title": "Trump UN speech: Seven years ago his audience laughed, this year they were silent",
    "summary": "Over almost an hour, he took aim at his opponents and their ideas, picking them off one by one as he toured the world.\nThe president even attacked the UN for a broken escalator and teleprompter that disrupted his visit and speech.\nUnder Trump, the US has withdrawn much of its UN funding, leaving the body forced to cut its humanitarian work around the world.\nTrump saved perhaps his biggest criticism for his European allies, attacking the continent for investing in renewable energy, and opening its borders to migration.\nWatch: How Trump lashed out at Europe in his UN speech",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-09-23T19:51:42Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/trump-calls-for-firing-microsoft-lisa-monaco-2025-9",
    "title": "Trump calls for the firing of Microsoft's president of global affairs, Lisa Monaco",
    "summary": "Trump calls for the firing of Microsoft's head of global affairs, Lisa Monaco, who is the former deputy attorney general in the Biden administration.\nTrump calls for the firing of Microsoft's head of global affairs, Lisa Monaco, who is the former deputy attorney general in the Biden administration.\nSarah Silbiger/APTrump calls for the firing of Microsoft's head of global affairs, Lisa Monaco, who is the former deputy attorney general in the Biden administration.\nImpact LinkPresident Donald Trump called for the firing of Microsoft's president of global affairs, Lisa Monaco, on Friday.\nAccording to her LinkedIn profile, she started her position as the head of Global Affairs at Microsoft in July.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-09-26T21:53:05Z",
    "source": "Business Insider"
  },
  {
    "url": "https://abcnews.go.com/International/zelenskyy-praises-informed-trump-after-presidents-russia-war/story?id=125882498",
    "title": "Zelenskyy praises 'well-informed' Trump after president's Russia war pivot",
    "summary": "President Donald Trump meets with Ukrainian President Volodymyr Zelenskiy during the 80th United Nations General Assembly, in New York City, September 23, 2025.\nPresident Donald Trump meets with Ukrainian President Volodymyr Zelenskiy during the 80th United Nations General Assembly, in New York City, September 23, 2025.\n\"The president clearly understands the situation and is well informed about all aspects of this war,\" Zelenskyy added.\nAsked if the social media post by Trump is a \"game changer\" for the war, Zelenskyy responded: \"Trump is a game changer by himself.\"\nPresident Donald Trump meets with Ukrainian President Volodymyr Zelenskyy during the 80th United Nations General Assembly, in New York City, New York City, September 23, 2025.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-09-24T08:28:49Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.theverge.com/news/785720/xiaomi-retro-handheld-phone-case-17-pro-gaming",
    "title": "Xiaomi’s retro handheld phone case is the best, and worst, way to game",
    "summary": "Then oh boy, does Xiaomi have the phone for you.\nToday it announced its flagship 17 series phones in China, led by the 17 Pro and 17 Pro Max (any naming similarity to Apple is resolutely not a coincidence).\nIt can be used to frame selfies, set timers, and control music playback, but all I can think about is Xiaomi’s official accessory to convert the phone into a ratchet Game Boy.\nNo word yet on if, or when, the 17 Pro phones will launch in Europe or anywhere else outside China, but let’s hope the retro case comes with them when they do.\nMaybe this is a sign that the mad scientists in Xiaomi’s accessory lab are cooking up something even weirder for the fourth-generation photography case for next year’s 17 Ultra.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-09-25T15:26:06Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/news/785474/nothing-spins-off-budget-brand-cmf-india",
    "title": "Nothing spins off its budget brand CMF",
    "summary": "Posts from this author will be added to your daily email digest and your homepage feed.\nNothing has announced that it plans to spin off its sub-brand CMF, which focuses on cheaper smartphones, earbuds, and wearables, into a standalone subsidiary based in India.\nNothing can afford the investment, having just raised $200 million in a funding round that values the company at $1.3 billion.\nThe announcement comes at an interesting time for CMF, which is busy teasing the launch of its first pair of over-ear headphones on September 29th.\nLike all CMF products, they’re expected to be budget-friendly — its top smartphone, the Phone 2 Pro, is just $279 in its US beta release, with its watches and earbuds all below $100.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-09-25T07:58:09Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/germany-brigade-lithuania-built-war-kit-watching-ukraine-2025-9",
    "title": "Germany's first permanent brigade abroad since WWII built its war kit for NATO's eastern edge by watching Ukraine",
    "summary": "The Puma S1 infantry fighting vehicle is among the assets the German brigade is bringing to Lithuania.\nGermany is permanently deploying a combat brigade abroad to NATO's vulnerable eastern edge for the first time since World War II amid growing concerns about Russian aggression.\nGerman soldiers walk in Lithuania at a ceremonial roll call to mark Germany's 45th Armoured Brigade being inaugurated in the country.\nUkraine has needed air defense systems, like the US-made Patriot, and the West has learned it needs more.\nRaytheon\"We will really need a lot of air defense assets, in particular for us as an army unit, short-range air defense,\" he said.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-09-26T09:47:01Z",
    "source": "Business Insider"
  }
]