[
  {
    "id": "MQ==",
    "url": "https://www.businessinsider.com/russia-economy-putin-direct-line-question-answer-ukraine-war-fatigue-2025-12",
    "title": "Putin's annual Q&A with Russians is back. 2 issues are front and center.",
    "summary": "Russian President Vladimir Putin is set to field questions from his countrymen about the war in Ukraine and the state of the economy.\nRussian President Vladimir Putin is set to field questions from his countrymen about the war in Ukraine and the state of the economy.\nGavriil Grigorov/Poll/AFP/Getty ImagesRussian President Vladimir Putin is set to field questions from his countrymen about the war in Ukraine and the state of the economy.\nRussian President Vladimir Putin is preparing for his annual televised Q&A session, and a new poll shows Russians remain focused on two issues: the war and the economy.\nThese two concerns have topped Levada's polls ahead of Putin's annual Q&A for three years.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MTM=",
    "url": "https://finance.yahoo.com/video/25-shift-made-china-global-150807356.html",
    "title": "The 25-Year Shift That Made China a Global Superpower",
    "summary": "China's entry into the WTO in 2001 accelerated its rise as a global manufacturing and technology powerhouse, fueled export growth, and helped stabilize global demand during the financial crisis.\nAs China expanded Belt and Road investments, advanced in EVs and AI, and entered a sharper economic rivalry with the United States, its property slowdown and domestic inequality exposed new vulnerabilities.\nEnda Curran, Elizabeth Economy, and Afsaneh Beschloss explain China's past 25 years and what its next phase means for the global economy.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MzU=",
    "url": "https://www.businessinsider.com/ukraine-attacks-russian-shadow-fleet-tanker-in-mediterranean-first-time-2025-12",
    "title": "Ukrainian drones hit a Russian 'shadow fleet' tanker in the Mediterranean Sea for the first time, security official says",
    "summary": "The oil tanker Qendil in the Mediterranean Sea before the attack.\nThe oil tanker Qendil in the Mediterranean Sea before the attack.\nScreengrab via Security Service of Ukraine videoThe oil tanker Qendil in the Mediterranean Sea before the attack.\nScreengrab via Security Service of Ukraine videoUkrainian forces used long-range drones to strike an oil tanker said to be part of Russia's \"shadow fleet\" in the Mediterranean Sea for the first time, a security source told Business Insider on Friday.\nA source in the Security Service of Ukraine, the SBU, called the drone attack an \"unprecedented special operation\" that targeted and critically damaged the tanker Qendil.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTQ=",
    "url": "https://www.yahoo.com/news/articles/syria-welcomes-permanent-repeal-sweeping-154748606.html",
    "title": "Syria welcomes the permanent repeal of sweeping US sanctions",
    "summary": "DAMASCUS, Syria (AP) — Syria’s government and its allies on Friday welcomed the final lifting of the most draconian sanctions imposed on the country in recent decades.\nThey argued that the sanctions were preventing international investors from launching reconstruction projects and blocking Syria from rebuilding its battered economy and infrastructure.\nSome lawmakers had pushed for making the repeal conditional on steps by the new Sunni Islamist-dominated Syrian government to protect religious minorities, among other measures.\nAl-Sharaa thanked the leaders of all three countries, along with Trump, in a speech celebrating the end of the sanctions.\nThe Saudi foreign ministry commended \"the significant and positive role played by US President Donald Trump” in lifting the sanctions.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTY=",
    "url": "https://www.aljazeera.com/news/2025/12/19/five-key-takeaways-from-us-secretary-of-state-rubios-year-end-briefing",
    "title": "Five key takeaways from US State Secretary Rubio’s year-end briefing",
    "summary": "Top US diplomat Marco Rubio reiterates hard line against Venezuela’s Maduro, says Ukraine conflict is ‘not our war’.\nIn a two-hour briefing to reporters on Friday, the US secretary of state reiterated Trump’s hard line against Venezuela and defended cuts to foreign aid programmes.\nRubio’s comments come as the US continues to amass troops and military assets around Venezuela, raising speculation about plans to topple Maduro by force.\nRubio was asked on Friday how he would square Trump’s self-image as a peacemaker with the escalating military threats to Venezuela.\nAl Jazeera asked Rubio about Israel’s violations, but the secretary of state failed to address the premise of the question.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTc=",
    "url": "https://finance.yahoo.com/news/europe-stumbles-attempt-sidestep-trump-090000409.html",
    "title": "Europe Stumbles in Its Attempt to Bypass Trump’s World Order",
    "summary": "Ursula von der Leyen was supposed to sign the European Union’s largest free-trade agreement on Saturday, proving the bloc’s standing as a geoeconomic force.\nBrazilian President Luiz Inacio Lula da Silva said earlier this week the time was now or never.\nOfficials say they will try again to sign the deal on Jan. 12, but there’s no guarantee.\nIt especially wants to prove it can move outside the orbit of China and the US, which have increasingly antagonistic trade relationships with Europe.\n“This is Europe’s independence moment,” von der Leyen said earlier this week, ahead of a summit when EU leaders would tackle funding options for Ukraine as well as Mercosur.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTg=",
    "url": "https://www.aljazeera.com/video/talk-to-al-jazeera/2025/12/20/uruguays-fm-on-us-claims-to-police-latin-america-and-rising-tensions",
    "title": "Uruguay’s FM on US claims to police Latin America and rising tensions",
    "summary": "Mario Lubetkin on Washington’s revived sphere-of-influence doctrine, Venezuela, and China’s growing footprint.\nThe United States is reviving a policy first set out in the 1800s that treats Latin America as its strategic sphere of influence.\nAs Washington expands maritime operations in the Caribbean and eastern Pacific, critics warn of legal violations and rising regional instability.\nUruguay’s Foreign Minister Mario Lubetkin joins Talk to Al Jazeera to discuss US strikes, Venezuela, migration pressures, and China’s growing role in the region — and whether diplomacy can still prevent escalation in a hemisphere shaped once again by power politics.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  }
]