[
  {
    "url": "https://www.bbc.com/news/articles/cg43lwwdwlno",
    "title": "Bolton pleads not guilty to charges of sharing classified information",
    "summary": "Bolton pleads not guilty to charges of sharing classified informationWatch: John Bolton arrives at federal court after indictmentThe indictment makes Bolton, 76, the third of the US president's political opponents to face charges in recent weeks.\nThe 18 charges stem from allegations he shared or retained sensitive materials, including some characterised as top secret.\nJohn Bolton, Donald Trump's former national security adviser, has pleaded not guilty to charges of mishandling classified information.\nBolton has been scrutinised for his handling of classified information since 2020, when he sought to publish a book about his time in the first Trump administration.\nBolton's indictment comes after Trump's Justice Department brought criminal charges against two of his political opponents: former FBI Director James Comey and New York Attorney General Letitia James.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-10-17T13:14:10Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/how-russia-gets-western-tech-fueling-missile-drone-attacks-2025-10",
    "title": "Russia's missiles and drones run on Western tech. Here's how it keeps getting the parts.",
    "summary": "Over three and a half years into the war, Ukraine is still finding thousands of foreign-made parts in the Russian missiles and drones raining down on its cities.\nThe findings highlight how Moscow continues to evade sanctions and export controls that were meant to choke off its weapons industry.\nThe components found in downed Russian drones and cruise and ballistic missiles range from microcomputers and sensors to switching connectors and converters.\nLast week, Ukrainian President Volodymyr Zelenskyy said over 100,000 foreign-made parts were found among the 550 Russian drones and missiles used in a large-scale bombardment, underscoring the scale of the problem.\nThe West has struggled to prevent Russia from obtaining foreign parts for its missiles and drones.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-10-17T14:40:35Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.aljazeera.com/news/2025/10/19/crisis-hit-bolivia-to-vote-in-run-off-election-ending-decades-of-socialism",
    "title": "Bolivia votes in run-off to end nearly 20 years of socialist government",
    "summary": "Polls have closed in Bolivia in a presidential election run-off between two pro-market candidates, marking the end of nearly two decades of socialist rule and the start of a likely realignment towards the United States.\nThe governing Movement Towards Socialism party (MAS), racked by division, failed to advance a candidate to the run-off election, meaning its leadership is slated to come to an end.\n‘Situation is terrible’Once South America’s fastest-growing economy, Bolivia has nearly depleted its foreign currency reserves after years of heavy subsidies and underinvestment in its gas industry.\nEverything is very expensive,” Felicidad Flores, a 67-year-old street vendor in La Paz, told the AFP news agency.\n“This election marks a political turning point,” Glaeldys Gonzalez Calanche, an analyst for the International Crisis Group, told the Reuters news agency.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-19T09:18:53Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://www.bbc.com/news/articles/cdx495n0qn9o",
    "title": "Louisiana resident assisted in Hamas 7 October attack, US says",
    "summary": "Louisiana resident assisted in Hamas 7 October attack, US saysA year after the attack, Mr al-Muhtadi allegedly travelled to the US on a fraudulent visa and became a permanent resident.\nUS prosecutors have accused a Louisiana resident of participating in the 7 October attack by Hamas on Israel, recently unsealed court documents show.\nMr al-Muhtadi sent messages asking others to bring a bulletproof vest for another man and ammunition, prosecutors allege.\nThe complaint said that Mr al-Muhtadi denied ever having been involved in terrorist activities on his US visa application.\nThe documents do not accuse Mr al-Muhtadi of specific crimes or killings.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-18T14:02:48Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/c3vnk3w0z69o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "title": "Dhanteras: Why India's Diwali gold rush is different this year",
    "summary": "But with prices - gold is up 60% and silver 70% - shooting through the roof, jewellers are having to change tack to counter stagnant customer budgets.\nWhile gold jewellery continues to account for the largest share of India's overall gold demand, the proportion driven by investment - primarily bars and coins - has been rising steadily, according to the World Gold Council (WGC).\nBesides retail demand, gold prices are also being significantly influenced by India's central bank, with the metal's share in its foreign exchange reserves rising from 9% to 14% in 2025, according to WGC.\nIn fact, the Reserve Bank of India (RBI) has been \"a major pillar of global gold demand over the past three years\", said Kaynat Chainwala who tracks commodities at Kotak Securities, a broking house.\nNurPhoto via Getty Images Many Hindus purchase gold and silver during Diwali for good luck and prosperity",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-17T23:44:14Z",
    "source": "BBC News"
  },
  {
    "url": "https://japantoday.com/category/politics/japan-actively-promoted-expo-diplomacy-amid-unstable-global-geopolitics",
    "title": "Japan actively promoted 'expo diplomacy' amid unstable global geopolitics",
    "summary": "Outgoing Japanese Prime Minister Shigeru Ishiba's government actively promoted \"expo diplomacy\" during the World Exposition in Osaka, holding numerous meetings with foreign leaders amid growing global instability, government officials said.\nForeign Minister Takeshi Iwaya said at a press conference late last week, \"The prime minister held about 50 meetings, and I had around 40 related to the expo.\nThe number of meetings held by Ishiba exceeded the roughly 30 conducted by then Prime Minister Junichiro Koizumi during the 2005 expo in Aichi Prefecture, the ministry said.\nAbout 90 heads of state and government leaders from abroad attended the Osaka expo.\nSince the Osaka expo opened in April, dignitaries from countries with limited prior ties to Japan have traveled there, providing what a government source described as \"valuable opportunities for in-depth dialogue at the leadership level.\"",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-18T20:48:54Z",
    "source": "Japan Today"
  },
  {
    "url": "https://www.jezebel.com/only-15-people-agree-to-report-on-pete-hegseths-push-ups",
    "title": "Only 15 People Agree to Report on Pete Hegseth’s Push-Ups",
    "summary": "In fact, only 15 signed the new agreement—not 15 outlets, 15 journalists.\nBut if the last nine months of the Trump administration are any indication, it’ll be a daily report of how many push-ups Hegseth completed that afternoon.\nWhatever the Pentagon’s plan is, the message is clear: the American people can’t ask questions, and the press can’t report freely.\nIf I were Pete, I also wouldn’t want the press reporting on how bad I was at my job.\nPlus, you’ll be supporting independent journalism—which, can you even imagine not supporting independent journalism in times like these?",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-10-17T10:59:18Z",
    "source": "Jezebel"
  },
  {
    "url": "https://www.bbc.com/news/articles/cj3zemk2j4ro",
    "title": "'No Kings' protests: where does Democratic opposition go next?",
    "summary": "After 'No Kings' protests, where does Democratic opposition go next?\nJust down the street from the No Kings gathering in the nation's capital, the White House responded to the protests with derision.\nThe pain from the shutdown – particularly for those in the Democratic coalition – is only going to increase as the weeks go by.\nThe reality is that Democratic leaders in the Senate will ultimately have to find a way out of the crisis.\nElections for governor and state legislatures could provide a barometer for whether the anti-Trump sentiment on display at the \"No Kings\" protests translates into electoral success for Democrats.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-19T20:48:40Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.aljazeera.com/news/2025/10/18/iran-says-restrictions-on-nuclear-programme-terminated-as-deal-expires",
    "title": "Iran says restrictions on nuclear programme ‘terminated’ as deal expires",
    "summary": "Iran also expresses commitment to diplomacy as landmark 10-year nuclear deal with Western powers officially ends.\nIran has said it is no longer bound by restrictions on its nuclear programme as a landmark 10-year deal between it and world powers expired, though Tehran reiterated its “commitment to diplomacy”.\nAdvertisementWestern powers and Israel have long accused Iran of seeking to acquire nuclear weapons, a claim Tehran denies.\nNuclear talks between Iran and world powers are currently deadlocked.\nOn Monday, Trump said he wanted a peace deal with Iran, but stressed the ball was in Tehran’s court.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-18T09:21:25Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://www.techmeme.com/251017/p21",
    "title": "Techmeme: A look at the challenges facing Europe's chip industry, as the EU will likely fail to increase its 10% global chip manufacturing share to a targeted 20% by 2030 (Foreign Affairs)",
    "summary": "About This PageThis is a Techmeme archive page.\nIt shows how the site appeared at 5:45 PM ET, October 17, 2025.\nThe most current version of the site as always is available at our home page.\nTo view an earlier snapshot click here and then modify the date indicated.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-10-17T14:00:37Z",
    "source": "Techmeme.com"
  },
  {
    "url": "https://www.bbc.com/news/articles/cwy7e4q779wo",
    "title": "What does King Charles do and who else is in the Royal Family?",
    "summary": "What does King Charles do and who else is in the Royal Family?\nGetty Images Sir Keir Starmer is the third UK prime minister of King Charles' reignJonathan Yeo Studio Artist Jonathan Yeo painted the first official portrait of King Charles III, and said the butterfly represented his commitment to environmental causesThe King confers official honours on people from all walks of life, in recognition of their merit, service or bravery.\nReuters Prince Andrew and King Charles at the funeral of the Duchess of Kent in September 2025Prince Andrew was Queen Elizabeth's second son.\nThey have three children: , and The Princess Royal (Princess Anne) was the Queen's second child and only daughter.\nWatch King Charles III be crownedHow popular is the Royal Family?",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-17T19:54:02Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/c3vnk3w0z69o",
    "title": "Dhanteras: Why India's Diwali gold rush is different this year",
    "summary": "But with prices - gold is up 60% and silver 70% - shooting through the roof, jewellers are having to change tack to counter stagnant customer budgets.\nWhile gold jewellery continues to account for the largest share of India's overall gold demand, the proportion driven by investment - primarily bars and coins - has been rising steadily, according to the World Gold Council (WGC).\nBesides retail demand, gold prices are also being significantly influenced by India's central bank, with the metal's share in its foreign exchange reserves rising from 9% to 14% in 2025, according to WGC.\nIn fact, the Reserve Bank of India (RBI) has been \"a major pillar of global gold demand over the past three years\", said Kaynat Chainwala who tracks commodities at Kotak Securities, a broking house.\nNurPhoto via Getty Images Many Hindus purchase gold and silver during Diwali for good luck and prosperity",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-17T23:44:09Z",
    "source": "BBC News"
  },
  {
    "url": "https://apnews.com/article/trump-zelenskyy-putin-ukraine-tomahawks-ce697e5eda6ce9793b4343499d105a8c",
    "title": "After Zelenskyy meeting, Trump calls on Ukraine and Russia to ‘stop where they are’ and end the war",
    "summary": "WASHINGTON (AP) — President Donald Trump on Friday called on Kyiv and Moscow to “stop where they are” and end their brutal war following a lengthy White House meeting with Ukrainian President Volodymyr Zelenskyy.\nIn recent weeks, he had shown growing impatience with Russian President Vladimir Putin and expressed greater openness to helping Ukraine win the war.\n“It’s good that President Trump didn’t say ‘no,’ but for today, didn’t say ‘yes,’” he said.\nThey don’t intend to stop,” Zelenskyy added.\nBut the Russian leader hasn’t shown any interest in meeting with Zelenskyy and Moscow has only intensified its bombardment of Ukraine.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-17T14:07:36Z",
    "source": "Associated Press"
  },
  {
    "url": "https://indianexpress.com/article/explained/in-mutaqqis-visit-to-deoband-religious-diplomacy-and-a-message-to-pakistan-10311438/",
    "title": "Explained: In Mutaqqi’s visit to Deoband, ‘religious diplomacy’ and a message to Pakistan",
    "summary": "Sources said that the significance of the Taliban leader’s visit to Darul Uloom was “personal” for him and “political” for the new Kabul-Delhi engagement.\nThe visit can be seen from the prism of what is called “religious diplomacy”, at a time Kabul’s ties with Pakistan are specially strained.\nHe studied in various schools for Afghan refugees, and then at the Darul Uloom Haqqania, where many other Taliban leaders have studied.\nStory continues below this adThe Darul Uloom Haqqania was set up at Khyber Pakhtunkhwa’s Akora Khattak in 1947 by the cleric Abdul Haq Akorwi, who had both studied in and taught at the Darul Uloom Deoband.\nIn his 30-minute address, he called upon the Darul Uloom members to visit Afghanistan and said that more diplomats from Afghanistan would visit.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-17T02:00:05Z",
    "source": "The Indian Express"
  },
  {
    "url": "https://www.bbc.com/news/articles/cj0e24rrjz1o",
    "title": "Stolen treasures, a crown dropped as thieves fled - and serious questions for Louvre security",
    "summary": "Stolen treasures, a crown dropped as thieves fled - and serious questions for Louvre security1 day ago Share Save Hugh Schofield Paris correspondent Share SaveAFPIt is the most spectacular robbery at the Louvre museum since the Mona Lisa disappeared in 1911.\nAnd it poses serious questions about levels of security covering French artworks, at a time when they are increasingly being targeted by criminal gangs.\nInside the richly decorated gallery they made for two display-cases which contain what remains of the French crown jewels.\nA crown of the empress Eugénie was also taken, but was recovered damaged near the museum after the thieves seemingly dropped it.\nLouvre Museum Thieves attempted to take Empress Eugenie's crown but apparently dropped it during the getaway\"We are well aware that French museums are vulnerable,\" said Nuñez.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-19T18:55:16Z",
    "source": "BBC News"
  },
  {
    "url": "https://abcnews.go.com/Politics/2-survivors-us-attack-alleged-drug-smugglers-american/story?id=126619031",
    "title": "At least 2 survivors of US attack on alleged drug smugglers in American custody",
    "summary": "The survivors in the Caribbean Sea were rescued by helicopter.\nThe person said the survivors were aboard a semi-submersible vessel when they were hit in the attack.\nThat was an attack on a drug-carrying, loaded-up submarine.”Secretary of State Marco Rubio said more details would be released later Friday, insisting the people on board were “terrorists.”The strike was the sixth military attack in the Caribbean Sea against suspected drug smugglers.\nAdm. Avlin Holsey, who has been overseeing military operations in the region, announced unexpectedly on Thursday that he is stepping down from the post.\nAccording to a person familiar with his decision, Holsey had expressed reservations about ongoing military operations and that tension between Holsey and Hegseth had been evident for weeks.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-17T16:49:56Z",
    "source": "ABC News"
  },
  {
    "url": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-immigration-crackdown-threatens-americas-job-market-and-ability-to-recruit-foreign-talent/articleshow/124668368.cms",
    "title": "Trump's immigration crackdown threatens America's job market and ability to recruit foreign talent",
    "summary": "\"I feel desperate,'' said Maria, 48, who requested anonymity to talk about her ordeal because she fears being detained and deported.\n''President Donald Trump's sweeping crackdown on immigration is throwing foreigners like Maria out of work and shaking the American economy and job market.\n\"Because we had a lot of immigration over the past five years, an inflationary surge was not as bad as many people expected.\n''More workers filling more jobs and spending more money has also helped drive economic growth and create still-more job openings.\nTrump's immigration crackdown, Liebreich said, is \"making it harder.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-18T13:38:25Z",
    "source": "The Times of India"
  },
  {
    "url": "https://slate.com/technology/2025/10/tiktok-ban-biden-trump-conservatives-propaganda.html",
    "title": "TikTok: How Joe Biden handed Donald Trump and conservatives a powerful propaganda tool.",
    "summary": "The other is paying close attention to who put them in this predicament—specifically, Joe Biden and Democratic congressional leadership.\nTikTok has limitless influence potential, which is why Trump is so keen for his pals to control it in the United States.\nAdvertisementAdvertisementAdvertisementAdvertisementAmazingly, it was Biden who set up these pins and left the bowling alley for Trump to knock them down.\nTikTok has violated U.S. child privacy laws in the past, but that’s just in keeping with the proud tradition of countless American tech firms.\nAdvertisementAdvertisementIt was Trump, not Biden, who first gave real juice to the idea of the United States banning TikTok.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-17T19:37:52Z",
    "source": "Slate Magazine"
  },
  {
    "url": "https://biztoc.com/x/056a2deefd6ff7b3",
    "title": "OpenAI reverses policy to allow erotica on ChatGPT",
    "summary": "",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-17T14:22:44Z",
    "source": "Biztoc.com"
  },
  {
    "url": "https://www.yahoo.com/news/articles/us-says-india-halves-russian-084641073.html",
    "title": "US says India halves Russian oil imports, sources say no cuts seen",
    "summary": "The Indian oil ministry and refiners that buy Russian oil did not immediately respond to Reuters requests for comment.\nTrump said Prime Minister Narendra Modi had assured him on Wednesday that India would stop buying Russian oil.\nStill, India's oil minister on Thursday sought data on Russian oil imports from all the refiners, including their loadings and arrivals tied up for November and December.\nRussia accounted for 36% of India's oil imports, some 1.75 million barrels per day, in the six months through September, trade data shows.\nKremlin spokesman Dmitry Peskov said Russia could supply oil more cheaply to countries that Trump is trying to persuade to stop buying Russian oil.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-17T08:46:41Z",
    "source": "Yahoo Entertainment"
  }
]