[
  {
    "id": "Ng==",
    "url": "https://finance.yahoo.com/news/russian-economy-now-eating-itself-231031777.html",
    "title": "The Russian economy is eating its own muscle to survive as Putin’s war on Ukraine destroys future capacity, former central bank advisor says",
    "summary": "Four years after Vladimir Putin ordered an invasion of Ukraine, Russia’s economy has entered a “death zone,” said Alexandra Prokopenko, a fellow at the Carnegie Russia Eurasia Center.\nMore from Yahoo Scout What makes Russia's economy a 'death zone'?\nWhy can't monetary policies fix Russia's economic problems?\n“Russia’s economy is stuck in what might be described as negative equilibrium: holding itself together while steadily destroying its own future capacity,” she wrote.\nAnd rather than end the war, Putin insists on continuing as he waits to see if Ukraine or its Western backers crack first.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2026-02-22T23:10:31Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzI=",
    "url": "https://www.yahoo.com/news/articles/putin-tells-fsb-better-protect-140100982.html",
    "title": "Putin tells FSB to better protect energy sector, warns foes against pushing Moscow too far",
    "summary": "MOSCOW, Feb 24 (Reuters) - President Vladimir Putin on Tuesday ordered the FSB security service to step ‌up protection of Russia's energy and transport infrastructure in ‌response to Ukrainian attacks that he said were conducted with the ​help of Western intelligence.\nPutin, speaking on the fourth anniversary of the war, said Russia's enemies would regret it if they pushed Moscow too far.\nUkraine has repeatedly attacked Russian oil depots, refineries and ports in the course of the ‌war, and Moscow blames it for ​a series of assassinations of ​senior military figures.\nPutin, in ​televised remarks, suggested that Russian energy pipelines ‌under the Black Sea could ​be targeted.\nHe issued ​an order to \"strengthen the anti-terrorist protection of energy and transport infrastructure and public gathering places, provide maximum ​coverage for critical ‌facilities, and, if necessary, equip them with additional ​security measures.\"",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-24T14:01:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzU=",
    "url": "https://www.yahoo.com/news/articles/india-brazil-sign-mining-pact-122938477.html",
    "title": "India, Brazil sign mining pact as Modi targets $20 billion trade in five years",
    "summary": "Advertisement AdvertisementBrazil is among the world's top producers of iron ore and holds large reserves of minerals critical to steelmaking.\nINFRASTRUCTURE INVESTMENTThe cooperation will ⁠focus on attracting investment in exploration, mining and steel sector infrastructure, the statement said.\n\"We are committed to taking bilateral trade much beyond $20 billion in the next five years,\" Modi said.\n\"Our nations will also work closely in areas such as technology, innovation, digital public infrastructure, AI, semiconductors and more,\" ‌Modi said.\nLula on Thursday advocated for Brazil and India to conduct trade in their own currencies ​rather than settling transactions in ‌U.S.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-21T12:29:38Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mzk=",
    "url": "https://www.bbc.com/news/articles/c4gj20xzw39o",
    "title": "Four years into its full-scale war in Ukraine, Russia is feeling the effects",
    "summary": "The Russian authorities do not release casualty figures for the so-called \"special military operation\".\nBut Russia is known to have suffered huge battlefield losses.\nSo many of the towns and villages I've visited in the last two years have had museums and monuments dedicated to soldiers killed in Ukraine, as well as separate sections for recent war dead at local cemeteries.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-23T06:01:59Z",
    "source": "BBC News"
  },
  {
    "id": "NDA=",
    "url": "https://www.npr.org/2026/02/22/nx-s1-5722854/pakistan-border-strikes-afghanistan-70-killed",
    "title": "Pakistan claims to have killed at least 70 militants in strikes along Afghan border",
    "summary": "Pakistan claims to have killed at least 70 militants in strikes along Afghan bordertoggle caption Hedayat Shah/APKABUL, Afghanistan — Pakistan's military killed at least 70 militants in strikes along the border with Afghanistan early Sunday, targeting what it described as hideouts of Pakistani militants it blamed for recent attacks inside the country, the deputy interior minister said.\nTalal Chaudhry, Pakistan's deputy interior minister, told Geo News that at least 70 militants were killed in the strikes.\nClearing rubble and burying the deadAfghanistan's Ministry of Foreign Affairs summoned Pakistan's ambassador to Kabul and handed him a note of protest over the Pakistani strikes.\nHabib Ullah, a local tribal elder, said those killed in the strikes were not militants.\nHours before the Pakistani strikes, a suicide bomber targeted a security convoy in the border district of Bannu in Pakistan's northwest, killing two soldiers, including a lieutenant colonel.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-22T15:55:39Z",
    "source": "NPR"
  },
  {
    "id": "NDY=",
    "url": "https://www.aljazeera.com/news/2026/2/23/chad-shuts-border-with-sudan-after-clashes-from-conflict-kills-five-troops",
    "title": "Chad shuts border with Sudan after cross-border incursion kills soldiers",
    "summary": "Chad’s government says the border will remain ​closed until further ⁠notice, citing repeated violations by Sudan’s warring parties.\nChad has closed its eastern border with Sudan, the government says, after several Chadian soldiers and civilians were killed in recent days in clashes linked to the Sudanese civil war.\nTwo sources told Reuters that more Chadian soldiers were being deployed to the area.\nLast year, a drone attack killed two Chadian soldiers, according to local authorities and a security source, although it was unclear who carried out the attack.\nChad has reportedly served as a transit route for supplies, including weapons and drones, to the RSF although the Chadian government denies involvement.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-23T13:15:07Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDc=",
    "url": "https://www.npr.org/2026/02/24/nx-s1-5711346/china-trump-us-foreign-aid-withdrawal",
    "title": "China and the US alter foreign aid strategies",
    "summary": "In those days, China itself was receiving aid from the Soviet Union, says Carrie Dolan, an expert on Chinese health aid at the College of William and Mary.\nChina framed its foreign aid as mutually beneficial with countries in the global south, promoting economic cooperation and increasing trade.\nU.S. foreign aid grants, Brazys says, also tended to focus on long-term solutions and came with conditions for governments, such as improving human rights, democracy and corruption.\nDolan's research in Kenya and Sierra Leone on the efficacy of Chinese aid showed mixed reactions from local medical officials, aid and health workers.\nHowever, it's clear that China will try to increase its influence through foreign aid, as the U.S presence appears to wane, she says.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-24T20:50:39Z",
    "source": "NPR"
  },
  {
    "id": "NDg=",
    "url": "https://www.npr.org/2026/02/21/nx-s1-5720226/kenya-ukraine-russia-war",
    "title": "'Given a gun and sent to die': Kenyans lured to fight for Russia in Ukraine",
    "summary": "'Given a gun and sent to die': Kenyans lured to fight for Russia in Ukrainetoggle caption Simon Maina/AFP via Getty ImagesNAIROBI, Kenya — In Sikonga village, Kisii County, a mother's wails fill the house.\nAccording to the intelligence report, 89 Kenyans remain on the frontline, 39 have been hospitalized, and 28 are missing in action.\nSponsor Message\"More telling is the collusion by officers at the Russian Embassy and the Kenyan Embassy in Moscow,\" Ichung'wah told Parliament.\nOpposition MP Joseph Makilap, who pushed for the intelligence report to be released, said the scale of the recruitment was staggering.\nAccording to the Kenyan intelligence report the recruitment networks involve both Kenyan and foreign actors.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-21T11:20:58Z",
    "source": "NPR"
  },
  {
    "id": "NDk=",
    "url": "https://www.yahoo.com/news/articles/canada-prepares-aid-package-cuba-174726102.html",
    "title": "Canada prepares aid package for Cuba as it faces fuel shortages worsened by US oil embargo",
    "summary": "TORONTO (AP) — Canada announced Monday that it is working on an aid package for Cuba as it faces blackouts and severe fuel shortages worsened by a U.S oil embargo.\nAdvertisement AdvertisementAir Canada and other airlines have canceled flights to the Caribbean island because of a shortage of aviation fuel on the island.\nGlobal Affairs Canada, a governmental office, has said Canada is Cuba’s second-largest source of direct investment to the island, particularly in the mining and tourism sectors.\nAdvertisement AdvertisementThe economic crisis gripping Cuba since 2020 has been compounded by intensified U.S. sanctions aimed at forcing a change in the island’s political model.\nBecause Cuba produces only 40% of its required fuel, it remains highly vulnerable to external blockades.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-23T17:47:26Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTA=",
    "url": "https://www.npr.org/2026/02/21/nx-s1-5720966/trump-iran",
    "title": "With U.S. forces in position, Trump mulls his options for Iran",
    "summary": "With U.S. forces in position, Trump mulls his options for Irantoggle caption Saul Loeb/AFP via Getty ImagesPresident Trump says he hasn't decided whether he'll launch a military strike on Iran.\nSome days he sounds like he would be satisfied with a negotiated deal on the country's nuclear program.\n\"There is no military solution for Iran's nuclear program,\" he told the MS NOW program Morning Joe.\nTrump wants Iran to effectively give up its nuclear program.\nHowever, Trump has so far not made a major speech to the American people about the prospect of a new Middle East war.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-21T11:00:00Z",
    "source": "NPR"
  },
  {
    "id": "NTE=",
    "url": "https://www.npr.org/2026/02/24/g-s1-111302/france-ups-the-ante-in-the-spat-with-us-ambassador-says-ministers-will-no-longer-meet-him",
    "title": "U.S. ambassador to France tries to defuse spat after being barred from government",
    "summary": "U.S. ambassador to France tries to defuse spat after being barred from governmenttoggle caption Christophe Ena/APPARIS — The U.S. ambassador to France sought Tuesday to smooth over a diplomatic spat with Paris, calling up the French foreign minister who had said earlier in the day that the U.S. diplomat would lose access to French government officials after he skipped a meeting.\nFrench authorities had summoned Ambassador Charles Kushner — the father of U.S. President Donald Trump 's son-in-law and adviser Jared Kushner — over comments from the Trump administration that France objected to.\nSponsor MessageBarrot reiterated to the ambassador that France cannot accept foreign interference, the minister's office said.\n\"When these explanations have taken place, then the U.S. ambassador in France will, naturally, regain access to members of the French government.\"\nLast August, Paris also summoned Kushner over a letter he wrote to French President Emmanuel Macron alleging that France did not do enough to combat antisemitism.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-24T06:29:28Z",
    "source": "NPR"
  },
  {
    "id": "NTM=",
    "url": "https://indianexpress.com/article/cities/lucknow/yogi-to-leave-for-4-day-visit-to-singapore-japan-expansion-on-agenda-10545313/",
    "title": "Yogi to leave for 4-day visit to Singapore, Japan today; investment diplomacy boost, industrial expansion on agenda",
    "summary": "Yogi Adityanath has departed for a four-day visit to Singapore and Japan to attract investments and deepen industrial partnerships.\n(File Photo)Uttar Pradesh Chief Minister Yogi Adityanath will leave on Sunday evening for his four-day visit to Singapore and Japan aimed at strengthening the state’s investment diplomacy and industrial expansion.\nThis will be his first foreign visit after his Myanmar trip in 2017.\nA key highlight of the visit will be Government-to-Business (G2B) meetings and roundtable interactions, where CM Adityanath will engage directly with the investors.\nActing in the role of the state’s CEO, he will also present Uttar Pradesh’s industrial roadmap, policy stability, and business potential.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-22T03:56:59Z",
    "source": "The Indian Express"
  },
  {
    "id": "NTU=",
    "url": "https://abcnews.com/US/wireStory/us-military-boards-oil-tanker-indian-ocean-after-130441949",
    "title": "US military boards third oil tanker in Indian Ocean after tracking it from Caribbean",
    "summary": "U.S. Southern Command said in a post on X that U.S. forces boarded the Bertha overnight, conducting “a right-of-visit, maritime interdiction and boarding.\"\n“The vessel was operating in defiance of President Trump’s established quarantine of sanctioned vessels in the Caribbean and attempted to evade,” the post said.\n“From the Caribbean to the Indian Ocean, we tracked it and stopped it.”Venezuela had faced U.S. sanctions on its oil for several years, relying on a shadow fleet of falsely flagged tankers to smuggle crude into global supply chains.\nVideo posted by the Pentagon shows U.S. military helicopters flying toward the tanker.\nTrump's Republican administration has been seizing tankers as part of its broader efforts to take control of Venezuela's oil.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-24T13:10:28Z",
    "source": "Abcnews.com"
  },
  {
    "id": "NTY=",
    "url": "https://alltoc.com/world/how-has-the-ukraine-war-reshaped-global-security",
    "title": "How has the Ukraine war reshaped global security?",
    "summary": "Four years in: how the conflict changed warfare and alliancesThe full‑scale invasion launched by Russia has entered its fifth year and, in that time, the war has produced deep and lasting shifts in military practice, alliance politics and global security thinking.\nTactical and technological changesWidespread use of drones: Both sides have deployed drones for reconnaissance, strike missions and improvisational air defenses.\nStrategic and geopolitical effectsNATO and European defense: The war renewed political will in Europe for higher defense spending, more integrated deterrence, and questions about deeper European security arrangements.\nHuman and economic toll: Population displacement, demographic impacts and the destruction of infrastructure pose long‑term reconstruction and economic challenges for Ukraine, while sanctions and disrupted trade have lasting global economic effects.\nWhy it matters nowThe war has altered how states prepare for and prosecute conflict in the 21st century.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-24T09:13:44Z",
    "source": "Alltoc.com"
  }
]