[
  {
    "url": "https://hbr.org/podcast/2025/11/why-business-leaders-need-political-diplomacy-skills-now",
    "title": "Why Business Leaders Need Political Diplomacy Skills Now",
    "summary": "We see lots of opinions about how much it’s going to affect different types of businesses and what executives should be doing about it.\nI think that’s been a very big issue of contention for many countries.\nSRIVIDYA JANDHYALA: So I would say I agree with you that there’s lots of different types of companies.\nAnd the reality is different companies look at the same landscape and they walk away with very different interpretations.\nGlobal companies, companies are thinking about issues like where do I put my staff?",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-11-18T13:20:00Z",
    "source": "Harvard Business Review"
  },
  {
    "url": "https://www.bbc.com/news/articles/cly1ypqlle0o",
    "title": "Zelensky ready to work with US on 'their vision' for ending Ukraine war",
    "summary": "Zelensky ready to work with US on 'their vision' for ending Ukraine war21 hours ago Share Save Laura Gozzi and James Chater Share SaveRussia advances in Ukraine, but is there an end in sight?\nUkrainian President Volodymyr Zelensky says he is ready to work with the US on \"their vision\" for ending the war with Russia.\nProvisions in the draft plan come across as heavily slanted towards Moscow - and it received a carefully diplomatic response from Kyiv.\n\"From the first days of the war, we have upheld one very simple position: Ukraine needs peace.\nGetty Images Zelensky's office said the US believed the draft plan could \"help reinvigorate diplomacy\"",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-11-20T18:11:59Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.jpost.com/middle-east/iran-news/article-874438",
    "title": "Iran's leaders are preparing for the next war with Israel",
    "summary": "Could Iran's Khamenei feel threatened enough to strike Israel?\n- analysis Between domestic dysfunction and Middle East geopolitics, could the Islamic Republic use Israel to rally the nation?\nIranian Supreme Leader Ayatollah Ali Khamenei appears among his supporters for the first time since the Iran-Israel war, in Tehran, Iran.\nJune 26, 2025.\n( photo credit : Office of the Supreme Leader of Iran via Getty Images )",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-11-19T11:34:06Z",
    "source": "The Jerusalem Post"
  },
  {
    "url": "https://www.thedailybeast.com/cnn-data-guru-harry-enten-finds-surprise-hidden-in-trumps-dismal-polls/",
    "title": "CNN Data Guru Finds Surprise Hidden in Trump’s Dismal Polls",
    "summary": "CNN data guru Harry Enten has revealed one bright spot for Donald Trump amid a dismal set of polls showing the president’s approval rating in free fall.\nDiscussing polls for Trump on foreign policy, Enten revealed, “At this point in term one, Donald Trump was just at a 35 percent approval rating.\nFor Enten, Trump’s relatively good foreign policy numbers are buoyed by his approval rating on the Israel/Hamas conflict.\nTrump's positive foreign policy numbers come while he's in free fall on virtually every other topic.\nEnten’s positive read of the polls comes when Trump’s approval rating on every other topic is cratering.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-11-19T17:43:26Z",
    "source": "Daily Beast"
  },
  {
    "url": "https://www.theregister.com/2025/11/19/microsoft_sap_cloud_crisis/",
    "title": "Microsoft-SAP pact aims to keep cloud running in a crisis",
    "summary": "SAP and Microsoft have struck a partnership designed to provide safeguards for users of the US vendor's cloud services in Europe during \"times of crisis.\"\nMicrosoft has signed separate deals with French and German sovereign cloud providers Bleu and Delos Cloud to provide assistance for cross-border cooperation in extensive crisis and emergency scenarios.\nDelos Cloud is a subsidiary of SAP while Bleu is a French cloud services company launched in 2024 as a joint venture between Orange and Capgemini, in partnership with Microsoft.\nCustomers that Microsoft could no longer serve would have the option to migrate workloads to Delos Cloud as a nationally-operated cloud platform.\nDelos Cloud obtains the legal right to access and use the necessary Microsoft cloud software code to support those customers in such emergency situations.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-11-19T13:57:07Z",
    "source": "Theregister.com"
  },
  {
    "url": "https://www.yahoo.com/news/articles/risks-china-faces-deploys-economic-093000905.html",
    "title": "The risks China faces as it deploys an economic arsenal against Japan",
    "summary": "China last week warned its citizens to avoid travel to Japan, with major Chinese airlines offering full refunds for flights there.\nFollowing that advisory, major Chinese airlines including Air China, China Southern and China Eastern offered full refunds or itinerary changes for flights, with reports suggesting that close to 500,000 ticket cancellations were issued.\nThis article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century.\nCopyright © 2025 South China Morning Post Publishers Ltd. All rights reserved.\nSouth China Morning Post Publishers Ltd. All rights reserved.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-11-21T09:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/reports-us-russia-peace-plan-113001939.html",
    "title": "Ukraine would cede territory to Russia in draft of Trump peace plan obtained by AP",
    "summary": "WASHINGTON (AP) — President Donald Trump's plan for ending the war in Ukraine would cede land to Russia and limit the size of Kyiv's military, according to a draft obtained Thursday by The Associated Press.\n“Our teams — of Ukraine and the United States — will work on the provisions of the plan to end the war.\nKellogg was initially named special envoy for Ukraine and Russia during Trump’s presidential transition.\nThe council is an idea that Trump snatched from his lengthy peace plan aimed at bringing about a permanent end to war between Israel and Hamas in Gaza.\nTrump has long pushed for end to warAdvertisement AdvertisementAdvertisement AdvertisementIt was not clear whether European foreign ministers had seen the peace plan, which was first reported by Axios.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-11-20T11:30:01Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://philippdubach.com/2025/10/25/pozsars-bretton-woods-iii-the-framework-1/2/",
    "title": "Pozsar's Bretton Woods III: The Framework [1/2] →",
    "summary": "Pozsar’s Bretton Woods III framework rests on a straightforward distinction.\nWhen this system collapsed in 1971, Bretton Woods II emerged: a system where dollars were backed by U.S. Treasury securities, inside money.\nCountries accumulated dollar reserves, primarily in the form of Treasuries, to support their currencies and facilitate international trade.\nPozsar’s argument: the moment Western nations froze Russian foreign exchange reserves, the assumed risk-free nature of these dollar holdings changed fundamentally.\nThey can provide liquidity to preserve par, influence interest rates through policy, and intervene in foreign exchange markets.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-11-19T19:39:09Z",
    "source": "Philippdubach.com"
  },
  {
    "url": "https://www.bbc.com/news/articles/cvgdgrqwnq9o",
    "title": "US military officials in Kyiv as Europe warns against reported Russia peace plan",
    "summary": "US Army Secretary Dan Driscoll held talks with Ukrainian Prime Minister Yulia Svyrydenko and was to see President Volodymyr Zelensky later.\nThe White House said President Donald Trump had grown \"frustrated\" with both Russia and Ukraine \"for their refusal to commit to a peace agreement\" and his team had been working on a \"detailed and acceptable\" peace plan.\nKremlin spokesman Dmitry Peskov said \"contacts\" had taken place with the US, but no \"consultations or negotiations\" were happening.\nNeither EU nor Ukrainian officials are believed to have been involved in drafting the new proposal, sparking fears it could be overwhelmingly favourable to Russia.\nOn Wednesday Ukrainian officials said at least 26 people had been killed in a Russian missile and drone attack on blocks of flats in Ukraine's western city of Ternopil.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-11-19T21:18:51Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/czrkg3gx6d6o",
    "title": "Russia says it's not received 'anything official' from US on peace plan",
    "summary": "Russia yet to receive anything official from US on peace plan, Kremlin says16 hours ago Share Save Matt Spivey and Olga Malchevska Share SaveGRIGORY SYSOYEV/POOL/AFP via Getty ImagesRussia has said it is yet to receive anything official from the US on its peace plan, after Ukraine's Volodymr Zelensky said he was ready to work with the Trump administration on its \"vision\" to bring an end to the war.\nThese provisions come across as heavily slanted towards Moscow and received a carefully worded response from Zelensky's office on Thursday.\nThe draft plan has emerged as Russia claims small territorial gains in eastern Ukraine, while Zelensky faces a domestic crisis implicating top officials in a $100m (£76m) corruption scandal.\nUmerov wrote on Telegram that he did not provide any assessments or approvals of the plan, adding that Ukraine was still \"carefully considering our partners' proposals\".\nHe added that Russia remained \"completely open to peace talks\".",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-11-21T12:45:19Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/hiltzik-trump-administrations-math-economic-110000261.html",
    "title": "Hiltzik: The Trump administration's math on economic policy doesn't add up",
    "summary": "But his casual retailing of obviously bogus arithmetic points to a broader issue with the numbers the Trump White House routinely injects into its policy statements.\nThe holder of a 50-year loan would have accumulated only about $22,000 in equity.\n\"Homeowners are not building much wealth with a 50-year mortgage,\" economist Dean Baker observes.\nThe White House still is trying to hide the effects of its economic policies on inflation — especially its tariffs.\nThe bottom line is that one shouldn't trust the math coming from this White House.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-11-18T11:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://hackaday.com/2025/11/19/build-a-stranger-things-wall-you-can-freak-out-at-in-your-own-home/",
    "title": "Build A Stranger Things Wall You Can Freak Out At In Your Own Home",
    "summary": "Foreign DJs gushed over the lush 80s soundtrack, fashionistas loved the clothing, and the world became obsessed with the idea of using Christmas lights to communicate across material planes.\nShe screams questions at her living room wall, upon which hangs a series of Christmas lights, marked with the letters A to Z.\nThe response from Claude (or Will Byers, if you’re imagining) is then flashed out on a WS2812B set of LED Christmas lights on the wall.\n[kyjohnso] added dramatic pauses whenever there’s a space in the output, somewhat replicating the dramatic elements of the show itself.\nIt’s all about committing to the bit; if you build such a thing, don’t hesitate to notify the tipsline!",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-11-19T21:00:00Z",
    "source": "Hackaday"
  },
  {
    "url": "https://www.yahoo.com/news/articles/iran-rejects-un-atomic-agencys-100120219.html",
    "title": "Iran rejects UN atomic agency's resolution and threatens more reprisal actions",
    "summary": "TEHRAN, Iran (AP) — Iran’s foreign ministry called a resolution by the U.N. atomic watchdog’s board of governors “anti-Iranian” and threatened unspecified retaliatory actions, state media reported on Friday.\nIAEA Director-Genral Rafael Mariano Grossi then reached an agreement with Iranian Foreign Minister Abbas Araghchi in Cairo in early September to resume inspections.\nBaghaei didn't immediately elaborate on what further actions Iran would take, but further uranium enrichment by the country is a possibility.\nAdvertisement AdvertisementAdvertisement AdvertisementAfter a 12-day air war in June with Israel, Iran suspended all cooperation with the IAEA.\nStrikes on Iran killed nearly 1,100 in Iran, including military commanders and nuclear scientists.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-11-21T10:01:20Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/texas-governor-declares-muslim-civil-042540956.html",
    "title": "Texas governor declares Muslim civil rights group a terrorist organization",
    "summary": "Greg Abbott on Tuesday declared one of the largest Muslim civil rights and advocacy groups in the U.S. a “foreign terrorist organization\" under a proclamation that he said allows the state to try shutting them down.\nNeither the CAIR nor the Muslim Brotherhood are designated as foreign terrorist organizations by the U.S. government.\nEPIC City representatives called the attacks about Islamic law and other assertions misleading, dangerous and without merit.\nAdvertisement AdvertisementAdvertisement AdvertisementIn his proclamation, Abbott cited a law he signed this year that he said prohibits “foreign adversaries” from purchasing or acquiring land.\n“Today proves exactly why that law was needed,” Republican state Rep. Cole Hefner posted on X.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-11-19T04:25:40Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/chinese-state-media-calls-more-093000944.html",
    "title": "Chinese state media calls for more research into Ryukyu history amid row with Japan",
    "summary": "\"The geopolitical position, strategic choices and future trajectory of the Ryukyu Islands not only determine their own fate but also profoundly affect the security concerns of neighbouring countries and regions,\" the editorial said.\nLocated between the islands of Kyushu and Taiwan, the Ryukyu archipelago was once controlled by the independent Ryukyu Kingdom.\nThe editorial suggested that studying the history around the Ryukyu Islands could help shed light on how to address \"pressing real-world concerns\" like America's military presence in Japan.\nAdvertisement AdvertisementAdvertisement AdvertisementBeijing has argued that the 1951 San Francisco Peace Treaty, which put the Ryukyu Islands under America's temporary administration, is invalid.\nAccording to figures from the Okinawan government, some 242,000 people were killed - civilian and military, Japanese and foreign.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-11-20T09:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/us-warned-others-avoid-loans-060107430.html",
    "title": "US has warned others to avoid loans from Chinese state banks. But it's the biggest recipient of all",
    "summary": "WASHINGTON (AP) — For years, Washington has been warning others not to trust loans from Chinese state banks fueling its rise as a superpower.\nBut a new report reveals an ironic twist: The United States is the biggest recipient of all — by far.\nAdvertisement AdvertisementAdvertisement AdvertisementDeals financed by China’s state-owned banks, the ones studied in the AidData report, are especially problematic.\nThe Chinese company had bought it through a company in the Netherlands that they owned.\nThe effort to track China's state loans and investment started more than a decade ago when Beijing launched its Belt & Road Initiative to build infrastructure in developing countries.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-11-18T06:01:07Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.vox.com/future-perfect/469219/future-perfect-25-big-thinkers-solutions-foreign-aid-masculinity-development",
    "title": "The 6 big thinkers reshaping foreign aid, masculinity, and development",
    "summary": "They’re the ones making sure that every dollar saves the maximum number of lives, that foreign aid is steered by evidence instead of dogma.\nKarlan is still hopeful that the US can one day rebuild the architecture behind its global aid strategy.\nThese days, Opalo is wrestling with what he calls “the growth question.” To him, development isn’t a glossy summit or a well-phrased aid campaign.\n—Marina Bolotnikova, deputy editorOliver KimNicole Rifkin for VoxThe best case for why development economics still matters is being made on Substack.\nHe takes big, messy arguments about poverty, growth, and aid and rebuilds them from the data up.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-11-19T06:17:14Z",
    "source": "Vox"
  },
  {
    "url": "https://www.yahoo.com/news/articles/treasury-plans-change-tax-credit-003716696.html",
    "title": "Treasury plans to change tax credit eligibility in a move critics say will hurt immigrant taxpayers",
    "summary": "WASHINGTON (AP) — The U.S. Treasury Department said Thursday it plans to reclassify certain refundable tax credits as “federal public benefits,\" which will bar some immigrant taxpayers from receiving them, even if they file and pay taxes and would otherwise qualify.\nAdvertisement AdvertisementAdvertisement AdvertisementThe Treasury said in its announcement that it plans to craft new rules affecting the refunded portions of certain individual income tax credits, including the Earned Income Tax Credit, the Additional Child Tax Credit, the American Opportunity Tax Credit and the Saver’s Match Credit.\nThe rule-making would redefine the tax credits as “federal public benefits” within the meaning of Personal Responsibility and Work Opportunity Reconciliation Act of 1996.\nNYU Tax Law Center Policy Director Brandon DeBot said in a statement that the Treasury’s reinterpretation of the law in order to craft a new rule for the tax credits “overrides such clear provisions of the tax code.”“Denying tax credits to immigrant families requires Congress to act explicitly,” DeBot said.\nTargeting them in this roundabout way, that’s not a policy change that would’ve had majority support in Congress,” he said.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-11-21T00:37:16Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/russia-delivering-su-57-sukhoi-fighter-fifth-generation-foreign-buyer-2025-11",
    "title": "Russia Says It's Delivering Su-57s to Foreign Buyer Amid the War",
    "summary": "A Sukhoi Su-57E performs during a display flight at Al-Maktoum International Airport during the Dubai Airshow 2025.\nGIUSEPPE CACACE/AFP via Getty ImagesA Sukhoi Su-57E performs during a display flight at Al-Maktoum International Airport during the Dubai Airshow 2025.\nVadim Badekha, the CEO of United Aircraft Corporation, said on Channel One, a Russian state-owned TV channel, that a \"foreign partner\" had received the aircraft.\nIn February, Algeria's state media reported that its government was one such buyer, and that Algerian pilots were training in Russia to fly the Su-57.\nThe Sukhoi Su-57 is Russia's fifth-generation jet and its most modern fighter in official operational service.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-11-19T05:25:17Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.wired.com/story/senators-want-extremism-researchers-to-surrender-documents-linked-to-right-wing-grudges/",
    "title": "Senators Want Extremism Researchers to Surrender Documents Linked to Right-Wing Grudges",
    "summary": "While Paul’s inquiry was lauded by Muslim-American organizations as a long-overdue examination of abusive federal surveillance, it appears the inquiry is a broader attempt to target academic researchers on extremism, which could chill inquiries into far-right radicalization.\nAt least three university research centers focused on extremism received requests for documentation from the Senate committee in the past two months.\nThe university was also instructed to identify all staff who held federal security clearances, any and all sources of federal grant funding, and internal procedures.\nPeople familiar with the committee inquiry view Paul’s sprawling queries as a targeted effort to chill or discourage academic research on far-right groups, ideologies, or individuals.\nOf the more than 300 subject matter queries listed in the Senate letter, researchers say only two terms—“anti-fascist” and “Black Lives Matter”—appear to align with left-wing movements, ideologies, or possible extremist groups.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-11-21T17:06:49Z",
    "source": "Wired"
  }
]