[
  {
    "url": "https://www.businessinsider.com/production-of-patriot-missiles-surging-demand-exceptionally-high-2025-8",
    "title": "Patriot missile production is surging, but the demand is insatiable",
    "summary": "US Army EuropeAmerican defense companies are cranking out Patriot interceptors at a record-breaking pace, but demand is surging.\nAmid global conflicts and growing worries in the West about a major conflict against a peer-level adversary, air defense missiles are in huge demand.\nMeanwhile, Boeing is surging PAC-3 missile seekers, critical components that enable the Patriot system to identify, track, and intercept threats, and Raytheon, which makes Patriot radars and launchers, is boosting PAC-2 interceptor missile production.\nA Patriot Air and Missile Defense launcher fires an interceptor.\nRaytheonHoffman cautioned that even if the West's production of missile interceptors, like the Patriots, exceeds Russian conventional ballistic missile production, \"this will not solve Europe's problems.\"",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-08-09T12:09:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.bbc.com/news/articles/czr68vde7nvo",
    "title": "The unlikely bond between JD Vance and David Lammy",
    "summary": "Faith, family and fishing: The unlikely bond between JD Vance and David Lammy3 days ago Share Save Kate Whannel Political reporter Share SavePA Media JD Vance and David Lammy fishing together at Chevening in KentUS Vice President JD Vance is taking his holiday in the UK - a trip which will include visits to the Cotswolds, Scotland and, to kick it all off, a few days staying with Foreign Secretary David Lammy at his grace-and-favour country home, Chevening House in Kent.\nYet, despite their differences Lammy and Vance appear to be the best of friends.\nVance went to Harvard's rival Yale - \"not quite as good,\" Lammy joked at Chevening.\nVance converted to Catholicism as an adult and attended Mass with Lammy when he visited Washington DC earlier this year.\nThe vice president is also meeting Conservative leader Kemi Badenoch and Reform UK's Nigel Farage has hinted that he may be as well.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-08-08T23:18:58Z",
    "source": "BBC News"
  },
  {
    "url": "https://gizmodo.com/nvidia-just-dodged-an-8-billion-bullet-thanks-to-donald-trump-2000641188",
    "title": "Nvidia Just Dodged an $8 Billion Bullet, Thanks to Donald Trump",
    "summary": "According to the Financial Times, the breakthrough came after Huang’s visit to the White House on August 6 to meet with President Donald Trump.\nTo prevent this, the U.S. has imposed strict export controls, blocking the sale of top-tier AI chips to China.\nThe Power of Personal DiplomacyReversing this policy took months of intense diplomacy and lobbying, culminating in Huang’s personal visits to the White House.\nDuring a White House AI summit last month, Trump admitted he had initially considered taking antitrust action against the chip giant before he got to know its CEO.\nWith the $8 billion revenue threat now averted and the $50 billion China market reopened, investors will be watching closely when Nvidia reports its quarterly earnings later this month.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-08-10T13:18:16Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://gizmodo.com/china-opens-robot-mall-its-first-mall-for-robots-2000640691",
    "title": "China Opens ‘Robot Mall,’ Its First Mall for Robots",
    "summary": "The four-story Robot Mall, located in Beijing’s high-tech E-Town district, showcases more than 100 robots from over 40 brands, including Chinese companies like Ubtech Robotics and Unitree Robotics.\nThe opening of Robot Mall coincides with two major robotics conferences in the city this month.\nFriday was also the first day of the 2025 World Robot Conference, which runs through August 12.\nJust days later, Beijing will host the 2025 World Humanoid Robot Games, taking place from August 14 to 17.\nSome U.S. robotics companies, including Tesla and Boston Dynamics, have already called on lawmakers to develop a national strategy that can compete with China’s.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-08-08T16:40:25Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://abcnews.go.com/International/vance-uk-high-stakes-diplomacy-day-after-trump/story?id=124514600",
    "title": "Vance in UK for high-stakes diplomacy day after Trump announces Putin meeting",
    "summary": "President Donald Trump in Washington, Aug. 6, 2025, Ukrainian President Volodymyr Zelensky in Rome, July 10, 2025 and Russian President Vladimir Putin in Moscow, Aug. 5, 2025.\nPresident Donald Trump in Washington, Aug. 6, 2025, Ukrainian President Volodymyr Zelensky in Rome, July 10, 2025 and Russian President Vladimir Putin in Moscow, Aug. 5, 2025.\nPresident Donald Trump in Washington, Aug. 6, 2025, Ukrainian President Volodymyr Zelensky in Rome, July 10, 2025 and Russian President Vladimir Putin in Moscow, Aug. 5, 2025.\nPresident Donald Trump in Washington, Aug. 6, 2025, Ukrainian President Volodymyr Zelensky in Rome, July 10, 2025 and Russian President Vladimir Putin in Moscow, Aug. 5, 2025.\nThe UK meeting came as the upcoming Trump-Putin summit -- set to happen without Ukrainian President Volodymyr Zelensky at the table -- has raised concern among Ukrainian officials and across Europe.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-08-09T22:19:22Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.businessinsider.com/top-20-cities-the-ultrawealthy-buy-second-homes-in-2025-2025-8",
    "title": "The top cities where the ultrawealthy are buying second homes in 2025 — and it's not just London or New York",
    "summary": "Ultra-high-net-worth buyers are flocking to Miami for second homes, drawn by its tax perks, lifestyle, and climate.\nUltra-high-net-worth buyers are flocking to Miami for second homes, drawn by its tax perks, lifestyle, and climate.\nJeff Greenberg/Jeffrey Greenberg/Universal Images Group via Getty ImagesUltra-high-net-worth buyers are flocking to Miami for second homes, drawn by its tax perks, lifestyle, and climate.\nA new report by wealth intelligence firm Altrata ranked the top 20 cities where ultra-high-net-worth individuals — defined as those with a net worth of at least $30 million — are buying second homes in 2025.\nThe top 20 cities for second homes in 2025The report ranked cities by the number of UHNW individuals who own a second residence in each location, looking at both US cities and cities in the rest of the world.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-08-09T10:30:02Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.thedailybeast.com/marjorie-taylor-greene-goes-on-fiery-tirade-against-psychopath-fox-news-host-mark-levin/",
    "title": "Marjorie Taylor Greene Goes on Fiery Tirade Against ‘Psychopath’ Fox News Host Mark Levin",
    "summary": "Fox News personality Mark Levin started the heated feud when he attacked the Georgia Republican on X.\n“Fox News host Mark Levin is a raging psychopath,” she wrote on X.\nAll because I am UNAPOLOGETICALLY AMERICA FIRST and UNAPOLOGETICALLY FIGHTING FOR MY CHILDREN’S GENERATION!!\n!”Fox News host Mark Levin is a raging psychopath.\nFox News host Mark Levin, a once hateful NEVER TRUMPER, is 100% Israel FIRST and America LAST!!",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-08-09T23:09:50Z",
    "source": "Daily Beast"
  },
  {
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-nuclear-weapons-disarmament-hiroshima-rcna224100",
    "title": "Trump’s disastrous nuclear policies once held a glimmer of hope",
    "summary": "In an Oval Office press meeting, for the first time in decades, a sitting president openly discussed nuclear disarmament: “There’s no reason for us to be building brand new nuclear weapons.\nAnd here we are building new nuclear weapons, and they’re building nuclear weapons,” he said.\nEven if he deterred Iran’s nuclear program, it put the U.S. directly at odds with other nuclear powers.\nBut right now, we’re on the wrong path — the path of excessive militarization and the risk of total annihilation.\nAnd the Pentagon is spending $2 trillion on a whole new generation of nuclear weapons.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-08-10T14:20:47Z",
    "source": "MSNBC"
  },
  {
    "url": "https://abcnews.go.com/International/russia-ukraine-exchange-drone-attacks-amid-peace-talks/story?id=124520013",
    "title": "Russia and Ukraine exchange drone attacks amid peace talks maneuvers",
    "summary": "People look at a destroyed Russian combat drone at an exhibition in central Kyiv, Ukraine, on August 8, 2025.\nPeople look at a destroyed Russian combat drone at an exhibition in central Kyiv, Ukraine, on August 8, 2025.\nPeople look at a destroyed Russian combat drone at an exhibition in central Kyiv, Ukraine, on August 8, 2025.\nPeople look at a destroyed Russian combat drone at an exhibition in central Kyiv, Ukraine, on August 8, 2025.\nRussia's Defense Ministry said its troops shot down at least 126 Ukrainian drones overnight.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-08-10T09:56:21Z",
    "source": "ABC News"
  }
]