[
  {
    "id": "OA==",
    "url": "https://www.bbc.com/news/articles/c99722j4lkgo",
    "title": "Trump says US is pursuing third oil tanker linked to Venezuela",
    "summary": "Trump says US is pursuing third oil tanker linked to Venezuela14 hours ago Share Save Vanessa Buschschlüter and Seher Asaf Share SaveWatch: Moment US intercepts a second oil tanker off VenezuelaThe US Coast Guard is still pursuing a vessel in international waters near Venezuela as tensions in the region escalate, President Donald Trump has confirmed.\n\"We're actually pursuing\" the tanker, Trump said on Monday.\nThe Trump administration has accused Venezuela of using oil money to fund drug-related crime, while Venezuela has described the tanker seizures as \"piracy\".\nLate on Saturday the US Coast Guard approached an oil tanker, which US officials said was not flying a valid national flag, the New York Times reported.\nThe Bella 1 is the third oil tanker to be targeted by the US in waters off Venezuela.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-12-21T21:13:50Z",
    "source": "BBC News"
  },
  {
    "id": "MTA=",
    "url": "https://finance.yahoo.com/video/25-shift-made-china-global-150807356.html",
    "title": "The 25-Year Shift That Made China a Global Superpower",
    "summary": "China's entry into the WTO in 2001 accelerated its rise as a global manufacturing and technology powerhouse, fueled export growth, and helped stabilize global demand during the financial crisis.\nAs China expanded Belt and Road investments, advanced in EVs and AI, and entered a sharper economic rivalry with the United States, its property slowdown and domestic inequality exposed new vulnerabilities.\nEnda Curran, Elizabeth Economy, and Afsaneh Beschloss explain China's past 25 years and what its next phase means for the global economy.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-20T15:08:07Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MTc=",
    "url": "https://www.businessinsider.com/taiwan-needs-tech-industries-involved-in-drone-push-us-official-2025-12",
    "title": "Taiwan's drone push needs its powerhouse industries, former US commerce official says",
    "summary": "Taiwan's government has prioritized increasing investment in the development and use of drone systems.\nTaiwan's government has prioritized increasing investment in the development and use of drone systems.\nI-Hwa Cheng/AFPTaiwan's government has prioritized increasing investment in the development and use of drone systems.\nTo expand the sector, though, it needs to have its powerhouse industries fully engaged, a former US commerce official said recently.\nChina has also sanctioned some US defense companies involved in supporting Taiwan's drone industry.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-12-22T13:57:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MzE=",
    "url": "https://www.yahoo.com/news/articles/us-authorities-stunning-discovery-inside-190000778.html",
    "title": "US authorities make stunning discovery inside footwear shipment from overseas: 'It's done'",
    "summary": "U.S. authorities detected Cesium-137 contamination in footwear manufactured at a facility in the Cikande area of Banten.\nAdvertisement AdvertisementAdvertisement AdvertisementThis shoe problem adds to the export troubles Indonesia has already faced.\nWhen safety systems fail and handling protocols break down, workers face exposure risks, and entire communities can suffer.\nCustoms in the Netherlands found the radioactive problem in Indonesian sneakers before the shrimp issue became widely known.\nIf you buy products made overseas, you can check for safety recalls through the FDA's website or the Consumer Product Safety Commission.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-20T19:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDQ=",
    "url": "https://www.bbc.com/news/articles/cy7v3862vpvo",
    "title": "Port of Dover Christmas getaway delays due to IT issues in Calais",
    "summary": "The delays, which lasted into the afternoon, were described as \"absolute chaos\" by one traveller, and images of the port showed a long line of vehicles queuing at a standstill.\nEurotunnel was also experiencing lengthy delays at its Folkestone terminal on Saturday - at the start of a weekend which is expected to see the Christmas getaway reach its peak.\nThe Port of Dover reported that traffic was free-flowing just before 15:00 GMT, after several hours of delays.\nOne traveller had posted earlier on X: \"Horrible experience at Port of Dover this morning.\nA port spokesperson asked all port-bound traffic to remain on main roads \"to allow the Dover community to travel to festive events and finish their Christmas shopping in the town\".",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-12-20T10:27:14Z",
    "source": "BBC News"
  },
  {
    "id": "NDc=",
    "url": "https://www.yahoo.com/news/articles/chinese-workers-return-africa-lucrative-093000949.html",
    "title": "Chinese workers return to Africa as lucrative job opportunities beckon",
    "summary": "Chinese workers are returning to Africa in their thousands, reversing a decade-long decline and signalling a renewed focus on strategic mega-projects across the continent.\nNow, as investment flows accelerate, mostly driven by Chinese state-owned enterprises, worker numbers are once again increasing in key countries across Africa.\nShe noted that the high number of Chinese workers for Tanzania was likely related to the ongoing construction of the Standard Gauge Railway.\nIt required a workforce of about 50,000 Chinese workers when it was first built in the 1970s, marking the beginning of China's long-term infrastructure legacy in Africa.\nChinese construction firms have increasingly relied on local African labour rather than importing Chinese workers,\" Xue said.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-21T09:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDk=",
    "url": "https://www.bbc.com/news/articles/ckgmd132ge4o",
    "title": "Trump says US needs Greenland after naming special envoy",
    "summary": "Trump says US 'has to have' Greenland after naming special envoy16 hours ago Share Save James Landale , Diplomatic correspondent and Rachel Hagan Share SaveWatch: BBC asks Trump what the new appointment to Greenland entailsDonald Trump has sparked a fresh row with Denmark after appointing a special envoy to Greenland, the vast Arctic island he has said he would like to annex.\nLandry, he said, would \"lead the charge\" as special envoy to Greenland, a semi-autonomous part of the Kingdom of Denmark.\nSince returning to the White House in January, Trump has revived his long-standing interest in Greenland, citing its strategic location and mineral wealth.\n\"We need Greenland for national security, not minerals.\"\nWriting on social media earlier, the US president said Landry understood how \"essential Greenland is to our national security\" and would advance US interests.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-12-22T12:25:59Z",
    "source": "BBC News"
  },
  {
    "id": "NTA=",
    "url": "https://www.yahoo.com/news/articles/denmark-insists-respect-territorial-integrity-085016399.html",
    "title": "Trump's appointment of envoy to Greenland sparks new tension with Denmark",
    "summary": "The leaders of Denmark and Greenland insisted Monday that the United States won't take over Greenland and demanded respect for their territorial integrity after President Donald Trump ‍​announced ​the appointment of a ‌special envoy to the semi-autonomous territory.\nJeff Landry would be the envoy prompted a new flare-up of tensions over Washington's interest in the vast territory of Denmark, a NATO ally.\nDenmark's foreign minister told Danish broadcasters that he would summon the U.S. ambassador to his ministry.\nIn March, Vice President JD Vance visited a remote U.S. military base in Greenland and accused Denmark of under-investing there.\n“We need Greenland for national security,” Trump told reporters on Monday at his Mar-a-Lago resort in Florida, when asked about Landry's appointment.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-22T08:50:16Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTE=",
    "url": "https://finance.yahoo.com/news/europe-stumbles-attempt-sidestep-trump-090000409.html",
    "title": "Europe Stumbles in Its Attempt to Bypass Trump’s World Order",
    "summary": "Ursula von der Leyen was supposed to sign the European Union’s largest free-trade agreement on Saturday, proving the bloc’s standing as a geoeconomic force.\nBrazilian President Luiz Inacio Lula da Silva said earlier this week the time was now or never.\nOfficials say they will try again to sign the deal on Jan. 12, but there’s no guarantee.\nIt especially wants to prove it can move outside the orbit of China and the US, which have increasingly antagonistic trade relationships with Europe.\n“This is Europe’s independence moment,” von der Leyen said earlier this week, ahead of a summit when EU leaders would tackle funding options for Ukraine as well as Mercosur.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-20T09:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTI=",
    "url": "https://www.yahoo.com/news/articles/turkeys-top-officials-visit-syria-141513568.html",
    "title": "Clashes flare as top Turkish officials visit Syria ahead of a deadline for Kurdish integration",
    "summary": "DAMASCUS, Syria (AP) — Clashes erupted between Syrian security forces and Kurdish fighters on Monday as top Turkish officials visited Damascus ahead of a deadline to implement a deal between the government and Kurdish-led forces in the country’s northeast.\nThe Kurdish-led Syrian Democratic Forces, or SDF, said 17 people were wounded and a woman was killed.\nSyria’s Civil Defense agency said two of its emergency responders were wounded after fighters with the Kurdish-led SDF opened fire on their vehicle.\nA statement from the Kurdish-led forces accused Syrian government forces of opening fire on a Kurdish checkpoint, while government officials accused the SDF of attacking first.\nThe Turkish military has also provided support to the new Syrian army, including training cadets and officers.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-22T14:15:13Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTM=",
    "url": "https://www.aljazeera.com/video/talk-to-al-jazeera/2025/12/20/uruguays-fm-on-us-claims-to-police-latin-america-and-rising-tensions",
    "title": "Uruguay’s FM on US claims to police Latin America and rising tensions",
    "summary": "Mario Lubetkin on Washington’s revived sphere-of-influence doctrine, Venezuela, and China’s growing footprint.\nThe United States is reviving a policy first set out in the 1800s that treats Latin America as its strategic sphere of influence.\nAs Washington expands maritime operations in the Caribbean and eastern Pacific, critics warn of legal violations and rising regional instability.\nUruguay’s Foreign Minister Mario Lubetkin joins Talk to Al Jazeera to discuss US strikes, Venezuela, migration pressures, and China’s growing role in the region — and whether diplomacy can still prevent escalation in a hemisphere shaped once again by power politics.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-20T09:04:57Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTQ=",
    "url": "https://www.aljazeera.com/news/2025/12/22/fresh-clashes-erupt-on-thai-cambodia-border-as-asean-convenes-peace",
    "title": "Clashes erupt on Thailand-Cambodia border as ASEAN convenes peace talks",
    "summary": "The conflict, since it resumed on December 8, has killed at least 40 people and displaced nearly one million people on both sides of the border.\nEarlier on Monday, Cambodian Prime Minister Hun Manet’s office announced that as of Sunday evening, an estimated 525,000 civilians have been displaced on their side of the border.\nAn ASEAN team is expected to present satellite-monitoring data provided by the US, alongside field observations.\nASEAN must do whatever is necessary to maintain regional peace and stability,” Hasan said in ⁠opening remarks to ministers.\nIt said it welcomed “ASEAN leaders coming together this week to support Cambodia and Thailand fully honoring their commitments to end this conflict”.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-22T03:39:41Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTU=",
    "url": "https://www.aljazeera.com/opinions/2025/12/22/is-the-us-making-a-great-gamble-to-reshape-iraq",
    "title": "Is the US making a great gamble to reshape Iraq?",
    "summary": "The Trump administration seeks to recalibrate US influence in the Middle East and wants to ‘make Iraq great again’.\nAt the centre of Trump’s ambitious goal is what the new US envoy to Iraq, Mark Savaya, described as his goal to “make Iraq great again”.\nIt could be the “great gamble” for Trump, who seeks an Iraq that serves as a stable, sovereign regional hub rather than a battleground for foreign interests.\nSavaya’s communal and ethnic ties have given him significant access to Iraqi power centres that traditional diplomats often lack.\nThis move clearly signals Iran’s deep and enduring interest in shaping Iraq’s political alignment and its future path.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-22T07:37:30Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTY=",
    "url": "https://www.rt.com/africa/629871-russia-china-remain-pretoria-strategic-partners/",
    "title": "Russia and China remain our strategic partners – South African deputy FM",
    "summary": "“China and Russia continue to be regarded as strategic partners of the country of South Africa,” she stated, adding that Pretoria “will continue to engage with Russia, China and other progressive forces in the world.”The deputy foreign minister noted Moscow’s role in supporting South Africa’s anti-apartheid struggle.\n“Russia has always been there for the South African government and the South African people when it fought against the apartheid regime.”Moraka also defended South Africa’s outspoken position on the Palestinian issue, including its legal case against Israel at the International Court of Justice.\n“We will continue to speak against any injustice… be it the Palestinian people in Gaza or whoever.”Addressing concerns from the Western partners, Moraka reaffirmed that non-alignment remains the cornerstone of South African foreign policy.\n“American markets need African countries,” especially for minerals and agriculture, she said.\nThe Russian delegation was led by Foreign Minister Sergey Lavrov, who held around 20 bilateral meetings with his African counterparts.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-22T12:16:12Z",
    "source": "RT"
  }
]