[
  {
    "id": "NQ==",
    "url": "https://finance.yahoo.com/news/japan-markets-set-renewed-takaichi-132924343.html",
    "title": "Japan markets set for renewed 'Takaichi trade' after landslide election win",
    "summary": "More from Yahoo Scout How has the Takaichi trade impacted Japanese markets?\nVoters braved heavy snowfalls in Tokyo and other parts of Japan to deliver what exit polls indicated to be the most decisive win for Takaichi's Liberal Democratic Party since 1996.\nWith polls already indicating a decisive LDP win, Japan's benchmark ​Nikkei 225 Index set an all-time high of 54,782.83 on Tuesday.\nBig winners of late include sectors like defence, artificial intelligence and chips that ‌have been singled out by Takaichi for targeted investment.\nBut prospects for more government outlays have unsettled investors already concerned about Japan's debt burden, the largest in the developed world.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-08T13:29:24Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Nw==",
    "url": "https://www.bbc.com/news/articles/c99j01p1yjro",
    "title": "Andrew shared confidential information with Epstein as trade envoy, files suggest",
    "summary": "Andrew Mountbatten-Windsor appears to have knowingly shared confidential information with Jeffrey Epstein from his official work as trade envoy in 2010 and 2011, according to material in the latest release of files in the US seen by the BBC.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-08T17:31:03Z",
    "source": "BBC News"
  },
  {
    "id": "OQ==",
    "url": "https://www.yahoo.com/news/articles/russian-officials-warning-putin-financial-211434255.html",
    "title": "Russian officials are warning Putin that a financial crisis could arrive this summer, report says, while his war on Ukraine becomes too big to fail",
    "summary": "Russian officials have been warning Putin with growing alarm that a financial crisis could hit by the summer, sources told the Washington Post.\nAs sanctions took hold and Putin mobilized the economy for a prolonged war, a tight labor market and high inflation forced the central bank to keep interest rates high.\nWith companies feeling the squeeze of high rates and weaker consumption, more workers not being paid, getting furloughed, or seeing their hours cut.\nThat would add to recent U.S. penalties on Russian oil majors Rosneft and Lukoil.\n“Russia has to continue the war because this war is too big for Putin to fail.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-08T21:14:34Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MTI=",
    "url": "https://www.npr.org/2026/02/06/nx-s1-5704104/argentina-us-trade-deal",
    "title": "Argentina and U.S. sign a major trade deal to slash tariffs, boost political alliance",
    "summary": "Argentina and U.S. sign a major trade deal to slash tariffs, boost political alliancetoggle caption Evan Vucci/APBUENOS AIRES, Argentina — Argentina and the United States agreed Thursday to ease restrictions on each other's goods in an expansive trade deal that boosts a drive by President Javier Milei to open up Argentina's protectionist economy and a push by the Trump administration to reduce food prices for Americans.\nA trade deal between ideological alliesOn Thursday Argentine Foreign Minister Pablo Quirno and U.S. Trade Representative Jamieson Greer said they signed the trade and investment agreement in Washington.\nAfter imposing sweeping tariffs on its trading partners, the Trump administration changed its tune last November in announcing framework deals with four Latin American countries, including Argentina.\nThose are key concessions as Argentine industries long protected by steep tariffs fret about their ability to compete with American manufacturers.\nWashington, for its part, will eliminate reciprocal tariffs on 1,675 Argentine products, Argentina's Foreign Ministry said, increasing government export revenue by over $1 billion.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-06T07:05:22Z",
    "source": "NPR"
  },
  {
    "id": "MTQ=",
    "url": "https://www.businessinsider.com/canada-travel-demand-us-tourism-2026-2",
    "title": "Canadians are staying away from the US — and the drop in travel is getting hard to ignore",
    "summary": "Data from Statistics Canada up to November showed that fewer Canadians returned from the US — indicating fewer visited the US — than in the past couple of years.\nStatistics Canada data also showed that US residents entering Canada haven't had as large a drop from the start of the year as Canadian residents returning did.\nStatistics Canada said domestic travel in the second quarter of 2025 was 10.9% higher than a year ago.\nKaraguesian expects Canadian travel to the US to continue to cool due to the \"Buy Canadian\" movement, political instability, the trade war, and recent violence in the US.\nU.S. Travel Association said Canada is the main driver for the expected 3.2% drop in international inbound travel spending from 2024 to 2025.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-06T09:34:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjA=",
    "url": "https://www.bbc.com/news/articles/cjd9k852zdjo",
    "title": "Japan election: Stocks surge as Takaichi secures historic election victory",
    "summary": "Just one week after Takaichi took office in October last year, Tokyo rolled out the red carpet for Trump when he visited Japan.\nIt was her diplomatic debut, and the optics were striking: fists pumping as the US president praised her in front of thousands of US soldiers.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-09T05:34:33Z",
    "source": "BBC News"
  },
  {
    "id": "NDI=",
    "url": "https://www.bbc.com/news/articles/cd0y0y9z231o",
    "title": "US wants Russia and Ukraine to end war by June, says Zelensky",
    "summary": "\"Why before this summer?\"\n\"We understand that their domestic issues in the US will have an impact.\"\nThese issues include the November midterm elections, which could affect the balance of power in the US government.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-07T11:53:53Z",
    "source": "BBC News"
  },
  {
    "id": "NTA=",
    "url": "https://www.businessinsider.com/russia-economy-venezuela-oil-investment-us-push-russian-companies-out-2026-2",
    "title": "Russia says the US is pushing its companies out of Venezuela's energy sector",
    "summary": "The administration of Russian President Vladimir Putin faces uncertainty over its ties with Venezuela following the US military operation in January.\nThe administration of Russian President Vladimir Putin faces uncertainty over its ties with Venezuela following the US military operation in January.\nImpact LinkRussia said the United States is pushing Russian companies out of Venezuela's energy sector.\nLavrov cited recent sanctions against Rosneft and Lukoil, as well as tariffs and restrictions on countries purchasing Russian oil, including India.\n\"Everywhere it is being said that Russian oil and Russian gas will be replaced by American oil and American liquefied natural gas,\" Lavrov said.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-06T06:59:19Z",
    "source": "Business Insider"
  },
  {
    "id": "NjM=",
    "url": "https://www.yahoo.com/news/articles/ukrainian-shelling-causes-serious-damage-000632794.html",
    "title": "Ukrainian shelling causes 'serious damage' in Russia's Belgorod, governor says",
    "summary": "Feb 6 (Reuters) - Nighttime shelling by Ukraine inflicted \"serious damage\" in the Russian city of Belgorod, near the border, the region's governor said ​early on Friday.\nAdvertisement Advertisement\"The enemy has shelled the civilian city of Belgorod.\nIn his morning address, Gladkov said the works to restore electric power supply continue.\n\"As of today, we have not ‍been able to fully ⁠restore electricity supply in Belgorod,\" he said.\nAdvertisement AdvertisementUkrainian forces have regularly attacked Belgorod and nearby parts of the region since Russia's February 2022 invasion ⁠of its smaller neighbour.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-06T00:06:32Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NjU=",
    "url": "https://www.npr.org/2026/02/07/nx-s1-5704785/state-department-trump-posts-x",
    "title": "State Department will delete X posts from before Trump returned to office",
    "summary": "State Department will delete X posts from before Trump returned to officetoggle caption Anna Moneymaker/Getty ImagesThe State Department is removing all posts on its public accounts on the social media platform X made before President Trump returned to office on Jan. 20, 2025.\nThe posts will be internally archived but will no longer be on public view, the State Department confirmed to NPR.\nThe removal of State Department X posts from public view appears to be less about ideological differences with past statements and more about control of future messaging.\nSome current and former State Department employees as well as academics worry that it will make the historical record of the government's communications and actions harder to trace.\nThe State Department also has publicly available archived versions of its website under previous administrations dating back to President Bill Clinton.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-07T10:00:00Z",
    "source": "NPR"
  },
  {
    "id": "NjY=",
    "url": "https://www.yahoo.com/entertainment/videos/lavrov-slams-french-diplomacy-pathetic-104500396.html",
    "title": "Lavrov Slams French Diplomacy as \"Pathetic\" After Macron Adviser's Moscow Visit",
    "summary": "The boys dig into some of the most disappointing Designated Player signings in MLS history, from Rafa Márquez’s chaos years to the underwhelming impacts of Olivier Giroud, Xherdan Shaqiri, and Lorenzo Insigne.\nThen it’s off to the Premier League, reacting to Liverpool’s heated loss to Manchester City — was the red card fair, and what does City’s win mean for Arsenal as the title race tightens?\nFinally, the crew breaks down Mauricio Pochettino telling Timothy Weah to “keep quiet” about World Cup ticket prices and what that moment says about power, pressure, and transparency in the modern game.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-02-06T10:45:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Njc=",
    "url": "https://www.bbc.com/news/articles/cvgpgnw5dnro",
    "title": "Universities told to report foreign interference on campus to MI5",
    "summary": "Meawhile, in November BBC News reported how a campaign of harassment and intimidation took place at Sheffield Hallam University in an attempt to shut down an academic's research into allegations of forced labour among Uyghur Muslims in the Xinjiang region of China.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-09T00:03:49Z",
    "source": "BBC News"
  },
  {
    "id": "Njg=",
    "url": "https://www.bbc.com/news/articles/cz9v9d0xj8qo",
    "title": "Foreign Office to review Mandelson's US ambassador pay-off",
    "summary": "However, he is believed to have been given an exit payment equivalent to three months' salary according to the Times.\nWhile his salary as US ambassador has not been disclosed, the post typically has a salary of £155,000-£159,999.\nThis would put a three months' pay-out at around £40,000.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-02-07T22:10:09Z",
    "source": "BBC News"
  },
  {
    "id": "Njk=",
    "url": "https://www.aljazeera.com/opinions/2026/2/6/trumps-america-first-doctrine-is-remaking-global-diplomacy",
    "title": "Trump’s America First doctrine is remaking global diplomacy",
    "summary": "His political trajectory and election as President of the United States were unprecedented.\nCritics dismiss the Trump Doctrine as nothing more than a chaotic combination of isolationism, dismantlement of multilateralism, and imperialism.\nAt its core, the Trump Doctrine rests on two strategic pillars designed to secure peace through strength and prosperity through leverage.\nAdvertisementIt is essential to consider the Trump Administration’s global foreign policy achievements and objectives through a broad lens, recognising them as part of a deliberate and coherent strategic doctrine.\nBoth Presidents put America First and carried a big stick, prioritising national power as the foundation of global influence and stability.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-06T11:21:05Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NzE=",
    "url": "https://www.aljazeera.com/news/2026/2/8/saudi-arabia-slams-foreign-interference-in-sudan-after-deadly-rsf-attacks",
    "title": "Saudi Arabia denounces ‘foreign interference’ in Sudan after RSF attacks",
    "summary": "In a statement on Saturday, the Saudi Ministry of Foreign Affairs condemned “foreign interference” by “some parties” in Sudan, including the “continued influx of illegal weapons, mercenaries and foreign fighters” for the continuation of the nearly three-year-old war.\nThe Saudi Ministry of Foreign Affairs said on Saturday the deadly RSF attacks “are completely unjustifiable and constitute flagrant violations of all humanitarian norms and relevant international agreements”.\nSeparately, Saudi Arabia has also accused the UAE of backing the separatist Southern Transitional Council (STC) in Yemen.\nThe offensive resulted in a split in Yemen’s internationally-backed government, and prompted Saudi Arabia to launch deadly raids targeting the STC.\nThe UAE pulled out its troops from Yemen following the Saudi allegation, saying it supports Saudi Arabia’s security.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-08T07:34:12Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NzI=",
    "url": "https://abcnews.go.com/International/iran-us-reopen-nuclear-talks-oman-after-weeks/story?id=129907788",
    "title": "Iran and US to reopen nuclear talks in Oman after weeks of tension",
    "summary": "LONDON -- Negotiating teams from the United States and Iran are expected to meet on Friday in Oman, marking a reopening of nuclear talks following weeks of tensions and threats, as leaders in Tehran oversaw a deadly crackdown on widespread protests.\nOmani Foreign Ministry via AFP via Getty ImagesThe talks, which were expected to begin at 10 a.m. local time, followed weeks of escalating tension between the U.S. and Iran, fueled in part by massive protests that have roiled Iran.\nIran's foreign minister met with his Omani counterpart in Muscat on Feb. 6, ahead of Oman-mediated talks with the United States on the Islamic republic's nuclear program.\nThe Iranian foreign minister responded by saying the country's military had \"their fingers on the trigger.\"\nMembers of the Trump administration last held a series of nuclear talks with Iran in April and May 2025 in Oman.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-06T09:34:58Z",
    "source": "ABC News"
  },
  {
    "id": "NzM=",
    "url": "https://www.aljazeera.com/news/2026/2/7/israels-gaza-genocide-risks-global-order-leaders-warn-at-al-jazeera-forum",
    "title": "Israel’s Gaza genocide risks global order, leaders warn at Al Jazeera Forum",
    "summary": "Israel’s war on Gaza and ‘expansionist’ actions beyond are reshaping global politics and threatening stability outside the region, forum hears in Doha.\nIsrael’s genocide against Palestinians in Gaza and its geopolitical fallout reverberating across the Middle East and beyond have dominated the 17th Al Jazeera Forum in Doha.\nIsraeli threat to the Red SeaSomali President Hassan Sheikh Mohamud, also speaking at the forum, warned that Israel’s Gaza war and escalating tensions in the Red Sea are unfolding alongside a broader breakdown in the international system.\nPlacing the conflict within a wider geopolitical context, Mohamud warned that the foundations of global governance are weakening.\n“Key among the global concerns is the weakening of the established rules based on international order.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-07T10:22:51Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NzQ=",
    "url": "https://www.npr.org/2026/02/09/nx-s1-5706602/japan-takaichi-conservative-agenda-election-landslide",
    "title": "Japan's Takaichi to pursue conservative agenda after election landslide",
    "summary": "Japan's Takaichi to pursue conservative agenda after election landslidetoggle caption Keisuke Hosojima/Kyodo News/APSEOUL — Japan's first female Prime Minister, Sanae Takaichi, brought the ruling Liberal Democratic Party (LDP) its biggest electoral victory in its 71-year history, fueling her ambitions to pursue to a political agenda which she herself says could \"split public opinion.\"\nCharismatic Japanese leaders, including Takaichi's mentor former Prime Minister Shinzo Abe, have helped the LDP stage comebacks before.\nQuestions and criticisms remain about how Takaichi will pay for these priorities, given that Japan's government debt is more than 200% of GDP.\nTakaichi also restated at her press conference her intention to revise Japan's National Defense Strategy and related documents.\n\"This year marks 10 years since Prime Minister Shinzo Abe advocated a free and open Indo-Pacific,\" Takaichi told the press conference.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-09T13:13:38Z",
    "source": "NPR"
  },
  {
    "id": "NzU=",
    "url": "https://www.npr.org/2026/02/09/nx-s1-5706515/china-media-tycoon-jimmy-lai-sentenced-20-years-hong-kong",
    "title": "China critic and former media tycoon Jimmy Lai sentenced to 20 years in Hong Kong",
    "summary": "China critic and former media tycoon Jimmy Lai sentenced to 20 years in Hong Kongtoggle caption Vincent Yu/APHONG KONG — Jimmy Lai, the pro-democracy former Hong Kong media tycoon and a fierce critic of Beijing, was sentenced on Monday to 20 years in prison in the longest punishment given so far under a China-imposed national security law that has virtually silenced the city's dissent.\n\"It signifies the total destruction of the Hong Kong legal system and the end of justice,\" he said.\nHong Kong leader John Lee said Lai's sentence demonstrated the rule of law, citing his serious crimes.\nHong Kong ranked 140th out of 180 territories in the press-freedom index compiled by media freedom organization Reporters Without Borders in 2025, far from its 18th place in 2002.\n\"Obviously, he has done nothing good for Hong Kong that could serve as a basis for his mitigation,\" he told reporters.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-09T07:52:28Z",
    "source": "NPR"
  },
  {
    "id": "NzY=",
    "url": "https://www.aljazeera.com/opinions/2026/2/8/iran-us-talks-in-muscat-bought-time-not-a-deal",
    "title": "Iran-US talks in Muscat bought time, not a deal",
    "summary": "The first round of Iran-US talks in Muscat produced no breakthrough.\nWhen Iranian and American negotiators concluded several hours of talks in Muscat on February 6, publicly, neither side signalled any shift from its opening position.\nDiplomacy conducted under military escortThe most striking feature of the Muscat round was not what was said, but who sat in the room.\nConsider the sequence of events surrounding the Muscat round itself.\nThe Muscat talks did not fail.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-08T07:04:06Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "Nzg=",
    "url": "https://www.yahoo.com/news/articles/russia-says-man-suspected-shooting-074544244.html",
    "title": "Russia says man suspected of shooting top general has been flown to Moscow from Dubai",
    "summary": "His wife told a Russian war blogger on Sunday that Alexeyev ‌had regained consciousness and was able to talk.\nRussia said Ukraine was behind the shooting but Kyiv has denied involvement.\nRussian media showed masked FSB officers escorting a blindfolded ⁠man from a small jet in Russia in the ‌dark.\nOne, Viktor Vasin, was detained in Moscow, while another, Zinaida Serebritskaya, escaped to Ukraine, Russian investigators said.\n'SERIOUS BLOW'The GRU, like the FSB, is a vast and powerful Russian intelligence agency that includes sleeper agents abroad, special forces units and advanced cyber capabilities.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-08T12:49:07Z",
    "source": "Yahoo Entertainment"
  }
]