[
  {
    "id": "MA==",
    "url": "https://www.wired.com/story/the-political-war-over-prediction-markets-is-just-getting-started/",
    "title": "The War Over Prediction Markets Is Just Getting Started",
    "summary": "The other insists they are just giving people access to legitimate financial markets already subject to adequate government oversight.\nOnce a niche financial experiment, prediction markets have rapidly become entrenched in mainstream culture, a transformation that has brought vast sums of money into play.\nBut critics say that prediction markets, at least in their current form, are exploitative.\nAttorneys general and gambling regulators in many states say sports contracts on prediction markets should follow state gambling laws.\nFederal lawmakers have also started weighing in; earlier this month, 23 Democratic senators voiced support for efforts to push prediction markets to abide by state gambling laws.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-20T10:30:00Z",
    "source": "Wired"
  },
  {
    "id": "Ng==",
    "url": "https://finance.yahoo.com/video/oil-prices-fair-target-amid-173000986.html",
    "title": "Oil prices: This would be a 'fair target' amid US–Iran tensions",
    "summary": "Mish, and I want to get to that too because I know you've been watching it.\nUm, you know, piled into all of the other stuff affecting inflation, we now have a potential conflict with Iran to contend with and the effect that that could have on oil prices.\nSo we've got oil prices that have now climbed over the past few sessions on concerns around that.\nSo, right now, I think $66 is a good pivotal area if you're looking at WTI oil.\nI think that's a fair target.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-20T19:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MTM=",
    "url": "https://www.aljazeera.com/news/2026/2/22/iran-us-tensions-what-would-blocking-strait-of-hormuz-mean-for-oil-lng",
    "title": "Iran-US tensions: What would blocking Strait of Hormuz mean for oil, LNG?",
    "summary": "Whenever tensions rise between Iran and the United States, one narrow waterway moves to the centre of global attention – the Strait of Hormuz.\nIranian authorities carried out live-fire military drills in the corridor, through which about 20 percent of global oil supplies are shipped.\nThe EIA estimated that in 2024, 84 percent of crude oil and condensate shipments transiting the strait headed to Asian markets.\nAdvertisementAny coordinated pressure on the Strait of Hormuz and Bab al-Mandab Strait would amplify risks for global shipping, energy markets and international trade.\nAlmost half of India’s crude oil imports and about 60 percent of its natural gas supplies move through the Strait of Hormuz.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-22T13:36:24Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MTU=",
    "url": "https://www.wired.com/story/leading-us-research-lab-appears-to-be-squeezing-out-foreign-scientists/",
    "title": "Leading US Research Lab Appears to Be Squeezing Out Foreign Scientists",
    "summary": "One of the US government’s top scientific research labs is taking steps that could drive away foreign scientists, a shift lawmakers and sources tell WIRED could cost the country valuable expertise and damage the agency’s credibility.\nThe National Institute of Standards and Technology (NIST) helps determine the frameworks underpinning everything from cybersecurity to semiconductor manufacturing.\nMany of the agency’s thousands of employees, postdoctoral scientists, contractors, and guest researchers are brought in from around the world for their specialized expertise.\nThe staffer, who spoke on the condition of anonymity because they were not authorized to speak to the media, says the Department of Commerce, which oversees NIST, originally pushed for banning all foreign researchers.\nNIST spokesperson Rich Press said the agency would respond to the lawmakers' letter \"through the appropriate channels.\"",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-20T10:00:00Z",
    "source": "Wired"
  },
  {
    "id": "MjA=",
    "url": "https://yro.slashdot.org/story/26/02/21/2140216/americas-peace-corps-announces-tech-corps-volunteers-to-help-bring-ai-to-foreign-countries",
    "title": "America's Peace Corps Announces 'Tech Corps' Volunteers to Help Bring AI to Foreign Countries",
    "summary": "Want to read Slashdot from your mobile device?\nPoint it at m.slashdot.org and keep reading!",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-02-21T21:43:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MjQ=",
    "url": "https://www.yahoo.com/news/articles/india-brazil-sign-mining-pact-122938477.html",
    "title": "India, Brazil sign mining pact as Modi targets $20 billion trade in five years",
    "summary": "Advertisement AdvertisementBrazil is among the world's top producers of iron ore and holds large reserves of minerals critical to steelmaking.\nINFRASTRUCTURE INVESTMENTThe cooperation will ⁠focus on attracting investment in exploration, mining and steel sector infrastructure, the statement said.\n\"We are committed to taking bilateral trade much beyond $20 billion in the next five years,\" Modi said.\n\"Our nations will also work closely in areas such as technology, innovation, digital public infrastructure, AI, semiconductors and more,\" ‌Modi said.\nLula on Thursday advocated for Brazil and India to conduct trade in their own currencies ​rather than settling transactions in ‌U.S.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-21T12:29:38Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDA=",
    "url": "https://www.npr.org/2026/02/22/nx-s1-5722854/pakistan-border-strikes-afghanistan-70-killed",
    "title": "Pakistan claims to have killed at least 70 militants in strikes along Afghan border",
    "summary": "Pakistan claims to have killed at least 70 militants in strikes along Afghan bordertoggle caption Hedayat Shah/APKABUL, Afghanistan — Pakistan's military killed at least 70 militants in strikes along the border with Afghanistan early Sunday, targeting what it described as hideouts of Pakistani militants it blamed for recent attacks inside the country, the deputy interior minister said.\nTalal Chaudhry, Pakistan's deputy interior minister, told Geo News that at least 70 militants were killed in the strikes.\nClearing rubble and burying the deadAfghanistan's Ministry of Foreign Affairs summoned Pakistan's ambassador to Kabul and handed him a note of protest over the Pakistani strikes.\nHabib Ullah, a local tribal elder, said those killed in the strikes were not militants.\nHours before the Pakistani strikes, a suicide bomber targeted a security convoy in the border district of Bannu in Pakistan's northwest, killing two soldiers, including a lieutenant colonel.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-22T15:55:39Z",
    "source": "NPR"
  },
  {
    "id": "NDQ=",
    "url": "https://www.aljazeera.com/video/newsfeed/2026/2/21/videos-show-aftermath-of-deadly-israeli-attacks-in-lebanon",
    "title": "Videos show aftermath of deadly Israeli attacks in Lebanon",
    "summary": "NewsFeed Videos show aftermath of deadly Israeli attacks in LebanonIsrael’s military has carried out air attacks on eastern Lebanon’s Bekaa Valley, with local media reporting at least 10 people killed and dozens wounded.\nEarlier, another attack hit Ein el-Hilweh, the country’s largest Palestinian refugee camp near Sidon, killing at least two people.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-21T08:25:34Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDc=",
    "url": "https://www.slashgear.com/2104134/us-gas-station-convenience-store-chain-owned-by-mexico/",
    "title": "The US Gas Station Convenience Stores You Might Not Know Are Owned By Mexico",
    "summary": "A transaction in October of 2024, between an American company and a Mexican one, resulted in a chain of U.S.-located gas station convenience stores being owned by the Mexican firm.\nThese retail operations consisted of 249 convenience stores that operated under the DK brand, located in New Mexico, Arkansas, and Texas.\nAs an oil products producer, it has a refining capacity of 302,000 barrels each day.\nThe Mexican company that bought the convenience stores at Delek's gas stations is called FEMSA.\nIt's a huge conglomerate that includes the OXXO chain of 28,800 convenience stores located in Mexico, Chile, Peru, Brazil, and Colombia.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-02-22T17:45:00Z",
    "source": "SlashGear"
  },
  {
    "id": "NDg=",
    "url": "https://www.npr.org/2026/02/21/nx-s1-5720226/kenya-ukraine-russia-war",
    "title": "'Given a gun and sent to die': Kenyans lured to fight for Russia in Ukraine",
    "summary": "'Given a gun and sent to die': Kenyans lured to fight for Russia in Ukrainetoggle caption Simon Maina/AFP via Getty ImagesNAIROBI, Kenya — In Sikonga village, Kisii County, a mother's wails fill the house.\nAccording to the intelligence report, 89 Kenyans remain on the frontline, 39 have been hospitalized, and 28 are missing in action.\nSponsor Message\"More telling is the collusion by officers at the Russian Embassy and the Kenyan Embassy in Moscow,\" Ichung'wah told Parliament.\nOpposition MP Joseph Makilap, who pushed for the intelligence report to be released, said the scale of the recruitment was staggering.\nAccording to the Kenyan intelligence report the recruitment networks involve both Kenyan and foreign actors.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-21T11:20:58Z",
    "source": "NPR"
  },
  {
    "id": "NTA=",
    "url": "https://www.npr.org/2026/02/21/nx-s1-5720966/trump-iran",
    "title": "With U.S. forces in position, Trump mulls his options for Iran",
    "summary": "With U.S. forces in position, Trump mulls his options for Irantoggle caption Saul Loeb/AFP via Getty ImagesPresident Trump says he hasn't decided whether he'll launch a military strike on Iran.\nSome days he sounds like he would be satisfied with a negotiated deal on the country's nuclear program.\n\"There is no military solution for Iran's nuclear program,\" he told the MS NOW program Morning Joe.\nTrump wants Iran to effectively give up its nuclear program.\nHowever, Trump has so far not made a major speech to the American people about the prospect of a new Middle East war.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-21T11:00:00Z",
    "source": "NPR"
  },
  {
    "id": "NTE=",
    "url": "https://indianexpress.com/article/cities/lucknow/yogi-to-leave-for-4-day-visit-to-singapore-japan-expansion-on-agenda-10545313/",
    "title": "Yogi to leave for 4-day visit to Singapore, Japan today; investment diplomacy boost, industrial expansion on agenda",
    "summary": "Yogi Adityanath has departed for a four-day visit to Singapore and Japan to attract investments and deepen industrial partnerships.\n(File Photo)Uttar Pradesh Chief Minister Yogi Adityanath will leave on Sunday evening for his four-day visit to Singapore and Japan aimed at strengthening the state’s investment diplomacy and industrial expansion.\nThis will be his first foreign visit after his Myanmar trip in 2017.\nA key highlight of the visit will be Government-to-Business (G2B) meetings and roundtable interactions, where CM Adityanath will engage directly with the investors.\nActing in the role of the state’s CEO, he will also present Uttar Pradesh’s industrial roadmap, policy stability, and business potential.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-22T03:56:59Z",
    "source": "The Indian Express"
  },
  {
    "id": "NTM=",
    "url": "https://www.businessinsider.com/who-is-susan-rice-netflix-board-member-trump-wants-fired-2026-2",
    "title": "Who is Susan Rice, the former national security advisor in Trump's crosshairs?",
    "summary": "President Donald Trump has demanded that Netflix remove former US ambassador and national security advisor Susan Rice from its board, stepping up his criticism of the streaming giant as it seeks to merge with Warner Bros.\nRice, who served in senior roles in the Obama and Biden administrations, recently warned companies against aligning with Trump.\nIn some situations, national security officials argue that knowing the person's identity is necessary to interpret and assess the intelligence information.\nAs UN Ambassador, Rice supported US intervention against Muammar Gaddafi.\nIn a 2025 column in The New York Times, Rice accused members of Trump's national security team of \"reckless negligence\" after they discussed sensitive national security matters on Signal.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-22T14:54:15Z",
    "source": "Business Insider"
  }
]