[
  {
    "url": "https://www.businessinsider.com/how-russia-gets-western-tech-fueling-missile-drone-attacks-2025-10",
    "title": "Russia's missiles and drones run on Western tech. Here's how it keeps getting the parts.",
    "summary": "Over three and a half years into the war, Ukraine is still finding thousands of foreign-made parts in the Russian missiles and drones raining down on its cities.\nThe findings highlight how Moscow continues to evade sanctions and export controls that were meant to choke off its weapons industry.\nThe components found in downed Russian drones and cruise and ballistic missiles range from microcomputers and sensors to switching connectors and converters.\nLast week, Ukrainian President Volodymyr Zelenskyy said over 100,000 foreign-made parts were found among the 550 Russian drones and missiles used in a large-scale bombardment, underscoring the scale of the problem.\nThe West has struggled to prevent Russia from obtaining foreign parts for its missiles and drones.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-10-17T14:40:35Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.bbc.com/news/articles/cew418r5rxdo",
    "title": "UK sanctions Russia's oil giants over Ukraine war",
    "summary": "The UK government is also pursuing a major Indian oil refinery and four Chinese oil terminals in a package of 90 new sanctions.\nBritain is targeting Russia's largest oil companies and the country's \"shadow fleet\" of oil tankers in a bid to cut off Vladimir Putin's ability to fund the war in Ukraine.\nThe two Russian oil firms export 3.1 million barrels of oil per day.\nA Russian embassy spokesperson said: \"Attacks on leading Russian oil and gas companies destabilise global energy markets and ultimately hit consumers worldwide.\"\nThe US separately has discussed putting additional tariffs on goods from China, up to 500%, tied to Beijing's purchases of Russian oil.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-15T14:24:39Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/satellites-reveal-americas-global-military-footprint-2025-10",
    "title": "Satellites reveal America's global military footprint",
    "summary": "Using satellite imagery and archive footage, we mapped out America's global military footprint.\nWe explore why new bases are being built while others are being left to rot, taking a firsthand look at the US's largest overseas base, which is in Southern Germany.\nWhat does the US overseas military \"empire\" tell us about the likelihood of conflict with China, Russia, and Iran?",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-17T16:25:05Z",
    "source": "Business Insider"
  },
  {
    "url": "https://gizmodo.com/the-kremlin-wants-elon-musk-to-build-a-tunnel-from-russia-to-the-u-s-2000673752",
    "title": "The Kremlin Wants Elon Musk to Build a Tunnel From Russia to the U.S.",
    "summary": "Building a tunnel across the Bering Strait, from Russia to Alaska, is an idea that’s been around since at least the 1950s.\n“@elonmusk, imagine connecting the US and Russia, the Americas and the Afro-Eurasia with the Putin-Trump Tunnel – a 70-mile link symbolizing unity.\nThousands of people being slaughtered each and every week — NO MORE, GO HOME TO YOUR FAMILIES IN PEACE!” Trump wrote.\nWe may or may not get a tunnel between the U.S. and Russia anytime soon.\nBut it feels like peace between Russia and Ukraine is further away than ever.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-17T23:55:29Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.businessinsider.com/us-army-wants-drones-like-russias-shaheds-2025-10",
    "title": "US general says the Army needs drones like the Shaheds Russia is slamming into Ukrainian cities",
    "summary": "Russia has been domestically producing its own versions of the Iranian-designed Shahed drones.\nRussia has been domestically producing its own versions of the Iranian-designed Shahed drones.\nIvan SAMOILOV / AFPRussia has been domestically producing its own versions of the Iranian-designed Shahed drones.\nIvan SAMOILOV / AFPThe US Army absolutely needs fast, cheap, and versatile long-range drones like Russia's Shahed-style drones, said the commanding general of the service's 25th Infantry Division out of Hawaii.\nRussia has been producing Geran drones, domestically manufactured versions of the Iranian-designed Shaheds, a family of loitering munitions that includes the notorious Shahed-136 initially supplied by Tehran to Moscow.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-16T20:24:49Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.bbc.com/news/articles/cvgdepnqk2jo",
    "title": "Russia intensifies strikes on Ukraine's trains in 'battle for the railways'",
    "summary": "Ukraine's 21,000km-long (13,000-mile) railway system is not merely a mode of transport, it is a central pillar of Ukraine's war effort and a powerful national symbol of resilience.\nKat Werner/BBC Russia is increasing its strikes on Ukraine's vast and vital rail networkHer train was hit earlier this month at a station in Shostka in the northern Sumy region.\nBalesta suggests Russia has been \"hunting for locomotives - deliberately targeting both freight and passenger trains\".\n\"Recently, a train from Kyiv to Sumy had to be rerouted, adding six hours due to safety reasons,\" says the UZ chief.\nKat Werner/BBC Kyiv central station is a major hub in Ukraine's rail network",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-15T23:04:20Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.theverge.com/news/801581/redmagic-11-pro-china-launch-liquid-cooling-8000mah-battery",
    "title": "Redmagic 11 Pro is the first phone with liquid cooling",
    "summary": "He previously worked at Android Police and Tech Advisor.\nRedmagic’s latest gaming phone has arrived in China with a neat trick up its sleeve: liquid cooling.\nIt’s an active liquid cooling system, as opposed to the passive vapor chamber systems that have become pretty common in high-end Android phones over the last few years, with a ceramic micro-pump to push liquid through the phone.\nThe other big selling point is a huge 8,000mAh battery, bigger even than the 7,500mAh cells in recent Xiaomi and Oppo phones.\nA Snapdragon 8 Elite Gen 5 handles the performance, with a 144Hz display, 120W wired charging, and haptic shoulder buttons too.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-17T13:18:08Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.bbc.com/news/articles/cwy534vw28go",
    "title": "Weapons smuggler jailed for 40 years after shipping ballistic missiles from Iran",
    "summary": "The 49-year-old was sentenced on Thursday, having been previously convicted on five counts - including terrorism offences and transporting weapons of mass destruction.\nCourt documents show the sentences for two of the five counts will run concurrently for 240 months, or 20 years.\nThe other three counts, another 20 years, will run consecutive to that - making a total of 480 months, or 40 years.\nThe packages, the US Navy would later discover, contained Iranian-made ballistic missile parts, anti-ship cruise missile components and a warhead.\nUS Department of Justice Among the cargo was this Iranian-made warhead, intended to form part of a ballistic missile",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-17T23:10:31Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cql9v6x4wpzo",
    "title": "Government will publish evidence in collapsed China case, PM says",
    "summary": "Government will publish evidence in collapsed China case, PM says3 days ago Share Save Becky Morton Political reporter Share SaveWatch: PM quotes Badenoch as previously saying China should not be called a \"foe\"The government will publish evidence submitted in the now-collapsed case against two men accused of spying for China, Sir Keir Starmer has said.\nDeputy national security adviser Matthew Collins provided three witness statements to prosecutors, which the prime minister said he intended to publish \"in full\".\nThe director of public prosecutions said the case collapsed because evidence could not be obtained from the government referring to China as a national security threat.\n\"He should have seen this case through, and let me be clear, a serious case involving national security has collapsed because this government is too weak to stand up to China.\"\nBarring any surprises, it is unlikely the publication of the witness statements will draw a line under the issue.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-10-15T02:00:00Z",
    "source": "BBC News"
  }
]