[
  {
    "id": "Ng==",
    "url": "https://www.npr.org/2026/01/23/nx-s1-5686526/trump-davos-world-order",
    "title": "At Davos, U.S. allies question a fraying world order",
    "summary": "The diplomatic whiplash was on full display in the Swiss ski resort of Davos, where the annual World Economic Forum unfolded against the backdrop of growing uncertainty about America's role as a global leader among Western democracies.\nA candid speech from CanadaThat unease was then voiced openly by several leaders in Davos.\nIt was a characterization that, two years ago, Macron would have intended for leaders like Presidents Xi Jinping and Vladimir Putin — but for many in the audience it seemed, this week, to target President Trump too.\nIn the same speech, Trump did appear to definitively rule out a U.S. invasion of Greenland, which is a semiautonomous territory of Denmark, a NATO ally.\nThe week in Davos began with sharp market reactions and diplomatic shocks, and ended without clear resolution.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-23T19:27:42Z",
    "source": "NPR"
  },
  {
    "id": "MTI=",
    "url": "https://www.yahoo.com/news/articles/frances-navy-intercepts-oil-tanker-142647802.html",
    "title": "France's navy intercepts an oil tanker in the Mediterranean sailing from Russia",
    "summary": "PARIS (AP) — France’s navy, working with intelligence provided by the United Kingdom, on Thursday intercepted an oil tanker in the Mediterranean Sea that traveled from Russia, in a mission targeting the sanctioned Russian shadow fleet, officials said.\nAdvertisement AdvertisementAdvertisement AdvertisementFrance and other countries have vowed to crack down on the sanction-busting shadow fleet of oil tankers which experts estimate numbers over 400 ships.\nRussia is using what is described as a “shadow fleet” to evade sanctions over its war on Ukraine.\n“The activities of the ‘shadow fleet’ contribute to financing the war of aggression against Ukraine,” Macron added.\nLast September, French naval forces boarded another oil tanker off the French Atlantic coas t that Macron also linked to the shadow fleet.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-22T14:26:47Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MTM=",
    "url": "https://www.npr.org/2026/01/22/g-s1-106787/up-first-newsletter-eu-emergency-meeting-trump-greenland-canada-scotus-fed",
    "title": "World leaders to hold emergency summit on Greenland. And, SCOTUS weighs Fed case",
    "summary": "World leaders to hold emergency summit on Greenland.\nToday's top storiesEuropean leaders will meet for an emergency summit tonight in response to President Trump's statements on Greenland.\nYesterday, after a meeting with NATO, Trump announced that a long-term agreement on Greenland had been reached.\nEven though Trump has called off the tariffs, the emergency summit will still be held with much less pressure than expected.\nSchultz says the leaders will most likely now discuss contingency plans in case the Greenland deal falls apart and the threats start again.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-22T12:06:59Z",
    "source": "NPR"
  },
  {
    "id": "MTQ=",
    "url": "https://www.bbc.com/news/articles/c62vke5dly2o",
    "title": "Captain of suspected Russian shadow tanker into French custody",
    "summary": "Captain of suspected Russian shadow tanker in French custody10 hours ago Share Save Thomas Mackintosh Share SaveReuters The Grinch was intercepted by the French navy on ThursdayFrench officials have taken the Indian captain of a suspected Russian shadow fleet tanker into custody days after the oil tanker was seized.\nOn Thursday, the French navy intercepted the tanker - named the Grinch - which President Emmanuel Macron said was \"subject to international sanctions and suspected of flying a false flag\".\nThe Grinch had been travelling through the Mediterranean Sea from the Russian Arctic port of Murmansk.\n\"The investigation aims to verify the validity of the flag used by the tanker,\" prosecutors said.\nMany Western countries imposed sanctions on Russian energy following Russia's full-scale invasion of Ukraine in 2022.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-25T15:25:52Z",
    "source": "BBC News"
  },
  {
    "id": "MTY=",
    "url": "https://finance.yahoo.com/news/china-keeps-low-profile-davos-190222962.html",
    "title": "China keeps low profile in Davos in pursuit of Western investment",
    "summary": "China is seen \"controlling the dynamic through stillness\", a senior global business leader told Reuters, a reference to a move from The Art of War, where you wait patiently for your enemy to exhaust themselves on the battlefield.\n\"(It will) just watch all the chaos happening all over the world, and steer its own course, China will win,\" a global business founder told Reuters this week in Davos.\nCanadian Prime Minister Mark Carney called the world's second largest economy a \"reliable and predictable partner\" during his recent visit and in Davos encouraged EU leaders to seek investment from China.\nBritain and China ⁠are working towards reviving the 'Golden Era' business dialogue during British ​Prime Minister Keir Starmer's visit next week, Reuters reported, citing ​sources.\nFinnish Prime Minister Petteri Orpo is also scheduled to visit China, with a business delegation spanning resources, manufacturing, resources and the food sector.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-23T19:02:22Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mzc=",
    "url": "https://www.npr.org/2026/01/23/g-s1-106993/vietnam-leader-to-lam-consolidates-power-as-country-targets-10-growth",
    "title": "Vietnam leader To Lam consolidates power as country targets 10% growth",
    "summary": "Lam, 68, pledged to accelerate economic growth and was reappointed unanimously by the 180-member Central Committee at the conclusion of the National Party Congress that ran from Monday through Friday.\nParty leaders say this will require moving beyond cheap labor and export-led growth toward productivity, technology and a stronger private sector.\n\"We must achieve double-digit growth to reach the set goals,\" Lam said.\nHiep, the analyst, said Lam's continued leadership would preserve Vietnam's political stability and signal economic and foreign policy continuity.\n\"If Vietnam isn't careful, the country may face significant economic problems within the next few years,\" he said.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-23T14:40:47Z",
    "source": "NPR"
  },
  {
    "id": "NDY=",
    "url": "https://www.bbc.com/news/articles/cwyr6p30054o",
    "title": "Peace talks on Russia-Ukraine war end as fighting rages",
    "summary": "Peace talks on Russia-Ukraine war end as fighting rages1 day ago Share Save Dearbail Jordan and Patrick Jackson Share SaveWatch: Firefighters battle blazes in Kyiv and Kharkiv after Russian strikesThe first three-way peace talks between Russia, Ukraine and the US have ended in Abu Dhabi with no apparent breakthrough, as fighting rages.\nThe two-day talks ended after waves of Russian air strikes targeted Ukraine's badly damaged energy infrastructure, killing one person and injuring 35 others, Ukrainian officials said.\nLater, it reported a Ukrainian missile attack on energy infrastructure in Belgorod.\nZelensky said for his part that \"the main target of the Russians\" had been the energy infrastructure.\nReuters Talks between Ukraine, Russia and the US are being hosted by the United Arab Emirates",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-01-24T07:59:48Z",
    "source": "BBC News"
  },
  {
    "id": "NTc=",
    "url": "https://www.yahoo.com/news/articles/brazil-takes-mexicos-diplomatic-representation-192701201.html",
    "title": "Brazil takes Mexico's diplomatic representation in Peru after spat over ex-PM asylum",
    "summary": "SAO PAULO, Jan 25 (Reuters) - Brazil will take over Mexico's diplomatic interests ​in Peru, Brasilia said on Sunday, ‌a couple of months after the Andean country ‌broke off relations with the North American nation over asylum for a former prime minister.\nLima severed relations with the Mexican ⁠government in ‌early November after Peru's former Prime Minister Betssy Chavez was granted ‍asylum in the Mexican embassy in the country.\nChavez, the last prime minister for Peru's ousted ​and now jailed former President Pedro ‌Castillo, faces conspiracy charges linked to Castillo's 2022 attempt to dissolve Congress.\nAdvertisement AdvertisementAdvertisement AdvertisementIn a statement, the Brazilian Foreign Ministry said it took the ⁠representation at the request ​of the Mexican government ​and with approval from Lima.\nBrazil said the representation includes the safekeeping ‍of the ⁠Mexican embassy's premises in Peru, including the residence of the head of ⁠mission, as well as its assets and archives.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-25T19:27:01Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTk=",
    "url": "https://www.npr.org/2026/01/23/nx-s1-5683204/abortion-trump-mexico-city-policy",
    "title": "Trump expands policy banning aid to groups abroad that discuss or provide abortions",
    "summary": "Trump expands policy banning aid to groups abroad that discuss or provide abortionstoggle caption Samantha Reinders for NPRFor over four decades, Republican presidents have banned U.S. funds from going to groups that provide or promote abortion — and Democratic presidents have reversed the ban.\nIn effect, she says the policy will make it harder for marginalized groups, including transgender people, to get health care.\nInitially, the policy was focused narrowly, banning U.S. money appropriated for family planning from going to groups that provide or promote abortion.\n\"This is an expansion of the likes we have never seen before,\" says Elisha Dunn-Georgiou , CEO of the Global Health Council, a nonprofit group that advocates for global health priorities.\nIn practice, the new policy could mean groups that focus on providing health care of any kind to transgender people abroad can't get U.S. funding.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-23T21:36:28Z",
    "source": "NPR"
  },
  {
    "id": "NjA=",
    "url": "https://www.bbc.com/news/articles/c9wxx29yknpo",
    "title": "Republic Day: How does India choose its chief guest for 26 January parade",
    "summary": "What India's Republic Day red carpet means for its foreign policy23 hours ago Share Save Nikita Yadav Share SaveEPA/Shutterstock The Republic Day parade is a display of India's culture, achievements and military mightIndia will mark its 77th Republic Day on 26 January - the day when the country adopted its constitution and formally became a republic, breaking from its colonial past.\nThe practice began in 1950 with the then Indonesian president, Sukarno, attending India's first Republic Day parade.\nIn its early years as a republic, India prioritised ties with other newly-independent countries - a focus reflected in its early choice of chief guests.\nGetty Images Queen Elizabeth II was the chief guest at India's Republic Day parade in 1961Since then, the parade has hosted leaders from across the world, reflecting shifts in India's global relations and strategic priorities.\nAFP via Getty Images Russian President Vladimir Putin attended the Republic Day parade in 2007",
    "category": "international",
    "bias": "right",
    "publishedAt": "2026-01-25T02:03:04Z",
    "source": "BBC News"
  },
  {
    "id": "NjE=",
    "url": "https://www.npr.org/2026/01/22/g-s1-106678/trump-allies-nato",
    "title": "Trump vs. U.S. allies: How will this end?",
    "summary": "Trump vs. U.S. allies: How will this end?\ntoggle caption Evan Vucci/APPresident Trump has backed off his threat to take Greenland by force.\nU.S. allies have often tried to appease Trump to avoid open confrontation.\n\"The American-dominated liberal world order is over,\" Robert Kagan, of the Brookings Institution, wrote in a recent essay in The Atlantic.\nThe American might that upheld the world order of the past 80 years will now be used instead to destroy it,\" Kagan said.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-22T10:00:00Z",
    "source": "NPR"
  },
  {
    "id": "NjI=",
    "url": "https://www.bbc.com/news/articles/cm244zlnmkvo",
    "title": "UK and European concerns made Trump back down on Greenland, says David Lammy",
    "summary": "Trump responded to UK and European concerns over Greenland, says Lammy3 days ago Share Save Paul Seddon Politics reporter Share SaveBBCDonald Trump backed down from his threats on Greenland because the UK stood up for the Danish territory's sovereignty, David Lammy has told the BBC.\nHe added that European countries were \"now back where we wanted to be, which is a negotiation, effectively\".\nHe then stepped up his public opposition to Trump on Wednesday, telling MPs he would not \"yield\" on Greenland's right to self-determination.\nLammy said in January last year, before his second term began, that Trump would not try to take Greenland by force.\nDonald Trump stepped back from any suggestion of force, and he stepped back from the use of tariffs,\" he added.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-01-23T05:59:34Z",
    "source": "BBC News"
  },
  {
    "id": "NjM=",
    "url": "https://www.bbc.com/news/articles/czr444j671vo",
    "title": "Trump 'wrong' to claim Nato troops avoided Afghanistan front line, Downing Street says",
    "summary": "Trump 'wrong' to claim Nato troops avoided Afghanistan front line, Downing Street says2 days ago Share Save Thomas Mackintosh and Sofia Ferreira Santos Share SaveWatch: Trump's comments 'extremely disrespectful', says British veteranDonald Trump was \"wrong\" to diminish the role of Nato and British troops in Afghanistan, Downing Street has said, after the US president claimed allies stayed away from the front line.\nFollow live: Downing Street says Trump 'wrong' to claim Nato troops avoided Afghanistan front line But Trump told Fox News on Thursday that he was \"not sure\" the military alliance would be there for the US \"if we ever needed them\".\nResponding on Friday, the prime minister's official spokesperson said: \"The president was wrong to diminish the role of Nato troops, including British forces.\"\nHe added that Nato troops made sacrifices \"in the service of collective security and in response to an attack on our ally\".\nWatch: Labour and Conservative MPs criticise Trump Afghanistan remarksLiberal Democrat leader Sir Ed Davey criticised the US president's remarks and said: \"Trump avoided military service five times.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-01-22T22:21:08Z",
    "source": "BBC News"
  },
  {
    "id": "NjQ=",
    "url": "https://www.yahoo.com/news/articles/trump-stirs-talk-world-order-235438659.html",
    "title": "Trump stirs talk of 'new world order' as leaders signal shifting global alliances",
    "summary": "Offended by Canadian Prime Minister Mark Carney's increasingly assertive posture toward the U.S., Trump revoked an invitation to join his Board of Peace.\nAppearing at the World Economic Forum, Trump spoke of imposing tariffs on Switzerland — which he ultimately lowered — because the country's leader “rubbed me the wrong way” during a phone call.\nBefore shelving sweeping tariffs on multiple European countries, Trump pressed Denmark to “say yes” to the U.S. push to control Greenland “and we will be very appreciative.\nBut leaders of other countries, who have spent much of Trump's administration trying to find ways to work with him, are increasingly vocal.\n“Remember that, Mark, the next time you make your statements.”Some leaders are pushing backCarney, however, was unbowed, speaking of Canada as “an example to a world at sea” as he crafted a potential template for other world leaders navigating a new era.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-23T23:54:38Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NjU=",
    "url": "https://www.npr.org/2026/01/22/g-s1-106799/board-of-peace-gaza-trump",
    "title": "Trump signs Board of Peace charter at Davos as allies split on Gaza plan",
    "summary": "Trump signs Board of Peace charter at Davos as allies split on Gaza plantoggle caption Chip Somodevilla/Getty ImagesDAVOS, Switzerland — President Trump on Thursday signed the founding charter of his proposed Board of Peace at the World Economic Forum.\nSponsor Message\"This isn't the United States — this is for the world,\" Trump said during the ceremony.\nFrom Gaza ceasefire to broader global ambitionsTrump's son-in-law Jared Kushner presented a slideshow in Davos with his vision for rehabilitating Gaza.\nHe presented simulated images of sleek skyscrapers on the shores of Gaza, and a master plan envisioning an airport and seaport.\nSponsor MessageUnder this charter, the Board of Peace would coordinate international assistance, support security arrangements, and help guide Gaza's post-conflict administration.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-22T18:45:50Z",
    "source": "NPR"
  },
  {
    "id": "Njk=",
    "url": "https://www.aljazeera.com/video/the-bottom-line/2026/1/25/why-is-trump-upending-80-years-of-us-foreign-policy",
    "title": "Why is Trump upending 80 years of US foreign policy?",
    "summary": "Former Trump official Christian Whiton argues it is about time to press ‘reset’ on US relations with the world.\nUnited States President Donald Trump realises “the rules-based international order” never existed, and he’s “willing to turn his back on that”, former Trump administration official Christian Whiton argues.\nWhiton tells Steve Clemons that US foreign policy remained fairly consistent over the past 80 years while Trump is happy to upset “the globalists and the establishment unity party in Washington – Republican and Democrat – and all the generals”.\nIn Europe, the US would like to see more populist, anti-immigration governments, Whiton said, adding that Western societies should “cast aside” the idea that they are “inherently racist, a patriarchy [with] … a racist, imperialist history”.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2026-01-25T16:01:59Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NzA=",
    "url": "https://www.npr.org/2026/01/24/nx-s1-5687236/canada-china-tariffs-trump",
    "title": "Trump threatens Canada with 100% tariffs over its new trade deal with China",
    "summary": "Trump threatens Canada with 100% tariffs over its new trade deal with Chinatoggle caption Jacques Boissinot/The Canadian Press via APWASHINGTON — President Donald Trump on Saturday threatened to impose a 100% tariff on goods imported from Canada if America's northern neighbor went ahead with its China trade deal.\nTrump initially had said that agreement was what Carney \"should be doing and it's a good thing for him to sign a trade deal.\"\nTrump had commented while in Davos, Switzerland, this week that \"Canada lives because of the United States.\"\nSpeaking in Davos before Trump, Carney said, \"Middle powers must act together because if you are not at the table, you are on the menu.\"\nAs for China, Canada had initially mirrored the United States by putting a 100% tariff on electric vehicles from Beijing and a 25% tariff on steel and aluminum.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-24T16:53:17Z",
    "source": "NPR"
  },
  {
    "id": "NzE=",
    "url": "https://abcnews.go.com/International/europe-play-power-game-trump-greenland-former-danish/story?id=129418834",
    "title": "Europe must 'play the power game' with Trump over Greenland, former Danish FM says",
    "summary": "Europe must 'play the power game' with Trump over Greenland, former Danish FM saysThe HDMS Knud Rasmussen ship of the Danish Navy patrols, January 20, 2026 near Nuuk, Greenland.\nThe HDMS Knud Rasmussen ship of the Danish Navy patrols, January 20, 2026 near Nuuk, Greenland.\nAurora borealis, also known as the northern lights, is seen in the sky above Nuuk, Greenland, Tuesday, Jan. 20, 2026.\nTrump has repeatedly said the U.S. will acquire Greenland -- \"one way or another,\" he said earlier this month.\nA sign reading \"Greenland is not for sale\" is pictured outside of a clothing shop in Nuuk, Greenland, on Jan. 19, 2026.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-23T10:08:35Z",
    "source": "ABC News"
  },
  {
    "id": "NzM=",
    "url": "https://www.cbsnews.com/news/golden-dome-for-america-trump-missile-defense-plan/?ftag=YHF4eb9d17",
    "title": "What is the \"Golden Dome\"? Here's what to know about Trump's missile defense plans",
    "summary": "What is the Golden Dome and how would it work?\nThe president was referring to Israel's Iron Dome defense system, which at least partially inspired the Golden Dome concept.\nChina respondsChina's foreign ministry has called on the U.S. \"to abandon the development and deployment of a global missile defense system as soon as possible.\"\nKarako said that the Golden Dome initiative was \"a belated realignment of U.S. missile defense policy\" to counter both China and Russia.\n\"Could [the Golden Dome] launch another spiral of offensive developments to try to break through?\"",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-22T16:50:07Z",
    "source": "CBS News"
  }
]