[
  {
    "url": "https://www.jpost.com/middle-east/iran-news/article-873298",
    "title": "NYT: Israel poised to strike Iran again",
    "summary": "Iran rebuilds as Israel signals readiness to strike again - NYT \"Israel feels the job is unfinished and sees no reason not to resume the conflict, so Iran is doubling down preparedness for the next round.\"\nMembers of the IRGC step on US and Israeli flags during the 46th anniversary of the U.S. expulsion from Iran, in Tehran, November 4, 2025.\n( photo credit : MAJID ASGARIPOUR/WANA (WEST ASIA NEWS AGENCY) VIA REUTERS )",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-11-10T10:30:43Z",
    "source": "The Jerusalem Post"
  },
  {
    "url": "https://www.bbc.com/news/articles/cvgvz6316zwo",
    "title": "Syria to join coalition to defeat IS group after Trump meeting",
    "summary": "The announcement came as President Donald Trump met Syrian President Ahmed al-Sharaa at the White House - the first such visit from a Syrian leader in the country's history.\nSyria will join the international coalition to combat the Islamic State group, marking a shift in US foreign policy in the Middle East, a senior Trump administration official has confirmed.\nBut since becoming interim Syrian president, al-Sharaa has worked to soften his public image as he tries to rebuild Syria, with foreign support, following 13 years of war.\n\"He has had a rough past,\" Trump said on Monday.\nIn June, President Trump signed an executive order lifting sanctions against Syria, which the White House said would help support the country's \"path to stability and peace\".",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-11-10T21:44:44Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/china-creates-visa-competing-us-050611905.html",
    "title": "China creates a new visa, competing with the US in wooing global tech talent",
    "summary": "China wants more foreign tech professionalsAdvertisement AdvertisementAdvertisement AdvertisementChina is striking while the iron is hot.\nA recent commentary published by a state-backed news outlet, the Shanghai Observer, downplayed such concerns, saying that bringing in such foreign professionals will benefit the economy.\n“Beijing will need to emphasize how select foreign talent can create, not take, local jobs,” said Michael Feller, chief strategist at consultancy Geopolitical Strategy.\nA country of about 1.4 billion, China had only an estimated 711,000 foreign workers residing in the country as of 2023.\nAdvertisement AdvertisementAdvertisement AdvertisementNikhil Swaminathan, an Indian H1-B visa holder working for a U.S. non-profit organization after finishing graduate school there, is interested in China’s K-visa but skeptical.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-11-10T05:06:11Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.aljazeera.com/news/2025/11/8/ukraines-fm-says-over-1400-africans-recruited-to-fight-for-russia-in-war",
    "title": "Ukraine says over 1,400 Africans recruited to fight for Russia in war",
    "summary": "Foreign minister accuses Russian government of luring recruits from African countries into ‘suicidal’ military contracts to bolster its war efforts.\nSpeaking on Friday, Sybiha accused Moscow of enticing Africans into joining the war and signing military contracts that were “equivalent to … a death sentence”.\n“Russia recruits nationals of African countries using a variety of methods.\nAccording to available information, at least 1436 citizens from 36 African countries are currently fighting in the ranks of Russia's invasion army in Ukraine.\nMany foreign recruits, according to reports, are promised high salaries, Russian citizenship, or noncombat roles, only to be sent straight to the battlefield.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-11-08T07:41:04Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://www.techdirt.com/2025/11/07/trump-cybersecurity-policy-is-indistinguishable-from-a-foreign-attack/",
    "title": "Trump Cybersecurity Policy Is Indistinguishable From A Foreign Attack",
    "summary": "Trump Cybersecurity Policy Is Indistinguishable From A Foreign Attackfrom the the-call-is-coming-from-inside-the-house deptLast year almost a dozen major U.S. ISPs were the victim of a massive, historic intrusion by Chinese hackers who managed to spy on public U.S. officials for more than a year.\nThe “Salt Typhoon” hack was so severe, the intruders spent much of the last year rooting around the ISP networks even after discovery.\nMany of the attack vectors were based on simple things like telecom administrators failing to change default passwords on sensitive hardware entry points.\nIt’s yet another example of how Trump policy is indistinguishable from a foreign attack.\nFiled Under: brendan carr, broadband, china, fcc, hacking, iran, privacy, russia, salt typhoon, security, telecom",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-11-07T13:22:00Z",
    "source": "Techdirt"
  },
  {
    "url": "https://theintercept.com/2025/11/08/nigeria-south-africa-trump-christian-nationalism/",
    "title": "How Christian Nationalism Is Shaping Trump’s Foreign Policy Toward Africa",
    "summary": "The president has justified prioritizing white South Africans by spreading misleading claims about the persecution and killings of white farmers.\nWhile Trump’s immigration and foreign policy stances in relation to these three countries may seem disjointed, experts on white supremacy and Christian nationalism told The Intercept that it all fit into the white Christian nationalist playbook.\nTrump’s strategy feeds into his base’s fears over immigration and demographic change while positioning the president as a defender of Christian values.\n“In Nigeria, it’s genocide against Christians, and in South Africa, it’s the supposed genocide against these white Afrikaners,” said Reyna.\nWhereas white, or “Western,” Christians in Africa should be brought into the United States.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-11-08T15:25:46Z",
    "source": "The Intercept"
  },
  {
    "url": "https://www.yahoo.com/news/articles/south-korean-foreign-minister-meets-065627184.html",
    "title": "South Korean foreign minister urges Cambodia's leader to fight online scams",
    "summary": "PHNOM PENH, Cambodia (AP) — South Korea’s foreign minister met Monday with Cambodian Prime Minister Hun Manet to pressure him to suppress burgeoning large-scale online scam operations that have been blamed for the brutal death of a Korean student.\nHis death triggered outrage in South Korea, prompting the government to send a delegation to Phnom Penh for urgent talks.\nForeign Minister Cho Hyun would raise the issue of cooperation to eradicate scam-related crimes in Cambodia and launching a joint police task force, Seoul's Foreign Ministry said.\nThe United Nations and other agencies have estimated that online scams earn international criminal gangs billions of dollars annually.\nAdvertisement AdvertisementAdvertisement AdvertisementScam centers in Cambodia are estimated to have about 200,000 workers including 1,000 South Koreans, according to South Korean officials.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-11-10T06:56:27Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/senate-democrat-questions-trump-administrations-184858899.html",
    "title": "Senate Democrat questions Trump administration's $7.5M payment to Equatorial Guinea",
    "summary": "WASHINGTON (AP) — The Trump administration made a $7.5 million payment to the government of Equatorial Guinea as it seeks to deport people to the West African country and draws closer to its heavily prosecuted leaders, according to the top Democratic senator on the Senate Foreign Relations Committee.\nShaheen said in her letter that the $7.5 million payment stood out because it would would “far exceed the amount of U.S. foreign assistance provided over the last 8 years combined” to the country.\nThe Trump administration, in aiming to ramp up deportations, has sought to forge agreements with countries to take in migrants who are not their citizens.\nBesides deportations, the U.S. is trying to counter Chinese influence in Equatorial Guinea and boost American oil and gas business interests there.\nEquatorial Guinea has challenged those asset seizures at the International Court of Justice.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-11-10T18:48:58Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/eu-tightens-visa-restrictions-russians-153827977.html",
    "title": "EU tightens visa restrictions on Russians over the Ukraine war and acts of sabotage",
    "summary": "Advertisement AdvertisementAdvertisement AdvertisementExceptions will be made for people “whose reliability and integrity is without doubt” like dissidents, independent journalists or human rights defenders, and for close family members of Russians living in the EU or family members of EU citizens living in Russia.\n“We now face unprecedented drone disruptions and sabotage on our soil,” EU foreign policy chief Kaja Kallas said in a statement announcing the stricter visa rules.\n“Travelling to and freely moving within the EU is a privilege not a given.”Russian Foreign Ministry spokeswoman Maria Zakharova bristled at the decision.\nAs a result, the number of visas issued to Russians drop from more than 4 million in 2019 to around 500,000 in 2023.\nThe new move makes visa applications more onerous but falls short of an outright ban.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-11-07T15:38:27Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/cj6n0k4x68no",
    "title": "A Kremlin target? Exiled Church figure Hilarion hits back at claims of spying",
    "summary": "I have never had any tasks or duties or requests on their part,\" says the former head of foreign relations of the Russian Orthodox Church, Metropolitan Hilarion.\nMetropolitan Hilarion was for many years a high-flyer in the Church and seen as likely successor to Patriarch Kirill.\nMetropolitan Hilarion admits mistakes in his treatment of Suzuki, but denies sexual harassment as well as spying.\nAround this time a new character, Veronica Suzuki, enters the story - his aide's grandmother, who had taken custody of George Suzuki as a child.\nIn another, Hilarion fires a pistol in a shooting range which George Suzuki alleges belongs to the FSB headquarters in Moscow.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-11-10T00:32:23Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.disclose.tv/id/wrbhq1fa5c/",
    "title": "Israel dumps millions into US influence targeting evangelicals in churches and ChatGPT",
    "summary": "Israel dumps millions into US influence targeting evangelicals in churches and ChatGPTSUMMARYIsrael's government has allocated millions in contracts to U.S. firms for public diplomacy efforts, targeting evangelical Christians and AI platforms like ChatGPT amid eroding support.\nTargeted Communications Global's $1.2 million Tourism Ministry contract engages influencers for travel promotion content.\nPew surveys show U.S. negative views of Israel rose from 42% in 2022 to 53% in 2025, with half of Republicans under 50 now holding negative opinions, up 15% since the Gaza war; young evangelicals no longer provide automatic support.\nA 2024 Tel Aviv University report confirms the shift among young evangelicals.\nThe government spent over $45 million in late 2025 on ads via Google, YouTube, X, and Outbrain.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-11-08T01:35:41Z",
    "source": "Disclose.tv"
  },
  {
    "url": "https://www.bbc.com/news/articles/c5yl939jvy5o",
    "title": "Iraq war graves: One man's mission to campaign for cemetery restoration",
    "summary": "One man's campaign for Commonwealth war graves restoration in Iraq2 days ago Share Save Jonathan Beale Defence correspondent Share SaveBen Soppit Ben Soppitt has been raising awareness about the conditions of Iraq's war cemeteriesThis Remembrance Sunday, Ben Soppitt will be honouring the sacrifice of his grandfather at Basra War Cemetery in Iraq.\nBen Soppitt says the Commonwealth War Graves Commission (CWGC) has \"catastrophically failed\" in its duty to honour the dead in Iraq.\nSince then, Basra War Cemetery has become a deserted wasteland, used by the locals for football or to dispose of rubbish.\nBen Soppitt Basra War Cemetery has become a deserted wasteland with children playing footballCWGC has promised to address this \"inequality in commemoration\", which has favoured British nationals.\nBen Soppitt Over the past two weeks, Ben Soppitt has been visiting most of the CWGC sites in Iraq",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-11-09T00:17:07Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.rt.com/news/627459-czech-republic-ukraine-aid/",
    "title": "Diplomacy not weapons: NATO member’s incoming govt on Ukraine policy",
    "summary": "In an interview published in Politico on Thursday, Filip Turek outlined the priorities of the new coalition, led by right-wing politician Andrej Babis’ ANO movement.\nIt was joined by two other Euroskeptic partners, the Freedom and Direct Democracy (SPD) party and the Motorists party, which Turek heads.\nPrague’s new cabinet, he added, will urge Brussels to “prioritize factory floors and family budgets over ideological agendas,” warning that current EU policies are undermining the bloc’s competitiveness.\nThe Czech presidency, which largely holds ceremonial powers, is held by former NATO Commander Petr Pavel, who shares the pro-Kiev stance.\nEU members are debating a “reparation loan” scheme using immobilized Russian assets as collateral, which presumes that Moscow would agree to pay it back.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-11-07T14:04:14Z",
    "source": "RT"
  },
  {
    "url": "https://www.bbc.com/news/articles/cp85dvnkpv4o",
    "title": "Trump gives Hungary one-year exemption from Russian energy sanctions",
    "summary": "Trump gives Hungary one-year exemption from Russian energy sanctions3 days ago Share Save Gary O'Donoghue, Chief North America Correspondent, Washington and Rachel Hagan Share SaveEPA/Shutterstock Hungary's Victor Orban (right) is one of Trump's closest European alliesDonald Trump has exempted Hungary from sanctions over its continued purchases of Russian oil and gas for one year, a White House official has confirmed to BBC News.\nIt comes after the US effectively blacklisted two of Russia's largest oil companies last month, threatening sanctions on those who buy from them.\nFollowing the meeting, Hungarian Foreign Minister Péter Szijjártó wrote on X that the US had given Budapest \"a full and unlimited exemption from sanctions on oil and gas\".\nThis decision by Trump marks a major victory for Orban, who had said the sanctions would ruin his country's economy.\nHe has promised \"cheap Russian energy\" to voters.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-11-07T22:25:06Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/king-charles-iii-leads-britains-111745088.html",
    "title": "King Charles III leads Britain's Remembrance Sunday ceremony for war dead",
    "summary": "LONDON (AP) — King Charles III led Britain’s annual ceremony of remembrance for the country’s war dead on Sunday, under November sunshine and the shadow cast across Europe by the almost 4-year-old war in Ukraine.\nAdvertisement AdvertisementAdvertisement AdvertisementThe national ceremony of remembrance is held every year on the nearest Sunday to the anniversary of the end of World War I on Nov. 11, 1918, at 11 a.m.\nSimilar memorial services are held in dozens of towns and cities across Britain and at U.K. military bases overseas.\nLike many other NATO members, Britain has increased its defense spending since Russia’s full-scale invasion of Ukraine in February 2022.\nAfter the wreath-laying, some 10,000 military veterans with gleaming medals marched past the Cenotaph, accompanied by jaunty military music and applauded by well-wishers lining the sidewalks.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-11-09T11:17:45Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://uk.news.yahoo.com/gas-gangrene-returns-europe-echoes-174412274.html",
    "title": "Gas gangrene returns to Ukraine in echoes of First World War trench warfare",
    "summary": "Ukrainian medics are reporting cases of gas gangrene, a condition once closely associated with the trenches of the First World War and long thought to have been all but eradicated in Europe.\n“These types of delayed evacuation times have never been seen in the last 50 years – probably since the Second World War, and maybe not even that.\nAdvertisement AdvertisementAdvertisement AdvertisementUsually, gangrene results from poor blood supply, does not involve bacterial toxins or gas formation, and develops much more slowly than gas gangrene.\n“Historically, it’s thought of as a World War One–era phenomenon.\nBunkers and basements are the only places drones cannot reach - Vyacheslav Madiyevskyy/REUTERSAccording to Alex, these underground facilities are ill-equipped to cope with the complications that cause gas gangrene.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-11-10T17:44:12Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.aljazeera.com/news/2025/11/10/un-warns-of-millions-displaced-by-climate-change-as-cop30-opens-in-brazil",
    "title": "UN warns of millions displaced by climate change as COP30 opens in Brazil",
    "summary": "Climate-related disasters and conflict have displaced millions of people across the globe, the United Nations has warned before the opening of its annual climate change conference.\nThe UNHCR added that climate change is also increasing the difficulties faced by those displaced by conflict and other driving forces.\n“Climate change is compounding and multiplying the challenges faced by those who have already been displaced, as well as their hosts, particularly in fragile and conflict-affected settings,” it continued.\nWeakening commitmentThe refugee agency’s report emphasised that while the effect of climate change is growing, the commitment towards dealing with it has been weakening.\nDeveloping nations, meanwhile, are concerned that it unfairly shifts the financial burden of climate action onto them.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-11-10T10:04:06Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://www.theatlantic.com/books/2025/11/what-translation-airpods-are-taking-away-from-us/684865/",
    "title": "The Costs of Instant Translation",
    "summary": "When I heard about the “Live Translation” feature of Apple’s newly released AirPods, what came to mind was my first night out in Berlin more than 20 years ago.\nThese moments weren’t just markers of intellectual progress; they signaled a redrawing of my perceptual and emotional boundaries that no automated translation could replicate.\nTranslation is less a matter of applying what I already know than of working slowly through uncertainty, allowing myself to be frustrated.\nThe rise of instantaneous AI translation could make drifting into insularity even easier, allowing users to “understand” the world without ever leaving the comfort of their linguistic home.\nThe same is true on a much larger scale: Translation work quietly undergirds the infrastructure of global life, including diplomacy, international law, commerce, education, and consumer transactions.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-11-10T14:00:00Z",
    "source": "The Atlantic"
  },
  {
    "url": "https://www.twz.com/news-features/can-u-s-intel-keep-up-with-chinas-tsunami-of-weapons-developments",
    "title": "Can U.S. Intel Keep Up With China’s Tsunami Of Weapons Developments?",
    "summary": "Not since the height of the Cold War have so many military advancements and individual adversary weapons programs flooded the space.\nU.S. intelligence capabilities are quite sophisticated and can collect considerable data on systems once they are deployed.\nHowever, it is more useful to anticipate future weapons or programs in development and this is probably much more difficult for U.S. intelligence to accurately determine due to the secretive nature of Chinese weapons programs.\nThus, U.S. intelligence is at some risk of being surprised by the emergence of new weapons systems.\nEven if you believe that U.S. military capabilities are qualitatively superior to Chinese capabilities (which, I do believe), the U.S. is a global power.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-11-07T18:11:35Z",
    "source": "Twz.com"
  },
  {
    "url": "https://www.aljazeera.com/features/2025/11/8/nigerians-demand-own-solutions-to-violence-as-trump-threatens-us-invasion",
    "title": "Nigerians demand own solutions to violence as Trump threatens US invasion",
    "summary": "Amid US claims of ‘Christian genocide’, locals and experts say crisis is multilayered, dismissing calls for foreign military intervention.\nDue to the violence, Miango’s residents have not been able to go to their farms, where armed men continue to attack and kill people.\nIn tackling the violence, Nigeria’s military has also launched operations to flush out attackers – but these have been criticised for ineffectiveness and apparent bias.\nExperts say what Trump interprets as the mass killing of Christians is in fact a multilayered crisis that affects many groups.\nInstead, Nigerians are worried it might exacerbate the situation, especially in a complex crisis where perpetrators live close to the community.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-11-08T07:11:52Z",
    "source": "Al Jazeera English"
  }
]