[
  {
    "url": "https://www.wired.com/story/how-to-travel-to-china/",
    "title": "What to Know About Traveling to China for Business",
    "summary": "Amid growing tensions and an escalating trade war between the United States and China, international business travelers may be understandably wary about traveling to the Chinese mainland.\nEach week there are 50 round-trip flights directly from the US to China, and in some cases China has made it easier to obtain business visas.\nWhen Stone Fish sees on-the-record comments from people working at global and US-based companies, he tends to see optimism about traveling to China and the environment there.\n“But when you have private conversations with them,” he says, “they’re a lot more pessimistic, and traveling to China on a business trip is more challenging than it used to be.”It wasn’t long ago that China was welcoming swelling numbers of foreigners, and international businesses and business travelers, across its borders.\nForeign companies were rushing to do business in China.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-08-06T13:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.bbc.com/news/articles/c5yl6eegv63o",
    "title": "Despite Trump’s peace calls, Russian attacks on Ukraine double since inauguration",
    "summary": "According to Ukrainian military intelligence, ballistic missile construction in Russia grew by 66% over the past year.\nDuring this period, Russian attacks on Ukraine briefly fell when compared with the final weeks of the Biden administration.\nAttacks peaked early last month, when Moscow launched 748 drones and missiles towards Ukraine on 9 July, according to the Ukrainian Air Force data.\nWhile Trump has expressed anger at the escalating Russian attacks on several occasions, his mounting frustration does not appear to have had an impact on Moscow's strategy.\nThe growing attacks have renewed calls for the US to send fresh supplies of Patriot anti-air batteries to Ukraine.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-08-05T23:35:07Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/russia-economy-oil-gas-energy-revenue-war-funding-india-trump-2025-8",
    "title": "The key pillar of Russia's war chest is cracking. The timing couldn't be worse.",
    "summary": "Russian President Vladimir Putin's administration is under increasing pressure to end the war in Ukraine.\nRussian President Vladimir Putin's administration is under increasing pressure to end the war in Ukraine.\nGetty ImagesRussian President Vladimir Putin's administration is under increasing pressure to end the war in Ukraine.\nLast week, Trump announced a 25% tariff on Indian goods and a \"penalty\" for its purchases of Russian oil.\nHowever, the bigger risk is if other major Russian oil buyers also start to avoid buying the commodity.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-08-06T07:39:29Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.bbc.com/news/articles/c74dzk744nvo",
    "title": "Sussex couple detained in Iran allowed to call home for first time",
    "summary": "Couple detained in Iran allowed first call home3 days ago Share Save Share SaveFamily handout Lindsay and Craig Foreman, from East Sussex, were arrested in JanuaryA British couple detained in Iran have been allowed their first phone calls home after several months of no direct contact.\nLindsay and Craig Foreman, from East Sussex, were on a once-in-a-lifetime trip around the world when they were detained by Iranian authorities in January and charged with espionage.\nMr Bennett, from Folkestone in Kent, said his parents were \"holding strong\".\nIt was revealed on Monday that Mr and Ms Foreman had been separated and were being held in what Mr Bennett called \"Iran's worst prisons\".\nWhile Mr Bennett said it was \"amazing\" to hear their voices, he continued that eyes should be \"firmly on the real issues\".",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-08-05T16:53:36Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.theverge.com/news/754269/trump-intel-ceo-lip-bu-tan-china",
    "title": "Trump demands CEO of Intel resign over ties to China",
    "summary": "President Donald Trump has called for Lip-Bu Tan to immediately resign as Intel’s CEO over his reported ties to Chinese tech firms.\nThe demand follows Arkansas Senator Tom Cotton questioning Intel’s board chairman whether Tan’s alleged connections to China would conflict with security regulations.\n“The CEO of INTEL is highly CONFLICTED and must resign, immediately,” Trump posted on Truth Social.\nThank you for your attention to this problem!”Tan was named Intel’s CEO in March to overhaul the struggling chipmaker’s business, after the board ejected his predecessor, Pat Gelsinger, three and a half years into a projected four-year turnaround plan.\nLast month, Intel said it’s laying off 24,000 employees this year and axing planned projects in Germany and Poland.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-08-07T14:25:28Z",
    "source": "The Verge"
  },
  {
    "url": "https://ca.news.yahoo.com/exclusive-putin-doubts-potency-trumps-104738158.html",
    "title": "Putin doubts potency of Trump's ultimatum to end the war, sources say",
    "summary": "FORCES ADVANCEThe first source said Putin was privately concerned about the recent deterioration of U.S. ties.\nAdvertisement AdvertisementAdvertisement AdvertisementRodgers, the author, said Putin has invested his political reputation and legacy in the war in Ukraine.\nRussia's military General Staff has told Putin that the Ukrainian front will crumble in two or three months, the first person said.\nAdvertisement AdvertisementAdvertisement Advertisement'HE'S MADE THREATS BEFORE'Trump's sanctions threat was \"painful and unpleasant,\" but not a catastrophe, the second source said.\nAdvertisement AdvertisementAdvertisement AdvertisementThe source called the offer a \"fantastic chance,\" but said stopping a war was much more difficult than starting it.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-08-05T10:47:38Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/cwyp7lgyy4ro",
    "title": "How Trump's 'secondary tariffs' on Russia could hit global economy",
    "summary": "He has announced that sweeping new secondary tariffs will impact any country still trading with Russia if a ceasefire with Ukraine is not agreed by Friday, 8 August.\nFurther secondary tariffs could see goods from any country that trades with Russia face a 100% tax when they are imported into the US.\nRussia remains the world's third biggest oil producer, behind only Saudi Arabia and the US itself.\nIf the tariffs work, they will cut the flow of Russian oil and gas to global markets.\nAdding 100% tariffs for buying Russian energy could significantly reduce the amount of goods sold by the EU to the US.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-08-05T23:36:18Z",
    "source": "BBC News"
  }
]