[
  {
    "id": "OA==",
    "url": "https://www.businessinsider.com/flew-9-hours-europe-best-airline-economy-cabin-turkish-food-2026-1",
    "title": "Flew 9 Hours in Europe's 'Best' Airline Economy Cabin; Food Impressed",
    "summary": "I flew on Turkish Airlines for nine hours to see what Europe's 'best' airlines has to offer.\nI flew on Turkish Airlines for nine hours to see what Europe's 'best' airlines has to offer.\nTaylor Rains/Business InsiderI flew on Turkish Airlines for nine hours to see what Europe's 'best' airlines has to offer.\nTaylor Rains/Business Insiderlighning bolt icon An icon in the shape of a lightning bolt.\nThe airline was named Europe's best economy class in the 2025 Skytrax awards, which evaluate cabin service, seating, and catering.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-01-31T10:35:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MTE=",
    "url": "https://www.aljazeera.com/news/2026/2/1/indias-budget-bets-on-infrastructure-manufacturing-amid-global-trade-war",
    "title": "India’s budget bets on infrastructure, manufacturing amid global trade war",
    "summary": "Indian Prime Minister Narendra Modi’s government has unveiled its annual budget, aiming for steady growth in an uncertain global economy rocked by recent tariff wars.\nFinance Minister Nirmala Sitharaman presented the budget for the 2026-2027 financial year in Parliament on Sunday, prioritising infrastructure and domestic manufacturing, with a total expenditure estimated at $583bn.\nIndia’s economy has so far weathered punitive tariffs of 50 percent imposed by United States President Donald Trump over New Delhi’s imports of Russian oil.\nDespite the past year’s challenges, the Indian economy has remained one of the world’s fastest growing.\nIt is a shade softer than this year’s projected 7.4 percent but still outpaces estimates by global institutions such as the World Bank.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-01T11:34:47Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "Mjk=",
    "url": "https://www.businessinsider.com/drones-may-not-change-infantry-job-uk-officer-2026-2",
    "title": "Infantry will still be fighting in muddy holes even as drones change war, British officer says",
    "summary": "Dmytro Smolienko/Ukrinform/NurPhoto via Getty ImagesDrones are prolific in Ukraine, but much of traditional land warfare also remains.\nBut Lt. Col Ben Irwin-Clark, the commanding officer of its 1st Battalion, told Business Insider that he believes most of an infantryman's job likely won't change even as drone technology proliferates.\nUkraine is pioneering drone warfare, but has had to rely on it so heavily amid shortages of other weaponry.\nThe Irish Guards are using drones in their exercises and training their soldiers in drone warfare.\nSinéad BakerThe British officer isn't alone in his thinking on the impact of drones on war and the infantry.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-02-01T11:31:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MzY=",
    "url": "https://www.businessinsider.com/western-forces-arctic-cold-is-one-of-their-toughest-enemies-2026-1",
    "title": "For Western Forces in Arctic, Cold Is One of Their Toughest Enemies",
    "summary": "Jake Epstein/Business InsiderIn Arctic warfare, surviving the elements is a fight all on its own.\nNATO soldiers training in Arctic warfare are learning that in a future conflict, fighting the enemy may be only half the battle.\nFinland's Jaeger Brigade teaches a monthlong course in Arctic warfare and cold-weather survival.\nJake Epstein/Business InsiderSoldiers learn skills such as navigating terrain, staying dry, and fighting in harsh conditions.\nJake Epstein/Business InsiderAs part of the course, soldiers participated in a combat exercise that included a ski assault.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-31T12:57:01Z",
    "source": "Business Insider"
  },
  {
    "id": "NDA=",
    "url": "https://www.businessinsider.com/american-moved-to-finland-lower-pay-better-work-life-balance-2026-1",
    "title": "I moved from the US to Finland for grad school and stayed to work. The pay is lower, but the work-life balance is great.",
    "summary": "Jordan Blake Banks said the work-life balance in Finland is much better than in the US.\nJordan Blake Banks said the work-life balance in Finland is much better than in the US.\nJordan Blake BanksJordan Blake Banks said the work-life balance in Finland is much better than in the US.\nJordan Blake BanksThis is an as-told-to essay based on a conversation with Jordan Blake Banks, an American and Finnish citizen who moved to Finland in 2019 for school and stayed to work.\nI graduated in May 2019 and moved to Finland about a month and a half later.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-31T09:14:01Z",
    "source": "Business Insider"
  },
  {
    "id": "NDE=",
    "url": "https://www.space.com/space-exploration/satellites/what-actually-happens-to-a-spacecraft-during-its-fiery-last-moments-heres-why-esa-wants-to-find-out",
    "title": "What actually happens to a spacecraft during its fiery last moments? Here's why ESA wants to find out",
    "summary": "What actually happens to a spacecraft during its fiery last moments?\nThat's the key question for the European Space Agency's (ESA) Destructive Reentry Assessment Container Object (Draco) mission.\n\"They also deposit ablation products directly into the upper atmosphere,\" Boley said.\n\"In-situ measurements are one important piece of the puzzle missing to better understand destructive spacecraft re-entry and its effects on the atmosphere,\" he told Space.com.\nDraco will be a single spacecraft reentry, with a specific trajectory, mass, and design, Anselmo said.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-01-31T11:00:00Z",
    "source": "Space.com"
  },
  {
    "id": "NTc=",
    "url": "https://www.bbc.com/news/articles/cnvgljj1dygo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "title": "Slovakia PM's national security adviser resigns over Epstein links",
    "summary": "Among them are images of the former Duke of York, who was stripped of his titles over his association with the disgraced financier, that appear to show the former prince kneeling on all fours over a female lying on the ground.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-01T08:37:29Z",
    "source": "BBC News"
  },
  {
    "id": "NTg=",
    "url": "https://www.businessinsider.com/moved-usa-to-malta-small-island-convenient-good-for-kids-2026-1",
    "title": "I moved my family from the US to Malta. Living on a small island has some unexpected conveniences.",
    "summary": "Christopher Mannino left the US and brought his family to the Mediterranean island Malta.\nCourtesy of Christopher ManninoChristopher Mannino left the US and brought his family to the Mediterranean island Malta.\nMannino and his family moved to Malta in June 2025.\nThere are some countries around the world, like Malta, where you can be a digital nomad.\nHere, we have really tried to make an effort to do a lot of family stuff.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-31T12:14:01Z",
    "source": "Business Insider"
  },
  {
    "id": "NTk=",
    "url": "https://www.yahoo.com/news/articles/modi-ally-proposes-social-media-042835088.html",
    "title": "Modi ally proposes social media ban for India's teens as global debate grows",
    "summary": "\"Not only are our children becoming addicted to social media, but India is also ‌one of the world's largest producers of data for foreign platforms,\" lawmaker L.S.K.\nFrance's National Assembly ‍this week backed legislation to ban children under 15 from social media, while Britain, Denmark and Greece are studying the issue.\nFacebook operator Meta, YouTube-parent Alphabet and X did not respond on Saturday to emails seeking comment on the ​Indian legislation.\nDevarayalu's 15-page Social Media (Age Restrictions and Online Safety) Bill, which is not public but was ⁠seen by Reuters, says no one under 16 \"shall be permitted ​to create, maintain, or hold\" a social media account and ​those found to have one should have them disabled.\n\"We are asking that the entire onus of ensuring users' age be placed on the social media platforms,\" Devarayalu ‍said.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-31T04:30:52Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NjE=",
    "url": "https://www.yahoo.com/news/articles/tens-thousands-czechs-rally-support-165426889.html",
    "title": "Tens of thousands of Czechs rally in support of President Pavel over dispute with foreign minister",
    "summary": "PRAGUE (AP) — Tens of thousands Czechs rallied Sunday in the capital and elsewhere to throw their weight behind President Petr Pavel in his dispute with the country’s foreign minister.\nMacinka accused the president of violating the country’s Constitution and threatened him with facing consequences if he fails to appoint his controversial associate.\nThe coalition has on its agenda to steer the country away from supporting Ukraine and reject some key European Union policies.\nUnlike the new government Pavel, a retired army general, is a staunch supporter of Ukraine in its fight against the Russian invasion.\nSmall rallies supporting Pavel took place in several other places across the country.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-01T16:54:26Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NjI=",
    "url": "https://www.aljazeera.com/features/2026/2/1/everyone-here-is-corrupt-what-fuels-the-balochistan-separatist-violence",
    "title": "‘Army alone can’t neutralise grievances’: What fuels Balochistan violence",
    "summary": "It was one of the biggest and most brazen attacks carried out by Baloch separatists, whose claim, however, of killing 84 Pakistani security personnel was dismissed by the authorities.\nYet, this narrative of dominance is punctuated by the sobering death toll: more than a dozen security personnel killed and civilian families caught in the crossfire.\nPakistan had released a video that appeared to show Jadhav confessing to facilitating attacks in Balochistan.\nGrievances fuelling rebellionOn the ground, the official Pakistani script reads differently.\nAs a security source told Al Jazeera: “A military can neutralise a militant, but it cannot neutralise a grievance.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-01T10:02:13Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NjM=",
    "url": "https://www.nature.com/articles/d41586-026-00196-6",
    "title": "China’s relationship with foreign scientific powers is changing rapidly",
    "summary": "He covered the subject in his PhD thesis1 and in a 2004 book called China’s Scientific Elite.\nBooming scienceThe authors point to China’s “worrisome” trend in undervaluing foreign education, a move “considered less conducive to institutional reforms and the attraction of talent from abroad”.\nBut they concede that this decline is because of China’s growing strength in higher education and research capabilities.\nThe CAS is the world’s leading institution in another Nature Index ranking of institutional output of scientific research in premier journals.\nA pattern of diminished international engagement, she adds, “would have implications not just for China, but for global scientific progress”.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-02T00:00:00Z",
    "source": "Nature.com"
  },
  {
    "id": "NjU=",
    "url": "https://www.yahoo.com/news/articles/syria-arrests-group-behind-mezzeh-185900776.html",
    "title": "Syria arrests group behind Mezzeh airport attacks, weapons traced to Hezbollah",
    "summary": "DAMASCUS, Feb 1 (Reuters) - Syria said on Sunday it had detained a group behind recent rocket ​attacks on the Mezzeh military airport in Damascus, ‌with investigators tracing the weapons to Iran-backed Hezbollah.\nThe weapons used in the attacks originated from Lebanon’s Hezbollah, an ally of ‍former President Bashar al-Assad that once had a large military presence across Syria supporting Assad’s army, the ministry said.\nAdvertisement AdvertisementHezbollah denied ​the allegations and said it had no activity or ‌ties with any group inside Syria.\nThe ministry said only that the detainees had links to unidentified \"foreign entities,\" without mentioning ⁠Hezbollah or Iran.\nSecurity sources say Hezbollah left behind weapons stockpiles, ⁠including drones, in parts of Syria after withdrawing its forces following ‌the collapse of Assad’s rule.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-01T18:59:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Njg=",
    "url": "https://www.nakedcapitalism.com/2026/01/how-a-us-israeli-strike-on-iran-could-ignite-a-wider-conflict.html",
    "title": "How a US/Israeli Strike on Iran Could Ignite a Wider Conflict",
    "summary": "In particular, this article underplays the possibility that Iran would close the Strait of Hormuz.\nThe Strait of Hormuz is an international sea passage and an essential trade corridor that supports regional economic prosperity.\nIran’s IRGC must do the same.\nThe US already has some 30,000 military personnel in the Middle East, with a carrier strike group now there as well.\nThe second is the big unknown when we look at how the IRGC and the Iranian military might react.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-31T11:51:59Z",
    "source": "Nakedcapitalism.com"
  },
  {
    "id": "Njk=",
    "url": "https://www.aljazeera.com/news/2026/1/31/russia-ukraine-war-list-of-key-events-day-1437",
    "title": "Russia-Ukraine war: List of key events, day 1,437",
    "summary": "Russia-Ukraine war: List of key events, day 1,437These are the key developments from day 1,437 of Russia’s war on Ukraine.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-31T00:32:02Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NzA=",
    "url": "https://www.yahoo.com/news/articles/us-ambassador-arrives-venezuela-reopen-223545153.html",
    "title": "New US charge d’affaires arrives in Venezuela to reopen diplomatic mission after 7 years",
    "summary": "CARACAS (AP) — U.S. charge d’affaires Laura Dogu arrived in Caracas on Saturday to reopen the American diplomatic mission in Venezuela after seven years of severed ties.\n“My team and I are ready to work,” Dogu said in a message posted by the U.S. Embassy in Venezuela 's account on X.\nAdvertisement AdvertisementVenezuela and the United States broke off diplomatic relations in February 2019 in a decision by Maduro.\nThey closed their embassies mutually after Trump gave public support to lawmaker Juan Guaidó who claimed to be the nation’s interim president in January that year.\n___Follow AP’s coverage of Latin America and the Caribbean at https://apnews.com/hub/latin-america___This story has been corrected to show that Dogu's title is charge d’affaires, not ambassador.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-01-31T22:35:45Z",
    "source": "Yahoo Entertainment"
  }
]