[
  {
    "url": "https://www.businessinsider.com/production-of-patriot-missiles-surging-demand-exceptionally-high-2025-8",
    "title": "Patriot missile production is surging, but the demand is insatiable",
    "summary": "US Army EuropeAmerican defense companies are cranking out Patriot interceptors at a record-breaking pace, but demand is surging.\nAmid global conflicts and growing worries in the West about a major conflict against a peer-level adversary, air defense missiles are in huge demand.\nMeanwhile, Boeing is surging PAC-3 missile seekers, critical components that enable the Patriot system to identify, track, and intercept threats, and Raytheon, which makes Patriot radars and launchers, is boosting PAC-2 interceptor missile production.\nA Patriot Air and Missile Defense launcher fires an interceptor.\nRaytheonHoffman cautioned that even if the West's production of missile interceptors, like the Patriots, exceeds Russian conventional ballistic missile production, \"this will not solve Europe's problems.\"",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-08-09T12:09:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/news/754987/senators-foreign-piracy-sites-block-beard-act",
    "title": "Senators are trying to force ISPs to block all foreign pirate sites",
    "summary": "Lawmakers have introduced a new bill aimed at countering “foreign piracy sites,” as reported earlier by TorrentFreak.\nThe bill, called the Block Bad Electronic Art and Recording Distributors (Block BEARD) Act, would allow copyright holders to ask a federal court to block piracy websites.\nEarlier this year, Representative Zoe Lofgren (D-CA) introduced the Foreign Anti-Digital Piracy Act (FADPA) in January, which would similarly compel ISPs to block foreign piracy websites.\nOver a decade ago, efforts to block piracy sites in the US were met with internet-wide blackouts that occurred in protest of proposed laws.\nDespite this, Schiff says the Block BEARD Act will “protect creators and consumers alike from foreign criminal enterprises seeking to steal our intellectual property and exploit Americans.”",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-08-07T16:45:10Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/news/754269/trump-intel-ceo-lip-bu-tan-china",
    "title": "Trump demands CEO of Intel resign over ties to China",
    "summary": "President Donald Trump has called for Lip-Bu Tan to immediately resign as Intel’s CEO over his reported ties to Chinese tech firms.\nThe demand follows Arkansas Senator Tom Cotton questioning Intel’s board chairman whether Tan’s alleged connections to China would conflict with security regulations.\n“The CEO of INTEL is highly CONFLICTED and must resign, immediately,” Trump posted on Truth Social.\nThank you for your attention to this problem!”Tan was named Intel’s CEO in March to overhaul the struggling chipmaker’s business, after the board ejected his predecessor, Pat Gelsinger, three and a half years into a projected four-year turnaround plan.\nLast month, Intel said it’s laying off 24,000 employees this year and axing planned projects in Germany and Poland.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-08-07T14:25:28Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.bbc.com/news/articles/czr68vde7nvo",
    "title": "The unlikely bond between JD Vance and David Lammy",
    "summary": "Faith, family and fishing: The unlikely bond between JD Vance and David Lammy2 days ago Share Save Kate Whannel Political reporter Share SavePA Media JD Vance and David Lammy fishing together at Chevening in KentUS Vice President JD Vance is taking his holiday in the UK - a trip which will include visits to the Cotswolds, Scotland and, to kick it all off, a few days staying with Foreign Secretary David Lammy at his grace-and-favour country home, Chevening House in Kent.\nYet, despite their differences Lammy and Vance appear to be the best of friends.\nVance went to Harvard's rival Yale - \"not quite as good,\" Lammy joked at Chevening.\nVance converted to Catholicism as an adult and attended Mass with Lammy when he visited Washington DC earlier this year.\nThe vice president is also meeting Conservative leader Kemi Badenoch and Reform UK's Nigel Farage has hinted that he may be as well.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-08-08T23:18:58Z",
    "source": "BBC News"
  },
  {
    "url": "https://gizmodo.com/china-opens-robot-mall-its-first-mall-for-robots-2000640691",
    "title": "China Opens ‘Robot Mall,’ Its First Mall for Robots",
    "summary": "The four-story Robot Mall, located in Beijing’s high-tech E-Town district, showcases more than 100 robots from over 40 brands, including Chinese companies like Ubtech Robotics and Unitree Robotics.\nThe opening of Robot Mall coincides with two major robotics conferences in the city this month.\nFriday was also the first day of the 2025 World Robot Conference, which runs through August 12.\nJust days later, Beijing will host the 2025 World Humanoid Robot Games, taking place from August 14 to 17.\nSome U.S. robotics companies, including Tesla and Boston Dynamics, have already called on lawmakers to develop a national strategy that can compete with China’s.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-08-08T16:40:25Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://gizmodo.com/nasa-told-to-overhaul-its-plans-to-replace-the-international-space-station-2000639959",
    "title": "NASA Told to Overhaul Its Plans to Replace the International Space Station",
    "summary": "For nearly 30 years, the International Space Station has played orbital home for astronauts from all over the world, but its time is running out.\nSlated to retire in 2030, NASA is aiming to replace it with a privately-run station that can host its astronauts in space when needed.\nIn a memo signed August 4, Duffy directs NASA to revise its Commercial Low Earth Orbit Destination program, which is designed to facilitate the development of commercial stations to replace the ISS.\nAnother major change is the revision to minimum capability requirements for an ISS replacement.\n“How was NASA’s previous strategy for commercial stations going to work when they lost close to a third of their budget?” Phil McAlister, previously the director of NASA’s Commercial Space Division, said in an interview with Ars Technica.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-08-07T15:27:23Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.theverge.com/tv/756298/paramount-plus-skydance-merger-complete-david-ellison",
    "title": "Paramount is now a Skydance Corporation",
    "summary": "It’s official: Skydance Media’s deal to purchase CBS parent company Paramount Global for $8 billion is complete, and incoming chairman / CEO David Ellison’s first order of business is a massive restructuring.\nIn an open letter about his plans for Paramount, a Skydance Corporation (the merged companies’ new name), Ellison announced that, going forward, the business will be split into three distinct units: studios, direct-to-consumer, and TV media.\nAnd beginning next year, the company plans to move Paramount Plus and Pluto TV onto “a unified technology stack” to boost performance and cut operational costs.\nAs Variety notes, closing the new deal cleared the way for Larry Ellison, Skydance, and RedBird Capital to buy out all of Paramount chairwoman Shari Redstone’s shares in National Amusements Inc. (NAI), which was the controlling shareholder of Paramount Global.\nIt was clear that the FCC would not sign off on the Paramount / Skydance merger until Paramount agreed to pay $16 million to settle Donald Trump’s lawsuit against the company over claims that CBS News edited a 60 Minutes interview with Kamala Harris in a way that misled voters during the 2024 elections.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-08-07T19:35:20Z",
    "source": "The Verge"
  },
  {
    "url": "https://sg.finance.yahoo.com/news/india-presses-global-code-conduct-130138798.html",
    "title": "India presses for global 'code of conduct' over pilot poaching",
    "summary": "The recent fatal crash of an Air India jetliner has sparked tighter scrutiny of the sector.\nIndia's Civil Aviation Ministry was not immediately available for comment.\nIndia's domestic aviation sector is led by IndiGo and Air India, while all major international airlines from Emirates to British Airways to Lufthansa operate regular flights.\nIn 2023, Air India exchanged barbs with Akasa Air over the poaching of pilots domestically.\nThe working paper asks for the creation of a code of conduct on the movement of skilled aviation workers among ICAO's member countries.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-08-07T13:01:38Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/top-20-cities-the-ultrawealthy-buy-second-homes-in-2025-2025-8",
    "title": "The top cities where the ultrawealthy are buying second homes in 2025 — and it's not just London or New York",
    "summary": "Ultra-high-net-worth buyers are flocking to Miami for second homes, drawn by its tax perks, lifestyle, and climate.\nUltra-high-net-worth buyers are flocking to Miami for second homes, drawn by its tax perks, lifestyle, and climate.\nJeff Greenberg/Jeffrey Greenberg/Universal Images Group via Getty ImagesUltra-high-net-worth buyers are flocking to Miami for second homes, drawn by its tax perks, lifestyle, and climate.\nA new report by wealth intelligence firm Altrata ranked the top 20 cities where ultra-high-net-worth individuals — defined as those with a net worth of at least $30 million — are buying second homes in 2025.\nThe top 20 cities for second homes in 2025The report ranked cities by the number of UHNW individuals who own a second residence in each location, looking at both US cities and cities in the rest of the world.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-08-09T10:30:02Z",
    "source": "Business Insider"
  }
]