[
  {
    "url": "https://www.theverge.com/policy/801110/eff-catch-and-revoke-visa-social-media-surveillance-lawsuit",
    "title": "Unions are trying to stop Trump from kicking out immigrants over social media posts",
    "summary": "The Trump administration’s heightened monitoring of immigrants’ social media accounts seeking grounds to revoke their visas stifles the speech rights of both noncitizens and citizens alike, the Electronic Frontier Foundation (EFF) alleges in a new lawsuit.\nIt claims that the policy effectively chills speech by encouraging individuals to self-censor to avoid being booted from the country.\nSome members have also limited their engagement with the unions themselves, it says, fearing retribution for public union activity.\n“We are not going to be importing activists into the United States,” he said, based on a transcript released by the State Department.\n“Otherwise, it doesn’t really mean very much.”Update, October 17th: Added State Department statement.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-16T19:21:10Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.bbc.com/news/articles/cg43lwwdwlno",
    "title": "Bolton pleads not guilty to charges of sharing classified information",
    "summary": "Bolton pleads not guilty to charges of sharing classified informationWatch: John Bolton arrives at federal court after indictmentThe indictment makes Bolton, 76, the third of the US president's political opponents to face charges in recent weeks.\nThe 18 charges stem from allegations he shared or retained sensitive materials, including some characterised as top secret.\nJohn Bolton, Donald Trump's former national security adviser, has pleaded not guilty to charges of mishandling classified information.\nBolton has been scrutinised for his handling of classified information since 2020, when he sought to publish a book about his time in the first Trump administration.\nBolton's indictment comes after Trump's Justice Department brought criminal charges against two of his political opponents: former FBI Director James Comey and New York Attorney General Letitia James.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-10-17T13:14:10Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cew418r5rxdo",
    "title": "UK sanctions Russia's oil giants over Ukraine war",
    "summary": "The UK government is also pursuing a major Indian oil refinery and four Chinese oil terminals in a package of 90 new sanctions.\nBritain is targeting Russia's largest oil companies and the country's \"shadow fleet\" of oil tankers in a bid to cut off Vladimir Putin's ability to fund the war in Ukraine.\nThe two Russian oil firms export 3.1 million barrels of oil per day.\nA Russian embassy spokesperson said: \"Attacks on leading Russian oil and gas companies destabilise global energy markets and ultimately hit consumers worldwide.\"\nThe US separately has discussed putting additional tariffs on goods from China, up to 500%, tied to Beijing's purchases of Russian oil.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-15T14:24:39Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/how-russia-gets-western-tech-fueling-missile-drone-attacks-2025-10",
    "title": "Russia's missiles and drones run on Western tech. Here's how it keeps getting the parts.",
    "summary": "Over three and a half years into the war, Ukraine is still finding thousands of foreign-made parts in the Russian missiles and drones raining down on its cities.\nThe findings highlight how Moscow continues to evade sanctions and export controls that were meant to choke off its weapons industry.\nThe components found in downed Russian drones and cruise and ballistic missiles range from microcomputers and sensors to switching connectors and converters.\nLast week, Ukrainian President Volodymyr Zelenskyy said over 100,000 foreign-made parts were found among the 550 Russian drones and missiles used in a large-scale bombardment, underscoring the scale of the problem.\nThe West has struggled to prevent Russia from obtaining foreign parts for its missiles and drones.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-10-17T14:40:35Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.macrumors.com/2025/10/16/tim-cook-to-increase-investment-in-china/",
    "title": "Apple CEO Tim Cook Pledges to Increase Investment in China",
    "summary": "Apple CEO Tim Cook pledged to expand the company's investments in China during his latest visit to the country, signaling that Apple intends to maintain a strong presence in its most important manufacturing hub even as it continues diversifying production elsewhere, Reuters reports.\nDuring meetings with Chinese government officials this week, Cook told China's industry minister Li Lecheng that Apple will keep investing in the country, with ongoing commitment to its Chinese supply chain and operations.\nLecheng told Cook that China hopes Apple will continue to expand in the country and \"grow together with Chinese suppliers,\" adding that the government intends to foster a favorable business environment for foreign companies.\nCook's latest assurances in China underscore that, despite diversification efforts, China remains integral to Apple's global operations.\nU.S. regulators have intensified scrutiny of American firms operating in China, while Chinese authorities have increased oversight of foreign technology companies.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-16T12:51:02Z",
    "source": "MacRumors"
  },
  {
    "url": "https://www.bbc.com/news/articles/cdx495n0qn9o",
    "title": "Louisiana resident assisted in Hamas 7 October attack, US says",
    "summary": "Louisiana resident assisted in Hamas 7 October attack, US saysA year after the attack, Mr al-Muhtadi allegedly travelled to the US on a fraudulent visa and became a permanent resident.\nUS prosecutors have accused a Louisiana resident of participating in the 7 October attack by Hamas on Israel, recently unsealed court documents show.\nMr al-Muhtadi sent messages asking others to bring a bulletproof vest for another man and ammunition, prosecutors allege.\nThe complaint said that Mr al-Muhtadi denied ever having been involved in terrorist activities on his US visa application.\nThe documents do not accuse Mr al-Muhtadi of specific crimes or killings.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-18T14:02:48Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/c3vnk3w0z69o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "title": "Dhanteras: Why India's Diwali gold rush is different this year",
    "summary": "But with prices - gold is up 60% and silver 70% - shooting through the roof, jewellers are having to change tack to counter stagnant customer budgets.\nWhile gold jewellery continues to account for the largest share of India's overall gold demand, the proportion driven by investment - primarily bars and coins - has been rising steadily, according to the World Gold Council (WGC).\nBesides retail demand, gold prices are also being significantly influenced by India's central bank, with the metal's share in its foreign exchange reserves rising from 9% to 14% in 2025, according to WGC.\nIn fact, the Reserve Bank of India (RBI) has been \"a major pillar of global gold demand over the past three years\", said Kaynat Chainwala who tracks commodities at Kotak Securities, a broking house.\nNurPhoto via Getty Images Many Hindus purchase gold and silver during Diwali for good luck and prosperity",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-17T23:44:14Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/united-takes-jab-rivals-delta-american-ife-club-lounge-entertainment-2025-10",
    "title": "United Just Threw Some Shade at Delta and American",
    "summary": "It tweaked American Airlines, too.\nAmerican Airlines has a tablet holder on its seatbacks instead of a screen.\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to knowResponding to a request for comment from Business Insider, a Delta spokesperson said: \"We are always evaluating our policies and strategy to ensure the best possible Club experience.\n\"Over 90% of our customers already fly with their own devices — ones they upgrade, know, and prefer,\" an American spokesperson told Business Insider.\n\"As such, American is focused on investing in fast connections and free entertainment, enjoyed on the devices our customers choose.\"",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-16T19:12:32Z",
    "source": "Business Insider"
  },
  {
    "url": "https://japantoday.com/category/politics/japan-actively-promoted-expo-diplomacy-amid-unstable-global-geopolitics",
    "title": "Japan actively promoted 'expo diplomacy' amid unstable global geopolitics",
    "summary": "Outgoing Japanese Prime Minister Shigeru Ishiba's government actively promoted \"expo diplomacy\" during the World Exposition in Osaka, holding numerous meetings with foreign leaders amid growing global instability, government officials said.\nForeign Minister Takeshi Iwaya said at a press conference late last week, \"The prime minister held about 50 meetings, and I had around 40 related to the expo.\nThe number of meetings held by Ishiba exceeded the roughly 30 conducted by then Prime Minister Junichiro Koizumi during the 2005 expo in Aichi Prefecture, the ministry said.\nAbout 90 heads of state and government leaders from abroad attended the Osaka expo.\nSince the Osaka expo opened in April, dignitaries from countries with limited prior ties to Japan have traveled there, providing what a government source described as \"valuable opportunities for in-depth dialogue at the leadership level.\"",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-18T20:48:54Z",
    "source": "Japan Today"
  },
  {
    "url": "https://www.jezebel.com/only-15-people-agree-to-report-on-pete-hegseths-push-ups",
    "title": "Only 15 People Agree to Report on Pete Hegseth’s Push-Ups",
    "summary": "In fact, only 15 signed the new agreement—not 15 outlets, 15 journalists.\nBut if the last nine months of the Trump administration are any indication, it’ll be a daily report of how many push-ups Hegseth completed that afternoon.\nWhatever the Pentagon’s plan is, the message is clear: the American people can’t ask questions, and the press can’t report freely.\nIf I were Pete, I also wouldn’t want the press reporting on how bad I was at my job.\nPlus, you’ll be supporting independent journalism—which, can you even imagine not supporting independent journalism in times like these?",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-10-17T10:59:18Z",
    "source": "Jezebel"
  },
  {
    "url": "https://www.aljazeera.com/news/2025/10/16/panamas-president-alleges-us-threatening-to-revoke-visas-over-china-ties",
    "title": "Panama’s president alleges US threatening to revoke visas over China ties",
    "summary": "Panama President Jose Raul Mulino said that someone at the United States Embassy has been threatening to cancel the visas of Panamanian officials.\nHis statements come as the administration of US President Donald Trump pressures Panama to limit its ties to China.\nBut in September, the US Department of State said in a statement that the country was committed to countering China’s influence in Central America.\nIn April, former Costa Rica President and Nobel Peace Prize winner Oscar Arias said the US had cancelled his visa.\n“They’re free to give and take a visa to anyone they want, but not threatening that, ‘If you don’t do something, I’ll take the visa,'” Mulino said Thursday.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-16T20:20:39Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://www.aljazeera.com/news/2025/10/18/iran-says-restrictions-on-nuclear-programme-terminated-as-deal-expires",
    "title": "Iran says restrictions on nuclear programme ‘terminated’ as deal expires",
    "summary": "Iran also expresses commitment to diplomacy as landmark 10-year nuclear deal with Western powers officially ends.\nIran has said it is no longer bound by restrictions on its nuclear programme as a landmark 10-year deal between it and world powers expired, though Tehran reiterated its “commitment to diplomacy”.\nAdvertisementWestern powers and Israel have long accused Iran of seeking to acquire nuclear weapons, a claim Tehran denies.\nNuclear talks between Iran and world powers are currently deadlocked.\nOn Monday, Trump said he wanted a peace deal with Iran, but stressed the ball was in Tehran’s court.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-18T09:21:25Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://gizmodo.com/china-is-racing-ahead-in-ev-sales-as-us-retreats-from-the-industry-2000672543",
    "title": "China Is Racing Ahead in EV Sales as US Retreats From the Industry",
    "summary": "The U.S. electric vehicle industry is in a crisis.\nFord CEO Jim Farley indicated that the company will pivot to focus on partial electrification instead of fully electric models.\nGlobal electric vehicle sales hit a record 2.1 million in September, according to market research firm Rho Motion.\nThat record was only partially driven by U.S. buyers rushing to get electric vehicles before the end of the electric vehicle tax credit.\nThe electric vehicle tax credit expired two weeks ago, delivering a much-feared sledgehammer to the EV industry as it tries to scale in the U.S.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-15T16:05:10Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.henleyglobal.com/newsroom/press-releases/henley-global-mobility-report-oct-2025",
    "title": "US Passport Power Falls to Historic Low",
    "summary": "For the first time since the Henley Passport Index was created 20 years ago, the United States is no longer ranked amongst the world’s Top 10 most powerful passports.\nDr. Christian H. Kaelin, Chairman of Henley & Partners and creator of the Henley Passport Index, says these seemingly small changes have had outsized consequences — underscoring just how finely balanced the global mobility landscape has become.\nOn the Henley Openness Index, China has also risen dramatically, granting visa-free access to an additional 30 countries in the past year alone.\nHenley & Partners data shows that Americans have become by far the largest group of applicants for investment migration programs in 2025.\nHenley & Partners also runs the world’s leading government advisory practice for wealth migration, which has raised more than USD 15 billion in foreign direct investment.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-15T17:20:40Z",
    "source": "Henleyglobal.com"
  },
  {
    "url": "https://www.businessinsider.com/us-army-wants-drones-like-russias-shaheds-2025-10",
    "title": "US general says the Army needs drones like the Shaheds Russia is slamming into Ukrainian cities",
    "summary": "Russia has been domestically producing its own versions of the Iranian-designed Shahed drones.\nRussia has been domestically producing its own versions of the Iranian-designed Shahed drones.\nIvan SAMOILOV / AFPRussia has been domestically producing its own versions of the Iranian-designed Shahed drones.\nIvan SAMOILOV / AFPThe US Army absolutely needs fast, cheap, and versatile long-range drones like Russia's Shahed-style drones, said the commanding general of the service's 25th Infantry Division out of Hawaii.\nRussia has been producing Geran drones, domestically manufactured versions of the Iranian-designed Shaheds, a family of loitering munitions that includes the notorious Shahed-136 initially supplied by Tehran to Moscow.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-16T20:24:49Z",
    "source": "Business Insider"
  },
  {
    "url": "https://finance.yahoo.com/video/trade-war-advisor-says-china-055703610.html",
    "title": "Trade War: Advisor Says China Can Walk Away Without Deal",
    "summary": "Wu Xinbo, an advisor to China's Ministry of Foreign Affairs who also heads Fudan University's Center for American Studies, says Beijing is prepared for worst case scenarios in its trade war with the US.\nSpeaking on \"Bloomberg: The China Show,\" he says China will not beg for negotiations and can walk away from talks without reaching an agreement.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-16T05:57:03Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essentials-mains-answer-practice-gs-2-week-124-10308511/",
    "title": "UPSC Essentials | Mains answer practice — GS 2: Questions on India’s ability to leverage its home-grown digital public infrastructure and Thailand–Cambodia border diplomacy (Week 124)",
    "summary": "UPSC Essentials brings to you its initiative for the practice of Mains answer writing.\nStory continues below this adQUESTION 2With reference to the Thailand–Cambodia dispute over Preah Vihear, discuss how cultural-historical claims complicate border diplomacy, and suggest ways for peaceful resolution.\n— At the centre of the border dispute is the Preah Vihear temple, known in Thai as Phra Viharn.\nThai troops occupied Preah Vihear in 1954, prompting Cambodia to take the matter to the International Court of Justice (ICJ).\n(2021)Previous Mains Answer PracticeUPSC Essentials: Mains answer practice — GS 3 (Week 122)UPSC Essentials: Mains answer practice — GS 3 (Week 123)UPSC Essentials: Mains answer practice — GS 2 (Week 122)UPSC Essentials: Mains answer practice — GS 2 (Week 123)UPSC Essentials: Mains answer practice — GS 1 (Week 123)UPSC Essentials: Mains answer practice — GS 1 (Week 122)Subscribe to our UPSC newsletter and stay updated with the news cues from the past week.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-10-15T11:14:30Z",
    "source": "The Indian Express"
  },
  {
    "url": "https://www.bbc.com/news/articles/c70jw0nylrgo",
    "title": "Trump tariffs: India's exports to US plunge as 50% tariffs weigh",
    "summary": "September was the first full month of Washington's 50% tariffs on Indian goods, which kicked in on 27 August.\nIndia's goods exports to the US, its largest foreign market, dropped sharply by 20% in September and nearly 40% in the last four months, as Trump's steep tariffs took effect, data shows.\nThe drop in exports have also contributed to India's trade deficit (the gap between what a country imports and exports), which widened to a 13-month high of $32.15 billion in September.\nSome of the reduction in exports to the US was cushioned by improved trade with countries like the UAE and China.\nFor years, Washington has pushed for greater access to India's farm sector, seeing it as a major untapped market.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-16T06:10:02Z",
    "source": "BBC News"
  },
  {
    "url": "https://yro.slashdot.org/story/25/10/16/1934236/chinese-criminals-made-more-than-1-billion-from-those-annoying-texts",
    "title": "Chinese Criminals Made More Than $1 Billion From Those Annoying Texts",
    "summary": "The U.S. is awash with scam text messages.\nOfficials say it has become a billion-dollar, highly sophisticated business benefiting criminals in China.\nFrom a report:",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-16T20:51:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://www.techmeme.com/251017/p21",
    "title": "Techmeme: A look at the challenges facing Europe's chip industry, as the EU will likely fail to increase its 10% global chip manufacturing share to a targeted 20% by 2030 (Foreign Affairs)",
    "summary": "About This PageThis is a Techmeme archive page.\nIt shows how the site appeared at 5:45 PM ET, October 17, 2025.\nThe most current version of the site as always is available at our home page.\nTo view an earlier snapshot click here and then modify the date indicated.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-10-17T14:00:37Z",
    "source": "Techmeme.com"
  }
]