[
  {
    "id": "MTE=",
    "url": "https://finance.yahoo.com/news/disney-ceo-meets-top-chinese-062820621.html",
    "title": "Disney CEO meets top Chinese official as 'House of Mouse' navigates US‑China tensions",
    "summary": "BEIJING, Jan 9 (Reuters) - One of China's top officials met with Disney CEO Bob Iger in Beijing on Friday, state media ​reported, as the \"House of Mouse\" seeks to strengthen its foothold ‌in the world's second-largest economy amid fraught U.S.-China tensions.\nFor three decades, Beijing has capped Hollywood imports at just 10 films a year, and it has made significant headway in steering Chinese audiences toward domestically produced movies in the world's second-largest film market.\nChinese moviegoers propelled \"Ne Zha 2\" past Pixar's \"Inside Out 2\" to make it the ⁠highest‑grossing animated film of all time last ​year.\nHollywood films account for only 5% of ​overall box office receipts in China's markets, analysts estimate.\n\"Disney is full of confidence in China's development and will continue to expand investment in ‌China,\" Iger was quoted as saying.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-09T06:28:20Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDg=",
    "url": "https://www.bbc.com/news/articles/cwygjvkvpgro",
    "title": "Colombia sees 'real threat' of US military action, president tells BBC",
    "summary": "Colombia sees 'real threat' of US military action, president tells BBC4 days ago Share Save Ione Wells BBC South America Correspondent, in Bogotá Share SaveWatch: BBC speaks to Colombian President Gustavo PetroColombia's President Gustavo Petro has told the BBC that he believes there is now a \"real threat\" of US military action against Colombia.\nIt comes after Trump said a military operation in Colombia \"sounds good\".\nFollowing US strikes on Venezuela and the seizure of Nicolás Maduro, US President Donald Trump said a military operation targeting Colombia \"sounds good\".\nAfter Trump's comments threatening military action in Colombia, demonstrations were held across the country in the name of sovereignty and democracy.\nPetro confirmed he had also spoken to Delcy Rodríguez, Venezuela's acting president and former vice president and oil minister, and invited her to Colombia.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-01-09T06:02:31Z",
    "source": "BBC News"
  },
  {
    "id": "NTM=",
    "url": "https://www.yahoo.com/news/articles/unhappy-putin-sends-message-west-171804776.html",
    "title": "'Unhappy' Putin sends message to West with Ukraine strike on EU border",
    "summary": "Russia's Oreshnik missile attack in Ukraine near the EU border aims to intimidate Kyiv's Western allies and signals Vladimir Putin's displeasure at recent foreign policy setbacks including in Venezuela, analysts said Friday.\nLviv mayor Andriy Sadovy said on Facebook the strike was \"a new level of threat -- not only for Ukraine, but also for the security of Europe\".\n\"This should probably be seen as a message to European countries,\" he said, adding the result of the strike was \"probably more psychological than operational\".\nTimothy Ash, an emerging market economist focused on Russia, struck a similar note, pointing to relatively limited damage on the ground after the missile strike.\nWhile Russia calls the Oreshnik a hypersonic missile, Western defence analysts say it is not a revolutionary weapon.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-09T17:18:04Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTk=",
    "url": "https://www.yahoo.com/news/articles/pope-blasts-countries-using-force-111023563.html",
    "title": "The pope in a major foreign policy address blasts how countries are using force to assert dominion",
    "summary": "“War is back in vogue and a zeal for war is spreading,” Leo told ambassadors from around the world who represent their countries’ interests at the Holy See.\nAdvertisement AdvertisementAdvertisement AdvertisementThe occasion was the pope’s annual audience with the Vatican diplomatic corps, which traditionally amounts to his yearly foreign policy address.\nIn his first such encounter, history’s first U.S.-born pope delivered much more than the traditional roundup of global hotspots.\n“The principle established after the Second World War, which prohibited nations from using force to violate the borders of others, has been completely undermined.”“Instead, peace is sought through weapons as a condition for asserting one’s own dominion.\n___Associated Press religion coverage receives support through the AP’s collaboration with The Conversation US, with funding from Lilly Endowment Inc.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-01-09T11:10:23Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NjA=",
    "url": "https://www.theregister.com/2026/01/09/alleged_russian_ransom_payment_negotiator/",
    "title": "France swaps alleged ransomware crook for conflict researche",
    "summary": "France has released an alleged ransomware crook wanted by the US in exchange for a conflict researcher imprisoned in Russia.\nSpecializing in the Ukraine war, Vinatier's work focused on communicating between states mired in conflict, outside of official channels.\nKasatkin, 26, was accused of aiding ransomware negotiations between a major, unnamed cybercrime outfit and around 900 victims, including two US federal departments.\nOn August 1, 2024, the largest exchange of prisoners since the Cold War took place between Russia and the West.\nTwenty-four individuals were freed in total: 16 for the West, and eight Russians, including several cybercriminals and state assassin Vadim Krasikov.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-01-09T16:07:46Z",
    "source": "Theregister.com"
  },
  {
    "id": "NjE=",
    "url": "https://www.yahoo.com/news/articles/yemen-completes-evacuation-stranded-tourists-150409845.html",
    "title": "Yemen completes evacuation of stranded tourists on Socotra island",
    "summary": "Jan 10 (Reuters) - Yemen completed on Saturday the evacuation of more than ​600 tourists who had been ‌stranded on the remote Yemeni island of Socotra ‌after the United Arab Emirates withdrew its troops from Yemen last week amid a rift with Saudi Arabia.\nFour flights ⁠operated by Yemenia ‌Airways, Yemen's national carrier, transported 609 tourists to Saudi Arabia's ‍city of Jeddah, the Yemeni Foreign Ministry said in a statement.\nAir traffic at the ​island's main airport came to a ‌halt as a deepening crisis between the UAE and Saudi Arabia translated into fresh conflict on Yemen's mainland, where the two Gulf powers now back ⁠opposing groups in the ​country's civil war.\nAdvertisement AdvertisementAdvertisement AdvertisementSocotra, which ​lies more than 300 km (186 miles) south of Yemen's coast and ‍until recently ⁠was mainly accessible by air via the UAE, has been a haven ⁠of tranquillity through the years of conflict ‌on the mainland.\n(Reporting by Hatem MaherEditing ‌by Mark Potter)",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-10T15:04:09Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NjI=",
    "url": "https://www.newyorker.com/podcast/political-scene/is-donald-trump-creating-the-conditions-for-another-world-war",
    "title": "Is Donald Trump Creating the Conditions for Another World War?",
    "summary": "Listen and subscribe: Apple | Spotify | Google | Wherever You ListenSign up to receive our twice-weekly News & Politics newsletter.\nThe Washington Roundtable discusses Donald Trump’s use of force in Venezuela, his desire to take over Greenland, and the historical echoes of the Administration’s new imperialist projects.\nThe panel also considers Trump’s brand of “narcissistic unilateralism” and the increased risks of global conflict when foreign policy is based on one man’s whims.\n“Donald Trump wants to write his name into history,” the staff writer Susan B. Glasser says.\n“He wants every single person in the world to have to exchange their map for one of the United States that looks different, that looks bigger, and that everybody for all eternity will say, ‘Donald Trump did this.’ ”This week’s reading:“Why Donald Trump Wants Greenland (and Everything Else),” by Susan B. Glasser“Minneapolis Grieves, Again,” by E. Tammy Kim“What Will Become of Venezuela’s Political Prisoners?,” by Stephania Taladrid“The Dramatic Arraignment of Nicolás Maduro,” by Cristian Farias“The Former Trump Skeptics Getting Behind His War in Venezuela,” by Isaac Chotiner“Jack Smith’s Closing Argument,” by Ruth Marcus“Marjorie Taylor Greene’s Big Breakup,” by Charles BetheaTune in to The Political Scene wherever you get your podcasts.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-01-10T04:59:00Z",
    "source": "The New Yorker"
  },
  {
    "id": "NjM=",
    "url": "https://www.bbc.com/news/articles/c041n3ng03no",
    "title": "What Trump's vision of the new world order means for Europe",
    "summary": "America led the creation of Nato, the World Bank, the IMF and the United Nations.\n\"The degree to which control of the canal is necessary to the United States cannot be overstated.\"\nUnder the new strategy, the United States will no longer pressure authoritarian regimes to improve their human rights records.\nAnd one of its policies for doing this is by \"cultivating resistance to Europe's current trajectory within European nations\".\n\"The Europeans have become very dependent upon the United States, and this was a matter of choice: it was cheaper and simpler.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-09T12:11:35Z",
    "source": "BBC News"
  },
  {
    "id": "NjQ=",
    "url": "https://newrepublic.com/article/205076/trump-doctrine-disaster-venezuela-lincoln",
    "title": "Trump’s Foreign Policy Madness Will Haunt Us for Generations",
    "summary": "Some officials described it as a “law enforcement operation,” citing a 2020 federal grand jury indictment against Maduro.\nOthers suggested that the Trump administration would now try to now control the rest of the New World more aggressively.\nTrump and his top officials have threatened additional military action in Colombia, Cuba, and Mexico.\nAs many as 73 percent of voters oppose the use of military force to seize Greenland, according to one post-Maduro poll.\nTrump sits atop the executive branch, which is little more than a vehicle for his personal whims and desires.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-01-09T11:00:00Z",
    "source": "The New Republic"
  },
  {
    "id": "NjU=",
    "url": "https://www.bbc.com/news/articles/cj9rengvnp9o",
    "title": "Iran medics describe hospitals overwhelmed with dead and injured protesters",
    "summary": "'There wasn't even time for CPR': Iran medics describe hospitals overwhelmed with dead and injured protesters2 days ago Share Save Soroush Pakzad , Roja Assadi , BBC News Persian, and Helen Sullivan Share SaveWatch: Government building on fire as protests continue in Karaj, IranStaff at several hospitals in Iran have told the BBC their facilities are overwhelmed with dead or injured patients, as major anti-government protests continue.\nReacting to the latest developments, President Trump posted on social media: \"Iran is looking at FREEDOM, perhaps like never before.\nHundreds of protesters are believed to have been killed or injured, and many more detained.\nA doctor at a medical centre in Tehran told the BBC: \"The number of injured people and fatalities was very high.\nBut former UK ambassador to Iran Sir Simon Gass told BBC Radio 4's Today programme that \"we really shouldn't get too ahead of ourselves\" when discussing regime change.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-10T08:25:06Z",
    "source": "BBC News"
  },
  {
    "id": "NjY=",
    "url": "https://www.aljazeera.com/news/2026/1/9/why-is-pakistan-selling-its-jf-17-fighter-jets-to-bangladesh-and-others",
    "title": "Why is Pakistan selling its JF-17 fighter jets to Bangladesh and others?",
    "summary": "Islamabad’s defence diplomacy is driving new interest in the JF-17 fighter jet following Pakistan-India clashes.\nBefore the JF-17, Pakistan was primarily relying on French manufacturer Dassault’s Mirage III and Mirage 5, as well as Chinese J-7 fighter planes.\nThe Pakistan Air Force says the jet offers high manoeuvrability at medium and low altitudes and combines firepower, agility and survivability, making it “a potent platform for any air force”.\nWith the plane’s entire assembly carried out in Kamra, Pakistan is the primary seller of the JF-17 fighter plane, including its after-sales services.\nFighter jets, he added, are a long-term commitment, with service lives of three to four decades.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-01-09T09:34:31Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "Njc=",
    "url": "https://www.aljazeera.com/video/inside-story/2026/1/9/why-is-the-us-quitting-international-organisations",
    "title": "Why is the US quitting international organisations?",
    "summary": "There are more signs that the United States is disengaging from the global order established after World War II.\nPresident Donald Trump has ordered his administration to pull out of more than 60 agencies, half of them part of the United Nations.\nTrump argues that being a member of these organisations is contrary to his country’s interests.\nThis move has prompted global outrage, with the UN saying its ‘responsibility to deliver’ will not waver.\nPresenter: James BaysGuests:Adolfo Franco – Republican strategist and former adviser to US Senator John McCainAndrew Gilmour – Former UN assistant secretary-general for human rightsMatthew Duss – Executive VP of the Center for International Policy and a former foreign policy adviser to Senator Bernie Sanders",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-01-09T21:59:53Z",
    "source": "Al Jazeera English"
  }
]