[
  {
    "id": "NA==",
    "url": "https://www.bbc.com/news/videos/crrx2y0jwpvo",
    "title": "Analysis: Trump's main themes and who he hoped to win over",
    "summary": "US President Donald Trump delivered his State of the Union address at the US Capitol, outlining his administration's accomplishments and his vision for the year ahead.\nDuring his wide-ranging speech, which lasted 1 hour and 48 minutes, Trump made the case that America had improved under his watch.\nThe BBC's Daniel Bush takes a closer look at Trump's main themes of immigration and the economy - and who he was looking to appeal to with his address.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-25T08:08:52Z",
    "source": "BBC News"
  },
  {
    "id": "OA==",
    "url": "https://abcnews.com/Politics/fact-checking-trumps-state-union-address/story?id=130459365",
    "title": "Fact-checking Trump's State of the Union address",
    "summary": "President Donald Trump delivers the State of the Union address in the House Chamber of the US Capitol in Washington, February 24, 2026.\nPresident Donald Trump delivers the State of the Union address in the House Chamber of the US Capitol in Washington, February 24, 2026.\nPresident Donald Trump delivers the State of the Union address in the House Chamber of the US Capitol in Washington, February 24, 2026.\nPresident Donald Trump delivers the State of the Union address in the House Chamber of the US Capitol in Washington, February 24, 2026.\n\"Every branch of our armed forces is setting records for recruitment,\" Trump said during the State of the Union address.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-25T02:32:33Z",
    "source": "Abcnews.com"
  },
  {
    "id": "MTA=",
    "url": "https://www.businessinsider.com/trump-calls-scotus-tariff-ruling-unfortunate-state-of-the-union2026-2",
    "title": "Trump Calls the SCOTUS Tariff Ruling 'Unfortunate' in National Address",
    "summary": "President Donald Trump called the Supreme Court's decision that overturned his signature tariffs \"unfortunate\" during his State of the Union address.\nTrump addressed the nation several days after the Supreme Court ruled against most of his 2025 tariffs that were enacted under the International Emergency Economic Powers Act.\nImmediately after the SCOTUS ruling, Trump signed an executive order to impose a 10% \"global tariff\" under Section 122 of the Trade Act of 1974.\nCongressional action will not be necessary,\" said Trump of his new 10% \"global tariffs\" at the State of the Union.\nThe landmark SCOTUS ruling was made at a time when concerns about affordability and economic health were widespread.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-02-25T03:32:34Z",
    "source": "Business Insider"
  },
  {
    "id": "MTI=",
    "url": "https://abcnews.com/Politics/state-union-trump-expected-tout-achievements-ahead-midterms/story?id=130387697",
    "title": "State of the Union: Trump expected to tout achievements ahead of midterms",
    "summary": "Earlier, she posted on X that “In one year, President Trump has turned our country around from the brink of disaster, and he will rightly declare the State of Our Union is strong, prosperous and respected.\"\nPresident Donald Trump speaks during a press briefing at the White House, Friday, Feb. 20, 2026, in Washington.\nPresident Donald Trump visits Coosa Steel Corporation in Rome, Ga., Thursday, Feb. 19, 2026.\nDonald Trump delivers remarks during a working breakfast with governors in the State Dining Room at the White House on February 20, 2026 in Washington, DC.\nPresident Donald Trump during an event to proclaim \"Angel Family Day\" in the East Room of the White House, February 23, 2026, in Washington.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-24T11:19:45Z",
    "source": "Abcnews.com"
  },
  {
    "id": "MzM=",
    "url": "https://www.yahoo.com/news/articles/putin-tells-fsb-better-protect-140100982.html",
    "title": "Putin tells FSB to better protect energy sector, warns foes against pushing Moscow too far",
    "summary": "MOSCOW, Feb 24 (Reuters) - President Vladimir Putin on Tuesday ordered the FSB security service to step ‌up protection of Russia's energy and transport infrastructure in ‌response to Ukrainian attacks that he said were conducted with the ​help of Western intelligence.\nPutin, speaking on the fourth anniversary of the war, said Russia's enemies would regret it if they pushed Moscow too far.\nUkraine has repeatedly attacked Russian oil depots, refineries and ports in the course of the ‌war, and Moscow blames it for ​a series of assassinations of ​senior military figures.\nPutin, in ​televised remarks, suggested that Russian energy pipelines ‌under the Black Sea could ​be targeted.\nHe issued ​an order to \"strengthen the anti-terrorist protection of energy and transport infrastructure and public gathering places, provide maximum ​coverage for critical ‌facilities, and, if necessary, equip them with additional ​security measures.\"",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-24T14:01:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzU=",
    "url": "https://www.businessinsider.com/what-country-richest-people-moving-2026-2",
    "title": "The mega-rich are moving. Here's where they're going.",
    "summary": "In 2018, only 108,000 extremely wealthy individuals emigrated to a new country.\nSwitzerland, for example, has a lump-sum tax scheme that uses a taxpayer's lifestyle expenses as a surrogate tax base, rather than taxing global income and assets.\nThe UAE doesn't levy income tax; instead, it relies on a 5% value-added tax.\nMany of the global wealthy are relocating to cities that offer entrepreneurial freedom, often lacking in more bureaucratic regions.\nWith growing restrictions on travel to many countries, wealthy individuals are applying for second residencies or even multiple citizenships as a safeguard.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-23T08:33:01Z",
    "source": "Business Insider"
  },
  {
    "id": "Mzg=",
    "url": "https://www.bbc.com/news/articles/c4gj20xzw39o",
    "title": "Four years into its full-scale war in Ukraine, Russia is feeling the effects",
    "summary": "The Russian authorities do not release casualty figures for the so-called \"special military operation\".\nBut Russia is known to have suffered huge battlefield losses.\nSo many of the towns and villages I've visited in the last two years have had museums and monuments dedicated to soldiers killed in Ukraine, as well as separate sections for recent war dead at local cemeteries.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-23T06:01:59Z",
    "source": "BBC News"
  },
  {
    "id": "Mzk=",
    "url": "https://www.npr.org/2026/02/25/nx-s1-5717096/trump-congress-state-union-highlights",
    "title": "5 takeaways from Trump's State of the Union address",
    "summary": "5 takeaways from Trump's State of the Union addresstoggle caption Chip Somodevilla/Getty ImagesStay up to date with our Politics newsletter, sent weekly.\nOnly one president in U.S. history has gone before Congress during a State of the Union address and said that the state of the union was \"not good.\"\nIt wasn't President Trump on Tuesday.\nState of the Union addresses can sometimes descend into laundry lists of things the president wants Congress to accomplish.\nThere were only about half a dozen specific things Trump asked Congress to do:\"Codify\" Trump's attempts to lower drug prices , though it's unclear how.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-25T09:08:29Z",
    "source": "NPR"
  },
  {
    "id": "NDA=",
    "url": "https://www.businessinsider.com/biggest-moments-from-donald-trumps-state-of-the-union-2026-2",
    "title": "Biggest moments from Trump's State of the Union",
    "summary": "Share icon An curved arrow pointing right.\nLinkedIn Copy LinkDescription Angle down icon An icon in the shape of an angle pointing down.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-25T05:37:10Z",
    "source": "Business Insider"
  },
  {
    "id": "NDI=",
    "url": "https://www.aljazeera.com/features/2026/2/24/yemens-mogadishu-somali-refugees-face-poverty-instability-in-aden",
    "title": "Yemen’s ‘Mogadishu’: Somali refugees face poverty, instability in Aden",
    "summary": "Aden, Yemen – Lying on the outskirts of Yemen’s interim capital, Aden, al-Basateen district starts where the paved roads end, stretching into narrow, sandy alleyways.\nIt reveals a decades-old refugee story in which Arabic blends with Somali and the faces harbour memories of a different place, across the sea.\nToday, local sources estimate the district’s population at more than 40,000, with people of Somali origin making up the majority.\nSome arrived as children holding the hands of relatives, while others were born in Aden and have known no other home.\nA mother of four, she was born in Aden to Somali parents.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-24T19:12:47Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDY=",
    "url": "https://www.npr.org/2026/02/24/nx-s1-5711346/china-trump-us-foreign-aid-withdrawal",
    "title": "China and the U.S. alter foreign aid strategies",
    "summary": "In those days, China itself was receiving aid from the Soviet Union, says Carrie Dolan, an expert on Chinese health aid at the College of William and Mary.\nChina framed its foreign aid as mutually beneficial with countries in the global south, promoting economic cooperation and increasing trade.\nU.S. foreign aid grants, Brazys says, also tended to focus on long-term solutions and came with conditions for governments, such as improving human rights, democracy and corruption.\nStill, China spent about the same overall on foreign aid in 2025 as it did in previous years, says Bryan Burgess , who tracks China's aid spending at the College of William and Mary.\nHowever, it's clear that China will try to increase its influence through foreign aid, as the U.S presence appears to wane, she says.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-24T20:50:39Z",
    "source": "NPR"
  },
  {
    "id": "NDc=",
    "url": "https://abcnews.com/Politics/iran-looms-large-trumps-state-union-address-analysis/story?id=130387861",
    "title": "Iran looms large over Trump's State of the Union address: ANALYSIS",
    "summary": "\"Everything that has been written about a potential War with Iran has been written incorrectly, and purposefully so,\" Trump continued.\n\"I think Iran is harder to do.\"\nPresident Donald Trump delivers his State of the Union address to a joint session of Congress on Capitol Hill in Washington, Jan. 30, 2018.\nAmbiguity on exactly what he wants out of any military action in Iran could play to his favor, O’Hanlon says.\n\"I don't think he's going to get caught up in just the Iran specifics,\" O’Hanlon said.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-24T19:50:36Z",
    "source": "Abcnews.com"
  },
  {
    "id": "NDg=",
    "url": "https://www.yahoo.com/news/articles/canada-prepares-aid-package-cuba-174726102.html",
    "title": "Canada prepares aid package for Cuba as it faces fuel shortages worsened by US oil embargo",
    "summary": "TORONTO (AP) — Canada announced Monday that it is working on an aid package for Cuba as it faces blackouts and severe fuel shortages worsened by a U.S oil embargo.\nAdvertisement AdvertisementAir Canada and other airlines have canceled flights to the Caribbean island because of a shortage of aviation fuel on the island.\nGlobal Affairs Canada, a governmental office, has said Canada is Cuba’s second-largest source of direct investment to the island, particularly in the mining and tourism sectors.\nAdvertisement AdvertisementThe economic crisis gripping Cuba since 2020 has been compounded by intensified U.S. sanctions aimed at forcing a change in the island’s political model.\nBecause Cuba produces only 40% of its required fuel, it remains highly vulnerable to external blockades.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-23T17:47:26Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NDk=",
    "url": "https://www.yahoo.com/news/articles/trump-state-union-address-sell-050314428.html",
    "title": "How Trump will use his State of the Union address to sell skeptical midterm voters on his plans",
    "summary": "WASHINGTON (AP) — President Donald Trump's State of the Union address on Tuesday is likely to be a test run of the message Republicans will give to voters in November's elections for control of the House and the Senate.\nHe might even minimize foreign policy in his State of the Union despite his belief that it's been a major success.\nTrump has made the State of the Union his ownThe State of the Union used to be about recapping accomplishments and seeking to unite the country, but it increasingly reflects divisions in society.\nWhen Trump delivered his 2020 State of the Union, then-House Speaker Nancy Pelosi theatrically ripped up a copy of the speech afterward, overshadowing much of what Trump said.\nState of the Unions have short shelf livesWhile some presidential phrases endure, much of the rhetoric in State of the Unions is forgettable.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-23T05:03:14Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTA=",
    "url": "https://www.aljazeera.com/news/2026/2/25/irans-fm-says-deal-with-us-within-reach-if-diplomacy-given-priority",
    "title": "Iran’s FM says deal with US ‘within reach’; Trump says he prefers diplomacy",
    "summary": "Foreign Minister Abbas Araghchi’s remarks in advance of Geneva talks come as a second US aircraft carrier heads towards the Middle East.\nWhile saying that he preferred diplomacy, he accused Iran of developing missiles that could “soon reach the United States of America”.\nBut one thing is certain, I will never allow the world’s number one sponsor of terror, which they are, by far, to have a nuclear weapon.\nTrump said that after the US attack on Iran’s nuclear sites in June 2025, “they were warned to make no future attempts to rebuild their weapons programme, in particular, nuclear weapons – yet they continue”.\nThey want to make a deal, but we haven’t heard those secret words: ‘We will never have a nuclear weapon’,” he added.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-25T03:39:03Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTE=",
    "url": "https://www.npr.org/2026/02/24/g-s1-111302/france-ups-the-ante-in-the-spat-with-us-ambassador-says-ministers-will-no-longer-meet-him",
    "title": "U.S. ambassador to France tries to defuse spat after being barred from government",
    "summary": "U.S. ambassador to France tries to defuse spat after being barred from governmenttoggle caption Christophe Ena/APPARIS — The U.S. ambassador to France sought Tuesday to smooth over a diplomatic spat with Paris, calling up the French foreign minister who had said earlier in the day that the U.S. diplomat would lose access to French government officials after he skipped a meeting.\nFrench authorities had summoned Ambassador Charles Kushner — the father of U.S. President Donald Trump 's son-in-law and adviser Jared Kushner — over comments from the Trump administration that France objected to.\nSponsor MessageBarrot reiterated to the ambassador that France cannot accept foreign interference, the minister's office said.\n\"When these explanations have taken place, then the U.S. ambassador in France will, naturally, regain access to members of the French government.\"\nLast August, Paris also summoned Kushner over a letter he wrote to French President Emmanuel Macron alleging that France did not do enough to combat antisemitism.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-24T06:29:28Z",
    "source": "NPR"
  },
  {
    "id": "NTI=",
    "url": "https://abcnews.com/Politics/trump-continues-lash-supreme-court-after-tariff-ruling/story?id=130407379",
    "title": "Trump continues to lash out at Supreme Court after tariff ruling",
    "summary": "Trump continues to lash out at Supreme Court after tariff rulingPresident Donald Trump arrives for an event to proclaim \"Angel Family Day\" in the East Room of the White House, Feb. 23, 2026.\n\"The supreme court (will be using lower case letters for a while based on a complete lack of respect!)\nTrump will face some of the Supreme Court justices in person on Tuesday night when he delivers his State of the Union address.\nThe Supreme Court will hear an expedited appeal of Trump's case seeking to effectively end birthright citizenship by executive order.\n\"But this supreme court will find a way to come to the wrong conclusion, one that again will make China, and various other Nations, happy and rich.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-23T17:20:21Z",
    "source": "Abcnews.com"
  },
  {
    "id": "NTQ=",
    "url": "https://www.aljazeera.com/news/2026/2/25/trumps-state-of-the-union-touts-economic-turnaround-as-approval-slumps",
    "title": "Key takeaways from Trump’s State of the Union speech",
    "summary": "Trump’s hardline stance on Iran and nuclear weapons, alongside foreign policy moves, dominate key moments of his speech.\n“Our nation is back: bigger, better, richer and stronger than ever before,” Trump said, at the start of his speech.\nDemocrats protest Trump’s immigration policiesTrump focused heavily on his hardline immigration policies, particularly when it came to his closure of the US border.\nBeyond the policy arguments on the economy and immigration, Trump leaned into a highly partisan appeal for Republican control of Congress.\nSpanberger said US businesses suffer under Trump’s tariffs, communities live under his mass deportation drive and residents remain dogged by affordability issues.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-25T06:30:20Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTU=",
    "url": "https://www.aljazeera.com/video/the-take-2/2026/2/24/what-to-expect-from-trumps-state-of-the-union-address-2",
    "title": "What to expect from Trump’s State of the Union address",
    "summary": "Trump’s State of the Union preview: foreign policy, immigration, tariffs, and the influence of Project 2025.\nAs US President Donald Trump prepares to deliver his State of the Union address, we look at what he’s expected to outline, from foreign policy tensions and sweeping tariffs to immigration crackdowns, and the influence of the conservative blueprint known as Project 2025 on his agenda.\nIn this episode:Amanda Becker, JournalistEpisode credits:This episode was produced by Marcos Bartolome and Melanie Marich, with Spencer Cline, Tamara Khandaker, Tuleen Barakat, Maya Hamadeh and our host, Malika Bilal.\nOur video editors are Hisham Abu Salah and Mohannad al-Melhemm.\nConnect with us:@AJEPodcasts on Twitter, Instagram, Facebook",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-24T20:47:13Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTY=",
    "url": "https://www.cbc.ca/news/world/australia-families-diplomats-israel-lebanon-9.7105056",
    "title": "Australia tells diplomats' families to leave Israel, Lebanon amid regional tensions",
    "summary": "The Australian government has told dependants of Australian diplomats in Israel and Lebanon to leave the two Middle East countries, the foreign ministry said on Wednesday, amid rising fears of military conflict between the United States and Iran.\nIran and the United States held indirect talks this month as Washington builds up military capability in the Middle East.\nThere are tens of thousands of Australians estimated to be living in the Middle East, many of them in the UAE, Israel and Lebanon.\nCanberra did not announce the closure of any of its Middle East embassies or consulates.\nThe Australian government closed its embassy in Tehran last year after expelling Iranian diplomats in June 2025, accusing the Iranian government of directing antisemitic attacks against Australian Jews.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-25T13:51:28Z",
    "source": "CBC News"
  },
  {
    "id": "NTc=",
    "url": "https://abcnews.com/US/wireStory/us-military-boards-oil-tanker-indian-ocean-after-130441949",
    "title": "US military boards third oil tanker in Indian Ocean after tracking it from Caribbean",
    "summary": "U.S. Southern Command said in a post on X that U.S. forces boarded the Bertha overnight, conducting “a right-of-visit, maritime interdiction and boarding.\"\n“The vessel was operating in defiance of President Trump’s established quarantine of sanctioned vessels in the Caribbean and attempted to evade,” the post said.\n“From the Caribbean to the Indian Ocean, we tracked it and stopped it.”Venezuela had faced U.S. sanctions on its oil for several years, relying on a shadow fleet of falsely flagged tankers to smuggle crude into global supply chains.\nVideo posted by the Pentagon shows U.S. military helicopters flying toward the tanker.\nTrump's Republican administration has been seizing tankers as part of its broader efforts to take control of Venezuela's oil.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-24T13:10:28Z",
    "source": "Abcnews.com"
  },
  {
    "id": "NTg=",
    "url": "https://alltoc.com/world/how-has-the-ukraine-war-reshaped-global-security",
    "title": "How has the Ukraine war reshaped global security?",
    "summary": "Four years in: how the conflict changed warfare and alliancesThe full‑scale invasion launched by Russia has entered its fifth year and, in that time, the war has produced deep and lasting shifts in military practice, alliance politics and global security thinking.\nTactical and technological changesWidespread use of drones: Both sides have deployed drones for reconnaissance, strike missions and improvisational air defenses.\nStrategic and geopolitical effectsNATO and European defense: The war renewed political will in Europe for higher defense spending, more integrated deterrence, and questions about deeper European security arrangements.\nHuman and economic toll: Population displacement, demographic impacts and the destruction of infrastructure pose long‑term reconstruction and economic challenges for Ukraine, while sanctions and disrupted trade have lasting global economic effects.\nWhy it matters nowThe war has altered how states prepare for and prosecute conflict in the 21st century.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-24T09:13:44Z",
    "source": "Alltoc.com"
  }
]