[
  {
    "id": "Mjk=",
    "url": "https://www.bbc.co.uk/sounds/play/p0n3wwqr",
    "title": "US and Israel carry out joint attacks on Iran",
    "summary": "Available for 88 daysPresident Donald Trump confirms that \"major combat operations\" are underway against targets in Iran in a joint operation by the US and Israeli military.\nThe office of Iran's supreme leader, and the presidential office in Tehran, were reportedly targeted, as well as military sites across the country.\nIn response Iran launched strikes at US military targets across the region - with damage reported in Qatar, the UAE and Kuwait.\nThe Global News Podcast brings you the breaking news you need to hear, as it happens.\nGet the news that matters, delivered twice a day on weekdays and daily at weekends, plus special bonus episodes reacting to urgent breaking stories.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-02-28T15:18:00Z",
    "source": "BBC News"
  },
  {
    "id": "Mzk=",
    "url": "https://www.bbc.com/news/articles/cj32zx48xvxo",
    "title": "What we know after latest escalation in Pakistan-Afghanistan tensions",
    "summary": "The Taliban spokesman said 55 Pakistani soldiers had been killed, 23 of whose bodies had been taken back to Afghanistan.\nHe also said others had been captured alive, while 19 bases had been destroyed.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-02-27T10:50:46Z",
    "source": "BBC News"
  },
  {
    "id": "NDc=",
    "url": "https://abcnews.com/International/wireStory/pakistan-killed-300-afghan-forces-dayslong-airstrikes-inside-130588257",
    "title": "Pakistan says it killed more than 300 Afghan forces in dayslong airstrikes",
    "summary": "Pakistan says it killed more than 300 Afghan forces in dayslong airstrikesPeople carry the coffin of an army soldier, killed in the cross-border clashes of Pakistan and Afghan forces, for his funeral prayer at a village in Lakki Marwat, a district of Pakistan's Khyber Pakhtunkhwa province, Saturday, Feb. 28, 2026.\nMarwat)People carry the coffin of an army soldier, killed in the cross-border clashes of Pakistan and Afghan forces, for his funeral prayer at a village in Lakki Marwat, a district of Pakistan's Khyber Pakhtunkhwa province, Saturday, Feb. 28, 2026.\nMarwat)People carry the coffin of an army soldier, killed in the cross-border clashes of Pakistan and Afghan forces, for his funeral prayer at a village in Lakki Marwat, a district of Pakistan's Khyber Pakhtunkhwa province, Saturday, Feb. 28, 2026.\nMarwat)People carry the coffin of an army soldier, killed in the cross-border clashes of Pakistan and Afghan forces, for his funeral prayer at a village in Lakki Marwat, a district of Pakistan's Khyber Pakhtunkhwa province, Saturday, Feb. 28, 2026.\nMarwat)ISLAMABAD -- Pakistan’s military, backed by artillery and air power, struck more Afghan military installations deep inside Afghanistan overnight and into early Saturday, killing over 300 Afghan forces in dayslong border clashes, a government spokesman and officials said.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-28T07:53:25Z",
    "source": "Abcnews.com"
  },
  {
    "id": "NDg=",
    "url": "https://www.wired.com/story/us-iran-strike-donald-trump/",
    "title": "US and Israel Launch Strikes Against Iran",
    "summary": "United States and Israeli forces have launched military strikes against Iran, with President Donald Trump calling the attacks a “major combat operation” against the Iranian regime.\nShortly after the first reports of the attacks emerged, both the US and Israel claimed responsibility for the strikes.\nExplosions have subsequently been heard in the United Arab Emirates and Bahrain, in what appeared to be retaliatory Iranian strikes.\nThe strikes on Iran, which have been called Operation Epic Fury by the so-called US Department of War and Operation Roaring Lion by the Israel Defense Forces (IDF), reportedly hit multiple cities across the country.\nShortly after confirming launching the attacks, the IDF said it had “identified” Iranian missiles being launched towards Israel.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-28T09:42:54Z",
    "source": "Wired"
  },
  {
    "id": "NTA=",
    "url": "https://www.bbc.com/news/articles/c0rjpr575g9o",
    "title": "Flights cancelled as new travel warnings issued after US-Israeli strikes on Iran",
    "summary": "Steve Rudderham and his wife had been on their way to the Maldives to celebrate their wedding anniversary but were stuck in Doha where they had been due to have a stopover.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-28T13:39:34Z",
    "source": "BBC News"
  },
  {
    "id": "NTE=",
    "url": "https://abcnews.com/International/middle-east-braces-conflict-uncertainty-remains-trumps-final/story?id=130526473",
    "title": "Middle East braces for another conflict but uncertainty remains over Trump's final decision, analysts say",
    "summary": "Middle East braces for another conflict but uncertainty remains over Trump's final decision, analysts sayThe US Navy aircraft carrier USS Gerald R. Ford departs Souda Bay on the island of Crete, February 26, 2026.\nIf the U.S. were to attack, Iran has said that U.S. bases in the region and Israel would be hit in response.\nThe chances of there not being a U.S. strike are very low, some analysts who spoke to ABC News said.\nThat conflict began with a surprise attack from Israel on Iranian nuclear sites that Israeli officials called a preemptive strike.\n\"It is therefore easier to manage ground-to-air defenses in Israel,\" Yatom added, adding some of Iran's firepower will be directed at other targets.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-26T21:11:13Z",
    "source": "Abcnews.com"
  },
  {
    "id": "NTI=",
    "url": "https://abcnews.com/video/130629958/",
    "title": "Video Iranian Foreign Ministry spokesman says president, supreme leader 'safe and sound'",
    "summary": "Iranian Foreign Ministry spokesman says president, supreme leader 'safe and sound' Esmail Baghaei joins ABC News following US and Israeli strikes on Iran early Saturday morning",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-28T18:48:26Z",
    "source": "Abcnews.com"
  },
  {
    "id": "NTM=",
    "url": "https://www.vox.com/politics/481030/us-iran-trump-intervention-america-first",
    "title": "Trump attacked regime change wars for years. Now he’s launched his own.",
    "summary": "Editor’s note, February 28, 5:30 pm ET: President Donald Trump announced on Saturday afternoon that Iran’s supreme leader, Ayatollah Ali Khamenei, was killed in the airstrikes.\nThe US has once again launched the sort of regime change war, where the actual stakes for US national security are far from clear, that he has spent more than a decade deriding his predecessors for pursuing.\nIn endorsing Trump in 2023, then-Sen. JD Vance wrote an op-ed with the title “Trump’s Best Foreign Policy?\nIt’s also worth noting that just because Trump is talking about the overthrow of the regime now, the operation could very well stop short of that goal.\nBut that doesn’t mean US troops won’t be at risk from retaliatory strikes from a desperate Iranian regime.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-28T16:29:02Z",
    "source": "Vox"
  },
  {
    "id": "NTQ=",
    "url": "https://www.thedailybeast.com/trump-threatens-friendly-takeover-of-cold-war-enemy-cuba/",
    "title": "Trump Threatens ‘Friendly’ Takeover of American Neighbor",
    "summary": "President Donald Trump has warned that he may launch a “friendly takeover” of Cuba, paving the way for yet another foreign intervention by the “America First” president.\nDonald Trump gestures as he walks to board Marine One as he departs the South Lawn of the White House for Texas in Washington.\nThey have no anything right now, but they’re talking with us, and maybe we’ll have a friendly takeover of Cuba.”Trump did not elaborate on what he meant by a “friendly takeover,” but said that after decades of strained relations, such a move would be “very positive” for Cuban exiles living in the U.S.\n“Cutting off energy supplies using our Navy and Coast Guard is the use of military force, and a takeover is not ‘friendly’ under these circumstances; it’s coercive.\nFigures such as MAGA warrior Steve Bannon, former Trump ally Marjorie Taylor Greene, and libertarian-leaning Congressman Thomas Massie have all spoken out about U.S. intervention.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2026-02-27T21:19:45Z",
    "source": "Daily Beast"
  },
  {
    "id": "NTU=",
    "url": "https://dpa-international.com/politics/urn:newsml:dpa.com:20090101:260226-99-661004/",
    "title": "Iran: Talks to continue with US on Monday",
    "summary": "Further progress was made in the third round of nuclear talks with the US and \"technical talks\" are planned to begin on Monday, Iranian Foreign Minister Abbas Araghchi told reporters on Thursday evening.\nIf these take place, the details of a possible agreement are likely to be negotiated.\n\"Perhaps the seriousness of reaching an agreement was more visible than before,\" the minister said, referring to the third round of talks.\nThe negotiations concern Iran's controversial nuclear program as Washington seeks to prevent the leadership in Tehran from developing nuclear weapons.\nOn Wednesday, Iran submitted a first draft of a new agreement.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-26T20:13:23Z",
    "source": "Dpa-international.com"
  },
  {
    "id": "NTY=",
    "url": "https://www.npr.org/2026/02/26/g-s1-111595/u-s-iran-to-third-round-nuclear-talks",
    "title": "U.S.-Iran nuclear talks wrap up with no announcement of a deal as risk of war looms",
    "summary": "Sponsor MessageTrump wants a deal to constrain Iran's nuclear program, and he sees an opportunity while the country is struggling at home with growing dissent following nationwide protests.\nAl-Busaidi said technical-level talks would continue next week in Vienna, the home of the International Atomic Energy Agency.\nIran says it will only discuss nuclear issues, and maintains its atomic program is for entirely peaceful purposes.\nSponsor MessageU.S. suspects Iran is rebuilding its programU.S. Secretary of State Marco Rubio told reporters Wednesday that Iran is \"always trying to rebuild elements\" of its nuclear program.\nThreat of military action sparks war fearsIf the talks fail, uncertainty hangs over the timing of any possible U.S. attack.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-26T06:54:17Z",
    "source": "NPR"
  },
  {
    "id": "NTc=",
    "url": "https://www.yahoo.com/news/articles/maduros-lawyer-says-us-blocking-000654233.html",
    "title": "Maduro's lawyer says US is blocking Venezuela government from paying deposed leader's drug defense",
    "summary": "The Trump administration is blocking Venezuela's government from paying for the cost of Venezuelan leader Nicolás Maduro's defense against drug trafficking charges in New York, a move that potentially interferes with his constitutional right to counsel, his lawyer says.\nThe first Trump administration cut ties with Maduro in 2019, recognizing the then opposition head of the National Assembly as Venezuela’s legitimate leader.\nAdvertisement AdvertisementPollack said he asked the Office of Foreign Assets Control on Feb. 11 to reinstate the original license and clear the way for Venezuela to meet its obligation to pay Maduro's defense costs.\nThe lawyer added that Maduro “cannot otherwise afford counsel\" and will request help from the judge to pay for his defense.\nAssociated Press writers Aamer Madhani and Fatima Hussein in Washington and Larry Neumeister in New York contributed to this report.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-26T00:06:54Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTg=",
    "url": "https://abcnews.com/Politics/top-mideast-commander-briefs-trump-military-options-iran/story?id=130544628",
    "title": "Top Mideast commander briefs Trump on military options on Iran: Exclusive",
    "summary": "Navy Adm. Brad Cooper, who oversees troops in the Middle East as head of U.S. Central Command, briefed President Donald Trump on Thursday on potential military options in Iran, according to a person close to the president.\nIf Israel struck Iran, defense officials predict Iran would almost certainly retaliate.\n\"I think it's important for President Trump to articulate the strategy and mission in Iran,\" he later added.\nOf particular concern is that Iran try to attack the some 35,000 to 40,000 U.S. troops stationed in the region.\nRubio also said Iran also was on a \"pathway\" to try to obtain ballistic missiles capable of reaching the U.S.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-26T23:46:19Z",
    "source": "Abcnews.com"
  },
  {
    "id": "NTk=",
    "url": "https://www.aljazeera.com/video/newsfeed/2026/2/28/diplomacy-was-betrayed-by-the-americans-iranian-fm-spokesman",
    "title": "‘Diplomacy was betrayed by the Americans’: Iranian FM spokesman",
    "summary": "NewsFeed ‘Diplomacy was betrayed by the Americans’: Iranian FM spokesman“This is the second time in less than a year that diplomacy was betrayed by the Americans.” An Iranian Foreign Ministry spokesperson slammed the United States for once again launching an attack against his country while negotiating with it.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-02-28T19:13:34Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NjA=",
    "url": "https://www.aljazeera.com/news/2026/2/28/us-israel-bomb-iran-a-timeline-of-talks-and-threats-leading-up-to-attacks",
    "title": "US, Israel bomb Iran: A timeline of talks and threats leading up to attacks",
    "summary": "The United States and Israel have launched strikes on Iran despite ongoing talks between Washington and Tehran over Iran’s nuclear programme.\nHere is a timeline of the events, including attacks and diplomatic overtures leading up to Saturday’s strikes by the US and Israel, and Iran’s fierce response.\nJune 13, 2025 — Israel launches major air strikes against Iranian nuclear and military facilities, amid ongoing talks between the US and Tehran.\nJune 22 – The US strikes Iranian nuclear facilities at Natanz, Fordow and Isfahan, with Trump claiming the attacks degraded Tehran’s nuclear programme.\nFebruary 17 – High-level US–Iran nuclear talks resume in Geneva, again with Omani mediation.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-28T11:31:31Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NjE=",
    "url": "https://www.bbc.com/news/articles/cg5nm6v2p4no?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "title": "Bahrain strikes raise questions on how US can deal with Iran retaliation",
    "summary": "Iran also has significant capabilities to attack the US Navy - if in range.\nIt has large stocks of anti-ship missiles, as well as small, fast, uncrewed attack boats.\nThere is also the unanswered question of whether China may have given Iran military support over the past few months.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-28T20:13:23Z",
    "source": "BBC News"
  },
  {
    "id": "NjI=",
    "url": "https://abcnews.com/International/iranian-officials-claim-school-hit-us-israeli-army/story?id=130629048",
    "title": "Iranian officials claim school hit during US-Israeli army strikes",
    "summary": "A view shows the aftermath of an Israel strike on a school in Minab, Iran, Feb. 28, 2026.\nA view shows the aftermath of an Israel strike on a school in Minab, Iran, Feb. 28, 2026.\nA view shows the aftermath of an Israel strike on a school in Minab, Iran, Feb. 28, 2026.\nA view shows the aftermath of an Israel strike on a school in Minab, Iran, Feb. 28, 2026.\nA view shows the aftermath of an Israel strike on a school in Minab, Iran, Feb. 28, 2026.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2026-02-28T21:32:59Z",
    "source": "Abcnews.com"
  },
  {
    "id": "NjM=",
    "url": "https://www.aljazeera.com/news/2026/2/28/irans-foreign-ministry-defends-retaliatory-strikes-slams-us-betrayal",
    "title": "Iran’s Foreign Ministry defends retaliatory strikes, slams US betrayal",
    "summary": "Spokesman Esmaeil Baghaei says Iran’s attacks on US targets across the region are legitimate defensive actions.\nIran is entitled to defend itself from Israeli and US attacks, the spokesman for Iran’s Ministry of Foreign Affairs has stressed.\nFriends in the regionBaghaei defended Iran’s retaliatory attacks in several countries across the region.\n“Under international law, any place, any location, any logistical support that are given to the aggressor [is a] legitimate target for the victim state,” he said.\nWhat we are doing is just taking defensive actions.”“We have proven that we trust our friends in the region,” Baghaei said.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-28T21:49:24Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NjQ=",
    "url": "https://www.npr.org/2026/02/28/nx-s1-5730186/iran-strikes-israel",
    "title": "Panic, fury, and some hope, in Iran as U.S. launches strikes",
    "summary": "Panic, fury, and some hope, in Iran as U.S. launches strikestoggle caption APAMMAN, Jordan — In Tehran, panicked residents rushed home to shelter and terrified children poured out of classrooms as U.S. air strikes hit the capitol, Iranians reached by phone told NPR.\nThe airstrikes hit on the first day of Iran's work week while many were at work or in school.\nThe United Arab Emirates, another U.S. ally, said it intercepted Iranian missiles.\nIt said shrapnel from one of the intercepted missiles killed a national of an unspecified Asian country in Abu Dhabi.\nSponsor MessageIran's foreign ministry said the U.S. and Israeli airstrikes had hit defense infrastructure and civilian sites across Iran.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-28T12:21:28Z",
    "source": "NPR"
  }
]