[
  {
    "url": "https://www.bbc.com/news/articles/c78nr234v5mo",
    "title": "A deserted rail station on Trump's route to peace where global interests collide",
    "summary": "\"We are on the Trump route, also known as Crossroads of Peace, the Silk Road, and the Zangezur Corridor,\" says Marut Vanyan, a local journalist.\nTrump's intervention could reshape the geopolitics of a region that Russia claims as its sphere of influence.\nMarut Vanyan stands close to the Aras river that separates Armenia from IranA future Trump route promises both \"unimpeded connectivity\" for Azerbaijan and \"full respect\" for Armenia's sovereignty.\nBoth nations' leaders say the Washington meeting has restored peace in their region and praise Trump's intervention as a game changer.\nThe Aras River that separates the Islamic Republic and Armenia is the very line the route is set follow.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-05T23:43:19Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cg5e9zlpz6eo",
    "title": "British parts found in Russian drones, Zelesnky says",
    "summary": "British parts found in Russian drones, Zelensky says\"We take reports of goods from UK companies being found in Russian weaponry incredibly seriously,\" a government spokesperson said.\nThe Ukrainian president called for further \"effective\" sanctions after saying parts originating in allied countries including Germany, Japan and the US have been identified in Russian weapons.\nBritish microcomputers were among more than 100,000 foreign-made parts contained in Russian missiles and drones used in Sunday's deadly strikes on Ukraine , Volodymyr Zelensky has said.\nComponents originating in China, Taiwan and the Netherlands have also been identified in Russian weapons, he continued.\nSince Russia launched its full-scale invasion of Ukraine in February 2022, it has become the most-sanctioned nation in the world.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-06T18:03:55Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/china-angered-eu-challenging-un-095005916.html",
    "title": "China angered at EU 'challenging' UN resolution that led to Taiwan leaving global body",
    "summary": "China and Taiwan, which Beijing views as its own territory, have been locked in an increasingly bitter dispute about U.N. resolution 2758.\nChina's Foreign Ministry said the EU remarks were a \"distortion\" of the resolution.\nAdvertisement AdvertisementAdvertisement Advertisement\"United Nations Resolution 2758 is very short - only 150 words.\nAnd among those 150 words, the word 'Taiwan' does not appear,\" an EU spokesperson said in an emailed statement.\nIn response, China's foreign ministry said that it was \"extremely dissatisfied and resolutely opposed\" to the EU remarks.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-07T09:50:05Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.co.uk/sounds/play/p0m72zf5",
    "title": "Will Trump’s Gaza Peace Plan Work?",
    "summary": "But Donald Trump's 20-point peace plan - which Israel has agreed to and Hamas has partly agreed to - is really just a framework, only a few pages long.\nAdam talks to Lyse Doucet, chief international correspondent, about how the next few days could play out?\nYou can listen the Oslo Accords Old Newscast here: https://www.bbc.co.uk/programmes/p0lx690c You can now listen to Newscast on a smart speaker.\nIf you want to listen, just say \"Ask BBC Sounds to play Newscast”.\nIf you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd Newscast brings you daily analysis of the latest political news stories from the BBC.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-10-06T18:03:00Z",
    "source": "BBC News"
  },
  {
    "url": "https://science.slashdot.org/story/25/10/06/0148246/removing-50-objects-from-orbit-would-cut-danger-from-space-junk-in-half",
    "title": "Removing 50 Objects from Orbit Would Cut Danger From Space Junk in Half",
    "summary": "Want to read Slashdot from your mobile device?\nPoint it at m.slashdot.org and keep reading!",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-10-06T02:12:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://www.bbc.com/news/articles/c20vlpwrzwdo",
    "title": "One iPhone led police to gang who sent 40,000 snatched phones to China",
    "summary": "Police believe the gang could be responsible for exporting up to half of all phones stolen in London, where most mobiles are taken in the UK.\nThe investigation was triggered after a victim traced a stolen phone last year.\nInside, officers found devices wrapped in foil - an attempt by offenders to transport stolen devices undetected.\nThree-quarters of all the phones stolen in the UK are now taken in London.\n\"We've dismantled criminal networks at every level from street-level thieves to international organised crime groups exporting tens of thousands of stolen devices each year.\"",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-10-06T21:00:30Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/what-to-know-tomahawk-cruise-missiles-trump-may-send-ukraine-2025-10",
    "title": "What to know about the Tomahawk cruise missiles Trump says he might give Ukraine",
    "summary": "President Donald Trump said he has made a decision about whether to send Tomahawk cruise missiles to Ukraine.\nPresident Donald Trump said he has made a decision about whether to send Tomahawk cruise missiles to Ukraine.\nMark Wilson/Getty ImagesPresident Donald Trump said he has made a decision about whether to send Tomahawk cruise missiles to Ukraine.\nMark Wilson/Getty ImagesThe US is signaling it may send Tomahawk cruise missiles to Ukraine, which would hand Kyiv a powerful American long-range strike weapon with significant reach.\nTomahawk missiles have become the latest high-profile weapon sought by Ukraine from Western partners.",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-10-07T15:15:02Z",
    "source": "Business Insider"
  },
  {
    "url": "https://gizmodo.com/roamless-esim-starts-cheap-at-1-25-gb-and-our-exclusive-20-off-code-pushes-it-practically-free-2000666932",
    "title": "Roamless eSIM Starts Cheap at $1.25/GB, and Our Exclusive 20% Off Code Pushes It Practically Free",
    "summary": "Surprises can be fun when you’re on vacation, except when they take the form of massive roaming charges on your cellular bill after you get home.\nRoamless works exactly as its name suggests — it’s a global all-in-one eSIM app that keeps you safely connected across all your travels, with transparent prepaid or pay-as-you-go pricing.\nIf you have a physical SIM card right now, you also know how tiny, fragile, and easy to lose they are.\nBoth methods are managed on the Roamless app, without worrying about swapping out SIM cards as you cross international borders.\nDon’t forget that $1.25 in free credit Roamless is offering, or the 20% off sitewide discount you get when you use the code GIZMODO20 at checkout.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-05T12:33:43Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.yahoo.com/news/articles/italys-meloni-says-she-denounced-195606805.html",
    "title": "Italy's Meloni says she has been denounced to ICC for complicity in genocide",
    "summary": "By Angelo AmanteROME (Reuters) -Italian Prime Minister Giorgia Meloni said on Tuesday that she and two of her ministers had been reported to the International Criminal Court for alleged complicity in genocide in connection with Israel's offensive in Gaza.\nSpeaking in an interview with state television broadcaster RAI, Meloni said Defence Minister Guido Crosetto and Foreign Minister Antonio Tajani had been denounced, and \"I think\" also Roberto Cingolani, the head of defence group Leonardo.\nAdvertisement AdvertisementAdvertisement Advertisement\"I don't believe there is another case like this in the world or in history,\" Meloni said.\nMeloni said she was \"amazed\" by the accusation of complicity in genocide because \"anyone who knows the situation is aware that Italy has not authorised new, let's say, arms supplies to Israel after October 7.\"\nAdvertisement AdvertisementAdvertisement AdvertisementIn other remarks, Meloni said she believed that U.S. President Donald Trump had come to the conclusion that Russia was not interested in a peace deal with Ukraine.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-07T19:56:06Z",
    "source": "Yahoo Entertainment"
  }
]