[
  {
    "url": "https://www.thedailybeast.com/trump-point-blank-refuses-to-answer-question-on-major-issue/",
    "title": "Trump Point-Blank Refuses to Answer Question on Major Issue",
    "summary": "President Donald Trump declined to take a question on foreign policy on the red carpet on Sunday—but swiftly changed his mind just moments later.\nPresident Donald Trump and First Lady Melania hosted the Kennedy Center Honors on Sunday.\nFilmMagicAfter taking a question about who’s on his “naughty list” for the year, however, Trump couldn’t help himself from bringing up the topic he just declined to discuss.\n“We’ve been speaking to President Putin, and we’ve been speaking to Ukrainian leaders, including President Zelensky, and I have to say that I’m a little bit disappointed that President Zelensky hasn’t yet read the proposal—that was as of a few hours ago,” he said.\nUkrainian President Volodymyr Zelensky said much work remains to be done in the peace talks with Russia.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-12-08T03:00:20Z",
    "source": "Daily Beast"
  },
  {
    "url": "https://beincrypto.com/china-escalates-anti-crypto-crackdown/",
    "title": "China Bans RWA for First Time: 7 Agencies’ Biggest Crypto Crackdown Since 2021",
    "summary": "They stated that all crypto-related business activities, including stablecoins, airdrops, mining, and, notably, real-world asset (RWA) tokenization, are illegal in China.\nThis move comes as global RWA tokenization surpasses $30 billion in market size.\nChinese regulators appear concerned that RWA tokenization could become a sophisticated tool for capital flight.\nThe warning also draws a clear boundary with Hong Kong’s crypto-friendly approach, stating that “mainland staff of offshore virtual currency service providers” will face legal consequences.\nThe city also permits RWA tokenization pilots, though strictly limited to offshore assets and non-mainland users.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-12-08T00:17:54Z",
    "source": "BeInCrypto"
  },
  {
    "url": "https://dpa-international.com/politics/urn:newsml:dpa.com:20090101:251209-99-873875/",
    "title": "German foreign minister draws positives from trip to China",
    "summary": "German Foreign Minister Johann Wadephul said on Tuesday he sees opportunities for constructive cooperation with China, following a period of significant tensions between both countries, and ahead of a planned visit by Chancellor Friedrich Merz.\n\"Overall, I had the impression during my trip that China, just like us, is very interested in a serious and concrete exchange,\" Wadephul said during a visit to the southern high-tech metropolis of Guangzhou.\nWhen asked what message he would give Merz ahead of the chancellor's trip in the first three months of next year, Wadephul said: \"I believe the chancellor is well aware of how important the political and economic relationship with China is.\"\nWadephul said that his trip, like that of Vice Chancellor and Finance Minister Lars Klingbeil, was a good preparation for the chancellor's visit to China.\nThere were key areas, Wadephul said, in which the German government could work jointly with China and where the bilateral economic relationship could be placed on a new footing.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-09T10:10:38Z",
    "source": "Dpa-international.com"
  },
  {
    "url": "https://www.salon.com/2025/12/07/trumps-foreign-policy-vision-make-europe-white-again/",
    "title": "Trump’s foreign policy vision: Make Europe white again",
    "summary": "Am I offering false hope if I say that the unsustainable contradictions within the Trump regime are beginning to pull it apart?\nThis past week, the absurd and alarming contradictions of Trumpian foreign policy — which combine a litany of incompatible retrograde tendencies too tedious to lay out here — were spelled out with admirable clarity in an official document known as the National Security Strategy.\nWell, the win-win here, I guess, is that the second Trump administration’s NSS isn’t boring at all.\nThat, of course, is also clarifying: As far as I can tell, this document has united foreign policy experts clear across the political and ideological spectrum in a reaction of WTAF followed by STFU.\n(There may be outliers on the Islamophobic far right and the Sinophile and/or Russophile far left, but not many.)",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-12-07T11:45:30Z",
    "source": "Salon"
  },
  {
    "url": "https://www.yahoo.com/news/articles/russias-africa-corps-fights-mali-052131039.html",
    "title": "As Russia's Africa Corps fights in Mali, witnesses describe atrocities from beheadings to rapes",
    "summary": "When the Africa Corps replaced Wagner six months ago, weary civilians hoped for less brutality.\nMalian authorities have never publicly acknowledged the presence of Wagner or Africa Corps.\nBut if they flee, Mali's army and Africa Corps consider them JNIM accomplices.\nIt is unclear whether the terms of Mali's agreement remain the same for Africa Corps.\nNot all Africa Corps fighters are Russian.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-07T05:21:31Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://slate.com/news-and-politics/2025/12/trump-national-security-strategy-2025-analysis.html",
    "title": "Trump's new national security strategy paper is alarming the world. What does it really mean?",
    "summary": "As the process evolved into the routine business of the National Security Council, the document itself became an obligatory afterthought, often drenched with cliché, designed to avoid sparking controversy.\nAdvertisementAdvertisementAdvertisementThe Trump document was clearly meant to ignite sparks—it is explicitly a rebuff to much of the liberal world order set up in the wake of World War II—but to what end?\nThe paper was the fruits of an elaborate project coordinated by Trump’s national security adviser at the time, retired Lt. Gen. H.R.\nAdvertisementIn short, the National Security Strategy is an unserious document.\nThe fact that his closest aides didn’t write it—and the strong likelihood that he didn’t read it—gives the allies’ strategy a leg up.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-08T22:07:23Z",
    "source": "Slate Magazine"
  },
  {
    "url": "https://ca.finance.yahoo.com/news/the-bank-of-canadas-rate-cuts-have-failed-to-lift-the-housing-market-heres-where-it-goes-next-132409481.html",
    "title": "The Bank of Canada's rate cuts have failed to lift the housing market. Here's where it goes next",
    "summary": "Sixteen months of interest rate cuts should have jolted Canada’s housing market back to life.\nInstead, the sector has barely moved — and with the Bank of Canada (BoC) holding rates steady today, industry experts say the trade war’s shadow, not interest rates, will dictate where the market goes next.\n“This Bank of Canada rate has come down massively from its peak,” said Ron Butler, a broker at Butler Mortgage.\n“Interest rates are secondary here,” he said.\nThe weakness in the entry-level market, says Soper, stems from the absence of the group that normally kickstarts a housing cycle.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-12-08T13:24:09Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://dpa-international.com/politics/urn:newsml:dpa.com:20090101:251209-99-876108/",
    "title": "German minister warns Europe must speed up innovation to match China",
    "summary": "German Foreign Minister Johann Wadephul on Tuesday warned that Europe needed to increase its speed of technological innovation if it wants to catch up with China, on the last leg of his visit to the country.\nOn a tour of the industrial metropolis of Guangzhou, Wadephul said that Germany and Europe risked losing out in the technology race.\n\"When it comes to future technologies, China is a pioneer and, it must be clearly stated, also our biggest competitor,\" he said.\nGuangzhou was the last stop on Wadephul's China visit, following political talks in Beijing.\nWadephul said that his trip, like that of Vice Chancellor and Finance Minister Lars Klingbeil, was a good preparation for the chancellor's visit.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-09T13:40:27Z",
    "source": "Dpa-international.com"
  },
  {
    "url": "https://www.bbc.com/news/articles/c3d01nxg0y0o",
    "title": "Royal Navy unveils new Atlantic strategy to counter Russian threat",
    "summary": "Fathom, made by the German defence company Helsing and now being trialled by the Royal Navy, moves silently, its sensors constantly gathering information.\nThe government says there has been a 30% increase in the number of Russian vessels threatening UK waters in the last two years.\nLast month, the Yantar, a Russian oceanic research vessel suspected of mapping British undersea cables and pipelines, shone lasers at RAF pilots tracking its progress near UK waters.\n\"The Royal Navy does not have the ships to do this job coherently or credibly and is looking to address it with drones as they are cheaper and can provide coverage of the geographical areas for which the Royal Navy is responsible in lieu of new ships,\" Prof Roberts adds.\n\"Russia so far is going unchallenged in much of UK water space and this strategy is playing catch up long after the fact.\"",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-08T00:30:31Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.co.uk/news/articles/c1dz0g2ykpeo",
    "title": "US could ask tourists for five-year social media history before entry",
    "summary": "The Trump administration previously announced it would examine social media accounts when vetting foreign nationals who apply for student visas or H-1B visas for skilled workers.\nThe state department said it would conduct \"online presence\" reviews for applicants and their dependants, and that privacy settings on all social media profiles must be made \"public\" so this screening can take place.\nAn announcement on the website for the US Embassy and Consulate in Mexico states certain visa applicants must list all social media usernames or handles of every platform they have used in the last five years.\nIt warns that if any social media information is not listed, it could lead to both current and future visas being denied.\nEarlier this year, the World Travel & Tourism Council said the US was the only one of 184 economies that it analysed that was expected to see a decline in international visitor spending in 2025.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-10T12:37:30Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.aljazeera.com/news/2025/12/7/russia-welcomes-trumps-revised-us-security-strategy",
    "title": "Russia welcomes Trump’s revised US security strategy",
    "summary": "The Kremlin has praised a new national security strategy adopted by US President Donald Trump, saying it aligns closely with Russia’s own view of global affairs.\nBut Peskov cautioned that the position of what he called the US “deep state” – a term the US president has used to accuse officials who he believes are undermining his agenda – may differ from Trump’s new security strategy.\nTrump’s new strategy comes as efforts led by the White House to broker an end to the Russia-Ukraine war approach a crucial moment.\nFocus shifts to ChinaThe new security strategy places the Indo-Pacific at the centre of US foreign policy, describing it as a “key economic and geopolitical battleground”.\nMeanwhile, Russia, isolated by Western sanctions over the war in Ukraine, has deepened its economic and political ties with China.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-07T18:52:14Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://www.yahoo.com/news/articles/trump-news-glance-president-hints-034716843.html",
    "title": "Trump news at a glance: president hints at abandoning Ukraine, rambles about ‘weak’ Europe",
    "summary": "Trump called for Ukraine’s president, Volodymyr Zelenskyy, to accept his proposal to cede territory to Russia, arguing that Moscow retained the “upper hand” and that Zelenskyy’s government must “play ball”.\nTrump lambasts ‘weak’ and ‘decaying’ EuropeThe US president repeatedly described what he said were Europe’s problems in entirely racial terms, calling some unnamed European leaders “real stupid”.\nRümeysa Öztürk, a PhD student studying children’s relationship to social media, was among the first people arrested as the Trump administration began targeting foreign-born students and activists involved in pro-Palestinian advocacy.\nRead the full storyGianni Infantino accused of breaking Fifa rules with Trump’s peace prizeThe Fifa president has been accused of breaching his organisation’s rules on political neutrality in relation to United States president Donald Trump.\nInfantino even presented Trump with the inaugural Fifa peace prize at last Friday’s World Cup draw in Washington DC.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-10T03:47:16Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://abcnews.go.com/International/wireStory/imf-approves-12-billion-pakistan-bailout-citing-progress-128231956",
    "title": "IMF approves $1.2 billion for Pakistan, citing progress on economic, climate reforms",
    "summary": "With the latest approval, Pakistan has received about $3.3 billion from the IMF since last year.\nPakistan, for decades, has relied on loans from the IMF and friendly nations to meet its financing needs.\nHe said the latest IMF decision shows Pakistan is taking the steps needed to stabilize and grow its economy after narrowly avoiding default last year.\nSharif said Pakistan’s reform and digitalization efforts have now become a global “case study,” but cautioned that shifting from stability to sustained growth will demand further effort.\nIn a statement, the IMF said Pakistan has made “significant progress” in stabilizing the economy despite a tough global environment and this year’s devastating floods.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-09T08:10:04Z",
    "source": "ABC News"
  },
  {
    "url": "https://politics.slashdot.org/story/25/12/10/189220/democrats-warn-their-party-may-try-to-unravel-any-paramount-warner-bros-discovery-deal",
    "title": "Democrats Warn Their Party May Try To Unravel Any Paramount-Warner Bros. Discovery Deal",
    "summary": "Slashdot is powered by your submissions, so send in your scoop",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-12-10T18:09:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://www.yahoo.com/news/articles/russian-strikes-kill-1-us-122437962.html",
    "title": "Trump says Zelenskyy 'hasn't read' a US-authored proposal to end Russia-Ukraine war",
    "summary": "KYIV, Ukraine (AP) — President Donald Trump on Sunday claimed Ukrainian President Volodymyr Zelenskyy “hasn’t read” a U.S-authored peace proposal aimed at ending the Russia-Ukraine war.\nTrump was critical of Zelenskyy after U.S. and Ukrainian negotiators completed three days of talks on Saturday aimed at trying to narrow differences on the U.S. administration’s proposal.\n“I’m a little bit disappointed that President Zelenskyy hasn’t yet read the proposal, that was as of a few hours ago.\nHe said he had been given an update over the phone by U.S. and Ukrainian officials at the talks.\nIt was updated on Dec. 8, 2025 to correct that Trump said Zelenskyy hadn’t read the latest proposal, rather than that he wasn’t ready to accept it.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-07T12:24:37Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/c1dz0g2ykpeo",
    "title": "US could ask tourists for five-year social media history before entry",
    "summary": "US could ask foreign tourists for five-year social media history before entry3 hours ago Share Save James FitzGerald Share SaveWatch: \"We want safety\" - Trump addresses social media checks for tourists to the USTourists from dozens of countries including the UK could be asked to provide a five-year social media history as a condition of entry to the United States, under a new proposal unveiled by American officials.\nAsked whether the proposal could lead to a steep drop-off in tourism to the US, Trump said he was not concerned.\nAs well as the collection of social media information, the new document proposes the gathering of an applicant's telephone numbers and email addresses used over the last five and 10 years respectively, and more information about their family members.\nThe new proposal regarding ESTA data collection for tourists invites views from the public for 60 days.\nMeanwhile, immigration law practice Fragomen suggested there could be practical impacts as applicants could face longer waits for ESTA approvals.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-12-10T11:26:19Z",
    "source": "BBC News"
  },
  {
    "url": "https://abcnews.go.com/Politics/trump-speak-pennsylvania-start-selling-economic-agenda-ahead/story?id=128235129",
    "title": "Trump strays from selling economic policy in campaign-style speech that launched into insults",
    "summary": "President Donald Trump speaks at the Mount Airy Casino Resort in Mount Pocono, Pa., Tuesday, Dec. 9, 2025.\nThey gave you high prices.\nAnd again, they cause the high prices, and we're bringing them down.\nPresident Donald Trump speaks during a gathering at the Mount Airy Casino Resort in Mt.\nPresident Donald Trump participates in a roundtable discussion with farmers in the Cabinet Room of the White House, December 8, 2025 in Washington.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-09T16:56:41Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/law-meets-limits-nuremberg-reveals-140429980.html",
    "title": "The law meets its limits – what ‘Nuremberg’ reveals about guilt, evil and the quest for global justice",
    "summary": "Not the first attempt at international justiceThese trials were not the first effort to prosecute war crimes in an international court.\nThe 1921 Leipzig war crimes trials took place to take legal action against Germans accused of war crimes in World War I.\nU.S. Secretary of War Henry L. Stimson was a key proponent of an international tribunal to hold Nazis to account.\nThe International Military Tribunal proceedings began on Nov. 20, 1945, and the hearings lasted until Sept. 1, 1946.\nFormer Yugoslav President Slobodan Milosevic appears before the U.N. war crimes tribunal at The Hague on Feb. 13, 2002.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-08T14:04:29Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://dpa-international.com/politics/urn:newsml:dpa.com:20090101:251210-99-890239/",
    "title": "Russian film director Sokurov voices rare criticism in front of Putin",
    "summary": "Russian film director Alexander Sokurov delivered unusually blunt criticism of government policies in the presence of President Vladimir Putin, according to a video and transcript of a meeting of Putin's Human Rights Council released by the Kremlin.\nSokurov, whose 2011 film \"Faust\" won the top prize at the Venice Film Festival, criticized the treatment of dissenting voices branded as \"foreign agents\" and denounced censorship in film and literature.\n\"When I experienced these processes under Soviet rule, I was always told why my film would not be shown in the Soviet Union,\" said the director.\n\"Every week, we watch with concern to see who will be labelled a foreign agent next,\" Sokurov said, criticizing the classifications as humiliating.\nAccording to the transcript, Putin responded by saying relations between the state and the arts had always been difficult.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-10T19:10:26Z",
    "source": "Dpa-international.com"
  },
  {
    "url": "https://www.aljazeera.com/video/newsfeed/2025/12/9/thai-foreign-minister-says-cambodia-not-ready-to-negotiate-peace",
    "title": "Thai foreign minister says Cambodia not ready to negotiate peace",
    "summary": "Thai foreign minister says Cambodia not ready to negotiate peaceNewsFeed Thai foreign minister says Cambodia not ready to negotiate peaceThailand’s foreign minister has told Al Jazeera that Cambodia is “not ready” for peace negotiations and that the renewed border conflict between the two countries provides no space for a diplomatic solution.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-12-09T11:01:42Z",
    "source": "Al Jazeera English"
  }
]