[
  {
    "url": "https://www.bbc.com/news/articles/ckgmpnr4ex2o",
    "title": "UK names Christian Turner as ambassador to US, replacing Peter Mandelson",
    "summary": "UK names Christian Turner as ambassador to US, replacing Peter Mandelson3 days ago Share Save Tom Bennett , London and Bernd Debusmann Jr , White House Share SaveReutersThe UK has named career diplomat Christian Turner as its new ambassador to the US, Downing Street has confirmed.\nThe previous ambassador, Lord Peter Mandelson, was sacked by UK Prime Minister Sir Keir Starmer after evidence, including emails and photos, emerged showing his continued association with the paedophile Jeffery Epstein.\nTurner has spent nearly 30 years working across Whitehall and the Foreign Office.\nThe White House said it looked \"forward to working with Ambassador Turner to further enhance the strong relationship between the United States ‍and United ‌Kingdom\", according to a statement sent to Reuters news agency.\nAFP via Getty Images Peter Mandelson (right) announced US-UK trade agreement alongside Donald Trump in May",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-12-18T18:13:31Z",
    "source": "BBC News"
  },
  {
    "url": "https://abcnews.go.com/International/russia-preparing-year-war-despite-peace-talks-zelenskyy/story?id=128511257",
    "title": "Russia preparing for another year of war despite peace talks, Zelenskyy says",
    "summary": "Putin said Russia would achieve its goals either through talks or through war.\nRussia preparing for another year of war despite peace talks, Zelenskyy saysRussia's President Vladimir Putin and Chief of the General Staff Valery Gerasimov attend an expanded meeting of the Russian Defence Ministry Board at the National Defence Control Centre in Moscow, December 17, 2025.\nLONDON -- Ukrainian President Volodymyr Zelenskyy said in an address on Wednesday that Russia is preparing \"the coming year as a year of war,\" despite ongoing U.S.-brokered peace talks to end Moscow's full-scale invasion of its neighbor.\nZelenskyy said Russian President Vladimir Putin sent \"signals\" of Moscow's aggressive intent in remarks made on Wednesday, saying the bellicose comments were intended \"not only for us.\"\n\"If the opposing side and their foreign patrons refuse to engage in substantive talks, Russia will achieve the liberation of its historical lands by military means.\"",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-18T11:25:21Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.yahoo.com/news/articles/saudi-arabia-quietly-expands-access-061328942.html",
    "title": "Saudi Arabia quietly expands access to its only alcohol store for non-Muslim residents",
    "summary": "RIYADH, Saudi Arabia (AP) — Saudi Arabia has quietly expanded access to its only store that sells alcohol, allowing wealthy foreign residents to buy booze in the latest step in the once-ultraconservative kingdom’s experiment in liberalization.\nThe new rules allow non-Muslim foreigners who hold Premium Residency to buy.\nAdvertisement AdvertisementAdvertisement AdvertisementSaudi Arabia, home to the holiest sites in Islam, has banned alcohol since the early 1950s.\nOn weekends and holidays, the island sees an influx of visitors from Saudi Arabia and across the Gulf, making it a popular getaway.\nSome people in Saudi Arabia enjoy alcohol-free beverages as a substitute for the real thing or to capture the aesthetic of drinking, often snapping photos for social media.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-12-21T06:13:28Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/analysis-chinas-power-reforms-global-230907043.html",
    "title": "Analysis-China's power reforms, global data centre buildout usher in battery boom",
    "summary": "The boom \"is one of the biggest surprises of the year, I think, in China's energy space.\"\nThe International Energy Agency forecasts global investment in battery storage facilities will rise 16% this year to $66 billion.\n\"U.S. AI data centre power demand is very robust, but power is the biggest bottleneck, and U.S. baseload power - gas, nuclear, thermal - they ‌won't grow much in the next five years.\"\nHowever, much of that battery storage capacity has sat idle because it was not profitable to operate.\nIt is \"the most decisive policy shift for energy storage in over ‌a decade\", Jefferies analyst Johnson Wan wrote in a note.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-21T23:09:07Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.macrumors.com/2025/12/18/tiktok-sale-closing-january/",
    "title": "TikTok U.S. Sale to Oracle-Led Group Set to Close in January",
    "summary": "TikTok has agreed to sell its U.S. operations to an investment group that includes Oracle, Silver Lake, and UAE-based company MGX, reports Axios.\nThe \"TikTok USDS Joint Venture LLC\" that includes the three companies will own 45 percent of TikTok, while ByteDance will keep close to 20 percent.\nThe U.S. group will handle U.S. data protection and content moderation, while also maintaining algorithm security.\nWith the sale, TikTok will be able to continue operating in the United States while complying with the 2024 Protecting Americans From Foreign Adversary Controlled Applications Act.\nThe act required TikTok parent company ByteDance to sell TikTok's U.S. operations to a non-Chinese company or be banned from operating in the United States.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-12-19T00:41:45Z",
    "source": "MacRumors"
  },
  {
    "url": "https://www.theatlantic.com/ideas/2025/12/trump-government-spending-congress/685337/",
    "title": "Trump’s Power Grab Over the Budget Is Breaking the Constitutional Design",
    "summary": "Under the U.S. Constitution, Congress holds the “power of the purse,” meaning the authority to direct federal spending.\nThis congressional check on executive policy is particularly important today.\nStarting on his first day back in office, Trump undertook a concerted campaign to wrest control over spending from Congress.\nHis administration claimed that the president’s “executive power” under the Constitution included the authority to withhold spending.\nToday, the Trump administration is singing from Nixon’s hymnal—and succeeding in ways Nixon and Reagan could not.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-20T12:00:00Z",
    "source": "The Atlantic"
  },
  {
    "url": "https://www.businessinsider.com/us-visa-requirements-social-media-review-what-to-know-h1b-2025-12",
    "title": "US Reviewing Socials of Some Visa Applicants. What You Should Know.",
    "summary": "Impact LinkThe United States is reviewing the social media accounts of some visa applicants, adding another hurdle for workers and other visitors to clear under the Trump administration.\nThe State Department said in June that certain visa applicants would have their online activity vetted as part of its screening process.\nConsular offices began conducting online presence reviews for H-1B applicants on December 15, but they're not the only ones affected.\nThose companies and many others are still smarting after Trump imposed the $100,000 fee on new H-1B visa applicants in September.\nThe widespread panic in corporate America forced the Trump administration to clarify that the fee would only apply to new visa applicants, not existing visa holders.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-12-20T23:09:52Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.yahoo.com/news/articles/trump-enters-election-big-wins-110203554.html",
    "title": "Trump enters election year with big wins - and bigger political headwinds",
    "summary": "Back in January, as Trump triumphantly returned to the White House for a second term, he vowed to remake the economy, the federal bureaucracy, immigration policy and much ‌of U.S. cultural life.\nLike all U.S. presidents who cannot seek another term, Trump faces the inevitable waning of power in his second ‌year.\nAdvertisement AdvertisementAdvertisement Advertisement\"Much work remains,\" Desai said, adding that Trump and his administration will continue to focus on the issue.\nHe has done this through executive orders and emergency declarations that have shifted decision-making away from Congress and to the White House.\nAnd unlike his first term, Trump has total control over his cabinet, which is packed with loyalists.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-20T11:02:03Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/cj4qpwprw9vo",
    "title": "Probe ongoing after UK government hacked, says minister",
    "summary": "Inquiry ongoing after UK government hacked, says minister2 days ago Share Save Sam Francis Political reporter Share SaveGetty ImagesCyber security officials have confirmed they are aiding an investigation after a minister said the UK government had been hacked.\nTrade Minister Sir Chris Bryant said earlier that investigations were \"ongoing\" after an attack in October.\nThe UK government has not named who it thinks is responsible, with a spokesperson saying it has been \"working to investigate\" the incident.\nLast year, responding to the UK government's National Security Strategy, a spokesperson for the Chinese embassy in London said \"accusations such as Chinese espionage, cyber-attacks, and transnational repression against the UK are entirely fabricated, malicious slander\".\nEarlier this month, Sir Keir said UK government policy towards China could not continue to blow \"hot and cold\".",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-12-19T08:03:22Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.yahoo.com/news/videos/no-longer-famine-gaza-says-203239425.html",
    "title": "No longer famine in Gaza, says hunger monitor, but emergency remains",
    "summary": "Bryant was motionless as he was carted off the field.\nSean Payton told reporters after the game that Bryant was able to move his hands and legs.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-19T20:32:39Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/syria-welcomes-permanent-repeal-sweeping-154748606.html",
    "title": "Syria welcomes the permanent repeal of sweeping US sanctions",
    "summary": "DAMASCUS, Syria (AP) — Syria’s government and its allies on Friday welcomed the final lifting of the most draconian sanctions imposed on the country in recent decades.\nThey argued that the sanctions were preventing international investors from launching reconstruction projects and blocking Syria from rebuilding its battered economy and infrastructure.\nSome lawmakers had pushed for making the repeal conditional on steps by the new Sunni Islamist-dominated Syrian government to protect religious minorities, among other measures.\nAl-Sharaa thanked the leaders of all three countries, along with Trump, in a speech celebrating the end of the sanctions.\nThe Saudi foreign ministry commended \"the significant and positive role played by US President Donald Trump” in lifting the sanctions.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-19T15:47:48Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://uk.finance.yahoo.com/news/banks-win-bid-block-3-095756500.html",
    "title": "Banks win bid to block $3.6 billion mass forex UK lawsuit",
    "summary": "LONDON, Dec 18 (Reuters) - Major banks including JPMorgan, UBS and Citigroup on Thursday won their bid to block a 2.7 billion-pound ($3.6 billion) mass ​lawsuit over alleged foreign exchange rigging.\nThe lawsuit, which was also brought against Barclays, MUFG and NatWest, was based on findings made by the European Commission, which fined banks more than 1 billion euros ($1.1 billion) in 2019.\nThe CAT said ​the case could be brought on an opt-in basis, though it accepted that ‌would effectively end the litigation.\nEvans' case was revived by the Court of Appeal in 2023, but the banks' appeal was upheld by the United Kingdom's Supreme Court on Thursday.\nJudge Vivien Rose said the Competition Appeal Tribunal \"was right to assess the merits of the claim as weak\".",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-18T11:20:32Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.yahoo.com/news/articles/china-still-targeting-us-based-093000574.html",
    "title": "China still targeting US-based researchers for 'malign' purposes, lawmakers warned",
    "summary": "The comments came during a House science committee hearing focused on protecting US research from China.\nShe and other witnesses stressed that US agencies had responded to outreach efforts from China by tightening vetting procedures for foreign researchers, but warned against measures that could deter legitimate international cooperation.\nDaniel Evans, a senior research official at Nasa, said concerns about China's \"malign\" foreign talent recruitment programmes should not obscure the parallel challenge of retaining foreign-born researchers trained in the US.\nThis article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century.\nFor more SCMP stories, please explore the SCMP app or visit the SCMP's Facebook and Twitter pages.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-19T09:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.aljazeera.com/news/2025/12/19/five-key-takeaways-from-us-secretary-of-state-rubios-year-end-briefing",
    "title": "Five key takeaways from US State Secretary Rubio’s year-end briefing",
    "summary": "Top US diplomat Marco Rubio reiterates hard line against Venezuela’s Maduro, says Ukraine conflict is ‘not our war’.\nIn a two-hour briefing to reporters on Friday, the US secretary of state reiterated Trump’s hard line against Venezuela and defended cuts to foreign aid programmes.\nRubio’s comments come as the US continues to amass troops and military assets around Venezuela, raising speculation about plans to topple Maduro by force.\nRubio was asked on Friday how he would square Trump’s self-image as a peacemaker with the escalating military threats to Venezuela.\nAl Jazeera asked Rubio about Israel’s violations, but the secretary of state failed to address the premise of the question.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-19T23:17:59Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://finance.yahoo.com/news/europe-stumbles-attempt-sidestep-trump-090000409.html",
    "title": "Europe Stumbles in Its Attempt to Bypass Trump’s World Order",
    "summary": "Ursula von der Leyen was supposed to sign the European Union’s largest free-trade agreement on Saturday, proving the bloc’s standing as a geoeconomic force.\nBrazilian President Luiz Inacio Lula da Silva said earlier this week the time was now or never.\nOfficials say they will try again to sign the deal on Jan. 12, but there’s no guarantee.\nIt especially wants to prove it can move outside the orbit of China and the US, which have increasingly antagonistic trade relationships with Europe.\n“This is Europe’s independence moment,” von der Leyen said earlier this week, ahead of a summit when EU leaders would tackle funding options for Ukraine as well as Mercosur.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-20T09:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/china-launches-113-billion-free-054238950.html",
    "title": "China launches $113 billion free-trade experiment on Hainan island",
    "summary": "Foreign firms will also be able to operate in service ‌sectors that are restricted on the mainland.\n\"China aims to build the Hainan Free Trade Port into an important gateway that leads the country's opening-up into a new era,\" ⁠an editorial by the state news agency Xinhua said.\nForeign direct ‌investment into China fell 10.4% year-on-year in the first three quarters of 2025, official data shows.\nIf liberalisation succeeds in Hainan, economists say policymakers may feel emboldened to expose more of China's economy to market forces.\n\"In addition to boosting Hainan's tourism sector, the plan should also encourage more foreign investment and manufacturing,\" she added.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-18T05:42:38Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.thedailybeast.com/trumps-son-in-law-pitches-112b-tech-utopia-on-gaza-rubble/",
    "title": "Trump’s Son-in-Law Pitches $112B Tech Utopia on Gaza Rubble",
    "summary": "Ivanka Trump’s husband is trying to get Middle Eastern leaders to invest in his vision of a high-tech paradise built on the ruins of Gaza.\nJared and Witkoff are pitching a futuristic utopia built on the ruins of Gaza.\nWin McNamee/Getty ImagesTrump’s son-in-law and Witkoff reportedly pressed their business connections in the Middle East while hammering out a peace deal in the Israel-Hamas conflict.\nHowever, Middle East experts have serious doubts that Jared and Witkoff’s vision will ever come to fruition.\nReconstruction in Gaza would require the removal of 68 million tons of debris, undetonated land mines, and 10,000 killed Palestinians.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-12-20T19:10:52Z",
    "source": "Daily Beast"
  },
  {
    "url": "https://www.cnet.com/tech/services-and-software/december-16-tiktok-ban-didnt-happen-and-heres-why/",
    "title": "The TikTok Ban Was Set for Dec. 16. It Didn't Happen, and Here's Why",
    "summary": "You've probably noticed certain videos posted to the popular social media site were counting down to Dec. 16 -- Tuesday this week.\nThat was the date TikTok users expected the latest threatened ban to take effect.\nByteDance hasn't finalized the sale of TikTok's US business, meaning a ban of the app should've taken effect.\nThe Dec. 16 date for a ban was nullified Sept. 25, when Trump signed an executive order delaying the sale for 120 days, extending the prohibition to Jan. 23, 2026.\nThe TikTok ban is now set for January.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-18T00:08:00Z",
    "source": "CNET"
  },
  {
    "url": "https://www.aljazeera.com/news/2025/12/19/how-much-is-us-support-for-israel-costing-donald-trump",
    "title": "How much is US support for Israel costing Donald Trump?",
    "summary": "So how extensive is US support for Israel, and just how much might that backing cost both Trump and his Republican Party?\nSome of the most significant figures within the Make America Great Again (MAGA) movement have already rebelled over Trump’s unflinching support for Israel.\nTaking to social media, he wrote: “The real divide isn’t between people who support Israel and people who support Iran or the Palestinians.\nHas Trump’s support for Israel hurt his political base?\n“Israel’s behaviour during the war in Gaza has significantly accelerated the erosion of support for Israel among these key groups.”But it is not just within Trump’s traditional base where his support for Israel is costing him.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-19T07:33:45Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://www.aljazeera.com/video/talk-to-al-jazeera/2025/12/20/uruguays-fm-on-us-claims-to-police-latin-america-and-rising-tensions",
    "title": "Uruguay’s FM on US claims to police Latin America and rising tensions",
    "summary": "Mario Lubetkin on Washington’s revived sphere-of-influence doctrine, Venezuela, and China’s growing footprint.\nThe United States is reviving a policy first set out in the 1800s that treats Latin America as its strategic sphere of influence.\nAs Washington expands maritime operations in the Caribbean and eastern Pacific, critics warn of legal violations and rising regional instability.\nUruguay’s Foreign Minister Mario Lubetkin joins Talk to Al Jazeera to discuss US strikes, Venezuela, migration pressures, and China’s growing role in the region — and whether diplomacy can still prevent escalation in a hemisphere shaped once again by power politics.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-20T09:04:57Z",
    "source": "Al Jazeera English"
  }
]