[
  {
    "id": "MTA=",
    "url": "https://finance.yahoo.com/video/oil-prices-fair-target-amid-173000986.html",
    "title": "Oil prices: This would be a 'fair target' amid US–Iran tensions",
    "summary": "Mish, and I want to get to that too because I know you've been watching it.\nUm, you know, piled into all of the other stuff affecting inflation, we now have a potential conflict with Iran to contend with and the effect that that could have on oil prices.\nSo we've got oil prices that have now climbed over the past few sessions on concerns around that.\nSo, right now, I think $66 is a good pivotal area if you're looking at WTI oil.\nI think that's a fair target.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-20T19:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MjY=",
    "url": "https://yro.slashdot.org/story/26/02/21/2140216/americas-peace-corps-announces-tech-corps-volunteers-to-help-bring-ai-to-foreign-countries",
    "title": "America's Peace Corps Announces 'Tech Corps' Volunteers to Help Bring AI to Foreign Countries",
    "summary": "Please create an account to participate in the Slashdot moderation system",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-02-21T21:43:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MzE=",
    "url": "https://finance.yahoo.com/news/indonesia-tightens-control-nickel-us-041040093.html",
    "title": "Indonesia tightens control on nickel as the US and China scramble for critical minerals",
    "summary": "The move could still ripple through global EV supply chains as the United States and China compete for critical minerals.\nMore from Yahoo Scout How is Indonesia tightening control over global nickel supply?\nJakarta hoped that control over nickel would underpin a fully domestic EV industry, from mining and batteries to finished cars.\nChina has sourced nickel from Indonesia for decades, but the relationship deepened after Jakarta banned raw ore exports in 2020, drawing a surge of Chinese investment into smelters.\nNickel shipments to China jumped, with imports of nickel matte — a semiprocessed material used in battery chemicals and alloys — rising nearly 28-fold between 2020 and 2023, more than 90% of it from Indonesia, according to trade data.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-18T04:10:40Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mzk=",
    "url": "https://www.businessinsider.com/ukraine-attacked-russian-oil-depot-protected-by-anti-drone-nets-2026-2",
    "title": "Satellite images show Russia put up anti-drone nets to protect its fuel tanks. A Ukrainian attack punched through.",
    "summary": "Long-range Ukrainian drones struck an oil depot in Velikiye Luki, a city in western Russia's Pskov region, a source in the Security Service of Ukraine (SBU) said.\nThe source said protective anti-drone nets had been stretched above fuel tanks at the oil depot.\n- overnight, drones from the Special Operations Center \"Alpha\" of the Security Service of Ukraine successfully struck the Velikolukskaya oil depot.\nMoscow said its air defenses shot down roughly 300 Ukrainian drones over the past 24 hours.\nSince October, Ukrainian energy facilities have been the main target of Russian barrages, Britain's defense ministry said on Thursday.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-19T16:57:20Z",
    "source": "Business Insider"
  },
  {
    "id": "NTQ=",
    "url": "https://www.businessinsider.com/ukrainian-soldiers-carry-scissors-to-cut-fiber-optic-drone-cables-2026-2",
    "title": "Ukrainian soldiers armed with scissors say they cut any fiber-optic drone cable they see — even if it might be their own",
    "summary": "Fiber-optic drones can't be jammed, but can be stopped by destroying the cables that control them.\nFiber-optic drones can't be jammed, but can be stopped by destroying the cables that control them.\nJose Colon/Anadolu via Getty ImagesFiber-optic drones can't be jammed, but can be stopped by destroying the cables that control them.\nAn analyst with Ukraine's Unmanned Systems Forces said he carries scissors to cut the cables of fiber-optic drones he comes across.\nFiber-optic drones are a relatively new feature in this war that have not previously been fielded at this scale.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2026-02-19T13:08:01Z",
    "source": "Business Insider"
  },
  {
    "id": "NTU=",
    "url": "https://www.npr.org/2026/02/21/nx-s1-5720226/kenya-ukraine-russia-war",
    "title": "'Given a gun and sent to die': Kenyans lured to fight for Russia in Ukraine",
    "summary": "'Given a gun and sent to die': Kenyans lured to fight for Russia in Ukrainetoggle caption Simon Maina/AFP via Getty ImagesNAIROBI, Kenya — In Sikonga village, Kisii County, a mother's wails fill the house.\nAccording to the intelligence report, 89 Kenyans remain on the frontline, 39 have been hospitalized, and 28 are missing in action.\nSponsor Message\"More telling is the collusion by officers at the Russian Embassy and the Kenyan Embassy in Moscow,\" Ichung'wah told Parliament.\nOpposition MP Joseph Makilap, who pushed for the intelligence report to be released, said the scale of the recruitment was staggering.\nAccording to the Kenyan intelligence report the recruitment networks involve both Kenyan and foreign actors.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-21T11:20:58Z",
    "source": "NPR"
  },
  {
    "id": "NTc=",
    "url": "https://www.npr.org/2026/02/21/nx-s1-5720966/trump-iran",
    "title": "With U.S. forces in position, Trump mulls his options for Iran",
    "summary": "With U.S. forces in position, Trump mulls his options for Irantoggle caption Saul Loeb/AFP via Getty ImagesPresident Trump says he hasn't decided whether he'll launch a military strike on Iran.\nSome days he sounds like he would be satisfied with a negotiated deal on the country's nuclear program.\n\"There is no military solution for Iran's nuclear program,\" he told the MS NOW program Morning Joe.\nTrump wants Iran to effectively give up its nuclear program.\nHowever, Trump has so far not made a major speech to the American people about the prospect of a new Middle East war.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-21T11:00:00Z",
    "source": "NPR"
  },
  {
    "id": "NTg=",
    "url": "https://www.bbc.com/news/articles/cp81kw4pzd2o",
    "title": "US and EU trade deals put India on global stage but challenges remain",
    "summary": "March has not even begun and Delhi has concluded the \"mother of all trade deals\" with the European Union and also what's now being termed the \"father of all trade deals\" with the United States - even though grave concerns remain about the asymmetric nature of the interim agreement which, many say, is stacked heavily in favour of the US.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2026-02-18T00:02:20Z",
    "source": "BBC News"
  },
  {
    "id": "NTk=",
    "url": "https://abcnews.com/International/us-ukraine-russia-peace-talks-geneva-expected-resume/story?id=130256516",
    "title": "Day 2 of US-Ukraine-Russia peace talks in Geneva conclude, official says",
    "summary": "Day 2 of US-Ukraine-Russia peace talks in Geneva conclude, official saysProtesters hold placards and Ukrainian flags amid talks between Russian, Ukrainian and U.S. negotiators in Geneva, Switzerland, on Feb. 17, 2026.\nProtesters hold placards and Ukrainian flags amid talks between Russian, Ukrainian and U.S. negotiators in Geneva, Switzerland, on Feb. 17, 2026.\nProtesters hold placards and Ukrainian flags amid talks between Russian, Ukrainian and U.S. negotiators in Geneva, Switzerland, on Feb. 17, 2026.\nProtesters hold placards and Ukrainian flags amid talks between Russian, Ukrainian and U.S. negotiators in Geneva, Switzerland, on Feb. 17, 2026.\nProtesters hold placards and Ukrainian flags amid talks between Russian, Ukrainian and U.S. negotiators in Geneva, Switzerland, on Feb. 17, 2026.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2026-02-18T09:21:37Z",
    "source": "Abcnews.com"
  }
]