[
  {
    "id": "Mg==",
    "url": "https://www.npr.org/2025/12/31/g-s1-104088/up-first-newsletter-flu-cases-surge-venezuela-iran-protests",
    "title": "Why flu cases are surging this season. And, protests erupt in Iran over the economy",
    "summary": "Why flu cases are surging this season.\nToday's top storiesThe flu season is off to a rough start this year.\nInstead, this year's flu vaccine appears to be mismatched against the virus because it was formulated before the strain emerged.\nIran is experiencing its largest protests in years as thousands of people, unhappy with the state of the economy, flood the streets.\nHere's how NPR's Word of the Week has evolved into a long-standing tradition.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-12-31T12:30:43Z",
    "source": "NPR"
  },
  {
    "id": "OA==",
    "url": "https://www.bbc.com/news/articles/cqj2llkjv8vo",
    "title": "Protests spread across Iran for third day after currency hits record low",
    "summary": "Protests spread across Iran for third day after currency hits record lowThe Iranian government said it \"recognises the protests\" and would listen \"with patience, even if it is confronted with harsh voices\".\nThe protests began on Sunday after shopkeepers in Tehran's Grand Bazaar staged a strike when the Iranian rial hit a record low against the US dollar on the open market.\nProtests and strikes in Iran over inflation and currency devaluation have spread from the capital, Tehran, to several other cities on a third day of unrest.\nDuring a 12-day war between Israel and Iran in June, the US carried out air strikes on key Iranian uranium enrichment sites.\nIran's supreme leader has repeatedly said that Israel's government hoped mass protests would erupt in Iran during the war and topple the regime.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-12-30T16:31:18Z",
    "source": "BBC News"
  },
  {
    "id": "MTI=",
    "url": "https://www.businessinsider.com/aging-retirement-japan-social-security-financial-insecurity-working-at-80-2025-12",
    "title": "The US Is Aging Fast. Here's What It Can Learn From Japan.",
    "summary": "Researchers agreed Japan still has a long way to go in supporting its aging workers and preparing mid-career workers for a stable retirement.\nMany older Japanese workers are employed in low-wage jobs, as many companies remain reluctant to hire older workers for higher-paid positions.\nMany older Japanese workers earn money out of necessity, said Yasuo Takao, a political scientist at Curtin University in Australia.\nJapan has a two-tier mandatory public pension system that relies on contributions, which is \"highly sensitive to population aging,\" Takao said.\nLong-term, this could mean older workers may be less pressured to stay on the job or may have more flexible hours.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-28T08:16:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjM=",
    "url": "https://www.businessinsider.com/israel-tech-staff-increasingly-seek-relocation-abroad-report-2025-12",
    "title": "Israeli innovation is under threat as tech employees seek relocation abroad: report",
    "summary": "Some of the world's largest tech companies have a presence in Israel, including Apple, Meta, Nvidia, Amazon, Microsoft, IBM, and Google.\nIsrael's tech sector is a key driver of its economy.\nThe Israel Innovation Authority, a government body, said the tech industry contributed one-fifth of the country's GDP in 2023.\nThe IATI report said that there are around 430 multinational companies in Israel, with around 90,000 high-tech employees working for them.\nDror Bin, the CEO of the Israel Innovation Authority, previously said that the Israeli economy's dependence on the high-tech sector had \"significantly grown in the past decade.\"",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-12-29T13:33:17Z",
    "source": "Business Insider"
  },
  {
    "id": "NDE=",
    "url": "https://www.aljazeera.com/news/2025/12/29/protests-strikes-after-irans-economic-situation-rapidly-deteriorates",
    "title": "Protests, strikes after Iran’s economic situation rapidly deteriorates",
    "summary": "Iranians are further squeezed every day amid a tanking economy, an energy crisis, water bankruptcy and lethal pollution.\nFor years, Iran has also been dealing with an exacerbating energy crisis, which has periodically contributed to deadly air pollution that claims tens of thousands of lives each year.\nThe attacks also significantly damaged or destroyed most of Iran’s nuclear facilities, which were under the supervision of the International Atomic Energy Agency (IAEA).\nHundreds of people were killed, over 20,000 people were arrested, and several people were executed in connection with the protests before they subsided.\nAuthorities blamed foreign influence and “rioters” trying to destabilise the country, as they did with previous rounds of protests.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-29T15:08:24Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NDg=",
    "url": "https://www.jpost.com/israel-news/article-881597",
    "title": "Peleg Yerushalmi protesters block Highway 4 near Bnei Brak",
    "summary": "Haredi Peleg Yerushalmi protest blocks Highway 4, police attempt to disperse anti-draft activists Members of the Peleg Yerushalmi anti-IDF draft group blocked Highway 4 near Bnei Brak, as Border Police moved to disperse demonstrators and reopen the road.\nHaredi protesters block Highway 4 near Bnei Brak during a protest denouncing the IDF draft, December 28, 2025.\n( photo credit : David Cohen/Flash90 )",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-28T16:53:00Z",
    "source": "The Jerusalem Post"
  },
  {
    "id": "NTA=",
    "url": "https://www.yahoo.com/news/articles/kosovo-voters-cast-ballots-second-071143444.html",
    "title": "Preliminary results show Prime Minister Kurti's party won Kosovo snap vote convincingly",
    "summary": "PRISTINA, Kosovo (AP) — Kosovo 's Prime Minister Albin Kurti appeared set for another term in office after his party on Sunday convincingly won an early parliamentary election in the Balkan country, preliminary results showed.\nThe Vetevendosje, or Self-Determination, party won nearly 50% of the ballots, far ahead of the opposition Democratic Party of Kosovo with 21%, and the Democratic League of Kosovo with nearly 14%, the state election, authorities said after nearly all the ballots were counted.\n“Congratulations on the biggest victory in the history of the country,” a cheerful Kurti said after results were announced.\nIt was not immediately clear whether the Self-Determination party has won 61 seats in the 120-member parliament to be able to rule alone.\nHundreds of ruling party supporters gathered outside the party offices in Pristina in celebration, chanting Kurti's name.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-28T07:11:43Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTI=",
    "url": "https://www.jpost.com/israel-news/defense-news/article-881599",
    "title": "Israelis rescued after entering Tulkarm",
    "summary": "Two Israelis rescued after entering Tulkarm under influence of alcohol Following the report, officers from the Coordination and Liaison Administration provided immediate protection to the Israelis and coordinated their transfer to the IDF through establishedAn Israeli soldier and a Palestinian man speak in Beit Lid, near Tulkarm, in the West Bank, November 7, 2025 ( photo credit : REUTERS/RANEEN SAWAFTA )",
    "category": "international",
    "bias": "right",
    "publishedAt": "2025-12-28T16:55:21Z",
    "source": "The Jerusalem Post"
  },
  {
    "id": "NTQ=",
    "url": "https://www.bbc.com/news/articles/c4g4g5lgngvo",
    "title": "Ukraine denies drone attack on Putin's residence",
    "summary": "Ukraine denies drone attack on Putin's residence2 days ago Share Save Amy Walker Share SaveEPAPresident Volodymyr Zelensky has denied allegations by Russia that Ukraine launched a drone attack on one of President Vladimir Putin's residences, and accused Moscow of trying to derail peace talks.\nRussia's Foreign Minister Sergei Lavrov claimed Kyiv had launched an attack over Sunday night using 91 long-range unmanned aerial vehicles (UAVs) on Putin's state residence in Russia's northwestern Novgorod region.\nZelensky dismissed the claim as \"typical Russian lies\", intended to give the Kremlin an excuse to continue attacks on Ukraine.\n\"Almost a day passed, and Russia still hasn't provided any plausible evidence to its accusations of Ukraine's alleged 'attack on Putin's residence'.\n\"I don't trust Putin and he doesn't want success for Ukraine,\" Zelensky added.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-12-29T17:02:50Z",
    "source": "BBC News"
  },
  {
    "id": "NTU=",
    "url": "https://www.yahoo.com/news/articles/pakistan-premier-offers-complete-solidarity-171951057.html",
    "title": "Pakistan’s premier offers 'complete solidarity' to Saudi Crown Prince after Yemen port strike",
    "summary": "ISLAMABAD (AP) — Pakistan’s Prime Minister spoke by telephone with the Saudi Crown Prince Mohammed bin Salman on Wednesday to express his “complete solidarity” with the Kingdom following this week's Saudi bombing of Yemen's port city of Mukalla, the prime minister’s office said.\nAccording to the statement, Shehbaz Sharif also stressed the need to maintain regional peace and stability through dialogue and diplomacy.\nIt said the crown prince also expressed his intention to pay an official visit to Pakistan next year.\nSaudi Arabia has long maintained close economic, religious, and security ties with Pakistan, while the UAE has also helped Islamabad with loans in recent years.\nIn 2024, Pakistan said the UAE had committed to investing up to $10 billion in Pakistan.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-31T17:19:51Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTY=",
    "url": "https://www.yahoo.com/news/articles/tokyo-expresses-concern-beijing-over-093000704.html",
    "title": "Beijing hits back at 'extremely hypocritical' critics of PLA drills around Taiwan",
    "summary": "Beijing has hit back against concerns raised by foreign countries, including Japan, over its military drills around Taiwan, accusing critics of being \"extremely hypocritical\".\nBeijing launched massive live-fire drills and blockade exercises around Taiwan on Monday and Tuesday, firing rockets and mobilising destroyers and missile launchers.\nThe People's Liberation Army (PLA) said the drills served as a warning to \"independence forces\" and against external interference.\nMeanwhile, Tokyo also said on Wednesday that Chinese coastguard vessels had patrolled near the Diaoyu Islands, another flashpoint, for a record number of days this year.\nThe Diaoyu Islands, northeast of Taiwan in the East China Sea, consist of five uninhabited islets and three reefs.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-31T09:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NTc=",
    "url": "https://www.aljazeera.com/video/the-bottom-line/2025/12/28/javad-zarif-main-threat-to-the-middle-east-is-israel-not-iran",
    "title": "Javad Zarif: Main threat to the Middle East is Israel, not Iran",
    "summary": "Iran’s former foreign minister argues Israel, backed by the US, has killed every opportunity for peace.\nMonths after being attacked by the United States and Israel, Iran finds itself in the crosshairs again, with Israeli officials lobbying US President Donald Trump to address Tehran’s ballistic missiles.\nVeteran Iranian diplomat Javad Zarif tells host Steve Clemons that “everybody lost any faith in diplomacy” after Israel and the US attacked Iran following five rounds of reconciliation talks between Washington and Tehran.\nZarif added that Israel has historically thwarted every opportunity for reconciliation between Iran and the US, and that Trump’s style of diplomacy is disastrous, as it creates “negotiations that end up in war”.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-28T14:43:12Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTk=",
    "url": "https://www.yahoo.com/news/articles/why-feud-between-tokyo-beijing-093000905.html",
    "title": "Why the feud between Tokyo and Beijing could rage on for a while yet",
    "summary": "Nearly two months after Japan's new prime minister enraged Beijing with her remarks on Taiwan, the issue is not going away.\nSanae Takaichi set off a diplomatic firestorm in November when she suggested that Japan could justify a military response if Beijing attacked Taiwan.\nWu said Japan's involvement in the South China Sea and the Taiwan Strait in the past decade was partly fuelling Beijing's concerns.\nThis article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century.\nCopyright © 2025 South China Morning Post Publishers Ltd. All rights reserved.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-29T09:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NjA=",
    "url": "https://www.yahoo.com/news/articles/us-pledges-2-billion-humanitarian-111233712.html",
    "title": "US pledges $2 billion in new UN model for delivery of humanitarian assistance",
    "summary": "U.N. data shows total U.S. humanitarian contributions to the U.N. fell to about $3.38 billion in 2025, equating to about 14.8% of the global sum.\nThis ⁠was down sharply from $14.1 billion the prior year, and ‌a peak of $17.2 billion in 2022.\nAdvertisement AdvertisementAdvertisement AdvertisementJeremy Lewin, State Department Under Secretary of State for Foreign Assistance, Humanitarian Affairs and Religious Freedom, said further countries ​would be added as more money is contributed to the mechanism.\nFletcher ​said that donors would have \"specific requirements\" around which countries and what type of work should ​be funded.\nLewin said the focus of the ‍funding was on life-saving assistance, while funding ⁠for climate-related and other projects that were not a priority for the administration would be cut out.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-29T17:39:59Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NjE=",
    "url": "https://abcnews.go.com/International/russian-official-threatens-zelenskyy-moscow-claims-kyiv-attacked/story?id=128774157",
    "title": "Russian official threatens Zelenskyy as Moscow claims Kyiv attacked Putin residence",
    "summary": "LONDON -- A top Russian official on Monday issued personal threats against Ukrainian President Volodymyr Zelenskyy after Russia claimed that Ukraine launched a drone attack on one of Russian President Vladimir Putin's official residences.\nUkrainian President Volodymyr Zelenskyy attends a joint news conference in Palm Beach, Florida, on Dec. 28, 2025.\nWhen pressed on whether there was any evidence that Putin's residence was actually attacked, Trump said it's possible it didn't happen.\nRussian President Vladimir Putin holds his annual end-of-year press conference in Moscow, December 19, 2025.\nLavrov said that Russia does not intend to withdraw from the negotiation process following the alleged attack.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-12-30T10:01:23Z",
    "source": "ABC News"
  },
  {
    "id": "NjI=",
    "url": "https://www.bbc.com/news/articles/c8xdxz48l7yo",
    "title": "UAE says it will withdraw from Yemen after Saudi strike on separatist-held port",
    "summary": "UAE says it will withdraw from Yemen after Saudi strike on separatist-held port1 day ago Share Save David Gritten Share SaveEPA The UAE-backed Southern Transitional Council (STC) seeks independence for southern YemenThe United Arab Emirates has said it will withdraw its remaining forces from Yemen, after Saudi Arabia backed a demand from the Yemeni presidential council for them to leave within 24 hours.\nThe Emirati announcement followed an air strike by a Saudi-led military coalition on what it said was a weapons shipment for UAE-backed separatist forces in the southern port of Mukalla.\nThe UAE denied the shipment contained weapons and expressed \"deep regret\" at the Saudi accusations.\nThe strongly worded statement issued by Saudi Arabia's foreign ministry on Tuesday morning said it was working to \"contain the escalatory steps\" taken recently by the Southern Transitional Council (STC), which seeks independence for southern Yemen.\nAFP The Saudi-led coalition air strike on Mukalla destroyed a number of military vehicles and pick-up trucks",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-12-30T14:08:40Z",
    "source": "BBC News"
  }
]