[
  {
    "url": "https://abcnews.go.com/Politics/trump-xi-meeting-fate-global-economy-hangs-balance/story?id=126978226",
    "title": "Trump orders nuclear weapons testing ahead of high-stakes meeting with Xi",
    "summary": "Leading up to the meeting, Trump said it could last three to four hours.\nPresident Donald Trump and Chinese President Xi Jinping shake hands before their meeting at Gimhae International Airport in Busan, South Korea, Oct. 30, 2025.\nPresident Donald Trump speaks with Chinese President Xi Jinping during a bilateral meeting at Gimhae Air Base on October 30, 2025 in Busan, South Korea.\nPresident Donald Trump meets with Chinese President Xi Jinping during a meeting on the sidelines of the G-20 summit in Osaka, Japan, June 29, 2019.\nKiichiro Sato/APSome experts say President Xi is angling for President Trump to signal a shift in U.S. support for Taiwan, the democratically governed island that Beijing claims as its own.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-29T16:47:54Z",
    "source": "ABC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/c1j8zn0ex9ro",
    "title": "Trump's Asia tour sees deals, knee-bending and a revealing Xi meeting",
    "summary": "Trump's stops in Malaysia, Japan and South Korea over the course of the first four days were an exercise in pleasing a sometimes mercurial American president.\nWith China, Trump may flick his pen, but such actions come with consequences.\nHe also presided over a treaty that should ease border tensions between Thailand and Cambodia – the kind of \"peace deal\" the American president loves to tout.\nThe main event of Trump's Asia trip came in its final hours, however, as he met with Xi.\nTrump's mood was upbeat after the meeting, which he described as \"amazing\" and graded a 12 on a scale of 1-10.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-30T18:06:02Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cly9z3r1dmzo",
    "title": "Steven van de Velde: Dutch volleyball player and child rapist denied Australian visa",
    "summary": "Dutch volleyball player and convicted child rapist denied visa to compete in AustraliaTwo weeks ago, South Australia's Attorney-General Kyam Maher wrote to the federal government, calling on authorities to reject his visa as his crimes were \"utterly abhorrent\".\nSteven van de Velde, 31, was due to play at the Beach Volleyball World Championships in Adelaide, South Australia, next month.\nA Dutch Olympic volleyball player convicted of raping a British girl a decade ago has been denied a visa to compete in Australia.\nAfter the rape in 2014, Van de Velde returned to the Netherlands but in 2016, he was extradited to the UK and arrested.\nThe BBC has contacted the organisers of the world championship event in South Australia and the Dutch national volleyball association for comment.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-28T02:07:10Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/cly4jz9zr50o",
    "title": "S Korea announces lowering of tariffs as part of new US trade deal",
    "summary": "South Korea's presidential aide, Kim Yong-beom, said the two sides will reduce reciprocal tariffs from 25% to 15%, as was agreed earlier this year.\nSouth Korea will also invest $350bn (£265bn) in the US, including $200bn in cash investment and $150bn in shipbuilding, Kim said.\n\"We had a tremendous meeting today with South Korea\", Trump said of his discussions with South Korean President Lee Jae Myung, adding that \"a lot was determined\".\nNoting the long-standing tensions between North and South Korea, Trump said \"we will see what we can do to get that all straightened out\".\nChinese interference became a common trope in conspiracy theories about former South Korean president Yoon Suk Yeol.",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-29T09:00:10Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.scientificamerican.com/article/trumps-baffling-call-for-resuming-u-s-nuclear-tests/",
    "title": "Trump’s Baffling Call for Resuming U.S. Nuclear Tests",
    "summary": "The Project 2025 report, now acknowledged by Trump as an indicator of his administration’s policies, had called for resuming U.S. nuclear testing to ensure the performance of the nuclear stockpile.\nThe U.S can presently test nuclear weapons in every way, shape or form—except for doing explosive tests that create yield.\nThe U.S. knows more about its nuclear weapons today than it did in the period when it was testing them.\nProject 2025 called for resuming underground nuclear tests, though.\nAnd the Department of Defense doesn’t have any role in this, really, because nuclear testing is handled by the Department of Energy.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-30T16:45:00Z",
    "source": "Scientific American"
  },
  {
    "url": "https://www.bbc.com/news/articles/c9864rgqqz7o",
    "title": "Methanol poisoning: Laos survivor says warnings must go further",
    "summary": "Methanol poisoning survivor says influencer campaign not enough3 days ago Share Save Jack Gray BBC Newsbeat Share SaveBethany Clarke Bethany Clarke (left) and her friend Simone White became ill after being offered shots in LaosA survivor of a mass methanol poisoning in Laos says an influencer campaign designed to warn young travellers about the deadly substance doesn’t go far enough.\nThe UK government has recruited students and influencers to promote safety messages about methanol poisoning on social media.\nThere has been pressure on the government to do more to highlight the risks of methanol poisoning since the deaths in Laos.\nAlthough she has a full-time job and describes social media as a \"hobby\", she has more than 40,000 TikTok followers on her travel-focused account.\n\"One was a focus on methanol poisoning when travelling,\" she says.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-10-29T10:20:27Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.vox.com/politics/466624/xi-trump-trade-nukes-taiwan",
    "title": "Trump isn’t interested in war with China. But it might be interested in him.",
    "summary": "In particular, Xi is reportedly seeking a statement from Trump formally opposing Taiwan’s independence.\nBefore the meeting, one Trump aide told NBC News that “everyone is holding their breath” to hear what he would say about Taiwan.\nIn the end, according to Trump, the issue did not even come up at the meeting in Korea.\nIf Trump actually means a return to active nuclear testing — detonating warheads — that would be a major escalation that could prompt reciprocal moves from Russia and China.\nTrump may not be interested in war with China, but war with China could still be interested in him.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-30T15:42:17Z",
    "source": "Vox"
  },
  {
    "url": "https://www.businessinsider.com/trump-order-us-nuclear-weapons-test-china-russia-2025-10",
    "title": "Trump is ordering the US to revive nuclear weapons tests after a 33-year hiatus",
    "summary": "Trump met Xi on Thursday in South Korea, just after he announced that the US would resume nuclear weapons testing.\nTrump met Xi on Thursday in South Korea, just after he announced that the US would resume nuclear weapons testing.\nAndrew Harnik/Getty ImagesTrump met Xi on Thursday in South Korea, just after he announced that the US would resume nuclear weapons testing.\nTrump said little about what these nuclear weapons tests would entail, or when exactly they would begin.\nFears of a nuclear arms raceMoscow, meanwhile, said it's been actively testing nuclear superweapons.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-30T04:35:55Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/openai-anthropic-perplexity-expand-india-next-billion-ai-users-2025-10",
    "title": "OpenAI, Anthropic, Perplexity Expand in India for Next Billion Users",
    "summary": "In recent months, American AI companies, such as OpenAI and Perplexity, have also steadily expanded their footprint in India, the world's largest open internet market outside the US.\nFor the big AI companies, however, \"India is not the 'next billion users' market.\nBy the time Anadan left Google in 2019, he said that India was the single largest market for all the company's largest products.\nIndia's AI infrastructureWestern tech companies are also racing to build the infrastructure needed to power AI in India.\nAs AI companies scale up in India, they're bringing new forms of risk with them.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-10-29T09:00:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.bbc.com/news/articles/cvg70064d2vo",
    "title": "BBC 'deeply concerned' about journalist unable to leave Vietnam",
    "summary": "BBC 'deeply concerned' about journalist unable to leave VietnamThe BBC said it was \"deeply concerned\" about the well-being of one its journalists who has been unable to leave Vietnam for several months.\nThe Vietnamese national travelled to the country to visit family and renew their passport, but the document and their ID card have been withheld and they have been subjected to \"multiple days of questioning\", the corporation said in a statement.\nThe BBC is urging Vietnamese authorities to allow the journalist to leave immediately and return to work by providing the renewed passport.\nIt comes as general secretary of the Communist Party of Vietnam, To Lam, arrived in the UK on Tuesday, for a visit during which he is expected to meet Sir Keir Starmer.",
    "category": "international",
    "bias": "lean right",
    "publishedAt": "2025-10-28T22:27:22Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.bbc.com/news/articles/c4gj90j2g8jo",
    "title": "Israel confirms identities of hostages' bodies returned by Hamas",
    "summary": "Israel confirms identities of hostages' bodies returned by Hamas13 hours ago Share Save David Gritten Jerusalem Share SaveReuters The Israeli military said Sahar Baruch (L) and Amiram Cooper (R) were killed by their captorsIsrael has confirmed the identities of two deceased hostages whose bodies it received from Hamas via the Red Cross in Gaza on Thursday.\nThe Hostages and Missing Families Forum in Israel demanded that all 11 Israeli and foreign deceased hostages still in Gaza be returned immediately by Hamas in line with the US-brokered ceasefire agreement.\nThe Israeli military said it estimated Amiram was murdered in captivity in February 2024, but that final conclusions will be made upon completion of a post-mortem.\nThe Israeli military said it estimated that he was murdered in captivity on 8 December 2023, and that it was awaiting the results of a post-mortem.\nThe Hostages and Missing Families Forum, which represents many hostages' families, said: \"There are no words to express the depth of this pain.\"",
    "category": "international",
    "bias": "center",
    "publishedAt": "2025-10-30T15:26:27Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/miss-universe-pageant-new-ceo-mario-bucaro-anne-jakrajutatip-replaced-2025-10",
    "title": "Miss Universe announces a new CEO just days before contestants are set to arrive in Thailand for the 2025 pageant",
    "summary": "Impact LinkBeauty queens from around the world are soon set to arrive in Thailand for the start of the Miss Universe pageant, which will take place from November 2 to 21.\nHe also served as Guatemala's Minister of Foreign Affairs for two years before joining Miss Universe.\nJakrajutatip with Miss Universe 2020 Andrea Meza, Miss Universe 2018 Catriona Gray, former Miss Universe president Paula Shugart, and former Miss Universe CEO Amy Emmerich in 2023.\nJakrajutatip with Miss Universe president Raul Rocha and Miss Universe 2024 Victoria Kjær Theilvig.\nMiss Universe has shared similar struggles with the Miss USA pageant, which it oversees.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-29T23:16:24Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theatlantic.com/ideas/archive/2025/10/zero-immigration-trump-ice/684728/",
    "title": "America’s Impending Population Collapse",
    "summary": "In the buoyant decades after World War II, net migration was low compared with the Ellis Island era of the early 20th century, but still positive.\nIt may be powerful enough to bring net migration down to zero, perhaps for some time.\nWe know because the United States has tried it before.\nThe number of native-born American workers in prime age has been stuck since 2013, and it is not expected to start growing.\nThe United States has always been a nation of expansion: It has never before experienced population shrinkage year after year.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-29T10:30:00Z",
    "source": "The Atlantic"
  },
  {
    "url": "https://www.aljazeera.com/opinions/2025/10/30/washingtons-blob-is-helping-whitewash-sudans-war-crimes",
    "title": "Washington’s ‘Blob’ is helping whitewash war crimes in Sudan",
    "summary": "This apparatus not only sustains conservative inertia but also defines the limits of what is considered possible in policy.\nRSF militiamen carry out their atrocities with confidence, knowing that responsibility will be blurred and its burden scattered across the parties.\nThis discourse serves as an overture to the Blob, leveraging shared geopolitical priorities to portray the RSF as a pragmatic partner in regional stability.\nThis fundamental distinction highlights the Blob’s contrived equivalence, conflating legitimate state-to-state engagements with the illicit empowerment of atrocity perpetrators.\nThese networks are often presented in Blob forums as “civilian stakeholders” or “pragmatic moderates”, sidelining authentic grassroots entities inside Sudan.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-30T07:38:13Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://finance.yahoo.com/news/chinas-rare-earth-export-delay-185937136.html",
    "title": "China's rare earth export delay offers US a chance to weaken Beijing's grip on the market",
    "summary": "But it will be hard to undercut China's stranglehold on the market.\nThe restrictions China imposed on rare earths this year have been a key issue in the trade talks between Beijing and Washington.\nChina accounts for nearly 70% of the world’s rare earths mining.\nIt also controls roughly 90% of global rare earths processing.\nThe West is making progressIan Lange, who is an economics professor who focuses on rare earths at the Colorado School of Mines, said he thinks the U.S. and its allies can make significant progress in a year’s time to lessen China’s dominance of the rare earths market.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-30T18:59:37Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/cx2p94x4pvro",
    "title": "Hotel lockdowns and honeymoon hit as Britons caught up in Hurricane Melissa",
    "summary": "Hotel lockdowns and honeymoon hit as Britons caught up in Hurricane Melissa3 days ago Share Save Kathryn Armstrong , Kerena Cobbina and NJ Convery Share SaveDavid RoweFor Rob Cuff and his wife Leah, their Jamaican honeymoon is coming to an uncertain end as Hurricane Melissa, the strongest storm to hit the Caribbean island in modern history, bears down.\nThey are among the UK nationals on the island bracing themselves for what could be the most powerful storm ever to hit Jamaica.\nHurricane Melissa is forecast to bring \"catastrophic and life-threatening conditions, and made landfall with with winds of up to 185mph (297km/h).\n\"This is a bad one,\" Ms Jenny told BBC Radio Northampton.\nDonnalee Ellis Donnalee Ellis now lives in London but was in Jamaica when Hurricane Gilbert struck in the 1980s",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-28T17:13:15Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.aljazeera.com/news/2025/10/29/last-ditch-push-pakistan-afghanistan-talks-falter-amid-deep-mistrust",
    "title": "‘Last-ditch push’: Pakistan-Afghanistan talks falter amid deep mistrust",
    "summary": "Syed added that their historical grievances and Pakistan’s past interventions in Afghanistan make concessions politically risky for the Afghan Taliban.\nA fraught friendshipHistorically, Pakistan was long perceived as the primary patron of the Afghan Taliban.\nAlthough independent from the Afghan Taliban, the two groups are ideologically aligned.\n“The response by the Afghan Taliban of attacking the Pakistani military on [the] border was seen as a forceful response, increasing their popularity.\n“If Akhunzada issues an edict, declaring Jihad against Pakistan, many young Afghans could potentially join the ranks of [the] Taliban,” Yousafzai warned.",
    "category": "international",
    "bias": "lean left",
    "publishedAt": "2025-10-29T00:38:36Z",
    "source": "Al Jazeera English"
  },
  {
    "url": "https://indianexpress.com/article/business/aviation/indigo-air-india-ceo-back-government-market-access-foreign-airlines-10334177/",
    "title": "IndiGo, Air India CEOs back government’s cautious stance on market access to large foreign airlines",
    "summary": "Story continues below this ad“The image that some like to portray that India is not giving any traffic rights is just wrong.\nStory continues below this adWilson also said that the issue of market access and imbalances doesn’t pertain to just bilateral air traffic rights, but also the shortage of slots at busy airports.\nHe argued that various large overseas carriers were able to secure slots long ago, while carriers like Air India that are “starting somewhat later” don’t enjoy the same luxury.\nThe Indian government and major Indian carriers like Air India and IndiGo have ambitions to have more direct international connectivity from India and to turn the country into an international aviation hub.\nThe India-Dubai bilateral air services agreement has not been revised in over a decade.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-29T12:03:59Z",
    "source": "The Indian Express"
  },
  {
    "url": "https://www.nakedcapitalism.com/2025/10/coffee-break-armed-madhouse-gunboat-stupidity.html",
    "title": "Coffee Break: Armed Madhouse – Gunboat Stupidity",
    "summary": "The Littoral Combat Ship (LCS), conceived in the early 2000s as a sleek, fast instrument of military force in contested littoral waters, is now being quietly retired.\nThis article explains the convergent failures of the LCS program and the associated coercive diplomacy concept.\nThe two designs, the Freedom-class littoral combat ship monohull and the Independence-class littoral combat ship trimaran, represented sharply different engineering philosophies.\nThe Yemen Missile Campaign: Proof of Failed Gunboat DiplomacyIf the Littoral Combat Ship program represents the conceptual failure of gunboat diplomacy, the Yemen missile campaign represents its operational collapse.\nAcknowledging LCS FailureThe U.S. Navy has quietly acknowledged the failure of the Littoral Combat Ship (LCS) program.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-28T18:00:43Z",
    "source": "Nakedcapitalism.com"
  },
  {
    "url": "https://biztoc.com/x/e342252615bab3fc",
    "title": "Trump's Grand Latin America Strategy Starts to Bear Fruit",
    "summary": "Nine months into Donald Trump’s second term, Latin America has become a central focus of U.S. foreign policy.\nThis story appeared on newsweek.com , 2025-10-28 21:49:27.",
    "category": "international",
    "bias": "left",
    "publishedAt": "2025-10-28T21:52:24Z",
    "source": "Biztoc.com"
  }
]