[
  {
    "id": "Mw==",
    "url": "https://www.androidcentral.com/phones/oneplus/allegations-claim-the-oneplus-16-might-give-global-markets-the-cold-shoulder",
    "title": "OnePlus 16 may go exclusive to China, leaving global fans in the dark",
    "summary": "What you need to knowRumors claim that the OnePlus 16 might ditch global markets this year, though the reason is unclear.\nThe post states that the OnePlus 16 might \"be exclusive to China only\" this year.\nBrar's recent post on X goes over some alleged OnePlus 16 camera specs, which we've seen before.\nAs the publication reiterates, the OnePlus 16 is expected to debut later this year, potentially in Q4, which would line up with the OEM's typical cadence.\nFor now, we have some early OnePlus 16 rumors that claim the device could feature a 200MP sensor and a periscope telephoto lens.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-20T10:09:00Z",
    "source": "Android Central"
  },
  {
    "id": "NQ==",
    "url": "https://www.androidcentral.com/phones/oneplus/oneplus-isnt-going-away-but-it-may-not-have-quite-as-big-a-presence-in-2026",
    "title": "'We’re operating as usual and will continue to do so:' OnePlus India CEO says the brand isn't going anywhere",
    "summary": "And when it comes to other countries, OnePlus India CEO Robin Liu confirmed that there isn't any change in how OnePlus is conducting its business in the region:I wanted to address some misinformation that has been circulating about OnePlus India and its operations.\n(Image credit: Harish Jonnalagadda / Android Central)But this doesn't mean OnePlus itself is going away — far from it.\nThe brand isn't changing how it's doing business in India, and although sales in the country declined last year, it continues to have a sizable presence.\n(Image credit: Apoorva Bhardwaj / Android Central)There's no doubting that OnePlus doesn't have any of the freedom it enjoyed as a standalone entity under BBK.\nThat said, OPPO isn't willing to squander the cachet OnePlus built up in India over the course of the last decade.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-20T18:42:47Z",
    "source": "Android Central"
  },
  {
    "id": "MTU=",
    "url": "https://www.theverge.com/news/864622/ftc-meta-antitrust-ruling-appeal",
    "title": "FTC says it will appeal Meta antitrust loss",
    "summary": "She spent 5 years covering tech policy at CNBC, writing about antitrust, privacy, and content moderation reform.\nThe Federal Trade Commission will appeal its loss in a landmark antitrust case against Meta, the agency announced Tuesday.\nThe FTC argued that Meta’s dominance let it degrade the quality of its service without any real alternatives for consumers to flee to.\n“The U.S. economy thrives when competition can flourish and U.S. businesses compete fairly against one another,” FTC Bureau of Competition Director Daniel Guarnera said in a statement.\n“We will remain focused on innovating and investing in America.”Update, January 20th: Added Meta statement.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-20T22:21:31Z",
    "source": "The Verge"
  },
  {
    "id": "MTY=",
    "url": "https://www.wired.com/story/ai-super-pacs-trying-to-influence-midterms/",
    "title": "Pro-AI Super PACs Are Already All In on the Midterms",
    "summary": "Technology executives, investors, and companies tied to the AI boom are funding a new network of AI-focused super PACS, which is poised to make AI a major issue in this year’s state and federal elections races.\nThe election spending marks a sharp escalation of the AI regulation debate that has divided Silicon Valley for years.\nIn December, President Donald Trump signed an executive order directing Attorney General Pam Bondi to challenge state AI laws that conflict with less-strict federal policy, and urging Congress to establish a national AI framework that would preempt state regulations.\nThis new wave of political spending groups adds yet another layer of pressure on lawmakers advancing AI safety efforts.\nWhile super PACs typically don’t lay out their overarching strategies, the political group has been unusually outspoken about its goal to oppose candidates who champion state-level AI regulation.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-21T11:30:00Z",
    "source": "Wired"
  },
  {
    "id": "MTc=",
    "url": "https://www.wired.com/story/china-ai-boom-algorithm-registry/",
    "title": "Thousands of Companies Are Driving China’s AI Boom. A Government Registry Tracks Them All",
    "summary": "Over time, the CAC has inadvertently created the most detailed map of a nation’s AI ecosystem anywhere in the world.\nScroll through the table and you’ll find an AI that manages homestays and an AI that drafts patents.\nA Broad View of the BoomNearly 80 percent of China’s generative AI registrations are clustered in and around its top tech hubs—Beijing, Shenzhen, Shanghai, and Hangzhou.\nChina’s six “AI tigers”—Moonshot, Minimax, Zhipu, Baichuan, 0.1AI, and Stepfun—are all backed by Alibaba or Tencent.\nByteDance’s Doubao surpassed DeepSeek as China’s most popular chatbot, but its spot at the top is not assured.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-20T11:00:00Z",
    "source": "Wired"
  },
  {
    "id": "MTg=",
    "url": "https://www.wired.com/story/europe-race-us-deepseek-sovereign-ai/",
    "title": "The Race to Build the DeepSeek of Europe Is On",
    "summary": "With rare exceptions, US-based firms outstrip European competitors across the AI production line—from processor design and manufacturing, to data center capacity, to model and application development.\nIn early January, the head of Belgium’s national cybersecurity organization told the Financial Times that Europe had “lost the internet,” and should make peace with a degree of reliance on US infrastructure.\nAlready, they have committed hundreds of millions of dollars to minimizing their reliance on foreign AI suppliers.\nBy publishing models for anyone to use or modify, the theory goes, breakthroughs achieved by European labs will compound as they're further refined by collaborators.\nThe two sides have clashed particularly openly over the approach to policing American tech firms—especially X, the social media platform owned by Elon Musk.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-19T07:00:00Z",
    "source": "Wired"
  },
  {
    "id": "MTk=",
    "url": "https://www.businessinsider.com/ai-security-risks-worry-ey-kpmg-execs-cybersecurity-davos-2026-1",
    "title": "Execs at Davos say AI's biggest problem isn't hype — it's security",
    "summary": "AI cybersecurity is a top concern for some execs right now.\nAI cybersecurity is a top concern for some execs right now.\nDonato Fasano/Getty Imageslighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nRaj Sharma, EY's global managing partner of growth and innovation, said there's not enough talk about AI security — specifically, the management of AI agents and their lifecycle.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-20T07:53:40Z",
    "source": "Business Insider"
  },
  {
    "id": "MjA=",
    "url": "https://www.theverge.com/news/864843/elevenlabs-ai-music-eleven-album-release",
    "title": "ElevenLabs made an AI album to plug its music generator",
    "summary": "ElevenLabs has released an album of AI-generated songs in its latest attempt to separate itself from the ethical concerns surrounding AI music.\nThe Eleven Album aims to showcase “how artists can use AI to expand their creative range while maintaining full authorship and commercial rights,” according to ElevenLabs.\nElevenLabs is using the album to market its Eleven Music generator and Iconic Voices Marketplace platforms it launched last year, both of which are cleared for commercial use.\nDemitri LeriosEmily FalveySunsettoKondZillaChris LyonsKaiAngelbabyMichael FeinsteinYou can listen to the album — or to cite ElevenLabs, “experience the future of sound” — on Spotify or the ElevenLabs website.\nWithout compensation and ownership rights, those AI clones could impact their ability to make money, given that most people can’t distinguish between AI-generated and human-made music.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-21T15:44:08Z",
    "source": "The Verge"
  },
  {
    "id": "MjE=",
    "url": "https://www.businessinsider.com/elon-musk-xai-hiring-elite-unit-recruit-top-engineers-grok-2026-1",
    "title": "xAI is hiring an 'elite unit' that reports directly to Elon Musk to recruit top engineers",
    "summary": "The AI startup is hiring a team of \"talent engineers\" to supercharge its hiring of top engineers as the AI boom fuels a red-hot race for talent.\nThe role, which pays $120,000-240,000 and is based in Palo Alto, California, is the latest novel approach taken by AI startups and Big Tech giants to snap up in-demand AI talent.\nMusk isn't the only top CEO to get personally involved in hiring top talent.\nOpenAI's chief research officer, Mark Chen, said in December that Mark Zuckerberg attempted to lure some OpenAI engineers to Meta by hand-delivering them soup.\nxAI's focus on hiring comes as the startup continues to grow despite being embroiled in controversy over its Grok chatbot.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-19T11:41:20Z",
    "source": "Business Insider"
  },
  {
    "id": "MjI=",
    "url": "https://www.businessinsider.com/emergent-vibe-coding-funding-khosla-softbank-2026-1",
    "title": "Emergent, Which Lets Anyone Build an App, Has Raised $70 Million.",
    "summary": "It was not long ago that building a sophisticated app required a team of experienced programmers hovering over their keyboards.\nNow, AI has made it possible for a novice with no coding knowledge to whip up high-quality apps from scratch.\nThe company recently raised $70 million in Series B funding from Khosla Ventures and SoftBank Vision Fund 2, with participation from Prosus, Lightspeed, Together, and Y Combinator.\nIn a sign of how quickly the hottest AI companies are raising funding in this bull market, it was only three months ago that Emergent raised $23 million in Series A funding.\nVibe coding is a crowded space for startups, and Emergent faces competition from Lovable, a Swedish vibe coding app that raised $330 million in Series B funding at a $6.6 billion valuation in December.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-20T11:00:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjM=",
    "url": "https://slashdot.org/story/26/01/21/141239/ceos-say-ai-is-making-work-more-efficient-employees-tell-a-different-story",
    "title": "CEOs Say AI is Making Work More Efficient. Employees Tell a Different Story.",
    "summary": "The trouble with computers is that they do what you tell them, not what you want.\n-- D. Cohen",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-21T14:01:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MjQ=",
    "url": "https://www.theverge.com/news/864229/openai-focus-practical-adoption-sarah-friar",
    "title": "OpenAI’s 2026 ‘focus’ is ‘practical adoption’",
    "summary": "As intelligence moves into scientific research, drug discovery, energy systems, and financial modeling, new economic models will emerge.\nSecuring world-class compute requires commitments made years in advance, and growth does not move in a perfectly smooth line.\nAt times, capacity leads usage.\nAt other times, usage leads capacity.\nThat lets us lean forward when growth is there without locking in more of the future than the market has earned.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-19T21:05:30Z",
    "source": "The Verge"
  },
  {
    "id": "MjU=",
    "url": "https://thenextweb.com/news/sequoia-joins-anthropics-25b-funding-round",
    "title": "Sequoia joins Anthropic’s $25B funding round valued at $350B",
    "summary": "Valuation fever and the AI arms raceA $350 billion valuation, even before a public listing, is eye-watering.\nThat dynamic is a symptom of a broader trend: a global AI capital rush that has persisted even amid concerns about a bust cycle or a funding slowdown in other tech segments.\nEurope has strong academic AI talent, an active startup ecosystem, and deep expertise in areas like robotics, industrial automation, and data privacy.\nYet venture capital density still trails the U.S., and marquee AI funding rounds of this scale are rare on the continent.\nEuropean AI talent has been moving among global hubs, and deals like this underline how strongly competitive pressures are shaping that movement.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-19T10:59:49Z",
    "source": "The Next Web"
  },
  {
    "id": "MjY=",
    "url": "https://www.businessinsider.com/elon-musk-tesla-fsd-licensing-adas-autonomy-legacy-automakers-2026-1",
    "title": "Elon Musk said automakers don't want to license Tesla FSD. We're starting to see why.",
    "summary": "Tesla CEO Elon Musk said it's \"crazy\" that automakers don't want to license Tesla FSD.\nTesla CEO Elon Musk said it's \"crazy\" that automakers don't want to license Tesla FSD.\nMarc Piasecki/Getty ImagesTesla CEO Elon Musk said it's \"crazy\" that automakers don't want to license Tesla FSD.\nBecause automakers see vehicle tech as a brand-defining component, a Tesla license can become a hard sell.\nDuring a Q&A session at CES, Nvidia CEO Jensen Huang called Tesla FSD \"completely world-class,\" before drawing a distinction between Tesla's goals and Nvidia's.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-01-20T11:00:02Z",
    "source": "Business Insider"
  },
  {
    "id": "Mjc=",
    "url": "https://slashdot.org/story/26/01/20/2234239/openai-and-servicenow-strike-deal-to-put-ai-agents-in-business-software",
    "title": "OpenAI and ServiceNow Strike Deal to Put AI Agents in Business Software",
    "summary": "The trouble with computers is that they do what you tell them, not what you want.\n-- D. Cohen",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-21T01:25:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "Mjg=",
    "url": "https://www.theverge.com/tech/864768/instagram-adam-mosseri-ai-content-algorithm",
    "title": "Instagram’s top boss is missing the point about AI on the platform",
    "summary": "In a series of messages, Instagram’s top exec laid out his concerns for the platform in the coming year, largely around AI.\nWhich may be true, but I think Mosseri is missing the point: Instagram is already overrun by robotic, same-y looking content, and it’s not just made by AI.\nIt’s made by humans churning out post after post following the same formula; one designed to keep us scrolling, liking, and sharing.\nThroughout his post, Mosseri actually makes a few points I agree with.\nAgain and again, Mosseri mentions “authentic” content, implying something human-made versus inauthentic content created by AI.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-21T11:19:55Z",
    "source": "The Verge"
  },
  {
    "id": "Mjk=",
    "url": "https://www.businessinsider.com/sapiens-author-ai-timeline-warning-lack-of-concern-2026-1",
    "title": "'Sapiens' author says the real AI timeline is 200 years — but the 'lack of concern' today is what scares him most",
    "summary": "Yuval Noah Harari said that AI's true consequences will unfold over the next 200 years.\nYuval Noah Harari said that AI's true consequences will unfold over the next 200 years.\nChris Jung/NurPhoto via Getty ImagesYuval Noah Harari said that AI's true consequences will unfold over the next 200 years.\nHarari warned that even if AI development were to stop today, its long-term effects would still be impossible to grasp.\nAI's social consequences, he said, will play out far beyond that horizon — whether the world is ready or not.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-20T17:01:19Z",
    "source": "Business Insider"
  },
  {
    "id": "MzA=",
    "url": "https://www.businessinsider.com/palantir-ceo-alex-karp-ai-humanities-jobs-doomed-2026-1",
    "title": "Palantir CEO Alex Karp Warns AI Will 'Destroy Humanities Jobs'",
    "summary": "Alex Karp, CEO of Palantir, said vocational skills will be in high demand in the AI era.\nAlex Karp, CEO of Palantir, said vocational skills will be in high demand in the AI era.\nFabrice COFFRINI / AFP via Getty ImagesAlex Karp, CEO of Palantir, said vocational skills will be in high demand in the AI era.\nFabrice COFFRINI / AFP via Getty ImagesAlex Karp, the billionaire co-founder and CEO of the AI defense technology company Palantir, had a top humanities-based education.\nAI \"will destroy humanities jobs,\" Karp said.",
    "category": "technology",
    "bias": "right",
    "publishedAt": "2026-01-20T17:21:28Z",
    "source": "Business Insider"
  },
  {
    "id": "MzE=",
    "url": "https://finance.yahoo.com/video/merck-ceo-us-business-life-100323926.html",
    "title": "Merck CEO on US Business, Life Sciences Innovation",
    "summary": "Merck KGaA Chief Executive Officer Belen Garijo says the company will continue to collaborate with the US and deliver life sciences innovation to patients.\nShe spoke to Bloomberg's Francine Lacqua on the sidelines of the 2026 World Economic Forum in Davos, Switzerland.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-01-20T10:03:23Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzI=",
    "url": "https://www.theverge.com/tech/864848/sony-linkbuds-clip-open-earbuds-wireless-headphones-bluetooth",
    "title": "Sony’s first clip-on open earbuds have a quiet mode so others can’t listen in",
    "summary": "Sony is the latest company to announce a pair of open-style wireless earbuds that clip onto the back of your ear instead of resting inside it.\nThe new Sony LinkBuds Clip Open earbuds are similar to the Bose Ultra Open Earbuds, JVC’s Nearphones, and Shokz’ OpenDots One, with a design that doesn’t block the ear canal so you can hear your environment, or conversations with people, alongside whatever you’re streaming from your phone.\nThe LinkBuds Clip Open are available starting today in black, greige (no, that’s not a typo), green, and lavender color options for $229.99.\nImage: SonyThe C-shaped design of the LinkBuds Clip Open doesn’t put any pressure on the inner ear, potentially making the earbuds comfortable to wear for longer periods.\nThere’s a 10-band EQ that can be used to adjust the LinkBuds Clip Open’s sound profile through Sony’s Sound Connect mobile app, plus three sound mode presets that can be accessed by tapping the headphones.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-21T15:13:13Z",
    "source": "The Verge"
  },
  {
    "id": "MzM=",
    "url": "https://www.businessinsider.com/godfather-ai-geoffrey-hinton-on-ai-sad-dangerous-2026-1",
    "title": "The 'Godfather of AI' says he's 'very sad' about what his life's work has become",
    "summary": "Geoffrey Hinton said he feels deep sadness as the AI he helped create grows more dangerous and outpaces society's ability to control it.\nGeoffrey Hinton said he feels deep sadness as the AI he helped create grows more dangerous and outpaces society's ability to control it.\nJORGE UZON/AFP via Getty ImagesGeoffrey Hinton said he feels deep sadness as the AI he helped create grows more dangerous and outpaces society's ability to control it.\nHinton, who helped pioneer the neural networks that underpin modern artificial intelligence, has become one of the field's most outspoken critics as AI systems grow more powerful and widespread.\n\"The idea that you could just turn it off won't work,\" Hinton said, adding that a sufficiently advanced AI could persuade humans not to shut it down.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-21T12:00:58Z",
    "source": "Business Insider"
  },
  {
    "id": "MzU=",
    "url": "https://www.businessinsider.com/sapiens-author-yuval-noah-harari-ai-crises-every-country-2026-1",
    "title": "The author of 'Sapiens' says AI is about to create 2 crises for every country",
    "summary": "AI technology is about to create two crises for every country, says the author of the bestselling book \"Sapiens: A Brief History of Humankind.\"\n\"Those who are concerned about human immigrants usually argue that immigrants might take jobs, might change the local culture, might be politically disloyal.\nI'm not sure that's true of all human immigrants, but it will definitely be true of the AI immigrants,\" he said.\nHarari is not the first person to refer to \"AI immigrants.\"\nEarlier this month, the Nvidia CEO, Jensen Huang, referred to robots using the term, and said \"AI immigrants\" will help humans with work we no longer want to do, such as manufacturing jobs, AFP reported.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-20T17:12:48Z",
    "source": "Business Insider"
  },
  {
    "id": "Mzg=",
    "url": "https://www.wired.com/story/chinese-ev-batteries/",
    "title": "Chinese EV Batteries Are Eating the World",
    "summary": "The city is now also the site of a battery factory, which would allow France to produce all parts of electric vehicles domestically.\nAccording to his calculations, 2024 was the first year Chinese EV and battery companies spent more money building factories outside of China than within.\n“We simply couldn’t.”So it’s perhaps no surprise that Chinese battery companies are dominant—and that the competition between them is fierce.\nWhen Apple built its technology empire on the backs of Chinese factories, the country had to reckon with whether it was benefiting from Apple’s victories or being exploited.\nAs China’s battery technology takes over the world, Chinese companies are the ones now raising these questions—of who ultimately benefits and who is exploiting whom.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-20T11:00:00Z",
    "source": "Wired"
  },
  {
    "id": "NDI=",
    "url": "https://www.theregister.com/2026/01/19/asia_tech_news_roundup/",
    "title": "Microsoft hiring energy strategists for Asian datacenters",
    "summary": "Asia In Brief Microsoft is hiring senior managers to ensure its datacenters in Asia can access the energy they need.\nMicrosoft’s expanding datacenter footprint is no secret, nor is the fact that datacenters used for AI applications are power-hungry.\nMicrosoft’s Asian outpost looks to be hiring to address those challenges, in its own facilities and third-party bit barns it rents.\nIf Viettel’s plans stay on track, the country will close that gap in 2027 when its fab starts work.\n“The time to first attack was less than one hour, and we averaged ~5,270 attacks every single day!” he wrote.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-19T02:11:34Z",
    "source": "Theregister.com"
  },
  {
    "id": "NDM=",
    "url": "https://www.techradar.com/pro/solving-ais-energy-challenge-sustainable-data-centers-for-a-competitive-uk-future",
    "title": "Solving AI's energy challenge: sustainable data centers for a competitive UK future",
    "summary": "The world is racing to harness AI's transformative potential, but this revolution comes with a stark reality: AI's energy appetite is enormous and growing rapidly.\nBut for data centers, I see a new mantra: move fast, but break nothing.\nLower energy consumption means reduced operational costs - critical when UK energy prices remain among the highest in Europe.\nA change of mindsetAchieving this virtuous circle for data centers demands a change of mindset.\nJust as failure is catastrophic in a power grid or transportation network, the same rigor must apply to AI's data infrastructure.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-19T10:52:03Z",
    "source": "TechRadar"
  },
  {
    "id": "NjA=",
    "url": "https://www.theregister.com/2026/01/21/palantir_ceo_karp_claims_ai/",
    "title": "Palantir CEO: With AI, economies won't need immigration",
    "summary": "This week, after promising not to go on one of his \"usual political screeds,\" the Palantir CEO went off on one, as the Brits like to say, launching into a speculative analysis of the impact of AI on immigration.\nHe was unlikely to have his worldview significantly challenged by his interviewer, BlackRock CEO Larry Fink, the septuagenarian billionaire Co-Chairman of the World Economic Forum.\nDuring the World Economic Forum session, Karp agreed that AI would lead to fewer white collar jobs.\nKarp admitted AI is a \"very low-trust environment,\" which is why Palantir needs very few salespeople.\nBut if [like Palantir] you've delivered stuff that does work, why do you need a salesforce?\"",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-21T15:31:00Z",
    "source": "Theregister.com"
  }
]