[
  {
    "id": "MQ==",
    "url": "https://www.businessinsider.com/bitcoin-price-today-bear-market-why-btc-is-down-crypto-2026-2",
    "title": "Bitcoin is struggling again after a brief comeback. Here's what's keeping it down.",
    "summary": "Bitcoin bounced off its lows last week, but it's struggling around the $70,000 mark on Monday.\nHowever, as other assets like stocks and precious metals continue to mount a solid recovery to start the week, bitcoin is in low gear.\nAlso, gold is still supported by central banks, while bitcoin is not.\n\"When you look at who's buying gold, it's the central banks,\" he said.\n\"And the central banks are essentially trying to get away from all fiat currency, not just dollars.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-09T17:48:40Z",
    "source": "Business Insider"
  },
  {
    "id": "Mw==",
    "url": "https://www.theverge.com/tech/876080/mrbeast-step-mobile-banking-app",
    "title": "MrBeast just bought a banking app",
    "summary": "Stevie started out at Laptop Mag writing news and reviews on hardware, gaming, and AI.\nPosts from this author will be added to your daily email digest and your homepage feed.\nBeast Industries, owned by YouTuber Jimmy “MrBeast” Donaldson, announced on Monday that it has acquired Step, a banking app designed for teens and young adults.\nThe move comes a couple of months after Donaldson announced plans to start a new YouTube channel centered on personal finance and investing.\nStep’s investors also include Gen-Z influencers Josh Richards and Charli D’Amelio, the latter of whom has appeared on MrBeast’s YouTube channel.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-09T22:14:13Z",
    "source": "The Verge"
  },
  {
    "id": "MTM=",
    "url": "https://www.theverge.com/tech/875454/iphone-17e-launching-soon-magsafe-a19",
    "title": "The iPhone 17e could launch soon with MagSafe and an A19 chip",
    "summary": "Almost exactly one year after launching the iPhone 16e, Apple is preparing to launch the 17e, according to Mark Gurman.\nThe iPhone 17e will feature an upgraded A19 chip from the iPhone 17 lineup, plus MagSafe charging, and move to Apple’s in-house cellular chips.\nGurman says Apple is planning to pitch the iPhone 17e aggressively in emerging markets and to enterprises.\nWe also expect Apple to launch an updated iPad and iPad Air around the same time, alongside the spec-bumped MacBook Pros and a MacBook Air with an M5 processor.\nThe base-model iPad will be moving to an A18 chip, which means it will support Apple Intelligence, while the iPad Air will move to an M4 and switch to an OLED display.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-08T15:26:33Z",
    "source": "The Verge"
  },
  {
    "id": "MjI=",
    "url": "https://www.businessinsider.com/lema-has-come-out-of-stealth-to-raise-24-million-2026-2",
    "title": "Cybersecurity Startup Lema Comes Out of Stealth to Raise $24 Million",
    "summary": "Lema has announced a $24 million Series A funding round led by Team8, a Tel Aviv-based venture capital firm.\n\"I think that third-party risk management was the neglected child of cybersecurity for a very long time,\" Eddie Dovzhik, Lema's co-founder and CEO, told Business Insider.\n60% of companies now rely on over 1,000 external vendors, according to Gartner.\nAnd nearly one-third of recent cyber breaches originated with third parties, according to McKinsey & Company.\n\"Our goal was to come up with a completely different solution that completely changes the way that third-party risk management is being done.\"",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-09T14:00:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjM=",
    "url": "https://www.wired.com/story/satellites-ai-nuclear-treaties/",
    "title": "AI Is Here to Replace Nuclear Treaties. Scared Yet?",
    "summary": "For half a century, the world’s nuclear powers relied on an intricate and complex series of treaties that slowly and steadily reduced the number of nuclear weapons on the planet.\nBoth countries are spending billions to build new and different kinds of nuclear weapons.\nSo, failing that, the world’s nuclear powers can use satellites and other remote sensors to monitor the world’s nuclear weapons remotely.\nFor decades, the US and Russia have worked to reduce the amount of nuclear weapons in the world.\nEliminating roughly 50,000 nuclear weapons took decades of dedicated work from politicians, diplomats, and scientists.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-09T11:30:00Z",
    "source": "Wired"
  },
  {
    "id": "MjQ=",
    "url": "https://www.businessinsider.com/sentinel-global-backs-ai-firms-beyond-silicon-valley-2026-2",
    "title": "Sentinel Global Backs AI Firms, Aims Beyond Silicon Valley",
    "summary": "Kranz says AI has made companies leaner, meaning there will be many more companies worth $1 billion that only raised $20 million.\n\"We think that AI is one of the black swans that impacts how you build a firm,\" he said.\nSentinel's investment focus spans enterprise AI, programmable money, and what Kranz calls the \"connected commerce,\" startups linking the physical world with software and AI.\nKranz believes those economics favor founders outside Silicon Valley, particularly in regions where efficiency has always mattered.\nSentinel typically makes fewer than 10 investments annually, writing checks ranging from $5 million to $30 million.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-09T13:00:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjU=",
    "url": "https://www.wired.com/story/the-technologies-changing-how-youll-watch-the-2026-winter-olympic-games/",
    "title": "The Technologies Changing How You’ll Watch the 2026 Winter Olympic Games",
    "summary": "During the 2024 Summer Olympics in Paris, 5G and 4K were the leading technologies available to many viewers.\nFor the 2026 Milano Cortina Winter Games there will be more technology than ever, for both athletes and fans.\nMuch of that technology has never been used at the Games before, says Yiannis Exarchos, the managing director of Olympic Broadcasting Services and executive director of Olympic Channel Services.\nDrone Views of Athlete PerformancesOne of the big technologies coming to the Milano Cortina Olympics are first-person view, or FPV, drones.\nThe Olympics’ New AI Tool: Olympic GPTGot a question about this year’s Games?",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-02-07T12:00:00Z",
    "source": "Wired"
  },
  {
    "id": "MjY=",
    "url": "https://thenextweb.com/news/techex-global-returns-to-london-with-enterprise-technology-and-ai-execution",
    "title": "TechEx Global returns to London with enterprise technology and AI execution",
    "summary": "London, TechEx Global 2026, one of Europe’s biggest enterprise technology conferences, brought thousands of technology professionals together at Olympia London on 4 and 5 February.\nThe event went beyond buzzwords, focusing on how emerging technologies, especially AI, are being applied in real business contexts.\nTechEx Global combines several co-located expos, including AI & Big Data, Cyber Security & Cloud, IoT Tech, Intelligent Automation, and Digital Transformation.\nA broad technology mixBeyond AI, TechEx also treated other pillars of digital transformation.\nFor enterprise leaders, the value of TechEx Global lies in its focus on actionable outcomes rather than abstract vision.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-02-06T08:56:15Z",
    "source": "The Next Web"
  },
  {
    "id": "Mjc=",
    "url": "https://tech.slashdot.org/story/26/02/09/0030214/carmakers-rush-to-remove-chinese-code-under-new-us-rules",
    "title": "Carmakers Rush To Remove Chinese Code Under New US Rules",
    "summary": "Different all twisty a of in maze are you, passages little.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-09T02:34:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "Mjk=",
    "url": "https://www.businessinsider.com/agentic-engineering-andrej-karpathy-vibe-coding-2026-2",
    "title": "The guy who coined 'vibe-coding' says the next big thing is 'agentic engineering'",
    "summary": "OpenAI founder Andrej Karpathy commemorated the first anniversary of coining vibe-coding by unveiling a new term.\nOpenAI founder Andrej Karpathy commemorated the first anniversary of coining vibe-coding by unveiling a new term.\nSan Francisco Chronicle/Hearst Newspapers via Getty Images/Contributor/Getty ImagesOpenAI founder Andrej Karpathy commemorated the first anniversary of coining vibe-coding by unveiling a new term.\nNow, the man who coined the term is celebrating the birth of a new one: \"agentic engineering.\"\nWhile vibe-coding is when humans prompt AI to write code, OpenAI cofounder Andrej Karpathy says agentic engineering is when AI agents write the code themselves.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-02-08T18:18:26Z",
    "source": "Business Insider"
  },
  {
    "id": "MzA=",
    "url": "https://www.businessinsider.com/amazon-ai-bet-anthropic-soars-61-billion-valuation-2026-2",
    "title": "Amazon's $8 billion Anthropic investment balloons to $61 billion",
    "summary": "The cloud giant disclosed on Friday that it holds $45.8 billion of convertible notes and $14.8 billion of nonvoting preferred stock in the AI startup.\nTaken together, the figures show that Amazon's Anthropic stake is now worth $60.6 billion.\nAmazon has invested $8 billion in Anthropic since late 2023, indicating a seven-fold increase in value.\nAnthropic last raised $13 billion in September at a $183 billion post-money valuation, following a $3.5 billion round in March that valued the company at $61.5 billion.\nThe AI startup is in talks for another funding round that would push its value to $350 billion.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-06T19:42:24Z",
    "source": "Business Insider"
  },
  {
    "id": "MzE=",
    "url": "https://slashdot.org/story/26/02/08/220228/do-super-bowl-ads-for-ai-signal-a-bubble-about-to-burst",
    "title": "Do Super Bowl Ads For AI Signal a Bubble About to Burst?",
    "summary": "Different all twisty a of in maze are you, passages little.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-08T22:06:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MzI=",
    "url": "https://www.wired.com/gallery/best-ai-notetakers/",
    "title": "The Best AI Notetakers to Record Your Meetings, Interviews, or Classes",
    "summary": "The small LCD is helpful (and rare in this market), indicating when you’re recording and offering a recording duration.\nThis makes it a lot more foolproof than other notetakers, which offer nothing more than a colored LED to tell you if it’s on.\nThe Note Pro supports 113 languages—sort of.\nIt will record in a foreign tongue and offer a verbatim transcript in the native language, but insights and summaries are delivered in your language of choice.\nBest of all, for a limited time, the company includes a generous three months of premium service at no charge.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-02-08T12:00:00Z",
    "source": "Wired"
  },
  {
    "id": "MzM=",
    "url": "https://slashdot.org/story/26/02/09/1514248/ai-gold-rush-is-resurrecting-chinas-infamous-72-hour-work-week---in-us",
    "title": "AI Gold Rush is Resurrecting China's Infamous 72-hour Work Week",
    "summary": "Different all twisty a of in maze are you, passages little.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-09T15:14:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MzQ=",
    "url": "https://www.businessinsider.com/evident-ai-alexandra-mousavizadeh-banks-wall-street-2026-2",
    "title": "Where banks should focus AI spending to stay ahead, from Wall Street's AI scorekeeper",
    "summary": "Alexandra Mousavizadeh said banks are all racing to make sure engineers are up to speed on AI.\nAlexandra Mousavizadeh said banks are all racing to make sure engineers are up to speed on AI.\nEvidentAlexandra Mousavizadeh said banks are all racing to make sure engineers are up to speed on AI.\nBeyond that, though, Mousavizadeh banks need to double down on their \"competitive edge.\"\nBanks need to get technology into every employee's hands, Mousavizadeh said, and mandatory training often yields better results.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-07T11:37:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MzU=",
    "url": "https://www.wired.com/story/new-york-is-the-latest-state-to-consider-a-data-center-pause/",
    "title": "New York Is the Latest State to Consider a Data Center Pause",
    "summary": "Two New York lawmakers on Friday announced that they are introducing a bill that would impose a three-year moratorium on data center development.\nThe announcement makes New York at least the sixth state to introduce legislation putting a pause on data center development in the past few weeks—one of the latest signs of a growing and bipartisan backlash that is quickly finding traction in statehouses around the country.\nDeSantis had previously proposed legislation that would offer a variety of consumer protections and limit the expansion of data centers in Florida.\nThe bill imposes at least a three-year moratorium on issuing permits for new data centers.\n“There are a lot of extraordinarily well-intentioned and well-meaning bills that have been introduced to attempt to address the many impacts that data centers have,” says Weltman.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-06T18:58:46Z",
    "source": "Wired"
  },
  {
    "id": "MzY=",
    "url": "https://www.businessinsider.com/orange-slice-pitch-deck-seed-funding-y-combinator-2026-2",
    "title": "Bollywood dance teammates raised $5.3 million for their Y Combinator AI startup. Read their pitch deck.",
    "summary": "Lighning bolt icon An icon in the shape of a lightning bolt.\nImpact LinkTwo University of Michigan graduates who met on a Bollywood dance team have emerged from Y Combinator with $5.3 million in seed funding.\nOrange Slice sells subscriptions to customers like sales engineers, with fellow Y Combinator startups Novoflow and Pirros among its early users, they said.\nNandigala and Sripada began building the startup and applied to Y Combinator as college seniors last year.\nHere's a look at the pitch deck Orange Slice used to raise its $5.3 million seed round.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-06T10:00:02Z",
    "source": "Business Insider"
  },
  {
    "id": "Mzc=",
    "url": "https://www.cnet.com/health/medical/apples-ai-health-coach-project-may-need-a-wellness-check/",
    "title": "Apple's AI Health Coach Project May Need a Wellness Check",
    "summary": "Apple is scaling back and rethinking its ambitious plans to introduce an AI-powered health coach, according to a Bloomberg report by Mark Gurman citing anonymous sources privy to the company's plans.\nThe project, known inside Apple as Mulberry, was first reported last year, with the company expected to roll together health-related AI features as a coach or assistant.\nBloomberg's sources point to a change in leadership over Apple's health technology.\nApple was also said to have built a studio for a revamped health services app that would have included virtual and video wellness instructions, and integration with existing health tools and Apple devices.\nIt is likely that some of that content and software will still be released publicly, just not in one package, according to Bloomberg.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-02-06T18:00:13Z",
    "source": "CNET"
  },
  {
    "id": "Mzg=",
    "url": "https://www.theverge.com/ai-artificial-intelligence/875501/new-york-is-considering-two-bills-to-rein-in-the-ai-industry",
    "title": "New York is considering two bills to rein in the AI industry",
    "summary": "It would also require that any content created using AI be reviewed and approved by a human with “editorial control” before being published.\nBeyond that, the bill requires organizations to disclose to newsroom employees how and when AI is being used.\nAnd it would call for safeguards that prevent confidential information, especially about sources, from being accessed by AI.\nMeanwhile, S9144 “imposes a moratorium on the issuance of permits for new data centers” for at least three years.\nThere are already over 130 data centers in New York, according to Data Center Map.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-08T21:04:53Z",
    "source": "The Verge"
  },
  {
    "id": "Mzk=",
    "url": "https://hbr.org/2026/02/why-new-technologies-dont-transform-incumbents",
    "title": "Why New Technologies Don’t Transform Incumbents",
    "summary": "The challenge of AI adoption is proving frustrating for many incumbent companies.\nThey’re deploying the technology widely—adding it to existing workflows, using it to automate individual tasks, incorporating it in new productivity tools—but nonetheless they’re losing out to smaller challengers.",
    "category": "technology",
    "bias": "right",
    "publishedAt": "2026-02-09T14:00:00Z",
    "source": "Harvard Business Review"
  },
  {
    "id": "NDA=",
    "url": "https://slashdot.org/story/26/02/06/1632210/kpmg-pressed-its-auditor-to-pass-on-ai-cost-savings",
    "title": "KPMG Pressed Its Auditor To Pass on AI Cost Savings",
    "summary": "Different all twisty a of in maze are you, passages little.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-06T16:31:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "NDc=",
    "url": "https://hardware.slashdot.org/story/26/02/07/0624254/free-bi-directional-ev-chargers-tested-to-improve-massachusetts-power-grid",
    "title": "Free Bi-Directional EV Chargers Tested to Improve Massachusetts Power Grid",
    "summary": "Different all twisty a of in maze are you, passages little.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-07T16:34:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "NDg=",
    "url": "https://www.businessinsider.com/spacex-hiring-elon-musk-data-centers-in-space-2026-2",
    "title": "SpaceX is hiring to turn Elon Musk's plan for data centers in space a reality",
    "summary": "As countries pour billions into new Earth-bound data centers in a global race for AI dominance, SpaceX CEO Elon Musk thinks the best way to conserve energy, money, and space is to put data centers in, well, space.\nSpaceX says its goal is to launch a \"constellation of a million satellites that operate as orbital data centers,\" and it's now hiring to make it happen.\nAs of 2023, about 4.4% of total US electricity consumption came from data centers, according to the Department of Energy.\nGlobally, data centers accounted for about 1.5% of global electricity consumption in 2024, according to the International Energy Agency.\nLocating data centers in space might appeal to the communities, like Northern Virginia, where electricity costs are growing and housing developments are vying with data centers for land.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-02-07T10:41:01Z",
    "source": "Business Insider"
  },
  {
    "id": "NDk=",
    "url": "https://www.businessinsider.com/eric-schmnidt-data-center-firm-negotiating-texas-deal-with-google-2026-2",
    "title": "Eric Schmidt-backed data center venture is negotiating a major deal with Google",
    "summary": "Bolt Data and Energy, a data center development firm that was cofounded late last year by former Google CEO Eric Schmidt, is negotiating a deal that would allow it to begin construction on a large data center project it is planning in West Texas.\n\"We don't comment on rumors,\" a Google spokeswoman told Business Insider, declining to comment further.\nThese commodities have become increasingly strained as data center development has boomed around the country.\nIn December, Business Insider revealed that Amazon had pulled back a $150 million cash advance it had pledged as part of a preliminary deal to anchor the project.\nFermi's CEO, Toby Neugebauer, told Business Insider that although Amazon had reclaimed its advance, the negotiations for it to take space with Fermi were still ongoing.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-09T19:33:44Z",
    "source": "Business Insider"
  },
  {
    "id": "NTI=",
    "url": "https://www.androidcentral.com/phones/i-want-a-phone-i-can-actually-fix-and-fairphones-record-growth-shows-the-world-does-too",
    "title": "I want a phone I can actually fix, and Fairphone’s record growth shows the world does too",
    "summary": "What you need to knowFairphone has posted 83.7% YoY growth in Q4 2025, even as major brands deal with rising costs and supply shortages.\nThe company is on pace for $500 million in sales and over one million devices sold.\nWhile the smartphone industry focused on faster upgrades and flashy features, Fairphone is going against the trend and finding success.\nWhile big brands face higher component costs and supply shortages, the Dutch company reported an impressive 83.7% year-on-year growth in Q4 2025.\nThe company is on track to reach $500 million in total sales and sell over one million devices since it started.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-02-09T17:22:44Z",
    "source": "Android Central"
  },
  {
    "id": "NTM=",
    "url": "https://hardware.slashdot.org/story/26/02/08/0430252/are-big-techs-nuclear-construction-deals-a-tipping-point-for-small-modular-reactors",
    "title": "Are Big Tech's Nuclear Construction Deals a Tipping Point for Small Modular Reactors?",
    "summary": "Different all twisty a of in maze are you, passages little.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-08T04:35:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "NzA=",
    "url": "https://www.theregister.com/2026/02/09/europe_sovereign_cloud_spend/",
    "title": "Europe set to treble sovereign cloud investment",
    "summary": "Worldwide sovereign cloud spending is forecast to hit $80 billion in 2026, up 35.6 percent from 2025.\nSpeaking to The Register, Rene Buest, Gartner senior director analyst, agreed geopolitics was a factor in European sovereign cloud decisions since January last year.\nA broader issue of strategic or economic sovereignty was influencing investment decisions to make local and regional cloud providers more competitive.\n\"But the AWS European Sovereign Cloud GmbH is a 100 percent subsidiary of Amazon Inc.\nIt claimed:\"These dedicated European subsidiaries maintain direct management and control over the AWS European Sovereign Cloud infrastructure and operations, and are led by EU citizens who are obligated to abide by European laws and to act in the best interest of the AWS European Sovereign Cloud.\"",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-02-09T14:12:08Z",
    "source": "Theregister.com"
  }
]