[
  {
    "url": "https://www.theverge.com/news/802070/nuclear-fusion-energy-ai-trump-roadmap",
    "title": "The US has a new roadmap for fusion energy, without the funds to back it up",
    "summary": "The Department of Energy (DOE) released a new roadmap for the US to realize the decades-long dream of harnessing fusion energy.\nIt’s a commitment to support research and development efforts and pursue public-private partnerships to finally build the first generation of fusion power plants.\nNuclear fusion plants, in contrast, would fuse atoms together to generate energy in a controlled way.\nBoth Google and Microsoft have announced plans to purchase electricity from forthcoming fusion power plants that are supposed to be online by the late 2020s or 2030s.\nThe DOE dedicates an entire section of the roadmap to AI, which it calls a “transformative tool for fusion energy.” Researchers can use AI models to construct “digital twins” to more quickly study how experimental facilities would perform, the roadmap says as an example.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-10-17T22:21:39Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/column/801370/ai-world-models-general-intuition-medal",
    "title": "Why world models are the next big thing in AI",
    "summary": "“They have a unique dataset and a unique team.”Unless you’re steeped in the AI world, you probably haven’t heard much about world models yet.\nMore practically, AI researchers are increasingly looking to world models as a way to train agents that can reliably generate and interact with a 3D space.\nAmong the prominent AI leaders, Google DeepMind CEO Demis Hassabis has been the most vocal advocate for world models and their importance in achieving AGI.\nThe correct technical path for developing world models is hotly debated in the AI industry, and as even Khosla noted to me, it’s unclear what data will ultimately prove the most valuable.\nHowever, he warned me that others might find it challenging to resist licensing checks and acquisition offers from the big AI labs.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-10-17T01:01:55Z",
    "source": "The Verge"
  },
  {
    "url": "https://finance.yahoo.com/video/docusign-ceo-discusses-emerging-capabilities-112752991.html",
    "title": "Docusign CEO discusses the emerging capabilities of AI startups",
    "summary": "00:09 Speaker BYou know, Open AI is a hugely important partner for us.\nA lot of our AI is is built on theirs and and other uh frontier LLM models.\nIt's the most important data a company has and so I think those those three factors position us very well to help bring AI to agreements.\n01:32 Speaker AThe pace that uh in OpenAI is moving to uh release new products, update models, whatever it is.\nUh, we do that, I think Doy is going to be very well positioned in the long term.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-10-17T11:27:52Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.wired.com/story/security-news-this-week-hackers-dox-ice-dhs-doj-and-fbi-officials/",
    "title": "Hackers Dox ICE, DHS, DOJ, and FBI Officials",
    "summary": "WIRED spoke with six people with facial differences who say flaws in these systems are preventing them from accessing essential services.\nOn Thursday, one member of the Com’s loose collective began posting to Telegram an array of federal officials’ identifying documents.\nOne spreadsheet, according to 404 Media, contained what appeared to be personal information of 680 Department of Homeland Security officials, while another included personal info on 170 FBI officials, and yet another doxed 190 Department of Justice officials.\nThe publications allege that at the end of last year, the mysterious Group 78 presented its strategy to two different meetings of European officials, including law enforcement officials and those working in judicial services.\n“In my view,” Wyden wrote, “local elected officials can best protect their constituents from the inevitable abuses of Flock cameras by removing Flock from their communities.”",
    "category": "technology",
    "bias": "right",
    "publishedAt": "2025-10-18T10:30:00Z",
    "source": "Wired"
  },
  {
    "url": "https://gizmodo.com/welcome-to-the-jobless-growth-economy-2000673236",
    "title": "Welcome to the ‘Jobless Growth’ Economy",
    "summary": "America is entering an era of “jobless growth,” according to analysts at Goldman Sachs.\nThe memo, written by economists David Mericle and Pierfrancesco Mei and spotted by Fortune, warns that the current market of “modest job growth alongside robust GDP growth” is likely the new normal going forward.\nThe thing about senior roles is that you need people with experience to fill them.\nThat hasn’t materialized even a little thus far, but the idea that it will has severely messed up the job market.\nOne thing is for sure: AI is going to be transformative for the economy.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-10-17T12:30:59Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.businessinsider.com/spotify-ai-tools-copyright-infringement-big-tech-openai-anthropic-2025-10",
    "title": "Spotify Takes Swipe at the AI Industry Over Copyright Infringement",
    "summary": "In a press release on Thursday announcing a new partnership to develop AI tools for musicians, Spotify said the music industry must protect creatives as the AI industry marches ahead.\nSpotify took a swipe at the AI industry in its press release, criticizing those who \"believe copyright should be abolished.\"\nIf the music industry doesn't lead in this moment, AI-powered innovation will happen elsewhere, without rights, consent, or compensation,\" the company said.\nIn its press release on Thursday, Spotify said it's partnering with Sony Music Group, Universal Music Group, Warner Music Group, Merlin, and Believe to develop \"artist-first AI music products.\"\nRepresentatives for Spotify, Sony Music Group, Universal Music Group, Warner Music Group, and Believe did not respond to a request for comment from Business Insider.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-17T09:25:02Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/defense-prime-contractors-new-problem-dan-driscoll-2025-10",
    "title": "The defense prime contractors have a new problem on their hands",
    "summary": "The defense primes have a fresh challenge on their hands: A US Army that's tilting ever more toward a start-up-friendly, fast-moving procurement system.\nPrimes under firePrime defense contractors are companies that have direct contracts with the government.\nSilicon Valley titans, who specialize in rushing new digital services to the market, have also criticized the defense establishment.\nA host of new defense companies have emerged in response, and many major Western defense contractors have initiated new partnerships to acquire cutting-edge technology, work more efficiently, and address capacity gaps.\n\"This is not about choosing only Silicon Valley companies.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-10-18T11:17:24Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.wired.com/story/can-ai-escape-enshittification-trap/",
    "title": "Can AI Avoid the Enshittification Trap?",
    "summary": "AI is on a trajectory to be a constant companion, giving one-shot answers to many of our requests.\nBecause of the massive costs of creating a full-blown AI model, it’s fair to assume that only a few companies will dominate the field.\nRight now, I’d say AI is in what Doctorow calls the “good to the users” stage.\nThe nightmare is that AI models will make recommendations based on which companies have paid for placement.\nThe AI search platform Perplexity has a program where sponsored results appear in clearly labeled follow-ups.",
    "category": "technology",
    "bias": "right",
    "publishedAt": "2025-10-17T15:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.businessinsider.com/quants-investing-ai-hype-grunt-work-marketing-2025-10",
    "title": "The quants who built computer-run trading strategies aren't ready to hand it over to AI",
    "summary": "What's the latest edge in quant finance, which relies on math whizzes to drive computer-driven funds?\nIn an ironic twist, the people behind quant funds are using some of the same language human-run stockpickers and investors have used for decades to defend their style against computer-run alternatives.\n\"Human creativity\" is what will get quants ahead, said Amadeo Alentorn, head of systematic equities at Jupiter Asset Management, adding that there might be \"too much hype\" for what generative AI can do for investment management right now.\n\"By far the most important part of generative AI is the end user,\" said Timothee Consigny, CTO of H2O Asset Management, a Paris-based macro manager.\nNone other than Citadel founder Ken Griffin agrees with the assessment, saying at Wednesday's Robin Hood conference in New York that generative AI \"falls short\" when it comes to finding market-beating ideas, according to Bloomberg.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-17T08:29:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/column/802022/ai-sexting-openai-chatbot-chatgpt",
    "title": "The AI sexting era has arrived",
    "summary": "An AI beat reporter for more than five years, her work has also appeared in CNBC, MIT Technology Review, Wired UK, and other outlets.\nFor more on AI and the industry’s power dynamics and societal implications, follow Hayden Field.\nHis AI startup, xAI, rolled out “companion” avatars, including an anime-style woman and man, over the summer.\nGavin Newsom signed into law Senate Bill 243, billed as the “first-in-the-nation AI chatbot safeguards” by State Sen. Steve Padilla.\nThe news went wide, with some social media users meme-ifying it to no end, mocking the company for “pivoting” from its AGI mission to erotica.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-10-17T23:25:55Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/dialogue-ai-pitch-deck-seed-round-market-research-2025-10",
    "title": "Here's the deck Dialogue AI used to land $6 million to transform $140 billion customer research industry",
    "summary": "Dialogue AI cofounders Justin Hoang, Hubert Chen, and Benjamin Lo are drawing on their experience at Nextdoor to reinvent market research.\nDialogue AI cofounders Justin Hoang, Hubert Chen, and Benjamin Lo are drawing on their experience at Nextdoor to reinvent market research.\nOn Friday, Dialogue AI, an AI-powered market research platform, launched with an aim to speed up the way companies conduct research — from designing studies and recruiting participants, to conducting interviews.\n\"We were basically conducting a lot of customer and user research,\" Lo told Business Insider.\nI think that's one of our visions — can we almost democratize market research,\" Hoang said.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-17T16:44:47Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/news/801505/meta-ai-chatbot-parental-controls-instagram",
    "title": "Meta’s Instagram is adding parental AI chatbot controls next year",
    "summary": "After enthusiastically rolling AI chatbots out everywhere, Meta has announced new options for parents to get an idea of how teens are chatting with the digital characters and set some limits on use.\nThe new controls will let parents stop their children from speaking with AI chatbots entirely or block access to specific characters they don’t like, Instagram lead Adam Mosseri and Meta chief AI officer Alexandr Wang wrote in a blog post announcing the changes on Friday.\nMeta’s AI assistant is a notable exception to this rule.\nFrom Meta’s description, it looks like the “insights” will take the form of a high-level summary of “the topics their teens are chatting about with AI characters” and Meta’s AI assistant.\nIt comes on the heels of another major update pushed only this week that limits what content teen Instagram accounts can view, in line with what you’d see in a PG-13 movie.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-10-17T09:52:29Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/marc-andreessen-ai-hollywood-movies-2025-10",
    "title": "Marc Andreessen says AI will give rise to a new type of filmmaker: 'That's a reason for profound optimism'",
    "summary": "Legendary investor and movie buff Marc Andreessen doesn't think that will be an issue for future creatives.\nAndreessen said AI has made the art of filmmaking more accessible to people who may have creative skills but lack the financial resources or technical expertise.\nOn Thursday, Spotify announced a partnership with major record labels and music companies to develop \"artist-first AI music products.\"\n\"If the music industry doesn't lead in this moment, AI-powered innovation will happen elsewhere, without rights, consent, or compensation.\"\nRepresentatives for Andreessen Horowitz did not respond to a request for comment from Business Insider.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-17T20:01:11Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/broadcom-layoffs-rifs-cuts-sales-staff-ai-expansion-2025-10",
    "title": "$1.65 trillion chip giant Broadcom cuts staff in units like sales and accounts",
    "summary": "lighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nThe $1.65 trillion chip giant Broadcom cut staff earlier this week.\nThe cuts on Thursday affected staff largely in sales, as well as customer success, account management, and solutions, according to LinkedIn posts and a person familiar with the matter.\nBroadcom has been making rolling cuts at the company, including at software firm VMware, which it acquired in late 2023.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-10-18T00:48:57Z",
    "source": "Business Insider"
  },
  {
    "url": "https://tech.slashdot.org/story/25/10/17/1011256/army-general-says-hes-using-ai-to-improve-decision-making",
    "title": "Army General Says He's Using AI To Improve 'Decision-Making'",
    "summary": "If at first you don't succeed, you must be a programmer.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-10-17T15:20:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://www.wired.com/story/gear-news-of-the-week-honor-teases-a-bizarre-robot-phone-and-kohler-debuts-a-toilet-sensor/",
    "title": "Gear News of the Week: Honor Teases a Bizarre Robot Phone, and Kohler Debuts a Toilet Sensor",
    "summary": "Prices start at $325 for the carry-on version, $375 for the checked size, $395 for a larger checked version, or $995 for the entire family set.\nI am planning on using the carry-on version this weekend, and it easily paired with my iPhone.\n—Adrienne SoFujifilm’s New Instax Has Two CamerasCourtesy of FujifilmFujifilm announced the Instax Mini LiPlay+ this week, an update to its 2019 Mini LiPlay camera.\nThe Fujifilm Instax Mini LiPlay+ will be available later this month for $235.\nThe GrapheneOS developers do say that whichever phone it turns out to be, it will be similarly priced.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-18T10:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.businessinsider.com/bi-today-sunday-newsletter-ai-gig-economy-2025-10",
    "title": "The AI revolution's next casualty could be the gig economy",
    "summary": "lighning bolt icon An icon in the shape of a lightning bolt.\nShuji Kajiyama/AP ImagesThe gig economy is facing a reckoning.\nBoth moves point toward the same future: one where the very workers who built the gig economy may soon find themselves training the technology that replaces them.\nBy helping Uber strengthen its AI, drivers could be accelerating the very driverless world they fear.\nStill, he has warned that the eventual decline of driving jobs poses a significant societal challenge to the gig economy.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-10-19T10:45:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/news/801487/anthropic-claude-microsoft-365-connector-ai",
    "title": "Anthropic connects Claude to Microsoft Teams, Outlook, and OneDrive",
    "summary": "Anthropic is integrating its Claude AI assistant with Microsoft 365 services so it can surface content from Word documents, Teams messages, and Outlook emails in conversations with the chatbot.\nClaude will now connect with Microsoft SharePoint and OneDrive to search and analyze documents without you needing to upload them manually.\nThe Microsoft Outlook integration with Claude lets the chatbot access email threads and analyze communications to surface relevant context in its answers.\nThe Claude and Microsoft 365 integration works by using a Model Context Protocol (MCP) connector, Anthropic’s open-source standard for connecting AI applications to other data sources and apps.\nMicrosoft has also been increasingly relying on Anthropic AI models to improve its Microsoft 365 apps.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-10-17T08:53:02Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/bcg-how-companies-deploy-ai-advice-steven-mills-2025-10",
    "title": "There's one key thing companies must do when they bring AI into the workplace, BCG's AI ethics officer says",
    "summary": "\"What we found is that employees want about five hours of hands-on training, and coaching, and mentoring,\" Boston Consulting Group Global Chief AI Ethics Officer Steven Mills told Business Insider.\nMills, who spoke to Business Insider on the sidelines of Semafor's World Economic Summit, said the real value starts once employees see what AI can do.\nLast month, BCG released a report that found that only 5% of companies are deriving value from AI.\nAt BCG, Mills works with governments worldwide.\nLeading AI companies, including OpenAI, which partners with BCG, Anthropic, Meta, Google, and Microsoft, have offered their AI agents at almost no cost to federal agencies.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-18T12:06:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.cnet.com/tech/mobile/agentic-ai-is-here-to-improve-your-life-you-just-have-to-believe-in-it/",
    "title": "Agentic AI Is Here to Improve Your Life, You Just Have to Believe in It",
    "summary": "Lining up the right LLMs and hardware is part of paving the way for AI agents.\nBut it'll take a lot of familiarization for people to understand how to use AI agents and become accustomed to them.\nAI agents could help people become power users of their devices without digging deep into their settings.\nWhether those AI capabilities, combined with performance improvements over last year's chip, will herald an era of AI agents on PCs has yet to be seen.\nPeople will ask questions on phones, and the AI agent will run through one or more LLMs to get the answers.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-17T20:16:00Z",
    "source": "CNET"
  }
]