[
  {
    "id": "MA==",
    "url": "https://www.theverge.com/news/867244/microsoft-bitlocker-privacy-fbi",
    "title": "Microsoft handed the government encryption keys for customer data",
    "summary": "The FBI went to Microsoft last year with a warrant, asking them to hand over keys to unlock encrypted data stored on three laptops as part of an investigation into potential fraud involving the COVID unemployment assistance program in Guam — and Microsoft complied.\nTypically, companies resist handing over encryption keys to authorities.\nChamberlayne ellaborated saying, “customers can choose to store their encryption keys locally, in a location inaccessible to Microsoft, or in Microsoft’s cloud.\nThe current administration and ICE have shown little respect for data security or the rule of law.\nAnd beyond American borders, Jennifer Granick, surveillance and cybersecurity counsel at the ACLU, told Forbes that “foreign governments with questionable human rights records” may also expect Microsoft to hand over keys to customer data.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-24T22:39:57Z",
    "source": "The Verge"
  },
  {
    "id": "NA==",
    "url": "https://www.androidcentral.com/apps-software/spotify/spotifys-prompted-playlists-beta-grooves-into-premium-in-the-us-more-markets",
    "title": "Spotify's 'Prompted Playlists' beta grooves into Premium in the US, more markets",
    "summary": "What you need to knowSpotify announces that its Prompted Playlists beta will open for more users in markets like the U.S. and Canada by the end of January.\nPrompted Playlists leverages a user's description of the type of music they want, taking into account vibes, account history, cultural influences, and more.\nSpotify's looking at you to tell its software what you're interested in listening to, which is why Prompted Playlists are headed to more places.\nSpotify's Prompted Playlist will generate its results based on your description.\nWith this expanded beta, Spotify is continuing its interest in listening to users to improve Prompted Playlists as much as possible before launching it fully.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-22T14:00:00Z",
    "source": "Android Central"
  },
  {
    "id": "NQ==",
    "url": "https://news.slashdot.org/story/26/01/23/2328228/campaigner-launches-2-billion-legal-action-in-uk-against-apple-over-wallets-hidden-fees",
    "title": "Campaigner Launches $2 Billion Legal Action In UK Against Apple Over Wallet's 'Hidden Fees'",
    "summary": "The confusion of a staff member is measured by the length of his memos.\n-- New York Times, Jan. 20, 1981",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-24T01:25:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "OQ==",
    "url": "https://it.slashdot.org/story/26/01/23/1910235/microsoft-gave-fbi-a-set-of-bitlocker-encryption-keys-to-unlock-suspects-laptops",
    "title": "Microsoft Gave FBI a Set of BitLocker Encryption Keys To Unlock Suspects' Laptops",
    "summary": "The confusion of a staff member is measured by the length of his memos.\n-- New York Times, Jan. 20, 1981",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-23T22:02:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MTA=",
    "url": "https://www.businessinsider.com/elon-musk-says-aging-is-a-solvable-problem-at-davos-2026-1",
    "title": "Elon Musk says it's 'highly likely' humans figure out how to reverse aging — but there's 'some benefit to death'",
    "summary": "The world's richest man said getting older was a \"very solvable problem\" during a conversation with BlackRock CEO Larry Fink at the World Economic Forum on Thursday.\nIt's not a subtle thing,\" Musk said.\nThere's a reason why we don't actually have a longer lifespan, because if people do live for a very long time, I think there's some risk of an ossification of society.\nMusk's surprise appearance was his first time onstage at the World Economic Forum, which he'd previously called \"boring af.\"\nDozens of political and business leaders from across the globe gathered in Davos, Switzerland, this week to attend the World Economic Forum.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-22T18:26:53Z",
    "source": "Business Insider"
  },
  {
    "id": "MTU=",
    "url": "https://www.theverge.com/transportation/865145/waymo-miami-public-riders-waitlist",
    "title": "Waymo is accepting public riders in Miami",
    "summary": "Waymo is kicking off the new year with a new city: Miami.\nThe map will also grow over time to include more neighborhoods and prime locations, like Miami International Airport.\nWaymo has been testing its autonomous vehicles in the Florida city on-and-off since at least 2019.\nIn its announcement about Miami, Waymo touted its safety record — a tenfold reduction in serious injury crashes compared to human drivers in the cities where it operates — and its growing demand.\nAt the end of 2025, Waymo said it was doing about 450,000 paid driverless trips each week.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-22T14:04:44Z",
    "source": "The Verge"
  },
  {
    "id": "MTc=",
    "url": "https://slashdot.org/story/26/01/22/2317238/intel-struggles-to-meet-ai-data-center-demand",
    "title": "Intel Struggles To Meet AI Data Center Demand",
    "summary": "The confusion of a staff member is measured by the length of his memos.\n-- New York Times, Jan. 20, 1981",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-23T02:02:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MTg=",
    "url": "https://www.wired.com/story/ai-agents-math-doesnt-add-up/",
    "title": "The Math on AI Agents Doesn’t Add Up",
    "summary": "The big AI companies promised us that 2025 would be “the year of the AI agents.” It turned out to be the year of talking about AI agents, and kicking the can for that transformational moment to 2026 or maybe later.\n“So we should forget about AI agents running nuclear power plants?” I ask.\nA startup called Harmonic is reporting a breakthrough in AI coding that also hinges on mathematics—and tops benchmarks on reliability.\n“Are we doomed to be in a world where AI just generates slop and humans can't really check it?\nIn a blog about the paper, OpenAI glumly stated that in AI models, “accuracy will never reach 100 percent.”",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-23T16:00:00Z",
    "source": "Wired"
  },
  {
    "id": "MTk=",
    "url": "https://www.wired.com/story/wikipedia-group-made-guide-to-detect-ai-writing-now-a-plug-in-uses-it-to-humanize-chatbots/",
    "title": "A Wikipedia Group Made a Guide to Detect AI Writing. Now a Plug-In Uses It to ‘Humanize’ Chatbots",
    "summary": "On Saturday, tech entrepreneur Siqi Chen released an open source plug-in for Anthropic’s Claude Code AI assistant that instructs the AI model to stop writing like an AI model.\n“It’s really handy that Wikipedia went and collated a detailed list of ‘signs of AI writing,’” Chen wrote on X.\nSpotting the PatternsSo what does AI writing look like?\nWhy AI Writing Detection FailsEven with such a confident set of rules crafted by Wikipedia editors, we’ve previously written about why AI writing detectors don’t work reliably: There is nothing inherently unique about human writing that reliably differentiates it from LLM writing.\nOne reason is that even though most AI language models tend toward certain types of language, they can also be prompted to avoid them, as with the Humanizer skill.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-22T12:00:00Z",
    "source": "Wired"
  },
  {
    "id": "MjA=",
    "url": "https://www.theverge.com/tech/866437/tiktok-usds-bytedance-sale-oracle-mgx",
    "title": "The TikTok deal is done, finally",
    "summary": "TikTok USDS Joint Venture’s mandate is to secure U.S. user data, apps and the algorithm through comprehensive data privacy and cybersecurity measures.\nData Protection: U.S. user data will be protected by USDS Joint Venture in Oracle’s secure U.S. cloud environment.\nAlgorithm Security: The Joint Venture will retrain, test, and update the content recommendation algorithm on U.S. user data.\nTikTok USDS Joint Venture has three managing investors, Silver Lake, Oracle and MGX, each holding 15%.\nByteDance retains 19.9% of the Joint Venture.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-23T01:05:20Z",
    "source": "The Verge"
  },
  {
    "id": "MjE=",
    "url": "https://www.wired.com/story/gear-news-of-the-week-apples-ai-wearable-and-a-phone-that-can-boot-android-linux-and-windows/",
    "title": "Gear News of the Week: Apple’s AI Wearable and a Phone That Can Boot Android, Linux, and Windows",
    "summary": "Accompanying the revamped Siri could be a new AI-powered wearable the size of an AirTag, according to fresh rumors this week from The Information.\nThis smartphone can run three operating systems: Android, Linux, and Windows.\nWhen you boot Android, you can use it as a normal Android phone, and you can enable Android's native desktop mode in Android 16.\nIf you launch the NexPhone with Windows, the company has a custom mobile user interface of Microsoft's operating system (very reminiscent of Windows Phone Metro UI) to make it easy to use on a phone display.\nAnd when plugged into an external monitor, you can enjoy the full Windows 11 desktop experience.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-24T11:00:00Z",
    "source": "Wired"
  },
  {
    "id": "MjI=",
    "url": "https://www.cnet.com/tech/services-and-software/surfshark-vpn-now-offers-post-quantum-protection-cybersecurity-is-behind-the-move/",
    "title": "Surfshark VPN Now Offers 'Post-Quantum' Protection. Cybersecurity Is Behind the Move",
    "summary": "Tyler Lacoma Editor / Home SecurityFor more than 10 years Tyler has used his experience in smart home tech to craft how-to guides, explainers, and recommendations for technology of all kinds.\nFrom using his home in beautiful Bend, OR as a testing zone for the latest security products to digging into the nuts and bolts of the best data privacy guidelines, Tyler has experience in all aspects of protecting your home and belongings.\nWith a BA in Writing from George Fox and certification in Technical Writing from Oregon State University, he's ready to get you the details you need to make the best decisions for your home.\nOn off hours, you can find Tyler exploring the Cascade trails, finding the latest brew in town with some friends, or trying a new recipe in the kitchen!",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-01-22T21:16:09Z",
    "source": "CNET"
  },
  {
    "id": "MjM=",
    "url": "https://www.theverge.com/news/865627/wikipedia-ai-slop-guide-anthropic-claude-skill",
    "title": "This plugin uses Wikipedia’s AI-spotting guide to make AI writing sound more human",
    "summary": "Is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more.\nPreviously, she was a writer and editor at MUO.\nPosts from this author will be added to your daily email digest and your homepage feed.\nA new tool aims to help AI chatbots generate more human-sounding text — with the help of Wikipedia’s guide for detecting AI, as reported by Ars Technica.\nIt’s only a matter of time before the AI companies themselves start adjusting their chatbots against some of these tells, too, as OpenAI has already addressed ChatGPT’s overuse of em dashes, which has become an indicator of AI content.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-22T14:48:15Z",
    "source": "The Verge"
  },
  {
    "id": "MjQ=",
    "url": "https://www.businessinsider.com/openai-1-billion-a-month-api-business-chatgpt-sam-altman-2026-1",
    "title": "OpenAI is generating over $1 billion from something that has nothing to do with ChatGPT",
    "summary": "Sam Altman says OpenAI's API business pulled in more than $1 billion in annual recurring revenue in the past month.\nSam Altman says OpenAI's API business pulled in more than $1 billion in annual recurring revenue in the past month.\nKyle Grillot/Bloomberg—Getty Images/ReutersSam Altman says OpenAI's API business pulled in more than $1 billion in annual recurring revenue in the past month.\nSam Altman said in a post on X on Thursday that OpenAI added more than $1 billion in annual recurring revenue in the past month \"just from our API business.\"\nHarvey, one of the fastest-growing legal tech startups, is built on OpenAI's models to assist lawyers with research and drafting.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-23T05:01:03Z",
    "source": "Business Insider"
  },
  {
    "id": "MjU=",
    "url": "https://www.theverge.com/ai-artificial-intelligence/865077/adobe-firefly-foundry-ip-sage-genai-models",
    "title": "Adobe is developing ‘IP-safe’ gen AI models for the entertainment industry",
    "summary": "As Hollywood continues to embrace generative AI, Adobe is taking steps to make its Firefly suite of creative tools the go-to for studios’ entertainment production needs.\nAdobe says that this ensures Firefly Foundry models enable “responsible AI adoption across every stage of production” from pre-visualization to final stage edits.\nThose limitations were rooted in the fact that Adobe’s more basic gen AI models were trained solely on inputs that Adobe had bought the rights to use.\nBut that wasn’t quite enough to create the kinds of assets Adobe’s clients wanted going forward.\nThat’s where Firefly Foundry comes in.”To hype Firefly Foundry up, Adobe is already collaborating with talent agencies, including Creative Artists Agency, United Talent Agency, and William Morris Endeavor.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-22T14:01:06Z",
    "source": "The Verge"
  },
  {
    "id": "MjY=",
    "url": "https://news.aibase.com/news/24859",
    "title": "OpenAI to Take a Percentage from Customer AI-Assisted R&D Outcomes, Further Upgrading Its Commercial Model and Triggering Industry Attention",
    "summary": "In the ongoing exploration of sustainable profit paths, OpenAI is酝酿 a more disruptive business model: taking a share from \"AI-Aided Discoveries\" achieved by customers using its AI systems.\nAccording to insiders, this plan is still under internal discussion but has already attracted widespread attention in high-value R&D fields such as technology, pharmaceuticals, and materials science.\nThey refer to innovative outputs accelerated by enterprises or research institutions using OpenAI's large models (such as GPT, Operator agents, etc.\nThis differs from traditional API usage billing, as it upgrades the charging model from \"usage volume\" to \"value creation,\" aiming to deeply bind AI with customer success.\nBetween its AGI vision and practical profitability, OpenAI is taking a bold step—but this path is destined to face three major challenges: legal, ethical, and commercial ones.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-23T23:15:12Z",
    "source": "Aibase.com"
  },
  {
    "id": "Mjc=",
    "url": "https://www.wired.com/story/ai-powered-disinformation-swarms-are-coming-for-democracy/",
    "title": "AI-Powered Disinformation Swarms Are Coming for Democracy",
    "summary": "When the scheme was finally uncovered, there was widespread media coverage and Senate hearings, and social media platforms made changes in the way they verified users.\nA decade on, while the IRA is no more, disinformation campaigns have continued to evolve, including the use of AI technology to create fake websites and deepfake videos.\nA new paper, published in Science on Thursday, predicts an imminent step-change in how disinformation campaigns will be conducted.\nThese AI swarms, the researchers believe, could deliver society-wide shifts in viewpoint that not only sway elections but ultimately bring about the end of democracy—unless steps are taken now to prevent it.\nThese systems would also be able to adapt in real time to respond to signals shared by the social media platforms and in conversation with real humans.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-22T19:00:00Z",
    "source": "Wired"
  },
  {
    "id": "Mjg=",
    "url": "https://www.theverge.com/news/866906/meta-teens-ai-characters-stop-block-new-version",
    "title": "Meta is stopping teens from chatting with its AI characters",
    "summary": "The change blocking teens from accessing the characters will go into effect “starting in the coming weeks.””Since we announced our plans to build parental controls for AI characters in October, we started developing a new iteration of AI characters generally (i.e.\n“Rather than building the parental controls twice (for the current AI characters and the new iteration of AI characters) we’re pausing teen access to the current version while we focus on the new iteration.\nWhen that new iteration is available for teens, it will come with parental controls.”According to TechCrunch, “Meta said that it heard from parents that they wanted more insights and control over their teens’ interactions with AI characters, which is why it decided to make these changes.”In October, Meta announced that parents would be able to block their teens’ access to one-on-one conversations with its AI characters, block their teens from talking with specific AI characters, and share insights with parents on the topics their teens discuss with Meta’s AI characters and its AI assistant.\nHowever, in Friday’s announcement, Meta says it is still working on how to share insights with parents about the conversations their teens are having with Meta’s AI assistant.\nCorrection, January 23rd: Clarified that Meta is still working on how to share insights with parents about the conversations their teens are having with Meta’s AI assistant.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-23T19:50:59Z",
    "source": "The Verge"
  },
  {
    "id": "Mjk=",
    "url": "https://www.theverge.com/news/866524/microsoft-paint-notepad-ai-coloring-book",
    "title": "Microsoft Paint can now make AI coloring books",
    "summary": "Microsoft is giving its Paint and Notepad apps on Windows new AI capabilities for editing text and making digital illustrations.\nThe latter feature is aptly called “Coloring book,” and lets you make blank coloring templates in version 11.2512.191.0 of Paint based on a text prompt.\nFrom there, you can presumably use Paint itself to color the image, or print it out to use traditional art materials.\nIt’s such an oddly specific tool that I have to wonder if this is something that coloring book consumers (parents and stressed-out millennials) actually use Paint for.\nThe Coloring book feature is notably only available on Copilot Plus PCs, so it’s more likely that Microsoft is exploring novel ways to make its AI-infused Windows 11 devices more marketable.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-01-23T11:06:39Z",
    "source": "The Verge"
  },
  {
    "id": "MzA=",
    "url": "https://www.theverge.com/tech/865168/google-says-ai-news-headlines-are-feature-not-experiment",
    "title": "Google won’t stop replacing our news headlines with terrible AI",
    "summary": "In early December, I brought you the news that Google has begun replacing Verge headlines, and those of our competitors, with AI clickbait nonsense in its content feed.\nFor example, Google’s AI claimed last week that “US reverses foreign drone ban,” citing and linking to this PCMag story for the news.\nTwo of Google’s AI headlines.\nOne headline that Google’s AI didn’t overwrite was “Star Wars Outlaws Free Download Available For Less Than 24 Hours” by Screen Rant.\nI don’t know how broadly Google is showing these “trending topics” AI headlines yet, but it seems the company is testing them beyond the Google Discover news feed, too.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-23T03:07:16Z",
    "source": "The Verge"
  },
  {
    "id": "MzE=",
    "url": "https://www.businessinsider.com/legal-tech-mergers-acquisitions-consolidation-clio-harvey-filevine-2026-1",
    "title": "Too Many Legal Tech Tools Give Way to Consolidation",
    "summary": "Legal tech is entering its consolidation era.\nThis week, Harvey, an $8 billion legal software giant, acquired Hexus, a sales tech startup built by former Google and Twitter (now X) engineers.\nAnd earlier this month, Microsoft quietly absorbed 18 employees from the legal software startup Robin AI after it filed for bankruptcy.\nEarly winners of the legal tech boom are expected to buy smaller companies to extend their leads and add new features to their software.\nThat pressure is now driving a \"shakeout of point solutions,\" said Omar Haroun, cofounder and chief executive of the legal tech company Eudia.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-23T10:00:02Z",
    "source": "Business Insider"
  },
  {
    "id": "MzI=",
    "url": "https://www.businessinsider.com/amplitude-ai-native-push-2026-1",
    "title": "5 acquisitions, winning over skeptical engineers, and spending tens of millions: Inside a public company's 'AI native' push",
    "summary": "It got Cursor and GitHub Copilot licenses for employees, and ran a heads-down AI week.\nWade Chambers led Amplitude's AI week, which took the entire engineering team offline.\nAmplitudeSoon after joining, Chambers began planning an \"AI week\" for the first week of June.\nThat figure peaked in the first week of December — after AI week but before the holiday vacation cycle — at 174 employees.\nAmplitude shared the growth in usage of its AI tools.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-25T09:30:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MzM=",
    "url": "https://www.theverge.com/tech/865689/microsoft-claude-code-anthropic-partnership-notepad",
    "title": "Claude Code is suddenly everywhere inside Microsoft",
    "summary": "This division is responsible for Windows, Microsoft 365, Outlook, Microsoft Teams, Bing, Edge, Surface, and more.\nMicrosoft has also approved the use of Claude Code across all of its code and repositories for its Business and Industry Copilot teams.\nSoftware engineers at Microsoft are now expected to use both Claude Code and GitHub Copilot and give feedback comparing the two, I’m told.\nMicrosoft and Anthropic signed a deal in November that allows Microsoft Foundry customers to get access to Claude Sonnet 4.5, Claude Opus 4.1, and Claude Haiku 4.5.\nThe big question here is, what does the increased use of Claude Code at Microsoft mean for its more than 100,000 code repositories?",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-22T16:24:34Z",
    "source": "The Verge"
  },
  {
    "id": "MzQ=",
    "url": "https://www.theverge.com/news/866441/ring-verify-security-camera-ai-fakes-video-verification",
    "title": "Ring can verify videos now, but that might not help you with most AI fakes",
    "summary": "Ring has launched a new Ring Verify tool that the company says can “verify that Ring videos you receive haven’t been edited or changed.” But since Ring won’t verify videos that have been altered in any way, it probably won’t be able to verify those videos you see on TikTok that look like they’re from security camera footage but are actually made with AI.\nAll videos downloaded from Ring’s cloud now include a “digital security seal,” Ring says.\nWhen Ring Verify says a video is “verified,” that means “the video hasn’t been changed in any way since it was downloaded from Ring.” (Ring Verify is built on C2PA standards, according to spokesperson Kaleigh Bueckert-Orme.)\nIf Ring can’t verify the video as authentic, it also can’t tell you exactly what was changed about it.\nIf you want an original version of a video, Ring suggests asking the person who shared it with you to share a link from the Ring app.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-23T00:57:41Z",
    "source": "The Verge"
  },
  {
    "id": "Mzk=",
    "url": "https://www.dezeen.com/2026/01/22/jpmorganchase-hq-trading-floors-interiors-som/",
    "title": "SOM unveils NYC's \"most advanced trading environment\" inside JPMorganChase skyscraper",
    "summary": "American architecture studio SOM has revealed the interiors of the trading floors inside the new Foster & Partners-designed JPMorganChase supertall skyscraper in Midtown Manhattan.\nThe eight trading floors sit just above the vast lobby inside 270 Park Avenue, which officially opened as the headquarters of the American financial company in October 2025.\n\"Our goal was to create a trading environment that supports both the focus and collaboration inherent in the work,\" said SOM interior design principal Ece Calguner Erzan.\nLarge, open trading floors are laid out to maximise daylight from the glass facades, supplemented by ceilings with integrated circadian lighting deeper into the floor plates.\nAbove each central cafe are two boardrooms that overlook the trading floors on one side and Park Avenue on the other.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-22T18:00:26Z",
    "source": "Dezeen"
  },
  {
    "id": "NDE=",
    "url": "https://www.nature.com/articles/s41598-026-35389-6",
    "title": "LED lighting (350-650nm) undermines human visual performance unless supplemented by wider spectra (400-1500nm+) like daylight",
    "summary": "Hence, exposure to full spectrum lighting results in a balanced pattern of improvement in visual performance.\nThese three features change the way in which long wavelength light may be applied to improve human physiology by delivery in normal environments with lasting balance effects.\nWhen shorter wavelength exposure is dominant, as in LED lighting, mitochondrial function declines.\nRetinal metabolism declines with age, but this can be partly corrected with long wavelength light across species16,21.\nConsequently, it has been suggested that longer wavelengths reduce water viscosity around rotary ATP pumps allowing the rotor to increase speed27.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-25T21:44:10Z",
    "source": "Nature.com"
  },
  {
    "id": "NDM=",
    "url": "https://hardware.slashdot.org/story/26/01/25/2153246/gasoline-out-of-thin-air-its-a-reality",
    "title": "Gasoline Out of Thin Air? It's a Reality!",
    "summary": "The confusion of a staff member is measured by the length of his memos.\n-- New York Times, Jan. 20, 1981",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-25T21:56:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "NDU=",
    "url": "https://www.yankodesign.com/2026/01/22/this-desk-hood-blocks-office-noise-without-walling-you-in/",
    "title": "This Desk Hood Blocks Office Noise Without Walling You In",
    "summary": "Canopy is KFI Studios and Gensler’s answer, a freestanding workstation that behaves like a tiny room inside the open plan.\nIt combines a height-adjustable desk with an upholstered privacy hood, integrated lighting, and built-in power, creating a personal haven for focused work without walling people off.\nThe upholstered hood softens the hum of the floor, integrated lighting dials in for your screen, and the sit-stand surface adjusts to your height with intuitive controls and a digital readout.\nThe fully upholstered hood gives a sense of boundary without feeling like a box.\nBy giving each person a small, height-adjustable, well-lit, and acoustically softened bay, it brings a bit of architectural calm into the open plan.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-22T18:20:20Z",
    "source": "Yanko Design"
  },
  {
    "id": "NjY=",
    "url": "https://www.theverge.com/news/866977/tiktok-deal-congress-china",
    "title": "Congress doesn’t seem to know if the TikTok deal complies with its law",
    "summary": "TikTok finally closed a deal meant to bring it into compliance with the law that should have banned it a year ago, and the lawmakers who passed that law still don’t seem to know what’s going on.\nNow that a deal has been reached, Markey said in a statement, “this TikTok deal raises many more questions than answers.”Trump has played a significant role in how the negotiations have played out, talking about the TikTok deal with China’s President Xi Jinping, and at one point bantering at a press conference with Oracle chairman Larry Ellison that they could “negotiate in front of the media” over the deal.\nMarkey griped that the White House “has provided virtually no details about this agreement, including whether TikTok’s algorithm is truly free of Chinese influence,” despite repeated requests for details.\nThe White House and TikTok did not immediately respond to requests for comment.\n“The sparse information provided doesn’t address serious concerns about compliance with the law or address the national security threat posed by Beijing’s continued control of the platform.”",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-23T22:08:43Z",
    "source": "The Verge"
  },
  {
    "id": "Njc=",
    "url": "https://www.businessinsider.com/the-us-militarys-drone-defense-confusion-is-leaving-bases-vulnerable-2026-1",
    "title": "The US military's drone-defense confusion is leaving its bases vulnerable, Pentagon watchdog finds",
    "summary": "A US Army soldier trains with a counter-UAS weapon known as a \"Drone Buster,\" at Fort Irwin, California, in October 2024.\nA Pentagon watchdog report is warning that gaps in Pentagon policy are leaving some US military bases vulnerable to drone threats.\nThat lack of awareness derived from confusing policy risks leaving bases exposed to uncrewed threats, a growing concern.\nThe Inspector General report examines 10 military installations where drone incursions have occurred.\n\"In recent years, adversary unmanned systems have evolved rapidly,\" a Department of Defense counter-drone strategy released in the final months of the Biden administration said.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-25T14:07:01Z",
    "source": "Business Insider"
  },
  {
    "id": "Njg=",
    "url": "https://hackaday.com/2026/01/25/commodore-64-helps-revive-the-bbs-days/",
    "title": "Commodore 64 Helps Revive The BBS Days",
    "summary": "One of those systems was the Bulletin Board System, or BBS, which would have been a single computer, often in someone’s home, connected to a single phone line.\nThe video by [The Retro Shack] sets up a lot of this history for context, then, towards the end, uses a modern FPGA-based recreation called the Commodore 64 Ultimate to access a BBS called The Old Net, a modern recreation of what these 80s-era BBS systems were like.\nOnce there, users can access mail, share files, and even play a few games.\nA retro machine like a C64 or Atari is not required either; modern operating systems can access these with the right terminal program, too.\nA more in-depth guide to the BBS can be found here for those looking to explore, and we’ve also seen other modern BBS systems recently.",
    "category": "technology",
    "bias": "right",
    "publishedAt": "2026-01-25T09:00:44Z",
    "source": "Hackaday"
  },
  {
    "id": "NzI=",
    "url": "https://www.businessinsider.com/read-tiktok-ceo-memo-closing-a-deal-avoid-a-ban-2026-1",
    "title": "Read the memo TikTok's CEO sent staff after closing a deal to avoid a US ban",
    "summary": "The deal involved setting up a joint venture with an investor consortium that now owns just over 80% of the new US entity.\nThe group, led by managing investors Oracle, Silver Lake, and MGX, is tasked with securing US user data, content moderation, and trust and safety.\nThe company is splitting up its US employees into different entities based on whether they'll stay under ByteDance's wing or work for the new joint venture, TikTok USDS Joint Venture LLC.\nMoving forward, Chew will continue to run TikTok globally, while trust and safety executive Adam Presser will oversee the US joint venture.\nTikTok's growth in the US nicely sets up the Joint Venture for strong future success.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-23T15:14:09Z",
    "source": "Business Insider"
  }
]