[
  {
    "url": "https://gizmodo.com/the-end-of-bullshit-ai-2000640302",
    "title": "The End of Bullshit AI",
    "summary": "In every conversation about AI, you hear the same refrains: “Yeah, but it’s amazing,” quickly followed by, “but it makes stuff up,” and “you can’t really trust it.” Even among the most dedicated AI enthusiasts, these complaints are legion.\n“I like it, but it never says ‘I don’t know.’ It just makes you think it knows,” she told me.\nThis makes it the first consumer AI explicitly designed to reject bullshit, especially its own.\nLess Flattery, More FrictionEarlier this year, many ChatGPT users noticed the AI had become strangely sycophantic.\nOthers, however, may find themselves frustrated by an AI that no longer just tells them what they want to hear.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-08-07T20:50:47Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.businessinsider.com/sam-altman-openai-gpt-5-agi-2025-8",
    "title": "Here's why Sam Altman says OpenAI's GPT-5 falls short of AGI",
    "summary": "Sam Altman says OpenAI has yet to crack AGI.\nDeveloping AGI that benefits all of humanity is OpenAI's core mission.\nAltman said that looking back at OpenAI's previous releases, GPT-5 is still a step in the right direction.\nWhile AGI remains the company's mission, Altman says OpenAI is already looking beyond it to superintelligence, a still theoretical advancement in which artificial intelligence can reason far beyond human capability.\n\"Superintelligent tools could massively accelerate scientific discovery and innovation well beyond what we are capable of doing on our own, and in turn massively increase abundance and prosperity,\" Altman wrote in January.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-07T18:01:39Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.derekthompson.org/p/how-ai-conquered-the-us-economy-a",
    "title": "How AI Conquered the US Economy: A Visual FAQ",
    "summary": "Nobody can say for sure whether the AI boom is evidence of the next Industrial Revolution or the next big bubble.\nWe can all stop talking about “what will happen if AI dominates the economy at such-and-such future date?” No, the AI economy is here and now.\nToday, in a bit of a throwback to my early blogging years, I’m going to try to walk through an FAQ with graphs to create a visual guide to the question:How big is the AI boom?\n“AI companies are reaching revenue milestones faster than previous generations of startups,” the company announced in a recent report.\nBut independent evaluators in the study actually concluded that using AI did the opposite: it increased task completion time by about 20 percent.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-08-07T10:12:54Z",
    "source": "Derekthompson.org"
  },
  {
    "url": "https://www.cnet.com/tech/services-and-software/trump-media-is-testing-an-ai-search-engine-powered-by-perplexity/",
    "title": "Trump Media Is Testing an AI Search Engine Powered by Perplexity",
    "summary": "President Donald Trump's media company, Trump Media, is beta-testing an AI search feature on the Truth Social platform, drawing on Perplexity's AI technology.\nGenerative AI technology has been upending traditional internet search, which has been dominated by Google for decades.\nTrump Media and Technology Group is perhaps best known for its social media program, Truth Social.\nRepresentatives for Trump Media and Perplexity didn't immediately respond to a request for comment.\nIn today's divided political landscape, one immediate concern is that a search engine from a conservative president's media company will select only search results that favor conservative opinions.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-07T00:35:09Z",
    "source": "CNET"
  },
  {
    "url": "https://news.slashdot.org/story/25/08/09/0624254/students-have-been-called-to-the-office---or-arrested---for-false-alarms-from-ai-powered-surveillance-systems",
    "title": "for False Alarms from AI-Powered Surveillance Systems",
    "summary": "How can you work when the system's so crowded?",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-08-09T16:34:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://www.macrumors.com/2025/08/07/apples-ai-problem-not-just-siri-talent-leaving/",
    "title": "Apple's Real AI Crisis Isn't Siri, But the Talent It's Losing to Rivals",
    "summary": "The exodus of staff from Apple's AI team over the last seven months has seen senior researchers leave variously for Meta, OpenAI, xAI, Cohere, and others.\nThe most notable recent departure was that of Ruoming Pang, head of Apple's Foundational Models team, who joined Meta last month after being lured by CEO Mark Zuckerberg with a $200 million pay package.\nFT reports that industry recruiters see the departures as \"a crisis of confidence\" around Apple's AI future.\nAaron Sines from recruiting firm Razoroo said companies now view elite AI talent as \"strategic assets,\" on par with intellectual property or even entire business units.\nA chatbot-like version of the virtual assistant was one of the key Apple Intelligence features that Apple promoted at last year's WWWDC, but it has yet to arrive.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-08-07T12:22:34Z",
    "source": "MacRumors"
  },
  {
    "url": "https://www.businessinsider.com/openai-sam-altman-ai-talent-war-meta-labor-market-jobs-2025-8",
    "title": "Sam Altman says the talent pool for AI superstars is probably bigger than people think",
    "summary": "OpenAI CEO Sam Altman called it the \"most intense talent market I have seen in my career,\" on CNBC's Squawk Box on Friday, a day after OpenAI released GPT-5, the latest iteration of its flagship model.\n\"I bet it's much bigger than people think,\" he said, referring to the available talent pool.\nBusiness Insider earlier reported that researchers at many of the top AI startups are earning in the mid-six-figures for their skills.\nMore than any other field, AI bets on potential over proven track records, as companies race toward still-theoretical goals like artificial general intelligence and superintelligence.\nThe real value of top AI talent, Altman said, lies in their capacity for breakthroughs.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-08-08T15:36:33Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/news/753863/trump-truth-social-ai-search-perplexity-conservative-bias",
    "title": "Truth Social’s new AI search engine basically just pushes Fox News",
    "summary": "Donald Trump’s Truth Social has launched a new AI search feature that consistently pushes conservative media sources.\nThe feature, Truth Search AI, is powered by the AI startup Perlexity and is now available on the web version of Trump’s social media platform, with public testing coming to the iOS and Android apps “in the near future.”In our testing, all of the source links that Truth Search AI cited were for conservative publications, including Fox News, Fox Business, The Washington Times, and The Federalist.\nThe vast majority of these links directed users to articles published by Fox outlets, which suggests the Perplexity-powered search engine is limiting results to Trump-supporting media.\n“Current evidence indicates that Trump’s tariffs have not improved the overall U.S. economy and are associated with a net negative effect, though some specific sectors benefit,” Truth Search AI wrote in response.\nThe sourcing pool for Truth Social’s AI search tool seems, unsuprisingly, very narrow.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-07T14:04:06Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/report/756810/wikipedia-ai-slop-policies-community-speedy-deletion",
    "title": "How Wikipedia is fighting AI slop content",
    "summary": "With the rise of AI writing tools, Wikipedia editors have had to deal with an onslaught of AI-generated content filled with false information and phony citations.\nAlready, the community of Wikipedia volunteers has mobilized to fight back against AI slop, something Wikimedia Foundation product director Marshall Miller likens to a sort of “immune system” response.\nThat means looking for three main signs:Writing directed toward the user, such as “Here is your Wikipedia article on…,” or “I hope that helps!”“Nonsensical” citations, including those with incorrect references to authors or publications.\nAs part of the WikiProject AI Cleanup, which aims to tackle an “increasing problem of unsourced, poorly written AI-generated content,” editors put together a list of phrases and formatting characteristics that chatbot-written articles typically exhibit.\nDespite varying viewpoints about AI across the Wikipedia community, the Wikimedia Foundation isn’t against using it as long as it results in accurate, high-quality writing.",
    "category": "technology",
    "bias": "right",
    "publishedAt": "2025-08-08T18:30:47Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/news/754168/dji-romo-robot-vacuum",
    "title": "The Romo is DJI’s first robovac and features a transparent design",
    "summary": "And like DJI’s latest drone, which debuted last May, the DJI Romo lineup won’t be available in the US for a while.\nThe DJI Romo P (left) features a transparent robovac and dock while the Romo A (center) only has a transparent top for the vacuum.\nIt remains to be seen if the transparent design of the Romo P will look as good after months of use.\nOnce the Romo P reaches consumers, we’ll see how clean the interior of the bot and docking station look after a few months’ use.\nThe pricier Romo P also includes an additional compartment for an alternate mopping solution.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-07T14:33:01Z",
    "source": "The Verge"
  }
]