[
  {
    "url": "https://www.wired.com/story/inside-the-biden-administrations-unpublished-report-on-ai-safety/",
    "title": "Inside the US Government's Unpublished Report on AI Safety",
    "summary": "More importantly, they showed shortcomings in a new US government standard designed to help companies test AI systems.\nTrump’s administration has since steered experts away from studying issues such as algorithmic bias or fairness in AI systems.\nThe event took place at the Conference on Applied Machine Learning in Information Security (CAMLIS).\nParticipants were asked to use the NIST AI 600-1 framework to assess AI tools.\nThe framework covers risk categories including generating misinformation or cybersecurity attacks, leaking private user information or critical information about related AI systems, and the potential for users to become emotionally attached to AI tools.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-06T18:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://gizmodo.com/the-end-of-bullshit-ai-2000640302",
    "title": "The End of Bullshit AI",
    "summary": "In every conversation about AI, you hear the same refrains: “Yeah, but it’s amazing,” quickly followed by, “but it makes stuff up,” and “you can’t really trust it.” Even among the most dedicated AI enthusiasts, these complaints are legion.\n“I like it, but it never says ‘I don’t know.’ It just makes you think it knows,” she told me.\nThis makes it the first consumer AI explicitly designed to reject bullshit, especially its own.\nLess Flattery, More FrictionEarlier this year, many ChatGPT users noticed the AI had become strangely sycophantic.\nOthers, however, may find themselves frustrated by an AI that no longer just tells them what they want to hear.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-08-07T20:50:47Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://tech.yahoo.com/ai/articles/google-commits-1-billion-ai-160316025.html",
    "title": "Google commits $1 billion for AI training at US universities",
    "summary": "By Kenrick CaiSAN FRANCISCO (Reuters) -Alphabet's Google on Wednesday announced a three-year, $1 billion commitment to provide artificial intelligence training and tools to U.S. higher education institutions and nonprofits.\nAdvertisement AdvertisementAdvertisementParticipating schools may receive cash funding and resources, such as cloud computing credits towards AI training for students as well as research on AI-related topics.\nThe billion-dollar figure also includes the value of paid AI tools, such as an advanced version of the Gemini chatbot, which Google will give to college students for free.\nAdvertisement AdvertisementAdvertisementThe announcement comes as rivals like OpenAI, Anthropic and Amazon have made similar pushes around AI in education as the technology pervades society.\nMicrosoft in July pledged $4 billion to bolster AI in education globally.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-06T16:03:16Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/sam-altman-openai-gpt-5-agi-2025-8",
    "title": "Here's why Sam Altman says OpenAI's GPT-5 falls short of AGI",
    "summary": "Sam Altman says OpenAI has yet to crack AGI.\nDeveloping AGI that benefits all of humanity is OpenAI's core mission.\nAltman said that looking back at OpenAI's previous releases, GPT-5 is still a step in the right direction.\nWhile AGI remains the company's mission, Altman says OpenAI is already looking beyond it to superintelligence, a still theoretical advancement in which artificial intelligence can reason far beyond human capability.\n\"Superintelligent tools could massively accelerate scientific discovery and innovation well beyond what we are capable of doing on our own, and in turn massively increase abundance and prosperity,\" Altman wrote in January.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-07T18:01:39Z",
    "source": "Business Insider"
  },
  {
    "url": "https://gizmodo.com/get-ready-the-ai-hacks-are-coming-2000639625",
    "title": "Get Ready, the AI Hacks Are Coming",
    "summary": "Others have used prompt injection to hijack code assistants like Cursor.\nIt’s also becoming increasingly clear that AI models appear to engage with hidden commands.\nIn the case of these attacks, the researchers informed Google of the vulnerability, and the company addressed the issue, per Wired.\nBut as AI gets integrated into more platforms and more areas of the public’s lives, the more risk that such weaknesses present.\nIt’s particularly concerning as AI agents, which have the ability to interact with apps and websites to complete multi-step tasks, are starting to roll out.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-06T18:10:25Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.derekthompson.org/p/how-ai-conquered-the-us-economy-a",
    "title": "How AI Conquered the US Economy: A Visual FAQ",
    "summary": "Nobody can say for sure whether the AI boom is evidence of the next Industrial Revolution or the next big bubble.\nWe can all stop talking about “what will happen if AI dominates the economy at such-and-such future date?” No, the AI economy is here and now.\nToday, in a bit of a throwback to my early blogging years, I’m going to try to walk through an FAQ with graphs to create a visual guide to the question:How big is the AI boom?\n“AI companies are reaching revenue milestones faster than previous generations of startups,” the company announced in a recent report.\nBut independent evaluators in the study actually concluded that using AI did the opposite: it increased task completion time by about 20 percent.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-08-07T10:12:54Z",
    "source": "Derekthompson.org"
  },
  {
    "url": "https://www.cnet.com/tech/services-and-software/trump-media-is-testing-an-ai-search-engine-powered-by-perplexity/",
    "title": "Trump Media Is Testing an AI Search Engine Powered by Perplexity",
    "summary": "President Donald Trump's media company, Trump Media, is beta-testing an AI search feature on the Truth Social platform, drawing on Perplexity's AI technology.\nGenerative AI technology has been upending traditional internet search, which has been dominated by Google for decades.\nTrump Media and Technology Group is perhaps best known for its social media program, Truth Social.\nRepresentatives for Trump Media and Perplexity didn't immediately respond to a request for comment.\nIn today's divided political landscape, one immediate concern is that a search engine from a conservative president's media company will select only search results that favor conservative opinions.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-07T00:35:09Z",
    "source": "CNET"
  },
  {
    "url": "https://www.macrumors.com/2025/08/07/apples-ai-problem-not-just-siri-talent-leaving/",
    "title": "Apple's Real AI Crisis Isn't Siri, But the Talent It's Losing to Rivals",
    "summary": "The exodus of staff from Apple's AI team over the last seven months has seen senior researchers leave variously for Meta, OpenAI, xAI, Cohere, and others.\nThe most notable recent departure was that of Ruoming Pang, head of Apple's Foundational Models team, who joined Meta last month after being lured by CEO Mark Zuckerberg with a $200 million pay package.\nFT reports that industry recruiters see the departures as \"a crisis of confidence\" around Apple's AI future.\nAaron Sines from recruiting firm Razoroo said companies now view elite AI talent as \"strategic assets,\" on par with intellectual property or even entire business units.\nA chatbot-like version of the virtual assistant was one of the key Apple Intelligence features that Apple promoted at last year's WWWDC, but it has yet to arrive.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-08-07T12:22:34Z",
    "source": "MacRumors"
  },
  {
    "url": "https://www.businessinsider.com/openai-sam-altman-ai-talent-war-meta-labor-market-jobs-2025-8",
    "title": "Sam Altman says the talent pool for AI superstars is probably bigger than people think",
    "summary": "OpenAI CEO Sam Altman called it the \"most intense talent market I have seen in my career,\" on CNBC's Squawk Box on Friday, a day after OpenAI released GPT-5, the latest iteration of its flagship model.\n\"I bet it's much bigger than people think,\" he said, referring to the available talent pool.\nBusiness Insider earlier reported that researchers at many of the top AI startups are earning in the mid-six-figures for their skills.\nMore than any other field, AI bets on potential over proven track records, as companies race toward still-theoretical goals like artificial general intelligence and superintelligence.\nThe real value of top AI talent, Altman said, lies in their capacity for breakthroughs.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-08-08T15:36:33Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/vibe-coding-limits-use-cases-software-companies-airtable-redis-2025-7",
    "title": "Vibe coding is the future — just don't trust it (yet)",
    "summary": "Companies have found, however, that despite the excitement — and the millions in funding pouring into vibe coding companies — the technology is still limited.\nSo, many CEOs are developing new policies and tools to maximize the benefits of vibe coding while mitigating the pitfalls.\nCompanies from Visa to Reddit to DoorDash are posting jobs that require vibe coding experience or familiarity with AI coding tools.\nWhile still limited, this new, more freewheeling approach has gained momentum in part thanks to the money flowing into vibe coding platforms.\nWix, a web-development platform, announced that it had acquired the vibe coding platform Base44 for $80 million.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-06T19:44:04Z",
    "source": "Business Insider"
  }
]