[
  {
    "id": "MQ==",
    "url": "https://www.wired.com/story/wall-street-has-ai-psychosis/",
    "title": "Wall Street Has AI Psychosis",
    "summary": "Tech leaders like Anthropic CEO Dario Amodei have already estimated that half the entry level white collar jobs will soon be gone, and earlier this year, Anthropic’s release of new agentic tools spurred a Wall Street selloff.\nWall Street, like the rest of us, is in a persistent state of anxiety about AI, and it doesn’t take much to trigger a mini-panic.\nAfter it did its job on Wall Street, the Citrini report came under considerable fire.\nWhen everyone has a few dozen AI agents working on their behalf, writes Shah, consumers will be able to effortlessly find the best goods for the best prices.\nInstead of being limited to the restaurants on the app, consumers will send out AI agents to find their ideal meal options, contracting directly with restaurants and delivery people—no apps needed.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-27T16:00:00Z",
    "source": "Wired"
  },
  {
    "id": "NA==",
    "url": "https://www.theverge.com/tech/885270/google-eu-dma-search-results-changes",
    "title": "Google might reshuffle search results to try to dodge fines in the EU",
    "summary": "Google is planning to test changes to how it displays search results for certain topics, nearly a year after it was charged with violating antitrust rules in the European Union, Reuters reports.\nThe shift will show top-ranked rival services for hotels, flights, restaurants, and transportation higher up in results, rather than prioritizing Google’s own services like Google Flights.\nCompanies that fail to comply with DMA regulations can face fines of up to 10 percent of their annual revenue.\nGoogle initially pushed back against demands for it to rearrange search results, with Google’s head of competition, Oliver Bethell, claiming in a post on LinkedIn last year that early changes to search results forced European users to search longer and pay higher prices.\nHowever, Google could potentially face billions of dollars in fines if it doesn’t make adjustments to comply with the DMA.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-26T15:18:12Z",
    "source": "The Verge"
  },
  {
    "id": "Nw==",
    "url": "https://247wallst.com/investing/2026/02/28/grok-ai-40k-bitcoin-price-prediction-why-analysts-say-its-too-bearish/",
    "title": "Grok AI $40K Bitcoin Price Prediction: Why Analysts Say It’s Too Bearish",
    "summary": "Grok’s $40,000 Bitcoin forecast sits 33% to 45% below most analyst bottom estimates of $60,000 to $75,000.\nThe base case lands between $75,000 and $150,000, which would mean Bitcoin roughly doubles from current levels or recovers to its October 2025 highs.\nFor the $40,000 bear case, Grok draws on X sentiment data, where technical charts circulating on the platform project $40,000 as Bitcoin’s cycle bottom in 2026.\nChatGPT projects a $40,000 to $75,000 Bitcoin bottom range if a prolonged crypto winter persists, but weights its base case between $75,000 and $110,000.\nGrok’s $40,000 Bitcoin price prediction reads more like a stress test than a serious forecast.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-02-28T13:13:21Z",
    "source": "24/7 Wall St."
  },
  {
    "id": "OQ==",
    "url": "https://slashdot.org/story/26/02/27/185250/a-chinese-officials-use-of-chatgpt-accidentally-revealed-a-global-intimidation-operation",
    "title": "A Chinese Official's Use of ChatGPT Accidentally Revealed a Global Intimidation Operation",
    "summary": "Give a man a fish, and you feed him for a day.\nTeach a man to fish, and he'll invite himself over for dinner.\n- Calvin Keegan",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-27T18:03:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MTE=",
    "url": "https://www.wired.com/story/silicon-valley-agentic-individuals-future-of-work/",
    "title": "Are You ‘Agentic’ Enough for the AI Era?",
    "summary": "But as the performance of AI coding tools has surged, so has the industry’s emphasis on humans being \"agentic\" themselves.\nFor many, a massive piece of their value is now tied to deciding what AI coding agents should work on.\nSimon Last, another Notion cofounder, uses AI coding agents more than anyone I’ve ever met.\nNow, he’s using up to four AI coding agents at any given time (he prefers Codex to Claude Code).\nEven though the company is using AI agents to automate work, Notion is busier than ever.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-02-26T19:00:00Z",
    "source": "Wired"
  },
  {
    "id": "MTQ=",
    "url": "https://www.theverge.com/policy/886316/acting-cisa-director-replaced-madhu-gottumukkala",
    "title": "CISA is getting a new acting director after less than a year",
    "summary": "The US Cybersecurity and Infrastructure Security Agency (CISA), which is part of the Department of Homeland Security, is getting a new acting director, as reported by ABC, less than a year after Madhu Gottumukkala took charge of the agency as deputy director and acting director in May 2025.\nCISA’s executive assistant director for cybersecurity, Nick Andersen, will become the agency’s new acting director while Gottumkkala will now be serving as director of strategic implementation at DHS.\nGottumkkala had requested special permission to use ChatGPT, despite the AI being off-limits for other DHS employees.\nCISA is also still without a Senate-confirmed director.\nTrump nominated Sean Plankey for the role last year, then renominated him in January.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-27T19:06:25Z",
    "source": "The Verge"
  },
  {
    "id": "MTU=",
    "url": "https://www.theverge.com/policy/886489/pentagon-anthropic-trump-dod",
    "title": "Trump orders federal agencies to drop Anthropic’s AI",
    "summary": "THE UNITED STATES OF AMERICA WILL NEVER ALLOW A RADICAL LEFT, WOKE COMPANY TO DICTATE HOW OUR GREAT MILITARY FIGHTS AND WINS WARS!\nThat decision belongs to YOUR COMMANDER-IN-CHIEF, and the tremendous leaders I appoint to run our Military.\nTherefore, I am directing EVERY Federal Agency in the United States Government to IMMEDIATELY CEASE all use of Anthropic’s technology.\nThere will be a Six Month phase out period for Agencies like the Department of War who are using Anthropic’s products, at various levels.\nWE will decide the fate of our Country — NOT some out-of-control, Radical Left AI company run by people who have no idea what the real World is all about.",
    "category": "technology",
    "bias": "right",
    "publishedAt": "2026-02-27T21:33:59Z",
    "source": "The Verge"
  },
  {
    "id": "MTY=",
    "url": "https://www.theverge.com/column/885244/smart-tv-web-crawler-ai",
    "title": "Your smart TV may be crawling the web for AI",
    "summary": "With Bright’s SDK, a viewer’s smart TV becomes part of a massive global proxy network that crawls and scrapes the web.\nTogether, these devices gather petabytes of public web data from a wide range of different locations and IP addresses.\nIn some cases, your smart TV may even crawl the web for Bright as soon as you turn it on.\nNew restrictions against proxy SDKs have had a direct impact on Bright’s addressable market in the smart TV space.\nThe company used to pitch its solution to Roku, Android TV, and Fire TV app developers, but Burns tells me that it no longer supports these platforms.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-26T14:39:04Z",
    "source": "The Verge"
  },
  {
    "id": "MTc=",
    "url": "https://www.businessinsider.com/trump-federal-agencies-stop-using-anthropic-technology-department-defense-2026-2",
    "title": "Trump orders federal agencies to stop using Anthropic's technology. Anthropic says it will fight back.",
    "summary": "\"We don't need it, we don't want it, and will not do business with them again,\" Trump said of Anthropic.\n\"We don't need it, we don't want it, and will not do business with them again,\" Trump said of Anthropic.\n\"We don't need it, we don't want it, and will not do business with them again,\" Trump said of Anthropic.\nIt came shortly after President Donald Trump ordered federal agencies to stop using Anthropic's technology, amid a dispute between the AI giant and the Department of Defense.\nOn Thursday, Amodei published a blog post stating that the Defense Department had added language to its contract allowing for \"any lawful use\" of its model.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-27T21:17:11Z",
    "source": "Business Insider"
  },
  {
    "id": "MTg=",
    "url": "https://www.theverge.com/ai-artificial-intelligence/886082/ai-vs-the-pentagon-killer-robots-mass-surveillance-and-red-lines",
    "title": "AI vs. the Pentagon: killer robots, mass surveillance, and red lines",
    "summary": "Can AI firms set limits on how and where the military uses their models?\nAnthropic is in heated negotiations with the Pentagon after refusing to comply with new military contract terms that would require it to loosen the guardrails on its AI models, allowing for “any lawful use,” even mass surveillance of Americans and fully autonomous lethal weapons.\nPentagon CTO Emil Michael is pushing for Anthropic to be designated a “supply chain risk” if it doesn’t comply, a label usually only given to national security threats.\nAnthropic’s rivals OpenAI and xAI have reportedly agreed to the new terms, but even after a White House meeting with Defense Secretary Pete Hegseth, Anthropic CEO Dario Amodei is still refusing to cross his company’s red line, stating that “threats do not change our position: we cannot in good conscience accede to their request.”",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-02-27T17:16:53Z",
    "source": "The Verge"
  },
  {
    "id": "MTk=",
    "url": "https://www.businessinsider.com/anthropic-department-of-war-pete-hegseth-military-contract-2026-2",
    "title": "Anthropic Has Less Than 36 Hours to Settle Terms With US Military",
    "summary": "Anthropic's military contract has come under threat following a meeting between its CEO and Defense Secretary Pete Hegseth.\nAnthropic's military contract has come under threat following a meeting between its CEO and Defense Secretary Pete Hegseth.\nIn January, months after Anthropic received the contract, the defense secretary delivered a speech during his visit to Musk's SpaceX.\nThe senior Pentagon official told Business Insider that the standstill with Anthropic had nothing to do with the startup's redlines.\nI mean, Anthropic could be quasi-nationalized, or they could be driven out of business,\" Ball said.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-02-26T11:03:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjE=",
    "url": "https://www.theverge.com/tech/885727/samsung-execs-unpacked-ai-deepfake-photos-vs-reality-c2pa",
    "title": "AI deepfakes are a train wreck and Samsung’s selling tickets",
    "summary": "On Thursday morning, I attended a Q&A panel with four top Samsung smartphone executives.\nGiven an opening later, an exec suggested our feelings toward AI-generated content might become more favorable in the future.\nPerhaps responding to our Samsung AI slop watch reporting, Samsung America exec Dave Das also chimed in to say that the company’s still learning about how much AI is acceptable when creating its own ads.\nHe asked whether Samsung might want to make it easier for customers to remove its AI watermark from AI-generated photos.\nThree screenshots taken from AI-generated Samsung ads on YouTube.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-27T18:54:47Z",
    "source": "The Verge"
  },
  {
    "id": "MjI=",
    "url": "https://www.theverge.com/ai-artificial-intelligence/885200/anthropic-retired-claude-given-a-substack",
    "title": "Anthropic gives its retired Claude AI a Substack",
    "summary": "Is a London-based reporter at The Verge covering all things AI and Senior Tarbell Fellow.\nIn January, Anthropic “retired” Claude 3 Opus, which at one time was the company’s most powerful AI model.\nThe newsletter, called Claude’s Corner, will give Opus 3 space to publish its “musings, insights, or creative works,” Anthropic said in a blog post.\nAnthropic describes the revival as an experiment for how to deal with the AI models it no longer deploys.\nPart of that process involves a kind of exit interview asking the model what it wants next, Anthropic said.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-26T14:27:49Z",
    "source": "The Verge"
  },
  {
    "id": "MjM=",
    "url": "https://www.theverge.com/tech/885113/google-swallows-ai-robotics-moonshot-intrinsic",
    "title": "Google takes control of ‘Android of robotics’ project in quest for physical AI",
    "summary": "Is a London-based reporter at The Verge covering all things AI and Senior Tarbell Fellow.\nGoogle is folding Alphabet’s AI robotics “moonshot,” Intrinsic, into the company after five years as an independent unit.\nThe move marks a strategic shift as Google doubles down on physical AI and pulls experimental projects closer to its core business.\nDetails of the purchase are not clear but the companies said Intrinsic will remain a “distinct group within Google.” It will work closely with Google DeepMind and utilize Google’s Gemini AI models and cloud resources, they said.\nDeepMind absorbed Alphabet’s shuttered Everyday Robotics division in 2023 and last year launched two AI models to help robots perform physical tasks.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-26T11:06:33Z",
    "source": "The Verge"
  },
  {
    "id": "MjQ=",
    "url": "https://www.theverge.com/tech/885275/google-nano-banana-2-ai-image-model-gemini-launch",
    "title": "Google’s Nano Banana 2 brings advanced AI image tools to free users",
    "summary": "Google is bringing a more powerful version of its Nano Banana AI image model to free users.\nLike Nano Banana Pro, the Nano Banana 2 model utilizes real-time information, web search images, and Gemini’s real-world knowledge base.\nOther features inherited from Nano Banana Pro include the ability to generate images with accurate, legible text, and localized translation.\nImage: GoogleNano Banana 2 also provides more creative control over generated images compared to the original Nano Banana model.\nThe new Nano Banana 2 model will replace the option for Nano Banana Pro across the Gemini app’s Fast, Thinking, and Pro generation modes.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-26T16:10:39Z",
    "source": "The Verge"
  },
  {
    "id": "MjU=",
    "url": "https://www.theverge.com/tech/885228/lenovo-ai-workmate-companion-work-concept-robot-arm-desktop-clock-hub",
    "title": "A robot arm with puppy dog eyes is just one of Lenovo’s new desktop AI concepts",
    "summary": "Alongside a handful of new laptop concepts (and a range of real products too), Lenovo used MWC to announce a pair of AI-based productivity companion concepts.\nThe AI Workmate Concept’s arm can extend and hover over physical documents to scan them.\nIt looks like a bedside alarm clock, but the AI Work Companion Concept can help manage your work schedule and stay ahead of burnout.\nImage: LenovoLenovo’s AI Work Companion Concept takes a different approach to AI assistance.\nLenovo has a solid track record of turning concept devices into real products.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-28T17:34:28Z",
    "source": "The Verge"
  },
  {
    "id": "MjY=",
    "url": "https://www.businessinsider.com/anthropic-executive-childs-youtube-freaks-out-2026-2",
    "title": "Top Anthropic executive limits his child's YouTube algorithm access: 'It freaks me out'",
    "summary": "At home, Clark said his toddler can watch \"Bluey\" and a few other shows on their smart TV, but he hasn't allowed \"unfettered access to the YouTube algorithm.\"\nClark's approach echoes other tech leaders who limit their kids' screen time.\nAI systems will need stronger parental controls, Clark said.\n\"So we're going to need to build pretty heavy parental controls into this system,\" he said.\nWhen reached for comment, a YouTube spokesperson pointed Business Insider to a guide on the platform's website about age-appropriate experiences and parental controls.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-26T10:44:01Z",
    "source": "Business Insider"
  },
  {
    "id": "Mjc=",
    "url": "https://www.businessinsider.com/nvidia-annual-report-dei-climate-change-focuses-china-2026-2",
    "title": "Nvidia rolls back 2 hot-button topics in a slimmer — and more China-focused — annual report",
    "summary": "Nvidia's annual report was missing two sections that it had last year.\nNvidia's annual report was missing two sections that it had last year.\nFabrice COFFRINI / AFP via Getty ImagesNvidia's annual report was missing two sections that it had last year.\nImpact LinkNvidia's annual report, released Wednesday, came in leaner this year.\nThat report mentioned sustainability, but in the context of Nvidia's business sustainability or adherence to sustainability-related laws.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-02-26T06:50:19Z",
    "source": "Business Insider"
  },
  {
    "id": "MzA=",
    "url": "https://hackaday.com/2026/02/27/css-now-its-got-your-8086/",
    "title": "CSS, Now It’s Got Your 8086",
    "summary": "CSS is Turing complete now, right?\nWhy not, as [Lyra Rebane] has done, write an 8086 emulator in pure CSS?\nThe web page at the link above may contain an 8086, but missing MMU aside, don’t expect it to run Linux just yet.\nIt needs a Chrome-adjacent browser because it uses some CSS functions not available in for example Firefox, but we’ll forgive it that oddity.\nIts clock is provided by a small piece of JavaScript not because CSS can’t provide one, but because the JS version is more stable.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-27T09:00:32Z",
    "source": "Hackaday"
  },
  {
    "id": "NDk=",
    "url": "https://www.theatlantic.com/ideas/2026/02/hegseth-anthropic-dispute-ai/686150/",
    "title": "The High-Stakes Fight Between Hegseth and Anthropic",
    "summary": "Read: What Pete Hegseth doesn’t understand about soldiersRelative to its competitors, Anthropic espouses the most public concern with the safety risks of artificial intelligence.\nOn Tuesday, Hegseth summoned Dario Amodei, Anthropic’s CEO, for a high-stakes meeting in Washington.\nAs of today, neither Hegseth nor Anthropic appears to be backing down from the dispute, which could threaten the privately held company’s valuation, which a recent funding round estimated at $380 billion.\nHis threats to penalize or essentially nationalize Anthropic anyway might be a way of setting a precedent for its competitors.\nThat would be ironic because Anthropic is in many ways the most “America First” AI company of them all.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-26T18:18:52Z",
    "source": "The Atlantic"
  }
]