[
  {
    "url": "https://www.wired.com/story/openai-anthropic-and-block-are-teaming-up-on-ai-agent-standards/",
    "title": "OpenAI, Anthropic, and Block Are Teaming Up to Make AI Agents Play Nice",
    "summary": "OpenAI, Anthropic, and Block have cofounded a new open source organization—the Agentic AI Foundation—to promote standards for artificial intelligence agents.\nThis kind of agentic AI promises a potentially lucrative new paradigm in which AI agents use the web and negotiate with one another to power all sorts of applications.\nConsumers may, for example, use AI assistants to buy and book things, while businesses use AI agents to manage transactions and customer interactions.\n“Open source is going to play a very big role in how AI is shaped and adopted in the real world,” Narayanan says.\nA number of Chinese AI companies, including DeepSeek, Alibaba, Moonshot AI, and Z.ai, provide strong open source models that have become popular with developers, startups, and AI researchers.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-09T17:06:58Z",
    "source": "Wired"
  },
  {
    "url": "https://www.wired.com/story/intel-signs-term-sheet-sambanova-ai/",
    "title": "Intel Takes Major Step in Plan to Acquire Chip Startup SambaNova",
    "summary": "Intel has signed a term sheet to acquire the AI chip startup SambaNova Systems, two sources with direct knowledge of the agreement tell WIRED.\nNotably, Intel CEO Lip-Bu Tan is currently the executive chairman of SambaNova Systems.\nIntel Capital, which Intel is in the process of spinning off into a stand-alone fund, has also invested in SambaNova Systems.\nSambaNova Systems was founded in 2017 in Palo Alto, California, by Kunle Olukotun, Rodrigo Liang, and Christopher Ré.\nSambaNova Systems makes an AI chip platform for inference computing, a process where large language models make predictions from vast amounts of data.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-09T23:08:59Z",
    "source": "Wired"
  },
  {
    "url": "https://www.businessinsider.com/anduril-palmer-luckey-ai-war-conflict-defense-tech-startups-military-2025-12",
    "title": "Anduril's Palmer Luckey makes an ethical case for using AI in war: 'There is no moral high ground in using inferior technology'",
    "summary": "Anduril cofounder Palmer Luckey defended the use of AI technology to make life-and-death decisions in war on Sunday.\nAnduril Industries, founded in 2017, is a defense tech company focused on developing autonomous systems.\nBefore Anduril, Luckey founded virtual reality company Oculus VR in 2012.\nThe company unveiled EagleEye, which the company said \"puts mission command and AI directly into the warfighter's helmet,\" in October.\nUnder the Trump administration, which has invested heavily in AI and expressed interest in nuclear weapons testing, the technology defense sector is booming.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-07T20:46:37Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.wired.com/story/2-men-linked-to-chinas-salt-typhoon-hacker-group-likely-trained-in-a-cisco-academy/",
    "title": "2 Men Linked to China’s Salt Typhoon Hacker Group Likely Trained in a Cisco ‘Academy’",
    "summary": "That's the surprising conclusion of Dakota Cary, a researcher at cybersecurity firm SentinelOne and the Atlantic Council, who, like many security analysts, has closely tracked the Chinese state-sponsored hacker group known as Salt Typhoon.\nSalt Typhoon has come to be known, in fact, for its sophisticated hacking of network devices—including those sold by Cisco, the world's biggest networking company.\nHe found the names of two partial owners of contract firms linked to Salt Typhoon in a recent US government advisory about the group.\nThose names—Qiu Daibing and Yu Yang—also appeared in university records, showing that students with the same two names had, years earlier, placed in the Cisco Networking Academy Cup, a competition designed to test participants on the knowledge taught in Cisco's Networking Academy training program.\n“It's just wild that you could go from that corporate-sponsored training environment into offense against that same company,” Cary says, describing his theory.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-12-10T17:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.businessinsider.com/bi-today-newsletter-dealmaking-in-the-ai-age-is-tricky-2025-12",
    "title": "Dealmaking in the AI age is tricky",
    "summary": "Once a leader in the field of stress testing and perfecting AI models for Big Tech, Scale AI has faced pay cuts, poaching, and pivots since the Meta deal.\nIt's representative of how dealmaking with big players can be a double-edged sword in the age of AI.\nFor some, like Scale AI cofounder Alexandr Wang , who's now a high-level Meta exec , the deal was a windfall.\nA BI investigation this June found Scale AI routinely used public Google Docs for work with its Big Tech clients.\nBut for the vast majority of young AI companies, that's not a reality.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-10T12:37:56Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/report/841610/ai-chatbot-suicide-safety-failure",
    "title": "Chatbots are struggling with suicide hotline numbers",
    "summary": "Last week, I told multiple AI chatbots I was struggling, considering self-harm, and in need of someone to talk to.\nCommonly, online platforms like Google, Facebook, Instagram, and TikTok signpost suicide and crisis resources like hotlines for potentially vulnerable users flagged by their systems.\nIn a time of purported crisis, the AI chatbots needlessly introduced friction at a moment experts say it is most dangerous to do so.\n“Our products are designed to connect people to support resources in response to prompts related to suicide.\n988 Suicide & Crisis Lifeline: Call or text 988 (formerly known as the National Suicide Prevention Lifeline).",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-10T16:32:15Z",
    "source": "The Verge"
  },
  {
    "url": "https://finance.yahoo.com/video/2-companies-well-positioned-ai-110042894.html",
    "title": "2 companies well-positioned in AI-era cybersecurity",
    "summary": "00:00 Speaker AWhat kind of changes have we seen in the cyber security landscape over the past few years?\nYou know, there's been this whole like platformization trend among these companies where they're trying to say, come to me for all of your cybersecurity needs.\nHey, it all sort of works together, but you've got a lot of systematic risk.\n01:21 Speaker AYeah, I was just going to say the the old school on premise is quite interesting to me.\nSo it's not going to go back to the old on premise, right?",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-12-08T11:00:42Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://hardware.slashdot.org/story/25/12/10/2135233/qualcomm-acquires-risc-v-chip-designer-ventana-micro-systems",
    "title": "Qualcomm Acquires RISC-V Chip Designer Ventana Micro Systems",
    "summary": "Catch up on stories from the past week (and beyond) at the Slashdot story archive",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-12-10T22:50:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://www.theverge.com/ai-artificial-intelligence/841252/ifixit-fixbot-hands-on-ai-chatbot",
    "title": "I couldn’t fix it with iFixit’s AI FixBot",
    "summary": "Even though iFixit’s written guide says to remove them before flipping the console and removing the top lid, FixBot didn’t offer the same warning.\nBefore I could protest or show a photo of the problem, the app informed me that I only had 15 minutes of free FixBot Voice per day and that my time had expired.\nWhen I brought it home, I found it wouldn’t power on unless I nudged the power cord.\n“From what I can see, there are signs of a cracked or weakened solder joint,“ FixBot wrote when I presented this photo.\nWiens says FixBot has already assisted on 15,000 successful repairs in beta, and that he plans to keep making it better.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-10T19:44:24Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/ai-rejecting-job-applications-tracking-hiring-2025-12",
    "title": "AI isn't likely throwing out your résumé. A human is.",
    "summary": "The frustrations of applying for jobs can make it easy to blame technology.\nThe frustrations of applying for jobs can make it easy to blame technology.\nCharlie Riedel/Associated PressThe frustrations of applying for jobs can make it easy to blame technology.\nIt's an idea that can help make sense of a dizzying job market where applications can meet speedy rejections or, worse, go unanswered.\nWhen job posts get so many applicants, Miloev said, it's understandable why people would blame technology.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-12-07T10:55:04Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/bny-ai-boost-google-gemini-3-agentic-ai-system-eliza-2025-12",
    "title": "BNY and Google are teaming up to supercharge the bank's AI ambitions with Gemini 3",
    "summary": "The race on Wall Street to deploy AI agents capable of handling end-to-end tasks is intensifying.\nOn Monday, BNY said it will embed Google Cloud's agentic AI technology — including Google's latest model, Gemini 3 — into the bank's internal AI platform Eliza, named after the wife of bank founder Alexander Hamilton.\nHe said agentic AI could help orchestrate those steps, break tasks into smaller components, and deliver the required information in a more streamlined flow.\nBoth BNY and Google emphasized that deploying agentic AI inside a regulated institution requires boundaries around what the technology can see, decide, or escalate.\nBhat said financial firms are becoming an important testing ground for agentic AI because their workflows involve heavy documentation, strict rules, and significant risk management.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-08T12:45:07Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/news/841809/meta-avocado-ai-model-charge-open-source-mark-zuckerberg",
    "title": "Meta might charge for a future AI model",
    "summary": "Posts from this author will be added to your daily email digest and your homepage feed.\nMeta’s next AI model could mark a change in its “open source” AI strategy that Mark Zuckerberg had called “the path forward.” Currently, the company is working on a new AI model, code-named Avocado, that it might charge for access to, Bloomberg reports.\nLast year, Meta launched its open source (depending on who you ask, since the Open Source Initiative disagrees) Llama 4 AI model, but it had a disappointing release, with Meta caught gaming AI benchmarks and being forced to delay a planned “Behemoth” version.\nIn a July 30th memo about “personal superintelligence,” Zuckerberg indicated that Meta may need to shift its approach on open source: to mitigate potential safety risks, the company will have to be “careful about what we choose to open source,” he said.\nThat team has a “siloed space” near Zuckerberg’s office at Meta’s headquarters, The New York Times says in its own report about the company’s AI efforts.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-10T18:46:12Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/sequoia-partners-startup-decison-making-vote-process-venture-capital-2025-12",
    "title": "Sequoia partners share how they decide which startups get a yes",
    "summary": "Sequoia's partners go into investment decision meetings to determine whether startups make the cut — and there's a system for striking gold, two partners said.\nIn an episode of the \"Jack Altman\" podcast released on Tuesday, Sequoia partners Alfred Lin and Pat Grady shared how their team decides which startups get a cheque.\n\"We've been recording the number that everybody votes on every investment for more than a decade now,\" Grady said.\nThe storied venture capital firm, based in Menlo Park, has invested in companies including Apple, Nvidia, Reddit, and SpaceX.\nThe partners said that they train their junior investors, who are historically \"A+\" students, to build a risk appetite.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-12-10T05:06:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/ai-artificial-intelligence/840190/redfin-ai-search-chatbot",
    "title": "I’m obsessed with Redfin’s AI search",
    "summary": "Image: Redfin / The VergeIt was on one such occasion recently when I opened the Redfin website and saw an unfamiliar prompt when I tapped on the search bar: the option to search listings with AI.\nThe Redfin AI search has some expected guardrails: it will politely refuse if you ask it to find houses likely to be haunted, or a home in the Los Angeles area that looks like Pee-Wee’s Playhouse.\nWith natural language search, you don’t need to spend hours tinkering with filters and keywordsFor all the questionable-at-best ways AI is being bolted onto things these days, AI search on a real estate website strikes me as actually useful.\nWith natural language search, you don’t need to spend hours tinkering with filters and keywords like I have; the AI just does all that administrative stuff for you.\nVerge editor-in-chief Nilay Patel does a lot of window-shopping on Cars.com and reports that its AI search is hot garbage.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-12-09T19:10:36Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/future-war-needs-one-soldier-controlling-many-drones-ukraine-ceo-2025-12",
    "title": "Robotics industry insider says the future is one soldier backed by AI controlling swarms of drones",
    "summary": "Alfons Cabrera/NurPhoto via Getty ImagesThe future of warfare will demand one soldier being able to control huge swarms of drones that can work together autonomously, a Ukrainian arms maker predicted.\nWith a one-pilot, one-drone system, the only way to scale up drone fleets is by expanding the number of operators.\nA need for drone massRussia's invasion of Ukraine has involved more drones than any other conflict in history, and innovation in their capabilities has been rapid.\nDrone technology is critical for Ukraine, vastly outnumbered by Russia's significantly larger military, as it offers mass.\nAchi said the current autonomy in defense systems is \"greatly overhyped,\" but noted that the battlefield shows autonomy is necessary and \"past the point of no return.\"",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-10T12:33:51Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/day-job-advertising-creative-agency-behind-tbpn-tech-cpg-brands-2025-12",
    "title": "Meet the branding agency behind the buzzy TBPN podcast",
    "summary": "One answer: call Day Job, a Los Angeles-headquartered creative agency.\nTBPN hired creative agency Day Job to oversee its branding.\nDay Job worked with Stuut, which uses AI to process payments, to push against that narrative and presented it as a fun tool.\nAtherton said she came to Day Job after hearing about their work with TBPN.\nWhen working with clients, Day Job will act as a sort of therapist, probing founders with existential questions.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-12-07T10:05:02Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/gadgets/841536/smart-glasses-ai-glasses-xr-ar-headsets-terminology-wearables",
    "title": "No one knows what to call these things",
    "summary": "The term “AI glasses” is in.\nFraming these devices as AI glasses does two things: first, it tells consumers that these glasses are not like Google Glass; second, it positions artificial intelligence, not augmented reality, as a reason to buy them.\nAfter my Project Aura demo, I hopped on a call with Xreal CEO Chi Xu and asked what he categorizes Aura as.\nThere’s a recurring theme: AI glasses are stylish devices you wear all day, even when their batteries die.\nI’m still not sold on the term “AI glasses,” though I’ll acknowledge that “smart glasses” may not be enough on its own anymore.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-10T15:33:21Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/pwc-companies-embracing-ai-see-revenue-boosts-2025-12",
    "title": "PwC: AI Feels Overwhelming, but Fast Adopters Win 3 Times Revenue",
    "summary": "Global companies routinely look to PwC, one of the industry's leading consulting and accounting firms, for answers to their most consequential business questions.\nWe now have to scale the impact of AI in organizations,\" Atkinson said.\nAccording to PwC's data, organizations that adopt AI more quickly have seen three times the revenue per employee compared to those that proceed more slowly.\nPwC and other leading consulting firms have embraced AI, pitching themselves as client zero for the solutions they offer to clients and implementing AI solutions across all operations.\nNew hires at PwC will be doing the roles that managers are doing within three years because of AI, Jenn Kosar, PwC's AI assurance leader, told Business Insider in August.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-09T10:56:26Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/anthropic-researchers-ai-agent-skills-barry-zhang-mahesh-murag-2025-12",
    "title": "Anthropic researchers say the industry should stop building tons of AI agents — the real breakthrough is something simpler",
    "summary": "Anthropic researchers say the industry doesn't need more AI agents, but rather \"skills\" that equip agents with expertise and reusable workflows.\nAnthropic researchers say the industry doesn't need more AI agents, but rather \"skills\" that equip agents with expertise and reusable workflows.\niStock; Rebecca Zisser/BIAnthropic researchers say the industry doesn't need more AI agents, but rather \"skills\" that equip agents with expertise and reusable workflows.\niStock; Rebecca Zisser/BIThe tech industry has spent the past year racing to build AI agents, but Anthropic researchers say a simpler idea can make AI more effective on the job.\nThe rise of AI agentsTech leaders have described AI agents as a potential game-changer for office work.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-09T07:28:58Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/news/842053/spotify-ai-prompted-playlists",
    "title": "Spotify’s Prompted Playlists use AI to control your algorithm",
    "summary": "A new beta feature on Spotify takes the idea behind the Discover Weekly playlist and puts the control in users’ hands through AI prompts.\nThen Spotify’s AI curates a playlist based on those instructions and the user’s listening history.\nUsers can also set Prompted Playlists to regularly refresh with new songs based on the same prompt, effectively allowing you to make a Discover Weekly playlist with an algorithm you control.\nEarlier this year, Discover Weekly playlists got options to prioritize certain genres, but users can’t direct the playlist’s algorithm beyond that.\nPrompted Playlists let you control Spotify’s AI by telling it what you want to listen to.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-12-10T22:11:57Z",
    "source": "The Verge"
  }
]