[
  {
    "url": "https://gizmodo.com/welcome-to-the-jobless-growth-economy-2000673236",
    "title": "Welcome to the ‘Jobless Growth’ Economy",
    "summary": "America is entering an era of “jobless growth,” according to analysts at Goldman Sachs.\nThe memo, written by economists David Mericle and Pierfrancesco Mei and spotted by Fortune, warns that the current market of “modest job growth alongside robust GDP growth” is likely the new normal going forward.\nThe thing about senior roles is that you need people with experience to fill them.\nThat hasn’t materialized even a little thus far, but the idea that it will has severely messed up the job market.\nOne thing is for sure: AI is going to be transformative for the economy.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-10-17T12:30:59Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.theverge.com/news/801205/new-york-rent-price-fixing-ban-software",
    "title": "New York bans AI-enabled rent price fixing",
    "summary": "is a NYC-based AI reporter and is currently supported by the Tarbell Center for AI Journalism.\nShe covers AI companies, policies, and products.\nKathy Hochul signed into law legislation banning the use of price-fixing software by landlords to set rental rates.\nNew York is the first state to outlaw algorithmic pricing by landlords, following a number of city-wide bans in Jersey City, Philadelphia, San Francisco, and Seattle.\nSoftware companies such as RealPage offer landlords algorithms that can set rental prices.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-16T21:24:52Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.wired.com/story/gear-news-of-the-week-honor-teases-a-bizarre-robot-phone-and-kohler-debuts-a-toilet-sensor/",
    "title": "Gear News of the Week: Honor Teases a Bizarre Robot Phone, and Kohler Debuts a Toilet Sensor",
    "summary": "Prices start at $325 for the carry-on version, $375 for the checked size, $395 for a larger checked version, or $995 for the entire family set.\nI am planning on using the carry-on version this weekend, and it easily paired with my iPhone.\n—Adrienne SoFujifilm’s New Instax Has Two CamerasCourtesy of FujifilmFujifilm announced the Instax Mini LiPlay+ this week, an update to its 2019 Mini LiPlay camera.\nThe Fujifilm Instax Mini LiPlay+ will be available later this month for $235.\nThe GrapheneOS developers do say that whichever phone it turns out to be, it will be similarly priced.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-18T10:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.macrumors.com/2025/10/16/apple-ai-search-head-leaves-for-meta/",
    "title": "Head of Apple's AI Search Project Leaves to Join Meta",
    "summary": "Apple's artificial intelligence division has lost another senior executive, with Ke Yang, who was recently appointed to lead the company's AI-driven web search effort, departing for Meta, according to Bloomberg's Mark Gurman.\nYang had only recently taken over Apple's newly created Answers, Knowledge, and Information group, known internally as \"AKI.\"\nThe AKI project is said to be a central component of Apple's planned ‌Siri‌ overhaul, which is currently scheduled for release in March 2026.\nWith Yang's exit, the AKI team will now report to Benoit Dupin, one of Giannandrea's deputies responsible for Apple's machine learning infrastructure.\nMany of those departures were from the company's Foundation Models team, which is tasked with developing Apple's core generative AI models.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-16T10:24:34Z",
    "source": "MacRumors"
  },
  {
    "url": "https://www.wired.com/story/bytedance-doubao-chatbot-popularity/",
    "title": "How ByteDance Made China’s Most Popular AI Chatbot",
    "summary": "When Chinese AI startup DeepSeek became a global sensation in January, it not only shocked Silicon Valley but also startled ByteDance, TikTok’s parent company.\nThe Chinese tech giant had already launched Doubao, its own flagship AI assistant app with tens of millions of users.\nBut when DeepSeek became the best-known Chinese AI company overnight, no one was talking about Doubao anymore.\nA little over two years since its launch, Doubao has quietly become the AI app that Chinese people—particularly those who aren’t very AI savvy—are actually using.\n“Some of the earliest Doubao users I heard of were my friends’ grandmothers and aunties.”",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-16T16:07:50Z",
    "source": "Wired"
  },
  {
    "url": "https://gizmodo.com/ai-wont-replace-jobs-tech-bros-want-you-terrified-2000670808",
    "title": "AI Won’t Replace Jobs, but Tech Bros Want You to Be Afraid It Will",
    "summary": "During her tenure in the Biden administration, Khan was known for her firm regulatory stance against big tech monopolies.\n“The way that tech bosses motivated tech workers was appealing to their sense of mission,” Doctorow said.\nMeanwhile, big tech companies are spending big and making record profits.\nThe AI bubble is worse than 2008If Doctorow’s estimates are true, then AI won’t take over any jobs.\n“There have been increasing discussion about how we may actually be just seeing a big AI bubble,” the former FTC chair said.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-15T14:20:54Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.businessinsider.com/oxford-warns-ai-making-teens-faster-but-shallower-thinkers-2025-10",
    "title": "AI is reshaping the teenage brain — and an Oxford study says it is making students faster, but shallower thinkers",
    "summary": "Oxford researchers say teenagers are learning faster with AI — but losing the depth to think critically.\nOxford researchers say teenagers are learning faster with AI — but losing the depth to think critically.\nXinhua News Agency via Getty ImagesOxford researchers say teenagers are learning faster with AI — but losing the depth to think critically.\nXinhua News Agency via Getty ImagesArtificial intelligence is changing how a generation learns, and Oxford researchers say it could also be changing how they think.\nOxford researchers argued that education systems must evolve to teach with AI without letting students think like it.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-16T10:03:45Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/scale-ai-shutters-dallas-contractor-team-shift-to-expert-data-2025-10",
    "title": "Scale AI cuts more contractors as it shifts toward more specialized AI training",
    "summary": "Scale AI shuttered a team of contractors in its Dallas office on Monday, as it shifts towards more technical, expert-level training, the startup confirmed to Business Insider.\nThe cuts mark the latest shake-up since Meta took a stake in Scale AI in a $14.3 billion deal.\nBased in San Francisco, Scale AI helps tech companies improve their latest chatbots by doing things like rewriting their responses.\nScale AI offered the workers four weeks of severance pay and healthcare coverage through October, according to an email from HireArt, a staffing agency used extensively by Scale AI.\nxAI has also made similar moves to focus on specialized AI training, recently downsizing its team of generalist AI tutors in September.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-15T20:09:44Z",
    "source": "Business Insider"
  }
]