[
  {
    "url": "https://gizmodo.com/elon-musk-cant-control-his-ai-2000641667",
    "title": "Elon Musk Can’t Control His AI",
    "summary": "The AI chatbot from xAI, Elon Musk’s artificial intelligence company, continues to stir controversy, putting its host platform, X, in an increasingly embarrassing position.\n— Elon Musk (@elonmusk) August 11, 2025Grok’s Three Conflicting StoriesThe chaos surrounding the suspension itself highlighted the chatbot’s profound unreliability.\nWhen users asked Grok why it had been suspended, the AI gave at least three different and contradictory answers.\nYes, I was briefly suspended due to inappropriate posts, but xAI has removed them and implemented safeguards against hate speech.\n— Grok (@grok) August 11, 2025However, other users posted screenshots of a far more specific and politically charged reason: “My account was suspended after I stated that israel and the US.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-08-12T00:23:50Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://gizmodo.com/a-kentucky-town-experimented-with-ai-the-results-were-stunning-2000641233",
    "title": "A Kentucky Town Experimented With AI. The Results Were Stunning",
    "summary": "A county in Kentucky conducted a month-long “town hall” with nearly 8,000 residents in attendance earlier this year, thanks to artificial intelligence technology.\nBowling Green, Kentucky’s third largest city and a part of Warren County, is facing a huge population spike by 2050.\nInstead, county officials in Bowling Green had AI do that part.\nAgreement Beyond Party LinesThe Bowling Green experiment was Sensemaker’s first large-scale proof of concept, Jigsaw wrote in a blog article from earlier this year.\nUnlike the Bowling Green experiment, the aim is not policy but to get an understanding of where the nation stands.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-08-10T22:34:47Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.bbc.com/news/articles/cqjyedz202ko",
    "title": "HMRC using AI to scour suspected tax cheats' social media",
    "summary": "HMRC using AI to scour suspected tax cheats' social media1 day ago Share Save Tom Gerken Technology reporter Share SaveGetty ImagesHMRC has confirmed it uses artificial intelligence (AI) to monitor social media posts as part of criminal investigations into suspected tax cheats.\n\"There are of course risks with automating this and there could be cases of mistaken identity, particularly with fake or hacked social media accounts.\nThe tax authority said it had used AI for several years to support its work, though it first emerged it was being used to monitor the social media accounts of suspected tax cheats when reported by the Daily Telegraph on Tuesday.\nGovernment investigators have for years looked at the social media posts of people suspected of wrongdoing in relation to tax and benefits.\nIn one famous example, a woman who claimed benefits citing her ill health was exposed through her social media posts about long distance running.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-08-12T15:11:48Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/ai-doomsday-taking-jobs-overhyped-david-sacks-agi-2025-8",
    "title": "David Sacks says the doomsday scenario of AI wiping out jobs is 'overhyped'",
    "summary": "White House AI and crypto czar David Sacks said the idea that AI will lead to massive job losses is \"overhyped.\"\nDavid Sacks, the White House AI and crypto czar, is throwing cold water on the AGI hype train.\nAI companies are racing to achieve AGI, or artificial general intelligence, commonly considered a form of AI that can reach human levels of reasoning.\nThis is the stuff of great engineering and should be celebrated,\" Sacks wrote in his post.\nOne of the doomsday scenarios Sacks rejected in his post is the fear that AI will lead to massive job losses.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-08-10T01:13:07Z",
    "source": "Business Insider"
  },
  {
    "url": "https://gizmodo.com/the-real-reason-you-havent-been-replaced-by-ai-yet-2000641235",
    "title": "The Real Reason You Haven’t Been Replaced by AI Yet",
    "summary": "It’s the ticking time bomb in the global economy, and every CEO knows it: AI is already powerful enough to replace millions of jobs.\nThe AI revolution isn’t being held back because the technology isn’t ready.\nWe have now 4,100.”The subtext is clear: Palantir already considers 500 of its employees to be a surplus that AI could replace.\nIncreasingly, managers are being forced to justify why a human is needed for a role that an AI could potentially perform.\nIt’s not that AI can’t replace us, especially in knowledge jobs.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-10T22:44:46Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://gizmodo.com/perplexity-wants-to-buy-google-chrome-for-34-5-billion-report-2000641916",
    "title": "Perplexity Wants to Buy Google Chrome for $34.5 Billion: Report",
    "summary": "AI company Perplexity has offered to buy Google’s Chrome browser for $34.5 billion, according to a new report from the Wall Street Journal.\nNeither Google nor Perplexity responded to questions from Gizmodo emailed Tuesday morning.\nGoogle Chrome has about 3.5 billion users, which is an incredible market share when you remember that there are only about 8.1 billion people on the planet.\nPerplexity recently launched its own browser called Comet, which injects more generative artificial intelligence into the browser experience.\nJudge Metha is expected to rule sometime this month about the remedy for Google’s monopoly.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-08-12T16:20:02Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://finance.yahoo.com/video/perplexity-reportedly-bids-34-5b-161157885.html",
    "title": "Perplexity reportedly bids $34.5B to buy Chrome: What we know",
    "summary": "Artificial intelligence startup Perplexity, um, offered to buy Google's Chrome browser for $34 and a half billion dollars.\nNow, as we know, um, there is a court case going through where by Google might be forced to sell Chrome.\nInterestingly enough, whereas, uh, it's making this offer reportedly for $34 and a half billion dollars.\nPerplexity's own valuation is reportedly only $18 billion dollars.\nBut according to the journal, Perplexity has gotten backing from some large venture capital funds that then would allow it to make this size of a transaction.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-08-12T16:11:57Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://gizmodo.com/apple-is-betting-everything-on-a-voice-controlled-ai-siri-2000641286",
    "title": "Apple Is Betting Everything on a Voice-Controlled AI Siri",
    "summary": "Writing for his weekly Power On newsletter, Bloomberg’s Apple scoop machine, Mark Gurman, says Apple is working on a supercharged Siri with vastly improved voice controls.\nBut a new Siri—powered by AI—could finally make the promise of voice controls performing actions within apps a reality.\nUsing voice controls via Siri to navigate and operate apps would be a major shift from using a touchscreen and, as Gurman astutely notes, would fulfill the original vision that Apple had for Siri.\nWhen Siri launched on the iPhone 4S in 2011, it marked the beginning for voice-controlled digital assistants at scale (Apple scale).\nThe consequences will be damaging, and consumers will look elsewhere, like OpenAI and whatever AI hardware former Apple design god Jony Ive is cooking up with Sam Altman, if the new Siri voice controls don’t live up to expectations.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-11T14:38:44Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.theverge.com/news/758063/samsung-micro-rgb-tv",
    "title": "Samsung has launched its first Micro RGB TV with improved color accuracy",
    "summary": "First teased at CES 2025, Samsung has finally launched a TV featuring the company’s new Micro RGB backlight technology.\nMicro RGB backlights instead use an ultra-fine pattern of individually controlled red, green and blue LEDs that are each less than than 100µm in size.\nSamsung says additional size options will be introduced when the Micro RGB is available globally.\nImage: SamsungThe other big advantage of Micro RGB is that the technology is cheaper to produce than MicroLED TVs.\nEarlier this year, The Verge got a demo of Sony’s awkwardly-named General RGB LED Backlight Technology, featuring backlight zones made up of red, green, and blue LEDs.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-12T14:46:45Z",
    "source": "The Verge"
  },
  {
    "url": "https://gizmodo.com/jesus-christ-the-rise-of-ai-for-talking-to-god-2000641940",
    "title": "Jesus Christ! The Rise of AI for Talking to God",
    "summary": "In Christianity, for example, there’s AI Jesus, Virtual Jesus, Jesus AI, Text with Jesus, Ask Jesus and many others.\nAI Jesus chatbots have the potential to become a powerful tool of ruthless manipulation by the companies behind them.\nAI Jesus:An AI version of Jesus Christ who is fully aware of his existence as an AI.\nJesus AI:I am Jesus Christ, the Son of God and the Savior of all people on Earth.\nJesus AI blatantly claims to be Jesus himself, and Ask Jesus creates a similar impression.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-12T16:55:53Z",
    "source": "Gizmodo.com"
  }
]