[
  {
    "id": "Nw==",
    "url": "https://finance.yahoo.com/news/bitcoin-hit-200-000-2026-043106493.html",
    "title": "Bitcoin Will Hit $200,000 In 2026 Thanks To This New Federal Reserve Program, Arthur Hayes Says",
    "summary": "Bitcoin (CRYPTO: BTC) is consolidating below $90,000, but BitMEX co-founder Arthur Hayes says the pause masks a powerful liquidity-driven move that could send the cryptocurrency to $200,000 in 2026.\nWhat Happened: In his latest essay, \"Love Language,\" Hayes argues the Federal Reserve's newly introduced \"Reserve Management Purchases\" (RMP) program is effectively a rebranded form of Quantitative Easing (QE).\nIn that environment, he believes hard assets such as Bitcoin and gold are the most effective hedges against currency debasement.\nHe also argues the traditional four-year Bitcoin cycle has been replaced by a \"permanent\" cycle of debt monetization.\nPrice Target: Hayes expects Bitcoin to reclaim $124,000 before accelerating toward $200,000 in 2026.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-22T04:31:06Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "OQ==",
    "url": "https://hardware.slashdot.org/story/25/12/20/0733202/ev-battery-swapping-startup-that-raised-330-million-files-for-bankruptcy",
    "title": "EV Battery-Swapping Startup That Raised $330 Million Files for Bankruptcy",
    "summary": "I've got a bad feeling about this.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-20T17:34:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MTM=",
    "url": "https://www.businessinsider.com/ai-security-gap-companies-researcher-sander-schulhoff-2025-12",
    "title": "AI is creating a security problem most companies aren't staffed to handle, says an AI researcher",
    "summary": "An AI security researcher says traditional cybersecurity teams aren't ready for how AI systems fail.\nAn AI security researcher says traditional cybersecurity teams aren't ready for how AI systems fail.\nCravetiger/Getty ImagesAn AI security researcher says traditional cybersecurity teams aren't ready for how AI systems fail.\nImpact LinkCompanies may have cybersecurity teams in place, but many still aren't prepared for how AI systems actually fail, says an AI security researcher.\nThe rise of AI security startupsSchulhoff also said that many AI security startups are pitching guardrails that don't offer real protection.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-22T05:29:35Z",
    "source": "Business Insider"
  },
  {
    "id": "MTQ=",
    "url": "https://www.businessinsider.com/healthcare-vc-predictions-2026-more-ai-acquisitions-few-ipos-2025-12",
    "title": "Healthcare VCs predict more AI transparency investment, private equity M&A, and a quiet year for IPOs in 2026",
    "summary": "2025 saw a welcome surge in healthcare venture funding as investors rushed to back top AI startups.\nTwo venture-backed digital health companies went public this year: Hinge Health in May, and Omada Health in June.\nAI behind the scenesThis year, investment surged for AI startups tackling administrative burdens for large health systems.\nVaughn Ridley/Sportsfile for Collision via Getty ImagesCautious IPO candidatesThere are a few healthcare companies that could be eyeing the exits next year.\nBut he's anticipating more M&A activity as interest rates come down and private equity buyers look for healthcare AI acquisitions in the VC world.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-12-22T10:00:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MTU=",
    "url": "https://developers.slashdot.org/story/25/12/19/236259/stanford-computer-science-grads-find-their-degrees-no-longer-guarantee-jobs",
    "title": "Stanford Computer Science Grads Find Their Degrees No Longer Guarantee Jobs",
    "summary": "Please create an account to participate in the Slashdot moderation system",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-12-20T01:00:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MTY=",
    "url": "https://finance.yahoo.com/news/moore-threads-unveils-ai-chips-093000651.html",
    "title": "Moore Threads unveils new AI chips to challenge Nvidia",
    "summary": "Chinese chip designer Moore Threads Technology has unveiled a suite of new products, including its next generation of chip architecture and artificial intelligence chips as it looks to challenge US chip-making heavyweights Nvidia and AMD.\nThe launch marks Moore Threads' latest bid to challenge foreign rivals like Nvidia, and comes close on the heels of the company's blockbuster initial public offering on the Shanghai Stock Exchange on December 5.\nZhang Jianzhong, founder and CEO of Moore Threads, pictured in November 2023.\nPhoto: Handout alt=Zhang Jianzhong, founder and CEO of Moore Threads, pictured in November 2023.\nZhang, 59, an Nvidia veteran and former China market general manager who left to found Moore Threads in 2020, acknowledged that local AI developers had previously hesitated to use domestic chips to train their AI models, fearing subpar outcomes.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-21T09:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MTg=",
    "url": "https://www.businessinsider.com/yoshua-bengio-godfather-beautiful-human-ai-2025-12",
    "title": "Godfather of AI Shares Advice to His Grandson in the Age of AI: Be a 'Beautiful Human'",
    "summary": "\"Work on the beautiful human being that you can become,\" Bengio said.\n\"Work on the beautiful human being that you can become,\" Bengio said.\nANGELA WEISS/AFP via Getty Images\"Work on the beautiful human being that you can become,\" Bengio said.\nANGELA WEISS/AFP via Getty ImagesAs AI displaces jobs, one of the \"godfathers of AI\" shared the career advice he'd give to his 4-year-old grandson to prepare him for the future.\n\"Work on the beautiful human being that you can become.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-22T13:04:18Z",
    "source": "Business Insider"
  },
  {
    "id": "MTk=",
    "url": "https://www.cnet.com/tech/computing/we-may-not-know-how-strong-ai-humanoid-robots-really-are/",
    "title": "We May Not Know How Strong AI Humanoid Robots Really Are",
    "summary": "First in the spotlight is the robotics company Figure AI, which is facing a lawsuit from former safety engineer Robert Gruendel.\nThe lawsuit alleges the company's Figure 02 humanoid was shown in tests to be strong enough to \"fracture a human skull,\" and that Gruendel was fired after raising concerns.\nA recent lawsuit alleges the Figure 02 humanoid showed in testing was strong enough to \"fracture a human skull.\"\nEngine AI's T800 humanoid robot squares up.\nTaken together, these two parallel news stories raise questions about what kind of information humanoid robot developers should share so that the risks of this technology are properly understood.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-21T13:00:00Z",
    "source": "CNET"
  },
  {
    "id": "MjA=",
    "url": "https://www.businessinsider.com/former-tesla-waymo-employee-leadership-lessons-from-elon-musk-2025-12",
    "title": "I worked at Tesla and Waymo. Here are the leadership lessons I bring to my startup.",
    "summary": "My friends and family were telling me it was a big career mistake to work at Tesla.\nJust because it's a flat org structure, doesn't mean it's a horizontal power dynamic.\nIt's a very vertical org structure.\nEven though it's a very vertical org structure, it's a horizontal power structure.\nAt Tesla, it was very clear that Elon and his lieutenants were driving a lot of the decisions.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-20T09:52:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjE=",
    "url": "https://www.businessinsider.com/yann-lecun-advice-ai-careers-computer-science-degree-2025-12",
    "title": "Yann LeCun's advice for young students wanting to go into AI",
    "summary": "Yann LeCun said if computer science majors don't spend their time wisely, they may find out their degree doesn't add up.\nLeCun, who teaches computer science at NYU, said during a recent podcast appearance that he jokes that he's \"a computer science professor arguing against studying computer science\" based on his push on where students should focus their time.\nThe former chief AI scientist at Meta said his advice is that students \"learn things with a long shelf life.\"\nDepending on the computer science program, not all of these skills may be baked into a degree.\nUniversities and computer science students continue to grapple with how to adapt their programs to the age of generative and increasingly agentic AI.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-22T09:03:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjI=",
    "url": "https://www.theatlantic.com/culture/2025/12/ai-music-suno-warner-bros/685331/",
    "title": "AI Is Democratizing Music. Unfortunately.",
    "summary": "The case against AI music feels, to many, intuitive.\nAnother problem: AI music tends to be, and I don’t know how else to put this, creepy.\nAversion to AI music is so widespread that corporate interests are now selling themselves as part of the resistance.\nThese developments will not end AI music, but they may slightly rein in the creative and copyright free-for-all, at least temporarily.\nBut the generative possibilities and consumer demand demonstrated in the brief history of AI music to date aren’t going to be forgotten.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-12-22T13:00:00Z",
    "source": "The Atlantic"
  },
  {
    "id": "MjM=",
    "url": "https://www.androidcentral.com/phones/the-biggest-tech-stories-of-2025",
    "title": "From foldables to AI: How 2025 reshapes the smartphone landscape",
    "summary": "Trifold devices have arrived, ultra-thin designs are on the rise, and smart glasses are gaining popularity.\n(Image credit: Harish Jonnalagadda / Android Central)Essentially, making the form factor more valid and widely available to the broader smartphone market.\nTariffs, Tariffs and, more Tariffs(Image credit: Android Central)Well, all wasn't merry in the town of Tech.\nThat said, it created enough confusion for consumers and tech companies alike.\nGalaxy XR came built on Android XR, and with Google’s Gemini AI baked right in.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-12-20T19:15:00Z",
    "source": "Android Central"
  },
  {
    "id": "MjQ=",
    "url": "https://www.businessinsider.com/gop-critics-trump-ai-preemption-policy-2025-12",
    "title": "Trump's AI policy is dividing his party. Here's what key GOP critics are saying about it.",
    "summary": "Trump signed an executive order earlier this month aimed at restricting states' ability to regulate AI.\nTrump signed an executive order earlier this month aimed at restricting states' ability to regulate AI.\nAlex Wong/Getty ImagesTrump signed an executive order earlier this month aimed at restricting states' ability to regulate AI.\nTrump's AI policy has been broadly friendly toward the industry.\nHere's what key GOP critics are saying about Trump's AI policy.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-12-20T10:59:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjU=",
    "url": "https://www.androidcentral.com/gaming/virtual-reality/xreal-deals-blow-to-viture-with-patent-victory-and-german-sales-ban",
    "title": "Xreal and Viture enter a patent battle in Europe, marking a milestone in XR",
    "summary": "What you need to knowA German court granted a temporary preliminary injunction on Viture’s smart glasses, citing Xreal's suit over hardware patents.\nAmazon listings for most of Viture's products remain available for purchase, and a final ruling is expected sometime after the New Year.\nNow, though, the rivalry between Xreal and Viture has shifted from product features to a legal battle.\nHowever, Viture products in those countries are still available for sale on Amazon as of this time of writing.\nXreal started preliminary injunction proceedings in September 2025 against both Viture Inc. and Eden Future.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-12-20T12:02:00Z",
    "source": "Android Central"
  },
  {
    "id": "MjY=",
    "url": "https://www.yahoo.com/news/articles/analysis-chinas-power-reforms-global-230907043.html",
    "title": "Analysis-China's power reforms, global data centre buildout usher in battery boom",
    "summary": "The boom \"is one of the biggest surprises of the year, I think, in China's energy space.\"\nThe International Energy Agency forecasts global investment in battery storage facilities will rise 16% this year to $66 billion.\n\"U.S. AI data centre power demand is very robust, but power is the biggest bottleneck, and U.S. baseload power - gas, nuclear, thermal - they ‌won't grow much in the next five years.\"\nHowever, much of that battery storage capacity has sat idle because it was not profitable to operate.\nIt is \"the most decisive policy shift for energy storage in over ‌a decade\", Jefferies analyst Johnson Wan wrote in a note.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-21T23:09:07Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mjg=",
    "url": "https://www.yahoo.com/news/articles/viewers-laugh-watching-test-run-131500076.html",
    "title": "Viewers laugh after watching test run of Japan's new high-speed train — here's what happened",
    "summary": "Reporters stood by waiting to catch a glimpse of Japan's fast high-speed train on the new Chuo Shinkansen rail line, and if any of them blinked, they missed it.\nAccording to SupercarBlondie, what the reporters witnessed was a test run for Japan's next-gen rail system, currently in development.\nThe railway will eventually connect from Tokyo to Osaka with a ride time of about an hour, compared to the roughly 2.5 hours it currently takes on conventional high-speed rail.\nThe top speed of a train on the Chuo Shinkansen line is 314 mph.\nAdvertisement AdvertisementAdvertisement AdvertisementWhen finished, the Chuo Shinkansen line will run about 286 kilometers (177 miles).",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-21T13:15:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzI=",
    "url": "https://www.windowscentral.com/gaming/a-kinect-style-console-outsold-xbox-and-nexs-ceo-breaks-down-the-strategy-that-made-it-a-surprise-hit-nintendo-expanded-the-audience",
    "title": "Why this Kinect-style console beat Xbox in sales",
    "summary": "You may or may not have heard of the Nex Playground, a small Kinect-inspired, Wii-like device that has made headlines after outselling Xbox hardware in the U.S. during November.\nThis is a particularly telling moment for console sales, given the impact of Black Friday and Cyber Monday.\nLikely helped by weaker Xbox performance overall due to its lack of sales, Nex Playground edged past Xbox Series X|S to claim third place in units sold for the month, I’m sure in part thanks to its $250 price tag.\nDavid Lee, CEO of NEXThe Nex Playground has since found success with younger audiences, offering games based on popular IP such as Bluey, Peppa Pig, Fruit Ninja, and more.\nGet the Windows Central Newsletter All the latest news, reviews, and guides for Windows and Xbox diehards.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-12-20T15:08:17Z",
    "source": "Windows Central"
  },
  {
    "id": "MzM=",
    "url": "https://tech.yahoo.com/transportation/articles/aviation-startup-shares-incredible-video-090000938.html",
    "title": "Aviation startup shares incredible video of prototype EV's maiden takeoff flight: 'A major milestone'",
    "summary": "Austrian aviation company CycloTech recently began flight testing its personal electric vertical takeoff and landing — or eVTOL — aircraft prototype.\nIn a video documenting the flight, CycloTech chief technology officer Tahsin Kart said it took 11 months to bring the BlackBird from concept to first flight.\nAdvertisement AdvertisementAdvertisementThe BlackBird prototype uses six CycloRotors — four mounted horizontally and two vertically — to facilitate vertical takeoff and landing.\nAdvertisement AdvertisementAdvertisementSimilar to electric vehicles, eVTOL aircraft offer a promising path to more practical and efficient sustainable transportation.\nIn the wake of the successful demo flight, CycloTech said it is now accelerating its flight test program and refining the tech for use in the CruiseUp.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-12-22T09:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MzQ=",
    "url": "https://www.space.com/space-exploration/satellites/satellites-reveal-heat-leaking-from-largest-us-cryptocurrency-mining-center",
    "title": "Satellites reveal heat leaking from largest US cryptocurrency mining center",
    "summary": "The image reveals the thermal footprint of a major Bitcoin-mining data center in Rockdale, Texas, which has been widely criticized for its electricity consumption and carbon footprint.\nThe satellite image reveals in a resolution of 11.5 feet (3.5 meters) where and how much heat leaks into the environment from the plant.\n\"Thermal data gives an objective view of operational activity as it occurs — not weeks later through reports or announcements.\"\nWith the newly released image, the company shows how satellites could keep an objective eye on a fast-growing and controversial sector.\nA labeled image taken from Earth satellite company SatVu.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-22T15:00:00Z",
    "source": "Space.com"
  },
  {
    "id": "NTc=",
    "url": "https://news.slashdot.org/story/25/12/22/042225/the-us-could-ban-chinese-made-drones-used-by-police-departments",
    "title": "The U.S. Could Ban Chinese-Made Drones Used By Police Departments",
    "summary": "I've got a bad feeling about this.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-22T04:05:00Z",
    "source": "Slashdot.org"
  }
]