[
  {
    "url": "https://www.theverge.com/column/826172/ai-startup-arr-numbers-sierra-bret-taylor",
    "title": "AI startups are turning their revenue into recruiting bait",
    "summary": "A new trend has quickly emerged for AI startups that want to stand out from the rest: brag about revenue.\nUnlike many AI startups now flexing their ARR, Sierra books its revenue through upfront contracts.\nBy contrast, many AI startups, especially those with more consumer-ish products or usage-based pricing, reach a public ARR figure by multiplying a good month’s revenue by 12.\n“I think AI is a category where it’s relatively easy to make a demo and sort of win a popularity contest on social media,” he said.\nTaylor is also already thinking about what happens when today’s crop of AI startups matures.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-21T14:21:25Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/news/823136/senator-elizabeth-warren-openai-trump-bailout",
    "title": "Sen. Warren presses Trump admin on potential AI bailout plans",
    "summary": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more.\nPosts from this author will be added to your daily email digest and your homepage feed.\nSen. Elizabeth Warren (D-MA) is pressing the Trump administration for more information on potential plans to “prop up” major AI companies with money from taxpayers.\nShe’s also seeking information about what kind of government assistance the administration plans to give OpenAI and other companies, as well as whether they think AMIC should apply to AI buildout.\nSacks and Kratsios have until December 1st, 2025, to reply.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-18T18:01:46Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.wired.com/story/cisco-aging-technical-infrastructure/",
    "title": "With the Rise of AI, Cisco Sounds an Urgent Alarm About the Risks of Aging Tech",
    "summary": "Aging digital infrastructure equipment like routers, network switches, and network-attached storage—has long posed a silent risk to organizations.\nDubbed “Resilient Infrastructure,” the initiative includes research and industry outreach as well as technical shifts in how Cisco manages its own legacy products.\nEventually, Cisco will go a step further to completely remove historic settings and interoperability options that are no longer considered safe.\n“Infrastructure globally is aging, and that creates a ton of risk,” says Anthony Grieco, Cisco’s chief security and trust officer.\n“The thing we’ve got to get across is this aging infrastructure wasn’t designed for today’s threat environments.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-20T10:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.businessinsider.com/cybersecurity-startup-feroot-ai-agents-tiktok-series-a-pitch-deck-2025-11",
    "title": "This AI startup advised Congress on the security risks of TikTok and DeepSeek. Read the pitch deck it used to raise $14M.",
    "summary": "lighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nIn February 2024, Tsarynny testified on privacy risks before the US-China Economic and Security Review Commission.\nOther security startups include DataGrail and Reflectiz, another website security startup, which recently announced a $22 million Series B funding round.\nRead the pitch deck Feroot used to raise its $14 million Series A:Note: Feroot redacted several slides from the pitch deck, as well as some details, so that the document could be shared publicly.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-11-18T12:00:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/news/825221/perplexity-comet-ai-browser-launch-android",
    "title": "Perplexity brings its Comet browser to Android",
    "summary": "Perplexity is launching its AI-powered browser on Android.\nComet launched on desktop for Perplexity Max subscribers in July before rolling it out more widely last month.\nYou can use voice mode on Comet’s Android app as well.\nImage: PerplexityJust like Comet on desktop, you can use voice mode on the browser’s Android app to chat about the information in your tabs, as well as ask Perplexity to generate summaries of what you’re seeing.\nShah notes that you can still use Android’s password manager with the browser, though.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-20T17:41:36Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/ai-startups-transforming-future-of-work-2025-11",
    "title": "Know a startup using AI to change the future of work? We'd like to hear from you.",
    "summary": "lighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nImpact LinkAI has affected nearly every aspect of the workplace.\nBusiness Insider is looking for the most compelling startups transforming how work gets done.\nCriteria and methodology:Prospective companies must be startups that use AI to improve some aspect of the workplace — whether in finance, tech, professional services, retail, or transportation.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-11-19T10:54:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/news/822988/microsoft-anthropic-partnership-claude-models-azure-investment-nvidia",
    "title": "Microsoft’s new Anthropic partnership brings Claude AI models to Azure",
    "summary": "Microsoft is announcing a strategic partnership with Anthropic today that will bring the AI startup’s models to Microsoft Foundry for the first time.\nNvidia and Anthropic are also partnering today as part of this deal, to optimize Anthropic’s models for the best performance on future Nvidia architectures.\nThe new deal with OpenAI extends Microsoft’s IP rights to models from OpenAI through 2032 and also includes post-AGI (artificial general intelligence) models.\nIn fact, Microsoft has been favoring Anthropic’s Claude 4 over GPT-5 in its new auto AI model selector in Visual Studio Code.\nMicrosoft also brought Anthropic’s Claude Sonnet 4 and Claude Opus 4.1 to Microsoft 365 Copilot users recently.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-18T15:20:39Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/column/824994/ar-viture-ai-glasses",
    "title": "AR startup Viture is stealthily working on new AI glasses",
    "summary": "But Vonderful isn’t starting from scratch: Vonder appears to be a stealth project of Viture, an AR startup that has been building glasses since 2021.\nViture isn’t the only AR startup looking to expand from visor-style glasses with birdbath optics to more full-fledged all-in-one devices.\nViture competitor Rokid recently completed a Kickstarter campaign for its own smart glasses, which feature monochrome displays in both lenses.\nThe company also just unveiled a set of glasses without displays that more closely mimics Meta’s popular Ray-Ban smart glasses.\nAnd TCL offshoot RayNeo launched a first pair of standalone AR glasses in 2024.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-20T14:22:07Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/policy/824508/fcc-telecom-salt-typhoon-hack",
    "title": "The FCC is rolling back steps meant to stop a repeat of a massive telecom hack",
    "summary": "After one of the biggest telecom hacks in US history, the Federal Communications Commission (FCC) moved to enforce strict standards on carriers’ cybersecurity measures.\nThe China-linked Salt Typhoon hack revealed last year impacted telecom companies including AT&T, Verizon, T-Mobile, and Lumen Technologies, The Wall Street Journal reported.\nNow, the FCC under Republican Chair Brendan Carr is rolling back those actions amid a broader deregulation push.\n“When I received this draft order, it was very disappointing because we are going to reverse the only meaningful effort this agency has advanced in response to that hack,” Gomez said.\n“My fear is Americans will be less secure from the day this hack was discovered a little over a year ago,” she said.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-11-19T22:34:00Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/podcast/823909/the-doordash-problem-ai-agents-web-amazon-perplexity-lawsuit",
    "title": "The DoorDash problem arrives for Amazon",
    "summary": "So what, exactly, is the DoorDash problem?\nNow, it’s time for us to really dive deep into the DoorDash problem.\nThat’s the DoorDash problem.\nSo at this point, you might be wondering: what does DoorDash think about the DoorDash problem?\nI don’t know how the industry solves the DoorDash problem.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-20T15:32:31Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/ai-artificial-intelligence/824608/trump-executive-order-ai-state-laws",
    "title": "Here’s the Trump executive order that would ban state AI laws",
    "summary": "In recent days, Trump has repeatedly posted his desire to have a state AI law moratorium, and reiterated it on Wednesday during his appearance at the US-Saudi Investment Forum, couching it as a way to fight “woke” ideology.\nBecause you’ll have one woke state and you’ll have to do all woke.\nDuring an appearance at Politico’s AI & Tech Summit in September, FCC Chairman Brendan Carr floated one potential interpretation of the Communications Act that would allow them to override state law.\nHe cited the European Union’s Digital Services Act and raised his concern “their AI models are not going to be truth-seeking AI models, but they’re going to be woke AI models, going to be AI models that are promoting DEI.\nAnd so again, President Trump has, as part of his action plan, steps to make sure that we don’t have that type of woke DEI embedded AI models developing here.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-19T23:03:28Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/drone-war-moving-too-fast-old-school-weapons-development-ceo-2025-11",
    "title": "The drone war is moving too fast for old-school defense tech development, CEO warns",
    "summary": "Roman PILIPEY / AFPDrones — and ways to defeat them — are evolving far too quickly for traditional weapons development cycles, a company making counter-drone systems said.\nA rapidly changing drone warThat rapid pace means that it's no longer sufficient to offer solutions that only fix the current problem.\nUkraine and Russia have both been moving very quickly to develop and invest in counter-drone systems, including interceptor drones and AI-powered turrets designed to shoot down drones.\nThe race to field new drone tech and weapons to defeat them is relentless in this war.\nHe said drone tech \"iterates every two to three weeks on the front line\" with a \"fundamentally different\" model.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-11-18T10:51:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://yro.slashdot.org/story/25/11/19/153210/chinese-university-collected-more-ai-patents-than-mit-stanford-princeton-and-harvard-combined",
    "title": "Chinese University Collected More AI Patents Than MIT, Stanford, Princeton and Harvard Combined",
    "summary": "Catch up on stories from the past week (and beyond) at the Slashdot story archive",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-11-19T15:25:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://hbr.org/2025/11/how-generative-ai-is-reshaping-venture-capital",
    "title": "How Generative AI Is Reshaping Venture Capital",
    "summary": "The venture capital world has witnessed countless technological disruptions over the decades, but few have arrived with the speed and scope of generative artificial intelligence.\nIn the three years since ChatGPT’s launch, gen AI has fundamentally altered how startups are conceived, pitched, built, and funded.\nAccording to a report from Stanford, global private AI investment reached a record high of $252.3 billion in 2024, with generative AI funding soaring to $33.9 billion—more than eight times higher than 2022 levels.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-11-18T15:00:00Z",
    "source": "Harvard Business Review"
  },
  {
    "url": "https://finance.yahoo.com/video/africas-next-leap-global-innovation-165005678.html",
    "title": "Africa's Next Leap in Global Innovation",
    "summary": "Emmanuel Lubanzadio of OpenAI, Chris Maurice of Yellow Card and Lexi Novitske of Norrsken22 discuss how AI, blockchain and fintech innovation are positioning Africa at the forefront of global tech advancement with Bloomberg's Yinka Ibukun at Bloomberg Africa Business Summit 2025 in Johannesburg, South Africa.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-11-18T16:50:05Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.theverge.com/tech/825022/microsoft-windows-40-year-anniversary-agentic-os-future",
    "title": "As Windows turns 40, Microsoft faces an AI backlash",
    "summary": "Windows 8 was arguably the most divisive release of Windows in its 40-year history, as Microsoft attempted to overhaul the operating system for a touch-first future.\nFor some Windows users, it’s already all too much.\nIt’s this reliable tool that Microsoft seems to want to reshape into something autonomous, increasingly built for AI agents instead of humans.\n“We are making this accessible so every user can use [AI agents] when they’re ready.\nThat’s always been a challenge in Redmond, and often why every other release of the operating system is disliked by so many.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-11-20T14:49:54Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/news/824786/google-gemini-synthid-ai-image-detection",
    "title": "Google Gemini is getting better at identifying AI fakes",
    "summary": "Google is making it easier for Gemini users to detect at least some AI-generated content.\nThe more important expansion will come further down the line, when Google extends verification to support industry-wide C2PA content credentials.\nGoogle also announced that images generated by its Nano Banana Pro model, also revealed today, will have C2PA metadata embedded.\nIt’s the second bit of good news for C2PA this week, after TikTok confirmed it would use C2PA metadata as part of its own invisible watermarking for AI-generated content.\nManual content verification in Gemini is a useful step, but C2PA credentials, and other watermarks like SynthID, won’t be truly useful until social media platforms get better at flagging AI-generated content automatically, rather than putting the onus on users to confirm for themselves.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-20T13:01:05Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/news/823775/tiktok-ai-generated-content-controls-manage-topics",
    "title": "TikTok is letting users control how much AI content they see",
    "summary": "TikTok is testing a new control that will let users manage how much AI-generated content appears in their video feed on the app.\nTo help make the filter more effective, the app will also soon start adding invisible watermarks to AI content.\nJust like those sliders, the AI control will allow users to request to see more or less AI material, with two levels in either direction.\nAn AI slider will only work if TikTok itself knows which content is made with AI, so it’s working on improving detection too.\nTikTok says both changes are rolling out over “the coming weeks,” though the AI content control is only a test for now.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-19T13:06:49Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/podcast/825979/ai-agents-are-invading-your-pc",
    "title": "AI agents are invading your PC",
    "summary": "Posts from this author will be added to your daily email digest and your homepage feed.\nFor a long, long time, Windows looked like Windows.\nWith Windows 8, Microsoft tried to completely change things… and we know how that went over.\nTo hear Microsoft CEO Satya Nadella tell it, you may not even use your own computer for long!\nAnd so it is putting agents in every nook and cranny of Windows, starting with the taskbar.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-21T15:15:22Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/report/823725/vanlife-ai-travel-planner-google-zero",
    "title": "AI, my unexpected daily travel companion",
    "summary": "I was starting to doubt it would ever happen, but I finally found a regular, helpful use for AI: vanlife travel planner.\nSo far, the AI results we’ve gotten have been highly reliable.\nScreengrab: GeminiThis type of response goes far beyond anything Google search can produce — even its AI Overview summaries lack weather integration.\nThe best Google search could do was confirm that yes, people kitesurf in Noli.\nI had been dubious about AI’s ability to benefit my day-to-day life prior to using it as a travel companion.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-19T09:48:59Z",
    "source": "The Verge"
  }
]