[
  {
    "url": "https://www.theverge.com/ai-artificial-intelligence/785407/peter-thiel-antichrist-tech-regulation",
    "title": "Silicon Valley’s latest anti-regulation argument: AI laws will summon the Antichrist",
    "summary": "These are, incidentally, areas where the tech billionaire, venture capitalist, and cofounder of Palantir has a vested financial interest.\nThe Antichrist, Thiel argued, would take the form of a one-world government that promised to regulate these technologies.\n‘The slogan of the Antichrist is peace and safety,’ which is nothing wrong with peace and safety.\n“And so the US is ground zero of globalization and it’s ground zero of the resistance to bad globalization.\nAs humans race toward a last battle—the Armageddon—a one-world government will form, promising peace and safety.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-09-25T20:49:43Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.wired.com/story/openai-oracle-softbank-data-center-stargate-us/",
    "title": "OpenAI Teams Up With Oracle and SoftBank to Build 5 New Stargate Data Centers",
    "summary": "OpenAI is planning to build five new data centers in the United States as part of the Stargate initiative, the company announced on Tuesday.\nThe move follows an agreement Oracle and OpenAI announced in July to develop up to 4.5 gigawatts of US data center capacity on top of what the two companies are already building at the first Stargate facility in Abilene.\nThe two remaining sites are being helmed by OpenAI and SB Energy, a SoftBank subsidiary that develops solar and battery projects.\nThe flagship site in Abilene is primarily owned and operated by Oracle, with OpenAI acting as the primary tenant, according to executives close to the project.\nIt is already running on Oracle Cloud Infrastructure and supporting OpenAI training and inference workloads, those sources add.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-09-23T20:59:50Z",
    "source": "Wired"
  },
  {
    "url": "https://gizmodo.com/qualcomm-6g-estimated-2028-arrival-2000663048",
    "title": "Tired of 5G? Qualcomm Says 6G Will Be Here Before the End of the World",
    "summary": "Currently, 5G and 4G LTE are the standard the world over.\n6G could allow for faster internet speeds, and the first “pre-commercial devices” with the standard will be here in three years.\nQualcomm, of course, imagines 6G will have something—anything—to do with AI.\nAnd if all these devices are increasingly pushing AI for everything you do, then Qualcomm needs to facilitate that.\nAnd in any case, by 2028, 6G will be the least of our concerns.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-09-24T12:25:24Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://gizmodo.com/google-warns-that-china-linked-malware-will-haunt-networks-for-years-2000663320",
    "title": "Google Warns That China-Linked Malware Will Haunt Networks for Years",
    "summary": "Companies may uncover traces of a Chinese-linked hacking campaign lurking in their networks for at least the next two years, Google warns.\nEvidence from Google’s investigations suggests legal groups are targeted for information related to U.S. national security and international trade.\nThe activity is primarily attributed to a group identified by Google as UNC5221, along with other closely related China-linked clusters.\nTo help organizations detect the malware, Mandiant has released a free scanner that looks for BRICKSTORM activity.\nIt works “by searching for a combination of strings and hex patterns unique to the backdoor,” Google said.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-09-24T19:30:22Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.wired.com/story/this-ai-powered-robot-keeps-going-even-if-you-attack-it-with-a-chainsaw/",
    "title": "This AI-Powered Robot Keeps Going Even if You Attack It With a Chainsaw",
    "summary": "A four-legged robot that keeps crawling even after all four of its legs have been hacked off with a chainsaw is the stuff of nightmares for most people.\n“This is something we call an omni-bodied brain,” Pathak tells me.\nHis startup developed the generalist artificial intelligence algorithm to address a key challenge with advancing robotics: “Any robot, any task, one brain.\nThe AI-controlled robot is able to adapt to new, extreme circumstances, such as the loss of limbs.\nWhat do you think of Skild’s multitalented robot brain?",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-09-24T18:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.theverge.com/podcast/784865/ai-safety-military-defense-openai-anthropic-ethics",
    "title": "How AI safety took a backseat to military money",
    "summary": "is The Verge’s senior AI reporter.\nI’m Hayden Field, senior AI repoter at The Verge — and your Thursday episode guest host.\nToday, I’m talking with Heidy Khlaaf, who is chief AI scientist at the AI Now Institute and one of the industry’s leading experts in the safety of AI within autonomous weapons systems.\nI also wanted to know what this push to deploy military-grade AI means for bad actors who might want to use AI systems to develop chemical, biological, radiological, and nuclear weapons — a risk the AI companies themselves say they’re increasingly worried about.\nOkay, here’s Heidy Khlaaf on AI in the military.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-09-25T13:46:39Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/sam-altman-predicts-ai-agi-surpass-human-intelligence-2030-2025-9",
    "title": "Sam Altman predicts AI will surpass human intelligence by 2030",
    "summary": "In many ways, GPT5 is already smarter than me, at least, I think a lot of other people too.\nI don't think it'll treat humans like ants.\nDon't expect anything very soon.\nWhat do you think of the idea of simply letting AI govern instead of a US president in the future?\nI don't think people want that anytime soon.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-09-26T09:00:02Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/sam-altman-ai-infrastructure-1-gw-per-week-stargate-2025-9",
    "title": "Sam Altman wants to build 'the coolest and most important infrastructure project ever'",
    "summary": "Sam Altman wrote in a blog post that a lot of the AI infrastructure will be built in the US.\nSam Altman wrote in a blog post that a lot of the AI infrastructure will be built in the US.\nAndrew Harnik/Getty ImagesSam Altman wrote in a blog post that a lot of the AI infrastructure will be built in the US.\nImpact LinkSam Altman just shared an ambitious goal for rapidly scaling artificial intelligence: Build a factory capable of producing one gigawatt of new \"AI infrastructure every week.\"\nA gigawatt of AI infrastructure — enough to power 876,000 households for a year — per week could also support some of OpenAI's other recently announced ventures.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-09-23T22:40:08Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.wired.com/story/alexa-von-tobel-quantum-venture-capital/",
    "title": "Why One VC Thinks Quantum Is a Bigger Unlock Than AGI",
    "summary": "Alexa von Tobel is fully aware that her big bet on quantum computing may never pay off.\nInspired Capital recently invested in a quantum startup called Logiqal, which is seeking to build the world’s first scaled quantum computer.\nI suspect you knew about quantum computing for years before you decided to invest.\nIf you talk to some of the best experts in the field, they would tell you there's only hundreds of quantum experts in the world.\nAnd I say quantum computers with an asterisk, because a quantum computer, even a quantum computer with 10,000 qubits, 50,000 qubits, 100,000 qubits, would begin to create a significant amount of value for society, but it wouldn't hit the bar of a perfect quantum computer, which is ideally hundreds of thousands of qubits.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-09-23T16:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://blog.google/technology/developers/ai-agents-intensive/",
    "title": "Google and Kaggle launch AI Agents Intensive course",
    "summary": "Earlier this year, we launched the second iteration of our GenAI Intensive course, which attracted over 280,000 learners.\nNow, we're taking things to the next level with the 5-Day AI Agents Intensive, designed to help you master AI agents: the next frontier of artificial intelligence.\nCrafted by Google’s own AI researchers and engineers, you’ll learn to build everything from simple AI agents to sophisticated multi-agent systems.\nApply your new skills in a capstone project for a chance to win prizes and be featured on Google’s and Kaggle’s social channels.\nWhether you're just starting out or advancing your expertise, this is your chance to build the future of intelligent, autonomous systems.",
    "category": "technology",
    "bias": "right",
    "publishedAt": "2025-09-23T16:00:00Z",
    "source": "Blog.google"
  }
]