[
  {
    "url": "https://gizmodo.com/a-kentucky-town-experimented-with-ai-the-results-were-stunning-2000641233",
    "title": "A Kentucky Town Experimented With AI. The Results Were Stunning",
    "summary": "A county in Kentucky conducted a month-long “town hall” with nearly 8,000 residents in attendance earlier this year, thanks to artificial intelligence technology.\nBowling Green, Kentucky’s third largest city and a part of Warren County, is facing a huge population spike by 2050.\nInstead, county officials in Bowling Green had AI do that part.\nAgreement Beyond Party LinesThe Bowling Green experiment was Sensemaker’s first large-scale proof of concept, Jigsaw wrote in a blog article from earlier this year.\nUnlike the Bowling Green experiment, the aim is not policy but to get an understanding of where the nation stands.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-08-10T22:34:47Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.businessinsider.com/ai-doomsday-taking-jobs-overhyped-david-sacks-agi-2025-8",
    "title": "David Sacks says the doomsday scenario of AI wiping out jobs is 'overhyped'",
    "summary": "White House AI and crypto czar David Sacks said the idea that AI will lead to massive job losses is \"overhyped.\"\nDavid Sacks, the White House AI and crypto czar, is throwing cold water on the AGI hype train.\nAI companies are racing to achieve AGI, or artificial general intelligence, commonly considered a form of AI that can reach human levels of reasoning.\nThis is the stuff of great engineering and should be celebrated,\" Sacks wrote in his post.\nOne of the doomsday scenarios Sacks rejected in his post is the fear that AI will lead to massive job losses.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-08-10T01:13:07Z",
    "source": "Business Insider"
  },
  {
    "url": "https://gizmodo.com/the-real-reason-you-havent-been-replaced-by-ai-yet-2000641235",
    "title": "The Real Reason You Haven’t Been Replaced by AI Yet",
    "summary": "It’s the ticking time bomb in the global economy, and every CEO knows it: AI is already powerful enough to replace millions of jobs.\nThe AI revolution isn’t being held back because the technology isn’t ready.\nWe have now 4,100.”The subtext is clear: Palantir already considers 500 of its employees to be a surplus that AI could replace.\nIncreasingly, managers are being forced to justify why a human is needed for a role that an AI could potentially perform.\nIt’s not that AI can’t replace us, especially in knowledge jobs.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-10T22:44:46Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://gizmodo.com/apple-is-betting-everything-on-a-voice-controlled-ai-siri-2000641286",
    "title": "Apple Is Betting Everything on a Voice-Controlled AI Siri",
    "summary": "Writing for his weekly Power On newsletter, Bloomberg’s Apple scoop machine, Mark Gurman, says Apple is working on a supercharged Siri with vastly improved voice controls.\nBut a new Siri—powered by AI—could finally make the promise of voice controls performing actions within apps a reality.\nUsing voice controls via Siri to navigate and operate apps would be a major shift from using a touchscreen and, as Gurman astutely notes, would fulfill the original vision that Apple had for Siri.\nWhen Siri launched on the iPhone 4S in 2011, it marked the beginning for voice-controlled digital assistants at scale (Apple scale).\nThe consequences will be damaging, and consumers will look elsewhere, like OpenAI and whatever AI hardware former Apple design god Jony Ive is cooking up with Sam Altman, if the new Siri voice controls don’t live up to expectations.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-11T14:38:44Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://gizmodo.com/nvidia-just-dodged-an-8-billion-bullet-thanks-to-donald-trump-2000641188",
    "title": "Nvidia Just Dodged an $8 Billion Bullet, Thanks to Donald Trump",
    "summary": "According to the Financial Times, the breakthrough came after Huang’s visit to the White House on August 6 to meet with President Donald Trump.\nTo prevent this, the U.S. has imposed strict export controls, blocking the sale of top-tier AI chips to China.\nThe Power of Personal DiplomacyReversing this policy took months of intense diplomacy and lobbying, culminating in Huang’s personal visits to the White House.\nDuring a White House AI summit last month, Trump admitted he had initially considered taking antitrust action against the chip giant before he got to know its CEO.\nWith the $8 billion revenue threat now averted and the $50 billion China market reopened, investors will be watching closely when Nvidia reports its quarterly earnings later this month.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-08-10T13:18:16Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://news.slashdot.org/story/25/08/09/0624254/students-have-been-called-to-the-office---or-arrested---for-false-alarms-from-ai-powered-surveillance-systems",
    "title": "for False Alarms from AI-Powered Surveillance Systems",
    "summary": "",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-08-09T16:34:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://gizmodo.com/nvidias-six-word-response-to-china-2000641571",
    "title": "Nvidia’s Six-Word Response to China",
    "summary": "“Embedding backdoors and kill switches into chips would be a gift to hackers and hostile actors,” the company wrote.\nThe Deal That Sparked the FireThis new firestorm in Beijing was ignited by the unconventional deal Nvidia just struck with Washington.\nTo return to China after months of a federal ban, the company agreed to pay the Trump administration 15% of the revenue generated by its H2O chip sales there.\nTrump then dismissed the H2O chips as “obsolete” and “an old chip that China already has.”The president’s comments perfectly capture the absurd tightrope Nvidia is now forced to walk.\nThe U.S. President is calling it old news, while Chinese state media is calling it a security risk.",
    "category": "technology",
    "bias": "right",
    "publishedAt": "2025-08-11T20:16:50Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://developers.slashdot.org/story/25/08/10/0110212/hour-of-code-announces-its-now-evolving-into-hour-of-ai",
    "title": "'Hour of Code' Announces It's Now Evolving Into 'Hour of AI'",
    "summary": "Become a fan of Slashdot on Facebook",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-08-10T03:34:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://news.slashdot.org/story/25/08/11/1650253/ex-nsa-chief-paul-nakasone-has-a-warning-for-the-tech-world",
    "title": "Ex-NSA Chief Paul Nakasone Has a Warning for the Tech World",
    "summary": "",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-08-11T16:50:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://jskfellows.stanford.edu/theft-is-not-fair-use-474e11f0d063",
    "title": "Theft is not fair use",
    "summary": "In another lawsuit, Getty Images accuses Stability AI of using millions of Getty’s copyrighted images in its training data.\nAs proof, Getty submitted multiple images where a distorted version of the Getty watermark is included in the output from Stability AI.\nPress enter or click to view image in full size A screenshot from Getty’s lawsuit against Stability AI.\nContent Credentials also features a box that can be checked that asks AI companies not to train on images.\nNews organizations, photographers, writers and all copyright holders should be fairly compensated for the billions in valuation AI companies have achieved by stealing the content.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-08-11T06:55:37Z",
    "source": "Stanford.edu"
  }
]