[
  {
    "url": "https://www.wired.com/story/happy-gilmore-producer-buys-spyware-maker-nso-group/",
    "title": "'Happy Gilmore' Producer Buys Spyware Maker NSO Group",
    "summary": "Under pressure from the Department of Justice, Apple removed a series of apps from its iOS App Store this month related to monitoring US Immigration and Customs Enforcement activity and archiving content related to ICE's actions.\nEach week, we round up the security and privacy news we didn’t report in depth ourselves.\nUse of mercenary spyware has increased within some US federal government agencies since the beginning of the Trump administration.\nWorkers have been moved to agencies including Immigration and Customs Enforcement, Customs and Border Protection, and the Federal Protective Service.\nUS Immigration and Customs Enforcement inked a $825,000 contract in May with TechOps Specialty Vehicles (TOSV), a Maryland-based company that manufactures equipment and vehicles for law enforcement.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-10-11T10:30:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.theverge.com/news/798875/california-just-passed-a-new-law-requiring-ai-to-tell-you-its-ai",
    "title": "New California law requires AI to tell you it’s AI",
    "summary": "A bill attempting to regulate the ever-growing industry of companion AI chatbots is now law in California, as of October 13th.\nGavin Newsom signed into law Senate Bill 243, billed as “first-in-the-nation AI chatbot safeguards” by state senator Steve Padilla.\n“We can continue to lead in AI and technology, but we must do it responsibly — protecting our children every step of the way.\nOur children’s safety is not for sale.”The news comes after Governor Newsom officially signed Senate Bill 53, the landmark AI transparency bill that divided AI companies and made headlines for months, into law in California.\nIt’s Steve Padilla, not Anthony Padilla.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-13T17:13:58Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.yahoo.com/news/articles/nobel-economist-warns-ai-dangers-194529501.html",
    "title": "Nobel economist warns of AI dangers",
    "summary": "A winner of this year’s Nobel prize in economics warned Monday that artificial intelligence offers \"amazing possibilities\" but should be regulated because of its job-destroying potential.\nCalifornia Governor Gavin Newsom on Monday signed a first-of-its-kind law regulating interactions with AI chatbots, defying a push from the White House to leave the technology unchecked.\nThe third economist to honored Monday, American-Israeli Joel Mokyr, was more sanguine about the impact of AI on the labor market.\nMokyr won his Nobel for his work on identifying the \"prerequisites for sustained growth through technological progress.\"\nI said, 'Sure, sure, sure,'\" Howitt recalled.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-10-13T19:45:29Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.theverge.com/news/798827/openai-broadcom-custom-ai-chips",
    "title": "OpenAI partners with Broadcom to produce its own AI chips",
    "summary": "is a London-based reporter at The Verge covering all things AI and Senior Tarbell Fellow.\nOpenAI is teaming up with Broadcom to produce its own computer chips to power its AI data centers.\nThe infrastructure partnerships have only recently become possible after OpenAI altered its exclusive arrangement with Microsoft for AI compute.\nCreating custom chips is part of a growing movement within the tech industry as major players like Meta, Google, and Microsoft work to bolster vital supply lines amid soaring demand and reduce their reliance on Nvidia’s AI chips.\nTo date, custom chip projects have not posed a plausible threat to the chipmaking behemoth, though they have handsomely benefited other chipmakers like Broadcom.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-10-13T14:59:44Z",
    "source": "The Verge"
  },
  {
    "url": "https://gizmodo.com/trumprx-is-a-narcissistic-ai-generated-nightmare-2000671309",
    "title": "TrumpRx Is a Narcissistic, AI-Generated Nightmare",
    "summary": "The TrumpRx website was first launched on Friday and initially contained text that read: “Tune in to the Oval Office @5PM EST,” according to the Internet Archive’s Wayback Machine.\nThe president insisted during his press conference, which was livestreamed on YouTube, that it wasn’t his idea to call the website TrumpRX.\nAnd the text on the one-page site includes snarky claims about him saving the day by supposedly lowering drug prices.\nPresident Trump is changing that with TrumpRx.\nAnd only time will tell whether TrumpRx actually does some good in the world.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-10-11T00:04:56Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://slashdot.org/story/25/10/13/1334226/openai-broadcom-forge-multibillion-dollar-chip-development-deal",
    "title": "OpenAI, Broadcom Forge Multibillion-Dollar Chip-Development Deal",
    "summary": "Catch up on stories from the past week (and beyond) at the Slashdot story archive",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-10-13T14:00:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://www.cnet.com/tech/services-and-software/new-california-law-wants-companion-chatbots-to-tell-kids-to-take-breaks/",
    "title": "New California Law Wants Companion Chatbots to Tell Kids to Take Breaks",
    "summary": "AI companion chatbots will have to remind users in California that they're not human under a new law signed Monday by Gov.\nThe law, SB 243, also requires companion chatbot companies to maintain protocols for identifying and addressing cases in which users express suicidal ideation or self-harm.\nLast week, Newsom signed measures requiring internet browsers to make it easy for people to tell websites they don't want them to sell their data and banning loud advertisements on streaming platforms.\nAI companion chatbots have drawn particular scrutiny from lawmakers and regulators in recent months.\nOpenAI spokesperson Jamie Radice called the bill a \"meaningful move forward\" for AI safety.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-10-13T20:54:27Z",
    "source": "CNET"
  },
  {
    "url": "https://gizmodo.com/is-the-ai-conveyor-belt-of-capital-about-to-stop-2000671017",
    "title": "Is the AI Conveyor Belt of Capital About to Stop?",
    "summary": "Morgan Stanley investor Ruchir Sharma recently noted that money poured into AI investments now accounts for about 40% of the United States’ GDP growth in 2025, and AI companies are responsible for 80% of growth in American stocks.\n“If that doesn’t happen, if there is no real enterprise AI adoption, then it’s all round-tripping,” Jaluria said.\nWhere these investments are generating a return is in the stock market.\n“In many ways, we’re seeing the same developing web of capital flows across the AI space.”This creates some obvious problems.\nTo talk about AI today, it means we have to talk about the credit market, we have to talk about the credit market.",
    "category": "technology",
    "bias": "right",
    "publishedAt": "2025-10-13T19:40:03Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.yankodesign.com/2025/10/12/designer-reimagines-ai-through-victorian-craft-philosophy/",
    "title": "Designer Reimagines AI Through Victorian Craft Philosophy",
    "summary": "This AI machine is unique not just because of its form but also because of its unconventional power source.\nUnlike mainstream language models, Park’s system has been specifically trained on data relating to William Morris and his philosophies.\nThe designer has also created a portable version of his concept in the form of a hand-cranked box, which he brought to discussions at the William Morris Gallery.\nThrough this ingenious marriage of Victorian craftsmanship and cutting-edge AI, Park demonstrates that the future of artificial intelligence doesn’t have to follow predetermined paths.\nPark’s project offers a compelling perspective on alternative approaches to AI development .",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-12T13:20:05Z",
    "source": "Yanko Design"
  }
]