[
  {
    "url": "https://www.wired.com/story/inside-the-biden-administrations-unpublished-report-on-ai-safety/",
    "title": "Inside the US Government's Unpublished Report on AI Safety",
    "summary": "More importantly, they showed shortcomings in a new US government standard designed to help companies test AI systems.\nTrump’s administration has since steered experts away from studying issues such as algorithmic bias or fairness in AI systems.\nThe event took place at the Conference on Applied Machine Learning in Information Security (CAMLIS).\nParticipants were asked to use the NIST AI 600-1 framework to assess AI tools.\nThe framework covers risk categories including generating misinformation or cybersecurity attacks, leaking private user information or critical information about related AI systems, and the potential for users to become emotionally attached to AI tools.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-06T18:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://tech.yahoo.com/ai/articles/google-commits-1-billion-ai-160316025.html",
    "title": "Google commits $1 billion for AI training at US universities",
    "summary": "By Kenrick CaiSAN FRANCISCO (Reuters) -Alphabet's Google on Wednesday announced a three-year, $1 billion commitment to provide artificial intelligence training and tools to U.S. higher education institutions and nonprofits.\nAdvertisement AdvertisementAdvertisementParticipating schools may receive cash funding and resources, such as cloud computing credits towards AI training for students as well as research on AI-related topics.\nThe billion-dollar figure also includes the value of paid AI tools, such as an advanced version of the Gemini chatbot, which Google will give to college students for free.\nAdvertisement AdvertisementAdvertisementThe announcement comes as rivals like OpenAI, Anthropic and Amazon have made similar pushes around AI in education as the technology pervades society.\nMicrosoft in July pledged $4 billion to bolster AI in education globally.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-06T16:03:16Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://gizmodo.com/the-mysterious-ai-easter-egg-at-the-heart-of-ari-asters-eddington-2000633209",
    "title": "The Mysterious AI Easter Egg at the Heart of Ari Aster’s ‘Eddington’",
    "summary": "Tokens, entered into LLMs during the AI training process, are a critical part of teaching a program how to talk to humans.\nSolidGoldMagikarp is one such “glitch token” that, in the past, has introduced bizarre behavior into LLMs.\nShe and her research partner, Matthew Watkins, discovered this particular glitch token when they were looking into the anomalous token phenomenon.\n“We think it’s what happens when the model has not seen that token during its training process,” said Rumbelow.\nIn short, phrases like SolidGoldMagikarp are obscure utterances that can make an AI model go temporarily crazy.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-08-05T12:00:40Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://gizmodo.com/get-ready-the-ai-hacks-are-coming-2000639625",
    "title": "Get Ready, the AI Hacks Are Coming",
    "summary": "Others have used prompt injection to hijack code assistants like Cursor.\nIt’s also becoming increasingly clear that AI models appear to engage with hidden commands.\nIn the case of these attacks, the researchers informed Google of the vulnerability, and the company addressed the issue, per Wired.\nBut as AI gets integrated into more platforms and more areas of the public’s lives, the more risk that such weaknesses present.\nIt’s particularly concerning as AI agents, which have the ability to interact with apps and websites to complete multi-step tasks, are starting to roll out.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-06T18:10:25Z",
    "source": "Gizmodo.com"
  },
  {
    "url": "https://www.theverge.com/openai/718785/openai-gpt-oss-open-model-release",
    "title": "OpenAI releases a free GPT model that can run on your laptop",
    "summary": "OpenAI is releasing a new open-weight model dubbed GPT-OSS that can be downloaded for free, be customized, and even run on a laptop.\nBoth model versions are being released today via platforms like Hugging Face, Databricks, Azure, and AWS under the ‭Apache 2.0 license, which allows them to be widely modified for commercial purposes.\nMeanwhile, developers have flocked to open models due to their lower cost and customizability.\nIts output is text-only and, like all of OpenAI’s models, GPT-OSS’s training data is undisclosed.\n“The team really cooked with this one.”OpenAI hasn’t shared benchmarks comparing GPT-OSS to other open models like Llama, DeepSeek, or Google’s Gemma.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-05T17:07:05Z",
    "source": "The Verge"
  },
  {
    "url": "https://finance.yahoo.com/news/chip-startup-oxmiq-launches-gpu-070649653.html",
    "title": "Chip startup Oxmiq launches GPU tech for license",
    "summary": "By Max A. CherneySAN FRANCISCO (Reuters) -Oxmiq Labs said on Tuesday that it planned to launch licensable graphics processor tech geared for artificial intelligence data crunching.\nFounded by Intel's former chief architect, Raja Koduri, Oxmiq said that it has raised $20 million in seed capital to help launch the new GPU intellectual property.\nThe funding round includes investments from angel investors, and corporate strategic investors, including MediaTek, Oxmiq said.\nThe company said it can customize the GPU architecture for specific types of computing.\nThe company said it opted to pursue building intellectual property instead of a complete chip design because it would avoid the high costs.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-05T07:06:49Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.businessinsider.com/palantir-calls-llms-a-jagged-intelligence-outlines-ai-race-plan-2025-8",
    "title": "Palantir exec calls LLMs a 'jagged intelligence' and outlines AI race plan",
    "summary": "A Palantir exec had some strong words for Large Language Models.\nThe Denver-based AI software company reported its first-ever billion-dollar quarter in Monday's Q2 earnings report, and the executives opened the investors call with comments on LLMs and how it plans to win the AI race.\n\"LLMs, on their own, are at best a jagged intelligence divorced from even basic understanding,\" Ryan Taylor, the company's chief revenue officer and chief legal officer, told shareholders on the earnings call.\nCompany executives also outlined how it plans to win the AI race and what kind of talent would thrive at Palantir.\nPalantir did not immediately respond to a request for comment from Business Insider.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-08-05T01:27:57Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.derekthompson.org/p/how-ai-conquered-the-us-economy-a",
    "title": "How AI Conquered the US Economy: A Visual FAQ",
    "summary": "Nobody can say for sure whether the AI boom is evidence of the next Industrial Revolution or the next big bubble.\nWe can all stop talking about “what will happen if AI dominates the economy at such-and-such future date?” No, the AI economy is here and now.\nToday, in a bit of a throwback to my early blogging years, I’m going to try to walk through an FAQ with graphs to create a visual guide to the question:How big is the AI boom?\n“AI companies are reaching revenue milestones faster than previous generations of startups,” the company announced in a recent report.\nBut independent evaluators in the study actually concluded that using AI did the opposite: it increased task completion time by about 20 percent.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-08-07T10:12:54Z",
    "source": "Derekthompson.org"
  },
  {
    "url": "https://www.cnet.com/tech/services-and-software/trump-media-is-testing-an-ai-search-engine-powered-by-perplexity/",
    "title": "Trump Media Is Testing an AI Search Engine Powered by Perplexity",
    "summary": "President Donald Trump's media company, Trump Media, is beta-testing an AI search feature on the Truth Social platform, drawing on Perplexity's AI technology.\nGenerative AI technology has been upending traditional internet search, which has been dominated by Google for decades.\nTrump Media and Technology Group is perhaps best known for its social media program, Truth Social.\nRepresentatives for Trump Media and Perplexity didn't immediately respond to a request for comment.\nIn today's divided political landscape, one immediate concern is that a search engine from a conservative president's media company will select only search results that favor conservative opinions.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-08-07T00:35:09Z",
    "source": "CNET"
  },
  {
    "url": "https://www.macrumors.com/2025/08/07/apples-ai-problem-not-just-siri-talent-leaving/",
    "title": "Apple's Real AI Crisis Isn't Siri, But the Talent It's Losing to Rivals",
    "summary": "The exodus of staff from Apple's AI team over the last seven months has seen senior researchers leave variously for Meta, OpenAI, xAI, Cohere, and others.\nThe most notable recent departure was that of Ruoming Pang, head of Apple's Foundational Models team, who joined Meta last month after being lured by CEO Mark Zuckerberg with a $200 million pay package.\nFT reports that industry recruiters see the departures as \"a crisis of confidence\" around Apple's AI future.\nAaron Sines from recruiting firm Razoroo said companies now view elite AI talent as \"strategic assets,\" on par with intellectual property or even entire business units.\nA chatbot-like version of the virtual assistant was one of the key Apple Intelligence features that Apple promoted at last year's WWWDC, but it has yet to arrive.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-08-07T12:22:34Z",
    "source": "MacRumors"
  }
]