[
  {
    "url": "https://www.theverge.com/policy/816882/cisa-cybersecurity-elections-infrastructure-shutdown",
    "title": "America’s cybersecurity defenses are cracking",
    "summary": "Arizona Secretary of State Adrian Fontes’ office took action to contain the threat, which he says did not impact personal voter information.\nBut one thing he didn’t do was contact the federal agency that would have once been among Fontes’ first calls: the Cybersecurity and Infrastructure Security Agency (CISA).\nCISA, housed within the Department of Homeland Security (DHS), is America’s central coordinator of cybersecurity information.\nEarlier this year, DHS moved to disband a public-private partnership that gave utilities legal cover to share more sensitive security information with the government.\n“We do not do these kinds of cuts and everything’s fine”The Trump administration has denied CISA is having problems.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-07T22:36:39Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/5-ai-powered-consulting-startups-aily-promptql-profound-dialogue-2025-10",
    "title": "4 AI-powered consulting startups to watch into 2026",
    "summary": "lighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nOver the past year, a new wave of consulting tech startups has emerged in Silicon Valley.\nBusiness Insider asked a handful of investors to identify a few of the most promising startups to watch in this emerging category of consulting tech.\nHere are four AI-powered consulting startups to watch, according to five investors who are backing them.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-11-07T10:41:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/cisco-innovation-officer-says-humanities-skills-are-critical-ai-era-2025-11",
    "title": "Cisco Innovation Exec Says These Skills Are Critical in AI Era",
    "summary": "This as-told-to essay is based on a conversation with Guy Diedrich, Cisco's global innovation officer, based in Austin.\nI left academia in 2014, but there's been a 24% drop in interest in the humanities between 2012 and 2022.\nThe option will be there to do just about anything, which raises questions about ethics, philosophy, and problem-solving.\nIt's going to become ubiquitous, and we're soon going to transition from AI to the quantum age.\nI think that's going to happen in the next three to five years — and the humanities are going to play a critical role moving forward.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-08T10:46:02Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/legal-ai-startup-legora-client-portal-2025-11",
    "title": "One of legal's hottest AI startups says it's cracked a way for law firms to get richer",
    "summary": "Legora's pitch is that software helps law firms provide a better client experience and actually grow revenue.\nLegora says Portal will centralize all legal work, replace email chains, and keep data out of AI training by default.\nLegora is riding a tailwind as law firms scramble to test and adopt new tools in response to client demands for efficiency.\nLegora isn't the first to build a law firm client portal.\nHarvey also partners with law firms to build bespoke software that clients pay to use, and Harvey itself takes a cut of the revenue.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-11-07T11:00:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/pluribus-disclaimer-apple-tv-made-by-humans-ai-vince-gilligan-2025-11",
    "title": "'Pluribus' Includes Disclaimer on Apple TV: 'Made by Humans'",
    "summary": "Impact LinkTucked away at the end of the credits of Apple TV's newest show, \"Pluribus,\" is an unusual disclaimer:\"This show was made by humans.\"\nIn another interview with Variety, Gilligan was even more blunt:\"I hate AI,\" Gilligan told Variety.\nIt might be a minute, however, before TV and film fans see AI actors on their screens.\nBusiness Insider reported last month that even brands are cooling off on \"hiring\" AI actors or influencers, citing data from marketing firm Collabstr.\nBut Dulay had another theory: AI-generated content is simply not as engaging as content created by real humans.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-11-09T14:55:52Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.androidcentral.com/accessories/smart-home/not-a-typo-i-found-a-black-friday-vpn-deal-that-gives-you-a-lifetime-of-security-for-only-30-bucks",
    "title": "Not a typo — I found a Black Friday VPN deal that gives you a lifetime of security (!!) for only 30 bucks",
    "summary": "The rumors are true: the popular brand FastestVPN is running an exclusive deal that gets you a lifetime of protection for only $30, all-in, when you use the code FUTUREBF2025 at checkout.\nTo make the deal even sweeter, the company will also throw in two years of FastestPass password management, just for kicks.\nFastestVPN clearly has something to prove by running budget-friendly deals like this, but that doesn't mean that it's cutting corners.\nOf course, all of this doesn't necessarily mean that FastestVPN is the best VPN ever created for Android users.\nBut again, this Black Friday VPN deal offers a lifetime of service for your family, and it'll cost you less than a tank of gas.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-11-10T20:24:42Z",
    "source": "Android Central"
  },
  {
    "url": "https://finance.yahoo.com/news/coreweave-beats-third-quarter-revenue-211211858.html",
    "title": "CoreWeave flags hit from data center delay, shares fall",
    "summary": "(Reuters) -Nvidia-backed CoreWeave trimmed annual revenue forecast on Monday, hurt by a delay at a third-party data center partner, ​taking the shine off a strong September quarter driven by burgeoning demand for AI ‌cloud services.\nIts shares fell more than 6% in extended trading, after Chief Financial Officer Nitin Agrawal forecast 2025 ‌revenue between $5.05 billion and $5.15 billion.\nThat was lower than CoreWeave's previous projection of $5.15 billion to $5.35 billion, and analysts' estimate of $5.29 billion, according to data compiled by LSEG.\nIts third-quarter revenue more than doubled ‌to $1.36 billion, beating the estimate of $1.29 billion.\nIts aggressive expansion plans, however, hit a snag ​in late October when crypto miner Core Scientific terminated a $9 billion all-stock merger agreement.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-11-10T21:12:11Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/news/jpmorgan-chase-ceo-jamie-dimon-160250770.html",
    "title": "JPMorgan Chase CEO Jamie Dimon Says AI Could Bring 3-Day Work Weeks And Thinks ‘People Should Stop Sticking Their Heads In The Sand’",
    "summary": "JPMorgan Chase CEO Jamie Dimon believes AI will eventually shorten the work week and says people should embrace it now, before it transforms every corner of the workforce.\nPeople should stop sticking their heads in the sand,” Dimon warned, per Fortune.\nIn the end, Dimon’s message about preparing operators for an AI-driven future — one that could mean three-day work weeks — is clear and consistent.\nThe post JPMorgan Chase CEO Jamie Dimon Says AI Could Bring 3-Day Work Weeks And Thinks ‘People Should Stop Sticking Their Heads In The Sand’ appeared first on AfroTech.\nThe post JPMorgan Chase CEO Jamie Dimon Says AI Could Bring 3-Day Work Weeks And Thinks ‘People Should Stop Sticking Their Heads In The Sand’ appeared first on AfroTech.",
    "category": "technology",
    "bias": "right",
    "publishedAt": "2025-11-07T16:02:50Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://tech.yahoo.com/transportation/articles/breakthrough-south-korean-technology-could-090000501.html",
    "title": "Breakthrough South Korean technology could be a game-changer in the future of transportation: 'We can … make a significant impact'",
    "summary": "The innovation uses temperatures of around 1,112 degrees Fahrenheit to decompose the ammonia, according to TechXplore.\nTo eliminate the need for fossil fuels, the team uses ruthenium, a platinum metal, as a \"catalyst\" during a process called pressure swing adsorption.\nIt's a complex mix of elements, compounds, and technology that can create high temperatures and, ultimately, hydrogen fuel.\nThe Korean method doesn't use fossil fuels, as the experts can produce high temperatures with the mix of elements used in the technique.\nThe TechXplore story mentioned KIER's research into hydrogen fuel cells to cleanly power buildings as one way the technology can provide for a more planet-friendly energy future.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-09T09:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://finance.yahoo.com/video/market-correction-overdue-not-because-200000664.html",
    "title": "Market correction is 'overdue,' but not because of an AI bubble",
    "summary": "Our next guest says bubble talk is overdone, but indeed the market could be due for a correction.\nOur sense is that going into the end of the year, uh the market will continue to do well.\n01:04 Nancy CurtinWe should talk a little bit about the bubble talk uh on on01:06 Speaker AYeah, let's do.\nBecause an innovation driven bull market unlike a cyclical or liquidity or recovery from recession type of bull market, uh fundamentally, you are adding earnings and productivity uh in infrastructure investment to the economy and that's very powerful.\nUltimately, all bull markets are killed by the Fed, but they seem to be in an easing mode at the moment.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-11-07T20:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/ce3xgwyywe4o",
    "title": "Mothers say AI chatbots encouraged their sons to kill themselves",
    "summary": "\"It's like having a predator or a stranger in your home,\" Ms Garcia tells me in her first UK interview.\nIn our interview - to be broadcast tomorrow on Sunday with Laura Kuenssberg - Ms Garcia welcomed the change, but said it was bittersweet.\nJust like Ms Garcia, the child's mother knew nothing about it.\n\"The Act covers 'user chatbots' and AI search chatbots, which must protect all UK users from illegal content and protect children from material that's harmful to them,\" the regulator said.\nSocial Media Victims Law CenterBut Ms Garcia is convinced that if her son had never downloaded Character.ai, he'd still be alive.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-11-08T13:20:52Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.businessinsider.com/meta-600-billion-us-investment-ai-infrastructure-data-center-jobs-2025-11",
    "title": "Meta details $600 billion US investment pledge that led to a hot-mic moment between Zuckerberg and Trump",
    "summary": "The $600 billion US investment that Mark Zuckerberg previously floated at a White House dinner with Trump is set to become a reality.\nIn a blog post published by Meta on Friday, the company said that it would commit over $600 billion to the US by 2028 to \"support AI technology, infrastructure, and workforce expansion.\"\nThe details follow a September pledge by Zuckerberg during a meal with Trump and other AI leaders, where he said Meta would invest \"something like, I don't know, at least $600 billion through 2028 in the US.\"\nFast forward to today, and Meta is now formalizing the $600 billion figure and providing more details about how it will allocate the money.\nZuckerberg has said the risk of overbuilding AI infrastructure is worth it if it means not falling behind in the race to superintelligence.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-11-07T21:23:27Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/news/818019/paramount-plus-price-increase-us-2026",
    "title": "Paramount Plus is getting a price hike in early 2026",
    "summary": "Paramount Plus is going up in price again.\nLike many other streamers, Paramount has hiked the price of its streaming service on an almost yearly basis.\nParamount Plus raised prices in 2023 before hiking them further last June.\nDuring Skydance’s first few months of ownership, Paramount Plus added 1.4 million subscribers, bringing its total to 79.1 million.\nParamount struck a $7.7 billion deal that will bring live UFC fights to its streaming service as well.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-10T22:09:14Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.technologyreview.com/2025/11/10/1127774/reimagining-cybersecurity-in-the-era-of-ai-and-quantum/",
    "title": "Reimagining cybersecurity in the era of AI and quantum",
    "summary": "Quantum computing has the potential to seriously undermine current encryption standards if developed unchecked.\nQuantum algorithms can solve the mathematical problems underlying most modern cryptography, particularly public-key systems like RSA and Elliptic Curve, widely used for secure online communication, digital signatures, and cryptocurrency.\n“Most organizations are understandably focused on the immediacy of AI threats,\" says Bailey.\nIt’s critical to start investing now in defenses that can withstand both AI and quantum attacks.”Critical to this defense is a zero trust approach to cybersecurity, which assumes no user or device can be inherently trusted.\nBy enforcing continuous verification, zero trust enables constant monitoring and ensures that any attempts to exploit vulnerabilities are quickly detected and addressed in real time.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-11-10T14:19:28Z",
    "source": "MIT Technology Review"
  },
  {
    "url": "https://finance.yahoo.com/news/deepseek-researcher-pessimistic-over-ais-101119928.html",
    "title": "DeepSeek researcher pessimistic over AI's impact in startup's first public appearance since success",
    "summary": "By Liam Mo and Brenda GohWUZHEN, China (Reuters) -Chinese artificial intelligence (AI) developer DeepSeek made its first public appearance in almost a year after it became a global sensation,​ fielding a senior researcher who told a government-organised internet conference that he was pessimistic about AI's ‌future impact on humanity.\n\"I'm ​extremely positive about the technology but I view the impact it could have on society negatively.\"\nNeither Liang or the company have commented publicly on their success and they have skipped major Chinese technology conferences in the country in the months since.\nWhile DeepSeek ​has not released a major model upgrade since January, the company's subsequent announcements have continued to draw significant attention.\nThe company has also emerged as a key player in China's efforts to build its own AI ecosystem and advance the ⁠domestic chip sector.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-07T10:13:22Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://slashdot.org/story/25/11/08/0533205/stratospheric-ai-spending-by-four-wealthy-companies-reaches-360b-just-for-data-centers",
    "title": "'Stratospheric' AI Spending By Four Wealthy Companies Reaches $360B Just For Data Centers",
    "summary": "",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-11-08T15:34:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://www.businessinsider.com/dropped-out-of-college-ai-founder-sacrifice-trade-off-cancer-2025-11",
    "title": "I quit college to run my company. The 80-hour weeks were worth it.",
    "summary": "David Kobrosky dropped out of the University of Michigan to start Intros AI.\nCourtesy of Sam GoldinDavid Kobrosky dropped out of the University of Michigan to start Intros AI.\nCourtesy of Sam GoldinThis as-told-to essay is based on a conversation with 26-year-old David Kobrosky, the founder of Intros AI, from Brooklyn.\nAlthough I returned to college in late 2019, I dropped out again in late 2020, at the age of 21, to start my company, Intros AI.\nIn 2024, I was the CEO of Intros AI and, for that year, paid myself a salary of around $100,000.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-07T10:49:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/latham-watkins-ai-academy-associate-training-2025-11",
    "title": "A Big Law Firm Tells Young Lawyers to Stay Vigilant As They Embrace AI",
    "summary": "The Big Law firm hit $7 billion in revenue last year, making it the second-highest-grossing firm in the US, and employs over 3,500 lawyers globally.\nFears are growing that law firms will reduce their associate class sizes because of AI efficiencies.\nMany believe that law firms will need fewer associates to drive profits even higher, and in-house legal teams are already exploring ways to reduce head count.\nIn-house counsel want efficiency gains and are asking law firms about their AI plans.\nRubin says the firm is also developing a virtual AI Academy for lawyers of any experience level, launching early next year.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-11-10T19:44:14Z",
    "source": "Business Insider"
  },
  {
    "url": "https://entertainment.slashdot.org/story/25/11/07/0057237/why-does-so-much-new-technology-feel-inspired-by-dystopian-sci-fi-movies",
    "title": "Why Does So Much New Technology Feel Inspired by Dystopian Sci-Fi Movies?",
    "summary": "Please create an account to participate in the Slashdot moderation system",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-11-07T07:00:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://finance.yahoo.com/news/intel-ceo-oversee-companys-ai-225721565.html",
    "title": "Intel CEO to oversee its AI efforts after executive departs for OpenAI",
    "summary": "By Max A. Cherney and Stephen NellisSAN FRANCISCO (Reuters) -Intel said on Monday its CEO Lip-Bu Tan would oversee the chipmaker's artificial ​intelligence efforts after the firm's chief technology officer departed for ChatGPT maker OpenAI.\nSachin Katti,‌ who has led Intel's AI efforts since a management reorganization at the chipmaker in January, said on social ‌media site X that he had joined OpenAI.\nKatti joined Intel roughly four ⁠years ago and worked in the networking group, which ​he eventually ran under former CEO Pat Gelsinger.\nTan ​promoted Katti to chief technology officer and chief AI officer in April, when he flattened the company's leadership structure.\nNaga Chandrasekaran, who was running Intel's manufacturing subsidiary, was given more responsibility for working with external contract manufacturing customers.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-11-10T22:57:21Z",
    "source": "Yahoo Entertainment"
  }
]