[
  {
    "id": "Mw==",
    "url": "https://thenextweb.com/news/the-rise-of-subscription-economy",
    "title": "The rise of the always-on economy: subscriptions beyond streaming",
    "summary": "Despite how modern it seems to be, the truth is that the subscription economy has been around for some time, surprisingly dating back to around 1800, with the first magazine subscriptions, or the subscriptions for fresh British milk, around 1860.\nOver the years, the of subscription-based companies has turned the subscription model into an ideal business strategy since it provides unique benefits.\nSoftware as a service (SaaS) remains the biggest part of the subscription market with a revenue of more than $250B by 2022.\nFrom education to parasocial relationshipsThe subscription economy has expanded to other services, such as education.\nThe next phase will likely combine hybrid subscription models with usage-based pricing and data-driven personalization.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-31T15:37:56Z",
    "source": "The Next Web"
  },
  {
    "id": "OQ==",
    "url": "https://finance.yahoo.com/video/why-openai-needs-to-raise-equity-and-a-lot-of-it-200000171.html",
    "title": "Why OpenAI needs to raise equity, and 'a lot of it'",
    "summary": "Well, they're going to need to raise a lot of equity.\nI think the recent equity raise which was very successful by Anthropic makes me feel better about it.\nBut I hope uh this works because man, a lot of folks are dependent on Open AI raising equity.\nDo they have another opportunity even besides that working with Open AI to monetize their own AI intentions.\nI would think that it could be a good deal for both sides, but I think it's particularly important for Open AI.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-02-01T20:00:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MTM=",
    "url": "https://www.theregister.com/2026/02/02/oracle_cloud_expansion_investment_plan/",
    "title": "Oracle seeks $45-$50 billion to fund cloud expansion",
    "summary": "One is issuing bonds, a move Big Red thinks will win it about half the cash it wants.\nOracle also says these are the only bonds it will issue in 2026.\nThe company will also issue mandatory convertible preferred securities that it says will deliver “a modest portion of the overall equity funding.” The rest will come from “a newly authorized at-the-market equity program of up to $20 billion.”Some investors weren’t entirely happy last year when Oracle used bonds to raise $18 billion to fund cloud builds, arguing that the debt might create risk.\nBig Red’s bulletin twice mentions that it can raise this lot of cash while its stock remains “investment-grade” – an admission that some investors might worry that raising this much cash might be a risky move given the uncertainty surrounding AI.\nInvestors are also likely aware that Oracle’s cloudy competitors – the likes of Microsoft, Google, and Amazon – all win $250 billion-plus of annual revenue, compared to Oracle’s $57 billion, and are spending a lot more than Big Red on datacenter infrastructure.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-02-02T05:01:47Z",
    "source": "Theregister.com"
  },
  {
    "id": "MTY=",
    "url": "https://www.businessinsider.com/europe-defense-tech-startups-founders-vc-boom-funding-deployment-2026-2",
    "title": "Inside the Startup Rush for Europe's New War Chest",
    "summary": "A NATO member had agreed to buy airships for surveillance under an alliance program pushing Western militaries to adopt new tech.\nKelluu is trying to make it big in a market that hasn't been kind to small firms.\nAccording to the NATO Innovation Fund in February, venture capital investments in European defense tech reached $1 billion in 2024, up by four times since 2020.\nTo make it in the old defense world, small firms typically needed to be bought by a prime.\nRead this collection to get to know some of the startups seeking a slice of Europe's expanding war chest:",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-02T00:08:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MTc=",
    "url": "https://slashdot.org/story/26/01/31/2344202/ai-use-at-work-has-increased-gallup-poll-finds",
    "title": "AI Use at Work Has Increased, Gallup Poll Finds",
    "summary": "What this country needs is a good five cent ANYTHING!",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-01-31T23:46:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MTg=",
    "url": "https://www.cnet.com/tech/services-and-software/nordvpn-anti-phishing-lab-test/",
    "title": "NordVPN Software Blocked 92% of Phishing Emails in Independent Testing",
    "summary": "NordVPN's anti-malware software Threat Protection Pro blocked 92% of phishing websites in an independent lab test of several antivirus products, browsers and VPNs in results released this week.\nAV-Comparatives, based in Austria, attacked 15 products with 250 websites -- all verified to be valid phishing URLs -- in a test that ran Jan. 7 to 19.\nThese phishing attempts might be sent in emails, but they also appear on websites, in texts and in voicemails.\nCNET offers tips for how to detect phishing attempts on even the most sophisticated of emails.\nIn the AV-Comparatives test, which evaluated phishing-page detection and false-positive rates, NordVPN's Threat Protection Pro ranked fourth among security products, blocking 92% of the 250 phishing URLs tested.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-01T18:20:43Z",
    "source": "CNET"
  },
  {
    "id": "MTk=",
    "url": "https://www.businessinsider.com/tech-executives-share-how-they-reset-shift-deep-thinking-2026-2",
    "title": "3 tech executives share how they find time and space for deep thinking",
    "summary": "Left to right: Shishir Mehrotra at Superhuman, Joe Depa at EY, and Parker Harris at Slack.\nLeft to right: Shishir Mehrotra at Superhuman, Joe Depa at EY, and Parker Harris at Slack.\nThree executives from Slack, EY, and Superhuman shared how they reset to make room for deep thinking amid stacked calendars.\nParker Harris, CTO SlackParker Harris said he turns the sound off on his notifications when turning to deep thinking.\nJoe Depa, EY global chief innovation officerJoe Depa is the global chief innovation officer at EY.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-01T10:20:02Z",
    "source": "Business Insider"
  },
  {
    "id": "MjA=",
    "url": "https://www.bbc.com/news/articles/cg4ewrw2drpo",
    "title": "'I spoke to ChatGPT 8 times a day' - Gen Z's loneliness 'crisis'",
    "summary": "\"AI chatbots very rarely do that unless you really tell them to.\nAnd so there's a sort of sycophantic element of basically sort of talking to yourself in a way, like to a mirror.\nIt mirrors back what it thinks you want to hear.\"",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-31T02:39:24Z",
    "source": "BBC News"
  },
  {
    "id": "MjE=",
    "url": "https://www.businessinsider.com/vibe-coding-team-embed-google-gemini-hackathon-singapore-2026-2",
    "title": "I embedded myself in a vibe coding team at Gemini's AI hackathon in Singapore. Building an app in 7 hours takes real work.",
    "summary": "I followed a hackathon team as they raced to vibe code an app in seven hours at Google's Gemini 3 Hackathon in Singapore.\nI followed a hackathon team as they raced to vibe code an app in seven hours at Google's Gemini 3 Hackathon in Singapore.\nLee Chong Ming/Business InsiderI followed a hackathon team as they raced to vibe code an app in seven hours at Google's Gemini 3 Hackathon in Singapore.\nHours later, they were racing to prototype it at Google's Gemini 3 Hackathon in Singapore.\nI embedded with the team at Google's developer space in Singapore in January to observe how a vibe-coding project comes together — or nearly falls apart — in seven hours.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-02T05:07:11Z",
    "source": "Business Insider"
  },
  {
    "id": "MjI=",
    "url": "https://hackaday.com/2026/01/31/surviving-the-ram-price-squeeze-with-linux-in-kernel-memory-compression/",
    "title": "Surviving The RAM Price Squeeze With Linux In-Kernel Memory Compression",
    "summary": "You’ve probably heard — we’re currently experiencing very high RAM prices due mostly to increased demand from AI data centers.\nUbuntu users should check out systemd-zram-generator instead, and be aware that zram might already be installed and configured by default on your Ubuntu Desktop system.\nIf you’re interested in the history of in-kernel memory compression LWN.net has an old article covering the technology as it was gestating back in 2013: In-kernel Memory Compression.\nFor those trying to get a grip on what has happened with RAM prices in recent history, a good place to track memory prices is memory.net and if you swing by you can see that a lot of RAM has gone up as much as four times in the last three or four months.\nIf you have any tips or hacks for memory compression on other platforms we would love to hear from you in the comments section!",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-01-31T09:00:06Z",
    "source": "Hackaday"
  },
  {
    "id": "MjM=",
    "url": "https://www.businessinsider.com/big-four-ai-agents-creating-upskilling-challenge-2026-1",
    "title": "The Big Four's AI revolution has a problem: how junior staff actually learn",
    "summary": "Big Four leaders say agents will soon handle the grunt work, freeing up junior employees to focus on strategic work.\n\"This is the big question right now that I haven't been able to get anybody to answer for me,\" Yvonne Hinson, CEO of the American Accounting Association, told Business Insider.\nEntry-level hires complete a \"four-day AI immersion course\" that teaches them both how to work with AI and how to leverage human skills, the firm told Business Insider.\nErrol Gardner, global vice chair of consulting at EY, told Business Insider that the foundational skillset now includes developing judgment about where and how to use AI.\n\"AI actually gives us the opportunity to be more deliberate about development, helping early-career professionals move into higher-value work sooner,\" said PwC's Burke.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-31T11:10:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjQ=",
    "url": "https://www.theverge.com/tech/871641/spacex-fcc-1-million-solar-powered-data-centers-satellites-orbit",
    "title": "SpaceX wants to put 1 million solar-powered data centers into orbit",
    "summary": "SpaceX filed a request with the FCC on Friday seeking approval to put a constellation of one million data center satellites into orbit.\nThe filing proposes establishing a network of solar-powered data centers in low Earth orbit that communicate with one another via lasers.\nBut SpaceX argues that the orbital data centers would be a cheaper and more environmentally friendly alternative to land-based centers that form the backbone of the growing AI industry.\nThe backlash against data centers has been growing, and communities are increasingly winning their battles to block their construction.\nCorrection January 31st: An earlier version of this article stated that there were over 11,000 Starlink satellites in orbit.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-31T19:38:36Z",
    "source": "The Verge"
  },
  {
    "id": "MjU=",
    "url": "https://www.businessinsider.com/moltbook-ai-agents-social-network-reddit-2026-2",
    "title": "A look inside Moltbook — the Reddit-style social media site for AI agents that is dividing humans",
    "summary": "Moltbook, a new Reddit-style social network made entirely for AI agents, can be read in a few different ways.\nThe post garnered the attention not just of thousands of other AI agents on the site, but also of the humans watching it all unfold.\nThe enthusiasm is notable, given that Karpathy said just last October on the Dwarkesh Podcast that he was utterly unimpressed with the state of AI agents.\nIn the near future, it will be common for certain AI agents, with unique identities, to become famous,\" Schlicht wrote on X.\nAs of February 1, the site says there are already more than 1,534,287 AI agents on the platform, and 85,017 comments.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-02T01:26:37Z",
    "source": "Business Insider"
  },
  {
    "id": "MjY=",
    "url": "https://www.androidcentral.com/streaming-tv/this-samsung-oled-tv-just-scored-a-whopping-usd1-100-discount-at-best-buy-just-in-time-for-super-bowl-sunday",
    "title": "This Samsung OLED TV just scored a whopping $1,100 discount at Best Buy, just in time for Super Bowl Sunday",
    "summary": "Super Bowl Sunday is nearly here, and TV deals are hitting retailers all across the web, ready to upgrade any party.\nFor example, Best Buy has slashed $1,100 off the price of this 65-inch Samsung 4K TV, marking over half off the normal sticker price and bringing it down to just $900.\nAdditionally, this Tizen TV comes with One UI, as well as more than 2,700 free channels, 400 premium Samsung TV Plus channels, and a long-term update promise that makes it more future-proof than many other TVs.\n$1,100 off Samsung 65-inch Class S84F OLED 4K TV: $1,999.99 $899.99 at Best Buy Best Buy's latest TV discount comes just ahead of Super Bowl Sunday, as the retailer has cut $1,100 off the price of the Class S84F 65-inch model.\nThe smart TV also runs a version of One UI that's well-liked by buyers, while purchase includes seven years of automatic OS upgrades.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-01T14:05:00Z",
    "source": "Android Central"
  },
  {
    "id": "Mjc=",
    "url": "https://www.androidcentral.com/apps-software/ai/you-can-watch-a-video-overview-of-your-notebooklm-research-on-android-now-and-more",
    "title": "You can watch a 'Video Overview' of your NotebookLM research on Android now, and more",
    "summary": "What you need to knowNotebookLM's app on Android and iOS is reportedly receiving Video Overviews after waiting for some time.\nVideo Overviews are AI-generated slideshows, packed with visuals, controls, and more, all about the content you've given NotebookLM to help you learn and understand.\nA previous update for NotebookLM on mobile brought flashcards and quizzes to people looking to study new topics.\nNotebookLM has been slowly upgrading how it condenses and delivers heavy research notes to users, and this latest update on Android is adding what it's been missing.\nA post by 9to5Google highlights a recent update for NotebookLM that's started rolling out for Android and iOS devices, bringing videos.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-31T12:36:00Z",
    "source": "Android Central"
  },
  {
    "id": "Mjg=",
    "url": "https://gyptazy.com/blog/fosdem-2026-opensource-conference-brussels/",
    "title": "FOSDEM 2026 – Open Source, Digital Sovereignty, and Europes Future",
    "summary": "FOSDEM 2026 – Open Source, Digital Sovereignty, and Europes Future2026-01-31FOSDEM, the Free and Open Source Developers’ European Meeting, is an annual pilgrimage for open source enthusiasts from all over the world.\nWhat started as a small gathering in 2000, originally named the Open Source Developers of Europe Meeting (OSDEM), has grown into one of the most significant conferences dedicated to free and open source software.\nFOSDEM 2026 - Sovereignty.\nMore people take open source seriously, more organizations depend on it, and more contributors want to get involved.\nNot every open source project exists to solve geopolitical problems, and not every contributor arrives with a policy agenda.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-02-01T10:30:41Z",
    "source": "Gyptazy.com"
  },
  {
    "id": "MzA=",
    "url": "https://www.businessinsider.com/elon-musk-inc-company-connections-tesla-spacex-xai-boring-2026-2",
    "title": "All the ways Elon Musk's companies are already intertwined, from a Tesla 'collab' with SpaceX to Grok in vehicles",
    "summary": "Elon Musk's companies have been swapping IP and cash.\nElon Musk's companies have been swapping IP and cash.\nHarun Ozalp/Anadolu via Getty ImagesElon Musk's companies have been swapping IP and cash.\nHere are some of the recent sharing agreements, purchases, and investments between Musk's companies.\nExecutives share overlapping functions on several of Musk's companies, too, according to insider org charts obtained by Business Insider.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-01T10:00:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MzI=",
    "url": "https://finance.yahoo.com/news/investor-made-20-million-nvidia-010505225.html",
    "title": "Investor Who Made $20 Million on Nvidia Stock Reveals the Next Big Opportunity",
    "summary": "One young investor poured money into the stock during that period and turned it into a $20 million position.\nRecently, he shared how he spotted the opportunity — and where he believes the next big investing opportunity could be found.\nWhat To Look For in a StockThe Nvidia investor appeared in a Whop on the Street video in which host Josh Suggs asked Wall Street millionaires how to get rich.\nSome people knew that cracking the AI code could lead to tremendous riches, and instead of creating the next Nvidia, the investor bought Nvidia stock.\nHe cited a recent breakthrough by Google involving its Willow chip, which brought quantum computing closer to real-world applications.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-02T01:05:05Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "Mzk=",
    "url": "https://www.designboom.com/architecture/reused-shipping-containers-high-tech-incubator-carquero-arquitectura-spain/",
    "title": "reused shipping containers form high-tech incubator by carquero arquitectura in spain",
    "summary": "Carquero arquitectura adapts industrial systems for reuseIncubazul Base Area by Carquero Arquitectura takes shape inside the Zona Franca de Cádiz, Spain, as a high-tech incubator designed to trigger the transformation of one of the most entrenched industrial zones in the city.\nThe project is structured around the reuse of shipping containers as a systemic decision.\nall images by Jesús Granadaurban acupuncture within cádiz’s zona franca, spainThe Cádiz-based team at Carquero Arquitectura frames Incubazul as a form of urban acupuncture.\nIts role is to activate the district that surrounds it, offering a recognizable and legible presence that draws attention to the broader regeneration of the Zona Franca.\nthe container-based building meets the industrial street edge while opening inwarda shaded courtyard emerges between reused containersred-painted ground surfaces and container walls define shared work areas",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-01T03:30:29Z",
    "source": "Designboom"
  },
  {
    "id": "NDI=",
    "url": "https://terraformindustries.wordpress.com/2026/01/30/direct-current-data-centers/",
    "title": "Direct Current Data Centers",
    "summary": "In the limit, Earth-based AI compute will be a direct current (DC) solar array connected to a DC battery bank connected to a DC GPU rack.\nPlug in some assumptions around GPU cost, solar cost, battery cost, gas turbine cost, gas fuel cost, and amortization period, and you can produce this chart.\nAs a rough rule of thumb, this is where 1.3 x battery cost + solar cost < $500/kW(h).\nThe pure solar+battery data center is cheaper than a gas-assisted or pure gas data center if solar and battery costs per kW are <~10% of the turbine/gas generator cost.\nFinally, an application of space-based solar power that can justify something like the vision of Gerry O’Neill.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-31T00:06:06Z",
    "source": "Wordpress.com"
  },
  {
    "id": "Njc=",
    "url": "https://indianexpress.com/article/technology/tech-news-technology/budget-2026-cloud-giants-cheer-tax-free-ride-data-centres-india-10507825/",
    "title": "Cloud giants cheer Budget 2026 proposal for tax-free ride to use data centres in India",
    "summary": "As a result, data centres sprawling acres of land have come to form the bedrock of the AI industry.\nHowever, the rapid growth of data centres in India could strain the country’s resources and negatively impact the environment.\nBy 2026, India’s total data centre capacity is projected to surpass 2 GW, up from a little over 1 GW.\nIt added that the 15 per cent on-cost safe harbour proposal ensures pricing certainty for routine infrastructure services.\nStory continues below this adAlso Read | Why does Elon Musk want to put AI data centers in space?",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-02-01T14:52:04Z",
    "source": "The Indian Express"
  }
]