[
  {
    "id": "OA==",
    "url": "https://www.businessinsider.com/ai-job-market-english-majors-humanities-demand-2026-2",
    "title": "AI Is Giving English Majors Some Unexpected Leverage in the Job Market",
    "summary": "Pre-pandemic, the number of English majors at the university was shrinking, part of a broader decline in English across the country, he said.\nBut there's been a rebound, with the number of English majors rising 9% since 2021.\nCourtesy of CU BoulderDerided by some as useless, the utility of the English major has long been questioned.\nThat means that, after years of mocking, English majors are finally getting recognized for their usefulness.\nStill, it's a dreary labor market for everyone — English majors includedThere are signs of employment hope for the English majors.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-22T09:50:01Z",
    "source": "Business Insider"
  },
  {
    "id": "OQ==",
    "url": "https://doempke.com/what-happened-to-software-is-happening-to-finance-and-accounting/",
    "title": "What Happened to Software is Happening to Finance and Accounting",
    "summary": "What happened to software is now happening to finance.\nWhat happened to software is now happening to finance.\nSo I became a finance person who codes — a weird niche that turned out to be excellent preparation for what's happening right now.\nIf you're already deep in this: I'd love to see what you're building.\nI'm thinking of putting together a mini hackathon for people building at this intersection — finance, AI, automation.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-21T10:45:52Z",
    "source": "Doempke.com"
  },
  {
    "id": "MTE=",
    "url": "https://news.slashdot.org/story/26/02/20/2134238/goldman-sachs-launches-ai-free-index",
    "title": "Goldman Sachs Launches AI-Free Index",
    "summary": "Can anyone remember when the times were not hard, and money not scarce?",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-02-20T23:20:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MTQ=",
    "url": "https://www.theverge.com/transportation/882364/uber-autonomous-solutions-training-data-partners",
    "title": "Uber launches robotaxi support project to aid AV partners",
    "summary": "Now, the ridehail giant is launching a new initiative to support its third-party robotaxi partners called Uber Autonomous Solutions.\nIt’s an acknowledgement that many AV developers aren’t as cash rich as Waymo, Tesla, and other leading AV developers.\nUber says this data can help its partners improve their own autonomous vehicles as they seek to scale their robotaxi business more quickly.\nEssentially, Uber is telling its AV partners to stick to the important stuff — developing software to power autonomous driving — and it will take care of the rest.\nThe company has said it wants to use its reach and scale to help autonomous vehicles proliferate across the globe.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-21T19:31:36Z",
    "source": "The Verge"
  },
  {
    "id": "MTY=",
    "url": "https://it.slashdot.org/story/26/02/20/003230/how-private-equity-debt-left-a-leading-vpn-open-to-chinese-hackers",
    "title": "How Private Equity Debt Left a Leading VPN Open To Chinese Hackers",
    "summary": "Can anyone remember when the times were not hard, and money not scarce?",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-02-20T13:00:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MTc=",
    "url": "https://www.businessinsider.com/pwc-engineers-launch-ai-agent-enterprise-grade-spreadsheets-big-four-2026-2",
    "title": "PwC engineers built an AI agent to tackle the corporate world's least sexy task: spreadsheets",
    "summary": "PwC, like many consulting firms, is investing heavily in engineering talent.\nArtur Widak/NurPhoto via Getty ImagesPwC, like many consulting firms, is investing heavily in engineering talent.\nThese files often underpin business-critical decisions, yet PwC \"found that even today's modern AI was very poorly suited to managing these big enterprise spreadsheets,\" Wood said.\nIn January, PwC launched a dedicated tech engineering career track to attract more technical talent, saying it wants to become \"a destination for top engineering talent.\"\nThe second reimagines professional services from scratch: \"If you were to start from a blank piece of paper, what would professional services look like in an AI agent world?\"",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-20T10:33:45Z",
    "source": "Business Insider"
  },
  {
    "id": "MTg=",
    "url": "https://www.wired.com/story/how-to-hide-google-ai-overviews-from-your-search-results/",
    "title": "How to Hide Google’s AI Overviews From Your Search Results",
    "summary": "While there’s no off switch to avoid this smorgasbord of AI tools entirely, there is one keyboard trick you can use to dodge Google’s AI Overviews for a brief respite.\nIt’s an option WIRED readers highlighted under a recent article about scams found in Google’s AI Overviews.\n“People find Search more helpful with AI Overviews, and they're coming back to search more as a result,” a Google spokesperson tells WIRED.\nThe exception seems to be on Android—at least on a Google Pixel phone we tested with, using “–ai” removed AI Overviews.\nWhen Google launched AI Overviews in 2024, it was a major turning point for the search engine.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-02-22T11:00:00Z",
    "source": "Wired"
  },
  {
    "id": "MTk=",
    "url": "https://www.anthropic.com/news/claude-code-security",
    "title": "Making frontier cybersecurity capabilities available to defenders",
    "summary": "Claude Code Security, a new capability built into Claude Code on the web, is now available in a limited research preview.\nClaude Code Security is intended to put this power squarely in the hands of defenders and protect code against this new category of AI-enabled attack.\nHow Claude Code Security worksStatic analysis—a widely deployed form of automated security testing—is typically rule-based, meaning it matches code against known vulnerability patterns.\nNothing is applied without human approval: Claude Code Security identifies problems and suggests solutions, but developers always make the call.\nClaude Code Security is one step towards our goal of more secure codebases and a higher security baseline across the industry.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-20T18:03:19Z",
    "source": "Anthropic.com"
  },
  {
    "id": "MjE=",
    "url": "https://www.businessinsider.com/mark-cuban-two-types-of-people-using-ai-learning-lazy-2026-2",
    "title": "Mark Cuban on 2 Types of AI Users: Learners and Non-Learners",
    "summary": "Mark Cuban said people who use AI either use it to learn everything or to avoid learning.\nMark Cuban said people who use AI either use it to learn everything or to avoid learning.\nTom Williams/CQ-Roll Call, Inc via Getty ImagesMark Cuban said people who use AI either use it to learn everything or to avoid learning.\nlighning bolt icon An icon in the shape of a lightning bolt.\nBill Gurley, a partner at the Silicon Valley venture capitalist firm Benchmark, agrees \"100%\" with Cuban that there are two types of AI users.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-02-20T00:07:49Z",
    "source": "Business Insider"
  },
  {
    "id": "MjI=",
    "url": "https://www.businessinsider.com/deepmind-ceo-demis-hassabis-ai-lazy-way-hurts-thinking-skills-2026-2",
    "title": "DeepMind's CEO says using AI can make you a genius — or hurt your critical thinking skills",
    "summary": "The Google DeepMind CEO said that AI is just like the internet when it comes to learning.\nIn a Thursday interview with entrepreneur Varun Mayya on the sidelines of the India AI Impact Summit, the Google DeepMind CEO said that AI is just like the internet.\n\"With AI, if you use it in a lazy way, it will make you worse at critical thinking and so on,\" he said.\nIt merged with Google Brain in 2023 to form Google DeepMind, the lab behind tools such as Gemini and Nano Banana.\nAt a June conference, the CEO of French AI lab Mistral said that a risk of using AI for everything is that humans will stop trying.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-20T05:01:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjM=",
    "url": "https://www.businessinsider.com/scott-adams-death-ai-avatar-resurrection-ethics-debate-family-backlash-2026-2",
    "title": "Scott Adams' AI Resurrection Sparks Backlash and an Ethics Debate",
    "summary": "\"The real Scott Adams gave explicit permission on the record multiple times for people to create and operate an AI version of him,\" the AI Adams said in a post on February 5.\nThe Adams estate did not respond to requests for comment from Business Insider.\n\"It's my belief this is something that he wanted,\" John Arrow, an AI venture capitalist who created the digital Adams, said.\nThe AI Adams identifies itself as artificial intelligence at the start of its clips and does not appear to solicit money.\nFor now, the AI \"Scott Adams\" fight is one family's public line-drawing exercise.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-20T09:14:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjU=",
    "url": "https://slashdot.org/story/26/02/22/1632217/ai-now-helps-manage-16-of-americas-apartments",
    "title": "AI Now Helps Manage 16% of America's Apartments",
    "summary": "Can anyone remember when the times were not hard, and money not scarce?",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-02-22T18:34:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MjY=",
    "url": "https://taalas.com/the-path-to-ubiquitous-ai/",
    "title": "The path to ubiquitous AI",
    "summary": "The path to ubiquitous AIBy Ljubisa BajicMany believe AI is the real deal.\nAbout TaalasFounded 2.5 years ago, Taalas developed a platform for transforming any AI model into custom silicon.\nAI inference is the most critical computational workload that humanity has ever faced, and the one that stands to gain the most from specialization.\nThe Silicon Llama is aggressively quantized, combining 3-bit and 6-bit parameters, which introduces some quality degradations relative to GPU benchmarks.\nOur first products, beginning with our hard-wired Llama and rapidly expanding to more capable models, eliminate high latency and cost, the core barriers to ubiquitous AI.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-20T10:32:52Z",
    "source": "Taalas.com"
  },
  {
    "id": "Mjc=",
    "url": "https://www.bbc.com/news/articles/c4g8r23yv71o",
    "title": "Why fake AI videos of UK urban decline are taking over social media",
    "summary": "\"If people saw it and they immediately knew it was fake, then they would just scroll.\nThe selling point of generative AI models is that they look real,\" RadialB tells me over the phone.\nHe refuses to share his real name but reveals he is in his 20s and from the north-west of England.\nHe has never been to Croydon.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-21T06:04:41Z",
    "source": "BBC News"
  },
  {
    "id": "Mjk=",
    "url": "https://news.slashdot.org/story/26/02/21/1932253/codeorg-president-steps-down-citing-upending-of-cs-by-ai",
    "title": "Code.org President Steps Down Citing 'Upending' of CS By AI",
    "summary": "Want to read Slashdot from your mobile device?\nPoint it at m.slashdot.org and keep reading!",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-02-21T20:35:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MzA=",
    "url": "https://www.wired.com/story/sony-wh-ch720n-deal-february-2026/",
    "title": "Sony’s WH-CH720N headphones offer excellent value at full price, but right now they're a steal.",
    "summary": "We've tested oodles of noise-canceling headphones and the Sony WH-CH720N might have an unfortunate name, but they're the best budget-friendly pair we've tried.\nThey usually offer good value when selling for the full $178 MSRP, but right now they've fallen to $95 shipped on Amazon and $100 on Best Buy.\nThese headphones are well-built and well-designed, with great active noise cancellation and robust sound.\nMoreover, if you want a pair of over-hear wireless headphones with active noise cancellation, it's very difficult to get that in a package this affordable.\nCheck those stories out if you're on the hunt for wireless gaming earbuds or open earbuds.",
    "category": "technology",
    "bias": "right",
    "publishedAt": "2026-02-21T20:30:46Z",
    "source": "Wired"
  },
  {
    "id": "MzM=",
    "url": "https://www.businessinsider.com/sam-altman-elon-musk-data-centers-space-timeline-2026-2",
    "title": "Sam Altman says Elon Musk's idea of putting data centers in space is 'ridiculous'",
    "summary": "Lighning bolt icon An icon in the shape of a lightning bolt.\nOrbital data centers are not something that's going to matter at scale this decade.\"\nIn February, SpaceX said its goal is to launch a \"constellation of a million satellites that operate as orbital data centers.\"\nTech and AI companies rely on data centers to power their products, like large language models and chatbots.\nThose data centers, however, can deplete water resources, strain power grids, increase pollution, and decrease the overall quality of life.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-02-21T22:57:42Z",
    "source": "Business Insider"
  },
  {
    "id": "MzU=",
    "url": "https://www.businessinsider.com/americas-hottest-nimby-issue-data-centers-sanders-desantis-2026-2",
    "title": "Politicians can't ignore data centers anymore",
    "summary": "National and local politicians are calling for data centers to pay their fare share of rising utility costs.\nUntil recently, most states have courted data centers, enticed by promises that they will create jobs and sprout long-term revenue from vacant land.\nThere's still about a fifth of people in the middle who don't have feelings on data centers yet, but their numbers are shrinking.\nIf data centers don't start footing the bill for higher energy use, voters are likely to keep turning on them.\nIn Virginia, home to the world's largest concentration of data centers, aka Data Center Alley, backlash has been mounting for several years.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-02-22T09:13:01Z",
    "source": "Business Insider"
  },
  {
    "id": "NTY=",
    "url": "https://news.slashdot.org/story/26/02/22/0213244/f-35-software-could-be-jailbreaked-like-an-iphone-dutch-defense-minister",
    "title": "F-35 Software Could Be Jailbreaked Like an IPhone: Dutch Defense Minister",
    "summary": "Can anyone remember when the times were not hard, and money not scarce?",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-02-22T15:34:00Z",
    "source": "Slashdot.org"
  }
]