[
  {
    "id": "NA==",
    "url": "https://www.businessinsider.com/guggenheim-firm-plans-to-invest-uae-creator-fund-2026-1",
    "title": "A Guggenheim heir is raising $50 million to back media and creator startups. Here are 4 areas he's betting on.",
    "summary": "Guggenheim Brothers MediaDillon Lawson-Johnston and Criswell Fiordalis see opportunity to invest at the intersection of Hollywood and creators.\nGuggenheim Brothers MediaA new $50 million fund is targeting media, entertainment, and creator economy startups, tapping into Hollywood networks and the UAE's growing appetite for cultural investment.\nUS investment firm Guggenheim Brothers Media is launching the fund with backing from Abu Dhabi-based Ethmar International Holding.\nThey plan to seek other investors as well and hope to grow the fund to as much as $75 million.\nHollywood has franchises ripe for extensionTraditional media companies have a lot of intellectual property that they want to give new life to in digital media.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-09T17:20:30Z",
    "source": "Business Insider"
  },
  {
    "id": "MTM=",
    "url": "https://ca.news.yahoo.com/chinas-zeekr-brand-enter-more-130220865.html",
    "title": "China's Zeekr brand to enter more European markets, considering hybrid models, executive says",
    "summary": "\"When we look at ‌the European consumer demand, the plug-in hybrid segment still ... has a high share,\" Lothar Schupet, Zeekr's acting head of European operations told Reuters at the Brussels car show.\nSelling PHEV models would help Zeekr avoid European Union tariffs ‍on Chinese-made fully-electric cars.\nZeekr currently sells in 12 European markets and launched in Germany in December - and in some markets sells directly to consumers.\nAs well as adding new major markets, Zeekr will also more than triple its European dealer network to around 100 dealers this year ⁠from 30 now, Schupet said.\nThe company has already launched plug-in hybrid ‍versions of some models ⁠in the Chinese market, the world's largest.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-09T13:02:20Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MTY=",
    "url": "https://www.businessinsider.com/elon-musk-retirement-saving-abundance-ai-tech-tesla-spacex-billionaires-2026-1",
    "title": "Elon Musk: Saving for Retirement 'Irrelevant' in Abundant Future",
    "summary": "Saving for retirement has been a cornerstone of personal finance for well over a century.\n\"If any of the things that we've said are true, saving for retirement will be irrelevant,\" Musk added.\nThe \"good future is anyone can have whatever stuff they want,\" Musk said.\nDespite his track record, Musk's latest prediction clashes hard with the reality faced by many Americans.\nA comfortable retirement also feels out of reach, with surveys showing the majority of Americans aren't saving nearly enough.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-09T10:29:10Z",
    "source": "Business Insider"
  },
  {
    "id": "MTg=",
    "url": "https://www.theverge.com/tech/859994/ai-collectibles-funko-pops-amiibo-buddyo-heymates-ces-2026",
    "title": "AI is coming for collectibles next",
    "summary": "AI toys, companions, and robots have been everywhere at CES this year, but among the horde of waddling plushies and light-up emoji eyes, two stood out to me.\nWith that in mind, it’s launching HeyMates, Funko-esque figurines with RFID chips in their bases, which become interactive AI characters when placed on the accompanying stand.\nIn short, he wants to build the next Funko Pops, but make it AI.\nInstead of selling figurines, Buddyo is launching a stand it calls an AI Pod, with a slot the exact size of a standard Amiibo base.\nIt’s still an open question whether there’s a meaningful market for AI toys and chatbot companions, but combining the tech with collectibles is the most convincing case I’ve seen yet.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-09T22:52:36Z",
    "source": "The Verge"
  },
  {
    "id": "MTk=",
    "url": "https://www.businessinsider.com/ai-human-intelligence-impact-at-work-2026-1",
    "title": "AI isn't making us smarter — it's training us to think backward, an innovation theorist says",
    "summary": "John Nosta, founder of the NostaLab think tank, says AI trains humans to think backward by providing answers before they understand.\nJohn Nosta, founder of the NostaLab think tank, says AI trains humans to think backward by providing answers before they understand.\nCourtesy of John NostaJohn Nosta, founder of the NostaLab think tank, says AI trains humans to think backward by providing answers before they understand.\nHowever, John Nosta, an innovation theorist and founder of NostaLab, an innovation and tech think tank, said that large language models don't think like humans at all.\nWhy AI flips human thinking upside downNosta believes AI is quietly reshaping how people think, especially at work.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-10T10:20:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjA=",
    "url": "https://www.businessinsider.com/artificial-intelligence-industry-super-pacs-2026-1",
    "title": "The AI industry is getting into politics. Here are the key super PACs to watch in 2026.",
    "summary": "The AI industry is pouring hundreds of millions of dollars into super PACs ahead of the 2026 midterm elections.\nThe AI industry is pouring hundreds of millions of dollars into super PACs ahead of the 2026 midterm elections.\nOsakaWayne Studios/Getty ImagesThe AI industry is pouring hundreds of millions of dollars into super PACs ahead of the 2026 midterm elections.\nSeveral super PACs backed by figures in the tech industry have formed ahead of the 2026 midterm elections.\nHere are the super PACs to keep an eye on as the year progresses.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-01-10T10:07:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjE=",
    "url": "https://www.businessinsider.com/wef-sees-4-ai-futures-for-jobs-by-2030-only-one-limits-disruption-2026-1",
    "title": "WEF mapped out 4 AI-driven futures for jobs by 2030, and only one looks good for humanity",
    "summary": "The World Economic Forum says AI will reshape work by 2030 — and only one future avoids major worker displacement.\nThe World Economic Forum says AI will reshape work by 2030 — and only one future avoids major worker displacement.\nAPHOTOGRAFIA/Getty ImagesThe World Economic Forum says AI will reshape work by 2030 — and only one future avoids major worker displacement.\nImpact LinkThe World Economic Forum says the future of work isn't doomed by AI — but most paths forward still involve painful disruption.\nA more optimistic camp, including Microsoft AI CEO Mustafa Suleyman and Zoom CEO Eric Yuan, have said AI will ultimately augment workers.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-09T12:11:45Z",
    "source": "Business Insider"
  },
  {
    "id": "MjI=",
    "url": "https://www.theverge.com/tech/860010/atitan-bluetooth-auracast-transceiver-ces-2026",
    "title": "This Atitan Bluetooth transceiver can bring Auracast to Apple iPhones",
    "summary": "One of the issues holding Auracast back from wider mainstream use is some companies’ lack of support for the Bluetooth technology — Apple being a prime example.\nAs of yet, Apple has made no comment on Auracast, and I’m not hopeful that we’ll get one anytime soon.\nIt’s developing a small disc-shaped transceiver — the splitR — that can attach to an iPhone’s MagSafe and turn it into an Auracast device capable of either transmitting or receiving an Auracast broadcast.\nThe splitR isn’t meant just for an Apple device, though.\nAnd Atitan tells me the next iteration will be able to pair wirelessly to translate a classic Bluetooth connection into a Bluetooth LE Auracast transmission.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-09T22:56:41Z",
    "source": "The Verge"
  },
  {
    "id": "MjM=",
    "url": "https://www.yahoo.com/news/articles/chinese-automaker-xpeng-touts-ai-051247018.html",
    "title": "Chinese automaker Xpeng touts AI pivot in face of fierce competition",
    "summary": "Robots and autos are the core of physical artificial intelligence and share a wide range of existing sensor tech and ‌other hardware.\nUnderlining growing interest in physical ​AI, chip technology company Arm Holdings told Reuters this week that it had reorganized to create ‌a physical AI unit to expand its presence in the robotics market.\nHe said Xpeng has also been hiring and investing in developing autonomous driving and ‍humanoid robots centred on its ⁠in-house AI capabilities.\nThe company will begin mass production of humanoid robots in the second half of 2026 and will begin street trials of robotaxis “very soon,” He said.\n(Reporting by David Kirton in Guangzhou, Additional reporting by Zhang Yan in ‌Shanghai; Editing by Brenda Goh and Thomas Derpinghaus)",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-09T05:12:47Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "MjQ=",
    "url": "https://www.theverge.com/news/859715/x-grok-ai-deepfakes",
    "title": "The latest on Grok’s gross AI deepfakes problem",
    "summary": "The launch of an AI image editing feature on xAI’s Grok has caused chaos on X after it was used to generate a flood of nonconsensual sexualized deepfakes.\nAs Hayden Field wrote , “screenshots show Grok complying with requests to put real women in lingerie and make them spread their legs, and to put small children in bikinis.”UK Prime Minister Keir Starmer called the deepfakes “disgusting,” saying, “X need[s] to get their act together and get this material down.\nAnd we will take action on this because it’s simply not tolerable.” X has slightly restricted the feature by requiring a paid subscription to generate images by tagging Grok on X, but the AI image editor remains freely available otherwise.",
    "category": "technology",
    "bias": "right",
    "publishedAt": "2026-01-09T19:13:32Z",
    "source": "The Verge"
  },
  {
    "id": "MjU=",
    "url": "https://it.slashdot.org/story/26/01/10/1926209/ai-fails-at-most-remote-work-researchers-find",
    "title": "AI Fails at Most Remote Work, Researchers Find",
    "summary": "It is better to travel hopefully than to fly Continental.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-01-10T20:34:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MjY=",
    "url": "https://www.theverge.com/tech/859023/i-cant-find-the-trump-phone-at-americans-largest-tech-show",
    "title": "I can’t find the Trump phone at America’s largest tech show",
    "summary": "CES 2026 live: all the news, announcements, and innovations from the show floor and beyondWhere’s the Trump phone?\nTrump Mobile didn’t hold a press conference, nor did it reach out to The Verge to set up any meetings at Trump Tower.\nIt’s not really a surprise that Trump Mobile isn’t here, of course, nor that it doesn’t want to show off its phone.\nLas Vegas has a Trump tower, but still no Trump phone.\nGot inside information on Trump Mobile or the Trump phone?",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-09T18:08:12Z",
    "source": "The Verge"
  },
  {
    "id": "Mjc=",
    "url": "https://tech.slashdot.org/story/26/01/09/216254/ces-worst-in-show-awards-call-out-the-tech-making-things-worse",
    "title": "CES Worst In Show Awards Call Out the Tech Making Things Worse",
    "summary": "Want to read Slashdot from your mobile device?\nPoint it at m.slashdot.org and keep reading!",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-01-09T23:20:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "Mjg=",
    "url": "https://www.businessinsider.com/cursor-ai-features-side-projects-jason-ginsberg-engineering-head-2026-1",
    "title": "Cursor's most important AI features started as side projects engineers built themselves, says its engineering head",
    "summary": "Some of Cursor's biggest AI features were bottom-up projects started by its engineers, says Jason Ginsberg.\nSome of Cursor's biggest AI features were bottom-up projects started by its engineers, says Jason Ginsberg.\nIllustration by Thomas Fuller/SOPA Images/LightRocket via Getty ImagesSome of Cursor's biggest AI features were bottom-up projects started by its engineers, says Jason Ginsberg.\nImpact LinkSome of Cursor's most important AI features didn't come from a formal road map.\nCursor still maintains short-term roadmaps, but many of its biggest features emerge organically, Ginsberg said.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-09T06:01:41Z",
    "source": "Business Insider"
  },
  {
    "id": "Mjk=",
    "url": "https://www.businessinsider.com/ai-startup-mistral-lands-french-military-deal-openai-of-europe-2026-1",
    "title": "$14 billion AI startup Mistral — Europe's answer to OpenAI — lands French military deal as the region bets on homegrown tech",
    "summary": "Mistral scored a major win after France's military picked the homegrown AI startup over US tech giants.\nMistral scored a major win after France's military picked the homegrown AI startup over US tech giants.\nVCG/VCG via Getty ImagesMistral scored a major win after France's military picked the homegrown AI startup over US tech giants.\nImpact LinkFrench AI startup Mistral has secured a major vote of confidence from its home government after landing a deal to provide AI technology to France's military.\nIn a LinkedIn post announcing the deal, Mistral said its AI systems would be deployed on France's own infrastructure and fine-tuned using defense-specific data to support operational military needs.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-09T12:32:24Z",
    "source": "Business Insider"
  },
  {
    "id": "Mzc=",
    "url": "https://hardware.slashdot.org/story/26/01/10/0556228/chinas-artificial-sun-breaks-nuclear-fusion-limit-thought-to-be-impossible",
    "title": "China's 'Artificial Sun' Breaks Nuclear Fusion Limit Thought to Be Impossible",
    "summary": "Catch up on stories from the past week (and beyond) at the Slashdot story archive",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-10T18:34:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "NDM=",
    "url": "https://science.slashdot.org/story/26/01/10/0628251/nature-inspired-computers-are-shockingly-good-at-math",
    "title": "Nature-Inspired Computers Are Shockingly Good At Math",
    "summary": "It is better to travel hopefully than to fly Continental.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-01-11T02:34:00Z",
    "source": "Slashdot.org"
  }
]