[
  {
    "id": "MA==",
    "url": "https://www.bbc.com/news/articles/c0r9280gvelo",
    "title": "AI likely to displace jobs, says Bank of England governor",
    "summary": "AI likely to displace jobs, says Bank of England governorHowever, he warned that there was an issue with younger, inexperienced professionals finding it difficult to secure entry-level roles due to AI.\nAndrew Bailey said the UK needed to have the \"training, education, [and] skills in place\" so workers could shift into jobs that use AI.\nThe widespread adoption of artificial intelligence (AI) is likely to displace people from jobs in a similar way seen during the Industrial Revolution, the governor of the Bank of England has said.\nEntry-level professional jobs are thought to be most impacted by AI, particularly in sectors such as law, accountancy and administration.\nMr Bailey said AI was the \"most likely source of the next leg up\" for UK economic growth.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "OA==",
    "url": "https://www.theverge.com/science/848445/nuclear-energy-ndaa-defense-bill",
    "title": "Next-generation nuclear reactors could get a boost from the National Defense Authorization Act",
    "summary": "President Trump signed the National Defense Authorization Act (NDAA) for Fiscal Year 2026 Thursday with measures that further the bipartisan push for next-generation nuclear power plants.\nThe Trump administration has embraced the technology as a new energy source for data centers demanding greater amounts of electricity for AI.\nMany Democrats, meanwhile, have championed smaller and ostensibly cheaper and easier-to-build nuclear reactors as a carbon pollution-free energy source that can help fight climate change.\nThe International Nuclear Energy Act establishes working groups and boosts funding and interagency cooperation on the development and export of US nuclear technologies.\nThe bill also directs the Department of Defense to create an executive agent role “for installation and operational nuclear energy.”",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MTQ=",
    "url": "https://www.theverge.com/report/847956/robot-crime-wave-europe-police-prediction",
    "title": "Europol imagines robot crime waves in 2035",
    "summary": "The report continues in an increasingly theoretical manner, suggesting that future robots are likely to give police a tough time.\nAs far-fetched as some of these predictions sound, Europol doesn’t think they’re that far off the mark with their vision for 2035.\nIt also “depends also on the market, the cost, the ability to produce en masse,” all of which could prevent the kind of robotic uptake imagined in Europol’s report.\nThat said, Masala says he agrees with the overall recommendations of Europol’s researchers.\n“I’m more concerned about police and intelligence agencies exploiting robot vulnerabilities than terrorists, especially given the ongoing authoritarian shifts across the world.”",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MTU=",
    "url": "https://www.yahoo.com/news/articles/russian-defense-firms-targeted-hackers-110543326.html",
    "title": "Russian defense firms targeted by hackers using AI, other tactics",
    "summary": "(Corrects spelling in story identifier to RUSSIA-CYBER/UKRAINE)By AJ VicensDec 19 (Reuters) - Russian technology companies working on air defense, sensitive electronics and other defense applications were targeted in recent weeks by a cyber espionage group using AI-generated decoy documents, according to ​a cybersecurity analyst.\nThe hacking campaign targeted several Russian companies, according to suspected AI-generated decoy documents discovered by Fishbein, who is the lead author of an ‍analysis prepared by Intezer.\nThe group's use of AI-generated decoy documents also demonstrates how \"accessible AI tools can be repurposed for malicious goals,\" Fishbein said.\nOthers, however, have suggested a link between the group and other ⁠known pro-Ukrainian hacking efforts.\nA September 2025 report published by Russian cybersecurity firm Kaspersky said Paper Werewolf has potential overlaps with Cloud Atlas, a pro-Ukrainian hacking group dating back more ‌than a decade.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MTY=",
    "url": "https://www.theverge.com/report/848205/nuclear-fusion-energy-trump-media-tae",
    "title": "Don’t expect Trump Media’s nuclear fusion power plant to generate electricity soon",
    "summary": "Trump Media — yup, the parent company of Truth Social — is the latest entrant in the near century-long race to develop a nuclear fusion power plant.\nGoogle and Microsoft have announced agreements to purchase electricity from fusion power plants that other companies plan to complete by the late 2020s or 2030s.\nThere are no utility scale nuclear fusion power plants yet, despite the rush of initiatives to design one that might actually work.\nHow do we know TAE and Trump Media can actually make fusion power plants a reality?\nA laser fusion power plant would likely need to achieve a gain of 50 to 100.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MTc=",
    "url": "https://www.businessinsider.com/nvidia-memo-capital-one-explores-aws-alternatives-ai-control-costs-2025-12",
    "title": "Capital One is wary about its rising Amazon cloud AI costs, Nvidia memo shows",
    "summary": "Capital One is concerned about AI costs rising via its cloud-computing relationship with Amazon and may be looking for alternatives, according to an internal Nvidia document obtained by Business Insider.\nNeoclouds are upstart cloud providers, often powered by Nvidia hardware, that focus on AI workloads, whereas AWS supports a much broader range of computing needs.\nCompanies are racing to adopt generative AI but also trying to mitigate rising cloud costs.\nForty-three percent of companies use more than two public cloud providers, according to a recent RBC Capital report.\nThe documents said that 90% of startups in Radical Ventures' portfolio were building primarily on rival clouds due to AWS costs.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MTg=",
    "url": "https://finance.yahoo.com/news/google-cloud-lands-deal-palo-130205661.html",
    "title": "Google Cloud lands deal with Palo Alto Networks 'approaching $10 billion,' per source",
    "summary": "The contract comprises a commitment by Palo Alto to pay a sum \"approaching $10 ‌billion\" to Google Cloud over several years, according to the person with direct knowledge of the matter.\n\"AI has spawned a tremendous amount of demand for security,\" said Matt Renner, chief revenue officer for Google Cloud.\nBoth Google and Palo Alto have invested heavily into security ⁠software as enterprises seek to adopt AI.\nPalo Alto launched AI-driven offerings in October and announced plans to buy software company Chronosphere for $3.35 billion last month.\nPalo Alto CEO Nikesh Arora was a longtime Google executive, serving ‌as its chief business officer until 2014.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MTk=",
    "url": "https://developers.slashdot.org/story/25/12/19/236259/stanford-computer-science-grads-find-their-degrees-no-longer-guarantee-jobs",
    "title": "Stanford Computer Science Grads Find Their Degrees No Longer Guarantee Jobs",
    "summary": "Want to read Slashdot from your mobile device?\nPoint it at m.slashdot.org and keep reading!",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MjA=",
    "url": "https://hbr.org/2025/12/ai-tools-make-coders-more-important-not-less",
    "title": "AI Tools Make Coders More Important, Not Less",
    "summary": "Of all the possible applications of generative AI, the value proposition of using it to write code was perhaps the clearest.\nCoding can be slow and it requires expertise, both of which can be expensive.\nMoreover, the promise that anyone who could describe their idea in plain text could create apps, features, or other value-adding products meant that innovation would no longer be limited to those with the skills to execute, but could be done by anyone with an idea.\nThe strength of this promise has created a $7.37 billion market for these tools.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MjE=",
    "url": "https://finance.yahoo.com/news/moore-threads-unveils-ai-chips-093000651.html",
    "title": "Moore Threads unveils new AI chips to challenge Nvidia",
    "summary": "Chinese chip designer Moore Threads Technology has unveiled a suite of new products, including its next generation of chip architecture and artificial intelligence chips as it looks to challenge US chip-making heavyweights Nvidia and AMD.\nThe launch marks Moore Threads' latest bid to challenge foreign rivals like Nvidia, and comes close on the heels of the company's blockbuster initial public offering on the Shanghai Stock Exchange on December 5.\nZhang Jianzhong, founder and CEO of Moore Threads, pictured in November 2023.\nPhoto: Handout alt=Zhang Jianzhong, founder and CEO of Moore Threads, pictured in November 2023.\nZhang, 59, an Nvidia veteran and former China market general manager who left to found Moore Threads in 2020, acknowledged that local AI developers had previously hesitated to use domestic chips to train their AI models, fearing subpar outcomes.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MjI=",
    "url": "https://tech.slashdot.org/story/25/12/19/1717228/uber-is-hiring-more-engineers-because-ai-is-making-them-more-valuable-ceo-says",
    "title": "Uber is Hiring More Engineers Because AI is Making Them More Valuable, CEO Says",
    "summary": "The amount of weight an evangelist carries with the almighty is measured in billigrahams.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MjM=",
    "url": "https://www.wired.com/story/uncanny-valley-podcast-wired-roundup-tech-politics-trends-2025/",
    "title": "WIRED Roundup: The 5 Tech and Politics Trends That Shaped 2025",
    "summary": "Articles mentioned in this episode:You can follow Zoë Schiffer on Bluesky at @zoeschiffer and Brian Barrett on Bluesky at @brbarrett.\nToday on the show, we're wrapping up our news episode series by reflecting on the trends and stories that shaped 2025.\nAnd who better to do that with than Brian Barrett, our executive editor who works tirelessly in the shadows?\nBrian Barrett: Zoë, thank you.\nBrian Barrett: What a year it's been, and I'm so excited for it to be almost over.",
    "category": "technology",
    "bias": "right",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MjQ=",
    "url": "https://www.wired.com/story/scammers-in-china-are-using-ai-generated-images-to-get-refunds/",
    "title": "Scammers in China Are Using AI-Generated Images to Get Refunds",
    "summary": "Online shopping platforms have long depended on photos submitted by customers to confirm that refund requests are legitimate.\n“This is a ceramic cup, not a cardboard cup.\nWho could tear apart a ceramic cup into layers like this?” the seller wrote.\nThe buyer even sent videos showing the dead crabs being poked by a human finger.\nThe case drew widespread attention on Chinese social media, in part because it was the first known AI refund scam of its kind to trigger a regulatory response.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MjU=",
    "url": "https://www.cnet.com/tech/computing/we-may-not-know-how-strong-ai-humanoid-robots-really-are/",
    "title": "We May Not Know How Strong AI Humanoid Robots Really Are",
    "summary": "First in the spotlight is the robotics company Figure AI, which is facing a lawsuit from former safety engineer Robert Gruendel.\nThe lawsuit alleges the company's Figure 02 humanoid was shown in tests to be strong enough to \"fracture a human skull,\" and that Gruendel was fired after raising concerns.\nA recent lawsuit alleges the Figure 02 humanoid showed in testing was strong enough to \"fracture a human skull.\"\nEngine AI's T800 humanoid robot squares up.\nTaken together, these two parallel news stories raise questions about what kind of information humanoid robot developers should share so that the risks of this technology are properly understood.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MjY=",
    "url": "https://www.businessinsider.com/former-tesla-waymo-employee-leadership-lessons-from-elon-musk-2025-12",
    "title": "I worked at Tesla and Waymo. Here are the leadership lessons I bring to my startup.",
    "summary": "My friends and family were telling me it was a big career mistake to work at Tesla.\nJust because it's a flat org structure, doesn't mean it's a horizontal power dynamic.\nIt's a very vertical org structure.\nEven though it's a very vertical org structure, it's a horizontal power structure.\nAt Tesla, it was very clear that Elon and his lieutenants were driving a lot of the decisions.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "Mjc=",
    "url": "https://www.androidcentral.com/apps-software/ai/gemini-can-now-tell-you-whether-a-video-was-generated-with-google-ai",
    "title": "Gemini can now tell you whether a video was generated with Google AI",
    "summary": "This tool can reveal whether a video was generated or modified with Google AI.\nStarting now, Gemini can verify the authenticity of videos using SynthID in the Gemini app.\nThis video checker can reveal if uploaded content was created or edited with Google AI in any way.\nGoogle says over 20 billion pieces of AI-generated content have been watermarked using SynthID, which digitally watermarks Google AI creations from Veo generations to AI edits in Google Photos.\nTo use the feature, upload a video to the Gemini app and ask a question like \"was this generated using Google AI?\"",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "Mjg=",
    "url": "https://www.androidcentral.com/phones/the-biggest-tech-stories-of-2025",
    "title": "From foldables to AI: How 2025 reshapes the smartphone landscape",
    "summary": "Trifold devices have arrived, ultra-thin designs are on the rise, and smart glasses are gaining popularity.\n(Image credit: Harish Jonnalagadda / Android Central)Essentially, making the form factor more valid and widely available to the broader smartphone market.\nTariffs, Tariffs and, more Tariffs(Image credit: Android Central)Well, all wasn't merry in the town of Tech.\nThat said, it created enough confusion for consumers and tech companies alike.\nGalaxy XR came built on Android XR, and with Google’s Gemini AI baked right in.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "MzM=",
    "url": "https://www.yahoo.com/news/articles/viewers-laugh-watching-test-run-131500076.html",
    "title": "Viewers laugh after watching test run of Japan's new high-speed train — here's what happened",
    "summary": "Reporters stood by waiting to catch a glimpse of Japan's fast high-speed train on the new Chuo Shinkansen rail line, and if any of them blinked, they missed it.\nAccording to SupercarBlondie, what the reporters witnessed was a test run for Japan's next-gen rail system, currently in development.\nThe railway will eventually connect from Tokyo to Osaka with a ride time of about an hour, compared to the roughly 2.5 hours it currently takes on conventional high-speed rail.\nThe top speed of a train on the Chuo Shinkansen line is 314 mph.\nAdvertisement AdvertisementAdvertisement AdvertisementWhen finished, the Chuo Shinkansen line will run about 286 kilometers (177 miles).",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "Mzc=",
    "url": "https://www.yahoo.com/news/articles/chinas-heat-pump-tech-tokyo-093000465.html",
    "title": "China's heat pump tech, Tokyo clarifies Taiwan stance to Beijing: SCMP's 7 highlights",
    "summary": "For over a century, the dream of efficiently concentrating low-grade heat into high-temperature industrial energy has been constrained by a stubborn ceiling: 200 degrees Celsius (392 degrees Fahrenheit).\nThis article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century.\nFor more SCMP stories, please explore the SCMP app or visit the SCMP's Facebook and Twitter pages.\nCopyright © 2025 South China Morning Post Publishers Ltd. All rights reserved.\nSouth China Morning Post Publishers Ltd. All rights reserved.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTI=",
    "url": "https://www.macrumors.com/2025/12/18/tiktok-sale-closing-january/",
    "title": "TikTok U.S. Sale to Oracle-Led Group Set to Close in January",
    "summary": "TikTok has agreed to sell its U.S. operations to an investment group that includes Oracle, Silver Lake, and UAE-based company MGX, reports Axios.\nThe \"TikTok USDS Joint Venture LLC\" that includes the three companies will own 45 percent of TikTok, while ByteDance will keep close to 20 percent.\nThe U.S. group will handle U.S. data protection and content moderation, while also maintaining algorithm security.\nWith the sale, TikTok will be able to continue operating in the United States while complying with the 2024 Protecting Americans From Foreign Adversary Controlled Applications Act.\nThe act required TikTok parent company ByteDance to sell TikTok's U.S. operations to a non-Chinese company or be banned from operating in the United States.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTM=",
    "url": "https://www.bbc.com/news/articles/cj4qpwprw9vo",
    "title": "Probe ongoing after UK government hacked, says minister",
    "summary": "Inquiry ongoing after UK government hacked, says minister3 days ago Share Save Sam Francis Political reporter Share SaveGetty ImagesCyber security officials have confirmed they are aiding an investigation after a minister said the UK government had been hacked.\nTrade Minister Sir Chris Bryant said earlier that investigations were \"ongoing\" after an attack in October.\nThe UK government has not named who it thinks is responsible, with a spokesperson saying it has been \"working to investigate\" the incident.\nLast year, responding to the UK government's National Security Strategy, a spokesperson for the Chinese embassy in London said \"accusations such as Chinese espionage, cyber-attacks, and transnational repression against the UK are entirely fabricated, malicious slander\".\nEarlier this month, Sir Keir said UK government policy towards China could not continue to blow \"hot and cold\".",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTU=",
    "url": "https://www.yahoo.com/news/articles/china-still-targeting-us-based-093000574.html",
    "title": "China still targeting US-based researchers for 'malign' purposes, lawmakers warned",
    "summary": "The comments came during a House science committee hearing focused on protecting US research from China.\nShe and other witnesses stressed that US agencies had responded to outreach efforts from China by tightening vetting procedures for foreign researchers, but warned against measures that could deter legitimate international cooperation.\nDaniel Evans, a senior research official at Nasa, said concerns about China's \"malign\" foreign talent recruitment programmes should not obscure the parallel challenge of retaining foreign-born researchers trained in the US.\nThis article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century.\nFor more SCMP stories, please explore the SCMP app or visit the SCMP's Facebook and Twitter pages.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  },
  {
    "id": "NTk=",
    "url": "https://www.theregister.com/2025/12/19/uk_foreign_office_hack/",
    "title": "Ministers confirm breach at UK Foreign Office",
    "summary": "The UK's Foreign Office is investigating a confirmed cyberattack it learned about in October, senior ministers say.\nThe tabloid claimed that Chinese state-sponsored attackers were behind the intrusion and stole details related to tens of thousands of visa applications.\nSir Chris told Sky News: \"We managed to close the hole, as it were, very quickly.\nOf the four major geopolitical adversaries, the UK has repeatedly singled out China as an \"epoch-defining challenge.\"\n\"China poses a genuine and increasing cyber risk to the UK,\" she said at the time.",
    "category": "technology",
    "bias": "right",
    "publishedAt": "2025-12-19T14:12:46Z",
    "source": "Al Jazeera English"
  }
]