[
  {
    "url": "https://www.theverge.com/report/847956/robot-crime-wave-europe-police-prediction",
    "title": "Europol imagines robot crime waves in 2035",
    "summary": "The report continues in an increasingly theoretical manner, suggesting that future robots are likely to give police a tough time.\nAs far-fetched as some of these predictions sound, Europol doesn’t think they’re that far off the mark with their vision for 2035.\nIt also “depends also on the market, the cost, the ability to produce en masse,” all of which could prevent the kind of robotic uptake imagined in Europol’s report.\nThat said, Masala says he agrees with the overall recommendations of Europol’s researchers.\n“I’m more concerned about police and intelligence agencies exploiting robot vulnerabilities than terrorists, especially given the ongoing authoritarian shifts across the world.”",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-12-19T15:16:27Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/news/847159/trump-media-tae-technologies-merger-nuclear-fusion",
    "title": "Trump Media is merging with a nuclear fusion company",
    "summary": "Trump Media, the company that runs social network Truth Social, is pivoting to nuclear fusion.\nIt has announced a merger with California-based fusion power company TAE Technologies and plans to start construction on a fusion power plant in 2026.\nTrump Media & Technology Group will become the holding company of the new organization, though shareholders from each company will own approximately half of the newly formed firm, which the companies say will be valued at more than $6 billion.\nPresident Trump previously owned a majority share in Trump Media, but transferred that to a trust managed by his son, Donald Trump Jr., before taking office in January.\nAs for Trump Media, it posted a loss of almost $55 million in Q3 2025, but has substantial digital assets after branching out into crypto this May.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-18T13:06:16Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/science/848445/nuclear-energy-ndaa-defense-bill",
    "title": "Next-generation nuclear reactors could get a boost from the National Defense Authorization Act",
    "summary": "President Trump signed the National Defense Authorization Act (NDAA) for Fiscal Year 2026 Thursday with measures that further the bipartisan push for next-generation nuclear power plants.\nThe Trump administration has embraced the technology as a new energy source for data centers demanding greater amounts of electricity for AI.\nMany Democrats, meanwhile, have championed smaller and ostensibly cheaper and easier-to-build nuclear reactors as a carbon pollution-free energy source that can help fight climate change.\nThe International Nuclear Energy Act establishes working groups and boosts funding and interagency cooperation on the development and export of US nuclear technologies.\nThe bill also directs the Department of Defense to create an executive agent role “for installation and operational nuclear energy.”",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-19T22:04:48Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.yahoo.com/news/articles/russian-defense-firms-targeted-hackers-110543326.html",
    "title": "Russian defense firms targeted by hackers using AI, other tactics",
    "summary": "(Corrects spelling in story identifier to RUSSIA-CYBER/UKRAINE)By AJ VicensDec 19 (Reuters) - Russian technology companies working on air defense, sensitive electronics and other defense applications were targeted in recent weeks by a cyber espionage group using AI-generated decoy documents, according to ​a cybersecurity analyst.\nThe hacking campaign targeted several Russian companies, according to suspected AI-generated decoy documents discovered by Fishbein, who is the lead author of an ‍analysis prepared by Intezer.\nThe group's use of AI-generated decoy documents also demonstrates how \"accessible AI tools can be repurposed for malicious goals,\" Fishbein said.\nOthers, however, have suggested a link between the group and other ⁠known pro-Ukrainian hacking efforts.\nA September 2025 report published by Russian cybersecurity firm Kaspersky said Paper Werewolf has potential overlaps with Cloud Atlas, a pro-Ukrainian hacking group dating back more ‌than a decade.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-19T11:05:43Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.theverge.com/report/848205/nuclear-fusion-energy-trump-media-tae",
    "title": "Don’t expect Trump Media’s nuclear fusion power plant to generate electricity soon",
    "summary": "Trump Media — yup, the parent company of Truth Social — is the latest entrant in the near century-long race to develop a nuclear fusion power plant.\nGoogle and Microsoft have announced agreements to purchase electricity from fusion power plants that other companies plan to complete by the late 2020s or 2030s.\nThere are no utility scale nuclear fusion power plants yet, despite the rush of initiatives to design one that might actually work.\nHow do we know TAE and Trump Media can actually make fusion power plants a reality?\nA laser fusion power plant would likely need to achieve a gain of 50 to 100.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-19T18:05:38Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.wired.com/story/the-ultra-realistic-ai-face-swapping-platform-driving-romance-scams/",
    "title": "The Ultra-Realistic AI Face Swapping Platform Driving Romance Scams",
    "summary": "The Chinese-language artificial intelligence app Haotian is so effective that it’s made millions of dollars selling its face-swapping technology on Telegram.\nAnd as face swapping and other video deepfake tools have become more widely available, they have increasingly been incorporated into scamming and other types of cybercrime around the world.\nHaotian has a website for its face-swapping tool, but it primarily promotes its desktop app via a public Telegram channel, which launched in October 2023 according to Ngo’s research.\nHowever, after WIRED got in touch with the company, the main public Haotian Telegram channel and some associated accounts became inaccessible or appeared to have been deleted.\nTelegram did not return a request for comment on whether the company took these accounts down.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-18T17:45:46Z",
    "source": "Wired"
  },
  {
    "url": "https://www.businessinsider.com/nvidia-memo-capital-one-explores-aws-alternatives-ai-control-costs-2025-12",
    "title": "Capital One is wary about its rising Amazon cloud AI costs, Nvidia memo shows",
    "summary": "Capital One is concerned about AI costs rising via its cloud-computing relationship with Amazon and may be looking for alternatives, according to an internal Nvidia document obtained by Business Insider.\nNeoclouds are upstart cloud providers, often powered by Nvidia hardware, that focus on AI workloads, whereas AWS supports a much broader range of computing needs.\nCompanies are racing to adopt generative AI but also trying to mitigate rising cloud costs.\nForty-three percent of companies use more than two public cloud providers, according to a recent RBC Capital report.\nThe documents said that 90% of startups in Radical Ventures' portfolio were building primarily on rival clouds due to AWS costs.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-12-19T10:00:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/pitch-deck-humanz-raises-millions-influencer-creator-marketing-merger-acquisitions-2025-12",
    "title": "This influencer marketing company raised $15 million to fuel an M&A spree. Read its pitch deck.",
    "summary": "Impact LinkAdvertising giants like Publicis, WPP, and Omnicom aren't the only companies deploying roll-up strategies and shaking up influencer marketing.\nIn 2025, the company acquired two influencer marketing companies: Bambassadors, a user-generated content marketplace, and Ubiquitous, an influencer marketing agency.\n\"Imagine a company great in influencer marketing on LinkedIn for B2B, or a tech company only doing creator payments.\nHe said that one reason Humanz sought to acquire Ubiquitous was that it's listed as a top influencer marketing company when prompting ChatGPT.\nHumanz raised $8 million from debt providers Viola Credit and Mizrahi Bank as part of its $15 million round, which will help finance its acquisitions.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-12-18T14:00:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/column/843418/humanoid-robot-hype",
    "title": "Humanoid robots are coming. Eventually?",
    "summary": "How it’s goingThere’s definitely a gold rush of sorts for humanoid robots right now.\nIf you go by the demos China and everyone else is pumping out, you’d be forgiven for thinking the humanoid robot future has already arrived.\nThis summer, robots competed in dance, combat, track, and field events at the first World Humanoid Robot Games in China.\n1X debuted Neo, which it claims is safe and “the world’s first consumer-ready humanoid robot.” There are also videos of Neo shakily completing basic household tasks.\nMaybe the robots are finally coming, or maybe I have many more fail videos coming my way.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-21T13:07:19Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/transportation/846783/rivian-ai-autonomy-day-self-driving-lidar-chip-tesla",
    "title": "Rivian’s AI pivot is about more than chasing Tesla",
    "summary": "Advances in transformer-based encoding and large-parameter models prompted a fundamental shift in Rivian’s thinking of the “physical AI” of autonomous driving, he says.\nThe company’s “AI and Autonomy Day” is set up like a Silicon Valley high school science fair.\nRivian’s Autonomy Plus package will be available free to all customers until March 2026.\nDuring the presentation, James Philbin, Rivian’s vice president for autonomy and AI, shows a side-by-side visual comparison of Rivian’s autonomy software identifying and interpreting objects ahead using only its cameras; cameras and radar; and the trifecta of cameras, radar, and lidar.\n“Beyond the technology, but actually, like, the business systems that need to be designed.”Rivian’s RAP1 chip, or the first-generation Rivian Autonomy Processor.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-19T17:03:01Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/news/847344/micron-ram-memory-shortage-2026-earnings",
    "title": "Micron says memory shortage will ‘persist’ beyond 2026",
    "summary": "Micron, one of the three biggest memory suppliers in the world, forecasts rough months ahead for the global RAM supply.\nAs part of its earnings report released on Wednesday, Micron CEO Sanjay Mehrotra said “tight industry conditions” across DRAM and NAND flash memory are expected to “persist through and beyond” 2026 as AI drives up demand.\nMicron aims to ramp up production and expects to increase its shipments of DRAM and NAND flash memory by 20 percent next year, but that still isn’t enough to keep up.\n“Despite significant efforts, we are disappointed to be unable to meet demand from other customers across all market segments,” Mehrotra said.\nMicron also expects to start production at a new manufacturing facility in Idaho in 2027, followed by a new plant in New York in 2030.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-18T15:14:24Z",
    "source": "The Verge"
  },
  {
    "url": "https://finance.yahoo.com/news/google-cloud-lands-deal-palo-130205661.html",
    "title": "Google Cloud lands deal with Palo Alto Networks 'approaching $10 billion,' per source",
    "summary": "The contract comprises a commitment by Palo Alto to pay a sum \"approaching $10 ‌billion\" to Google Cloud over several years, according to the person with direct knowledge of the matter.\n\"AI has spawned a tremendous amount of demand for security,\" said Matt Renner, chief revenue officer for Google Cloud.\nBoth Google and Palo Alto have invested heavily into security ⁠software as enterprises seek to adopt AI.\nPalo Alto launched AI-driven offerings in October and announced plans to buy software company Chronosphere for $3.35 billion last month.\nPalo Alto CEO Nikesh Arora was a longtime Google executive, serving ‌as its chief business officer until 2014.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-19T13:02:05Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://www.bbc.com/news/articles/c0r9280gvelo",
    "title": "AI likely to displace jobs, says Bank of England governor",
    "summary": "AI likely to displace jobs, says Bank of England governorHowever, he warned that there was an issue with younger, inexperienced professionals finding it difficult to secure entry-level roles due to AI.\nAndrew Bailey said the UK needed to have the \"training, education, [and] skills in place\" so workers could shift into jobs that use AI.\nThe widespread adoption of artificial intelligence (AI) is likely to displace people from jobs in a similar way seen during the Industrial Revolution, the governor of the Bank of England has said.\nEntry-level professional jobs are thought to be most impacted by AI, particularly in sectors such as law, accountancy and administration.\nMr Bailey said AI was the \"most likely source of the next leg up\" for UK economic growth.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-12-19T06:00:08Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.windowscentral.com/artificial-intelligence/microsoft-copilot/ai-isnt-optional-at-microsoft-but-almost-no-one-is-using-copilot",
    "title": "Satya Nadella says Microsoft execs must embrace AI",
    "summary": "Bill Gates, Steve Ballmer, and Satya Nadella.\nHowever, Microsoft executives are having a rough time adjusting to the new reality.\nSatya Nadella on stage.\nSatya Nadella reportedly launched a weekly AI accelerator meeting and a dedicated Teams channel to help bolster and accelerate the company’s AI efforts.\nCoincidentally, a separate report from last year highlighted Microsoft insiders' doubts about the company's AI strategy and its perceived fixation on the technology.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-18T12:30:00Z",
    "source": "Windows Central"
  },
  {
    "url": "https://developers.slashdot.org/story/25/12/19/236259/stanford-computer-science-grads-find-their-degrees-no-longer-guarantee-jobs",
    "title": "Stanford Computer Science Grads Find Their Degrees No Longer Guarantee Jobs",
    "summary": "\"It is better for civilization to be going down the drain than to be coming up it.\"\n-- Henry Allen",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-20T01:00:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://www.wired.com/story/jbl-flip-7-deal-december-2025/",
    "title": "The Best Bluetooth Speaker Is $50 Off Right in Time for Christmas",
    "summary": "The audio-visual experts on the WIRED Reviews team have tested hundreds of Bluetooth speakers, going all the way back to 2017.\nThere are plenty of Bluetooth speakers worth recommending, but the JBL Flip 7 is our very favorite for most people.\nRight now, it's on sale for $100—a $50 discount—in every single color (there are nine options in total).\nThat discount reflects the best price we've tracked.\nGet the Best Price on the Best Bluetooth SpeakerNo Bluetooth speaker is going to be completely perfect for everyone, but we think the JBL Flip 7 strikes the best balance between portability and sound quality that'll be pleasing to most listeners living most lifestyles.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-19T17:18:22Z",
    "source": "Wired"
  },
  {
    "url": "https://www.theverge.com/news/847454/kia-boyz-settlement-kia-hyundai-fix-ignition-cylinder",
    "title": "Kia and Hyundai will spend millions fixing old cars to stop ‘Kia Boyz’ thefts",
    "summary": "is a NYC-based AI reporter and is currently supported by the Tarbell Center for AI Journalism.\nKia and Hyundai will offer free repairs for millions of cars that lack anti-theft technology as part of a settlement with dozens of US states.\nThe repairs could cost up to $500 million, in addition to several million in restitution to Hyundai and Kia owners whose cars were damaged by thieves, the Associated Press reports.\nThe lack of an immobilizer, a relatively standard piece of tech in other cars, is why theft of Kia and Hyundai cars became so popular.\nVideos explaining how to steal Kia and Hyundai cars with a USB cable jammed into the ignition cylinder flooded social media platforms, as the so-called “Kia Challenge” led to a spike in thefts, and even fatal crashes.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-12-18T16:44:03Z",
    "source": "The Verge"
  },
  {
    "url": "https://hbr.org/2025/12/ai-tools-make-coders-more-important-not-less",
    "title": "AI Tools Make Coders More Important, Not Less",
    "summary": "Of all the possible applications of generative AI, the value proposition of using it to write code was perhaps the clearest.\nCoding can be slow and it requires expertise, both of which can be expensive.\nMoreover, the promise that anyone who could describe their idea in plain text could create apps, features, or other value-adding products meant that innovation would no longer be limited to those with the skills to execute, but could be done by anyone with an idea.\nThe strength of this promise has created a $7.37 billion market for these tools.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-12-19T14:00:00Z",
    "source": "Harvard Business Review"
  },
  {
    "url": "https://finance.yahoo.com/news/moore-threads-unveils-ai-chips-093000651.html",
    "title": "Moore Threads unveils new AI chips to challenge Nvidia",
    "summary": "Chinese chip designer Moore Threads Technology has unveiled a suite of new products, including its next generation of chip architecture and artificial intelligence chips as it looks to challenge US chip-making heavyweights Nvidia and AMD.\nThe launch marks Moore Threads' latest bid to challenge foreign rivals like Nvidia, and comes close on the heels of the company's blockbuster initial public offering on the Shanghai Stock Exchange on December 5.\nZhang Jianzhong, founder and CEO of Moore Threads, pictured in November 2023.\nPhoto: Handout alt=Zhang Jianzhong, founder and CEO of Moore Threads, pictured in November 2023.\nZhang, 59, an Nvidia veteran and former China market general manager who left to found Moore Threads in 2020, acknowledged that local AI developers had previously hesitated to use domestic chips to train their AI models, fearing subpar outcomes.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-12-21T09:30:00Z",
    "source": "Yahoo Entertainment"
  },
  {
    "url": "https://tech.yahoo.com/home/articles/magic-balls-installed-drones-could-003000034.html",
    "title": "'Magic balls' installed by drones could conquer US market thanks to game-changing performance: 'It's never been like this'",
    "summary": "If you're curious about solar options for your home, check out TCD's Solar Explorer to connect with vetted installers and save up to $10,000 on installations by curating competitive bids.\nThe Solar Explorer also includes $0-down subscription options that can lower your utility rates by as much as 20%.\nOne popular option is Palmetto's LightReach program, which lets you lease solar panels with locked-in low energy rates.\nAnother great Solar Explorer partner, EnergySage, helps homeowners find the best solar installation solutions and understand money-saving incentives.\nAre you able to install solar panels where you live?",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-12-18T00:30:00Z",
    "source": "Yahoo Entertainment"
  }
]