[
  {
    "url": "https://www.theverge.com/report/810083/ai-browser-cybersecurity-problems",
    "title": "AI browsers are a cybersecurity time bomb",
    "summary": "Flaws discovered in Comet could allow attackers to hijack the browser’s AI with hidden instructions.\nWith AI browsers, the threats are numerous.\nWith AI browsers, “the biggest immediate threat is the market rush,” Haddadi says.\n“These agentic browsers have not been thoroughly tested and validated.”But AI browsers’ defining feature, AI, is where the worst threats are brewing.\nFor some threats, experts say the only real way to keep safe using AI browsers is to simply avoid the marquee features entirely.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2025-10-30T15:53:23Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/sequoia-partner-ai-gold-rush-experimental-revenue-alfred-lin-2025-10",
    "title": "A Sequoia partner says a lot of the AI industry's revenue is 'experimental'",
    "summary": "Sequoia partner Alfred Lin says the AI boom could be fueled by \"experimental revenue\" that might not last.\nSequoia partner Alfred Lin says the AI boom could be fueled by \"experimental revenue\" that might not last.\nBig Event Media/Getty Images for HumanX ConferenceSequoia partner Alfred Lin says the AI boom could be fueled by \"experimental revenue\" that might not last.\nImpact LinkWhile AI startups are riding a wave of record valuations, a Sequoia Capital partner said investors should examine the numbers more closely.\n\"A lot of founders know it's a joke, but they don't have any problems just taking whatever month's revenue is, that's all pilot revenue, and multiplying by 12,\" he said.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-29T06:33:51Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.bbc.com/news/articles/cq6z8r7n6d1o",
    "title": "NHS to offer same-day prostate cancer diagnosis",
    "summary": "NHS to offer same-day prostate cancer diagnosisAround one in eight men will develop prostate cancer in their lives, according to Prostate Cancer UK, with research showing it has overtaken breast cancer as the most commonly diagnosed form of the disease in the UK.\nMen with suspected prostate cancer will be able to get a diagnosis from the NHS within a day, under a new trial hailed as a potential \"game changer\" for identifying and treating the disease.\nBut unlike breast cancer, there is currently no national screening programme for prostate cancer.\nAccording to the National Prostate Cancer Audit, 58,218 men were diagnosed with prostate cancer in England in 2024 - with a rise of more than 5000 diagnoses from the year prior.\nThe announcement of the trial precedes the release of the government's National Cancer Plan, expected later this year.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-28T05:53:30Z",
    "source": "BBC News"
  },
  {
    "url": "https://www.theverge.com/news/809349/meta-mark-zuckerberg-ai-social-feeds-q3-2025-earnings",
    "title": "Mark Zuckerberg is excited to add more AI content to all your social feeds",
    "summary": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more.\nMeta CEO Mark Zuckerberg is getting ready to dump even more AI-generated posts into your social feeds.\n“Social media has gone through two eras so far,” Zuckerberg said.\nThe second was when we added all of the Creator content.” Though Zuckerberg stops short of calling AI the third era of social media, it’s clear that the technology will be heavily involved in what comes next.\n“I think that Vibes is an example of a new content type enabled by AI, and I think that there are more opportunities to build many more novel types of content ahead,” Zuckerberg added.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-10-29T21:41:31Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/palantir-lawsuit-employees-ai-startup-general-catalyst-2025-10",
    "title": "Palantir sues ex-engineers at new AI startup backed by General Catalyst, claiming they stole its 'crown jewels'",
    "summary": "Palantir Technologies has its claws out for a new startup on the block.\nGeneral Catalyst, a venture capital firm with IPO ambitions that recently bought a hospital chain, launched the company in early October.\nIn a Federal lawsuit, Palantir claims the two ex-engineers \"exploited their prior access of Palantir's confidential information, proprietary methodologies, and customer relationships to the benefit of a copycat 'version' of Palantir.\"\nPalantir alleges it hadn't known where either former employee was working until General Catalyst announced Percepta's launch.\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to knowGeneral Catalyst, one of Silicon Valley's most formidable venture capital firms, has been laying the groundwork to potentially become one of the first VCs to go public, Business Insider reported in May.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-30T21:05:33Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/openai-anthropic-perplexity-expand-india-next-billion-ai-users-2025-10",
    "title": "OpenAI, Anthropic, Perplexity Expand in India for Next Billion Users",
    "summary": "In recent months, American AI companies, such as OpenAI and Perplexity, have also steadily expanded their footprint in India, the world's largest open internet market outside the US.\nFor the big AI companies, however, \"India is not the 'next billion users' market.\nBy the time Anadan left Google in 2019, he said that India was the single largest market for all the company's largest products.\nIndia's AI infrastructureWestern tech companies are also racing to build the infrastructure needed to power AI in India.\nAs AI companies scale up in India, they're bringing new forms of risk with them.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-10-29T09:00:01Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.businessinsider.com/amazon-layoffs-hit-mgm-studios-jobs-cut-gen-ai-2025-10",
    "title": "Amazon's TV and movie arm was hit during the company's broad layoffs. Here's what we know.",
    "summary": "Amazon MGM Studios, the company's TV and movie arm, was hit during the broader company layoffs announced Tuesday.\nAmong the big names affected at Amazon MGM Studios were Donna Rosenstein, who was head of series casting; and Genna Terranova, head of global programming for MGM Studios and Prime Video.\nAlso cut were drama series exec Meggie Choi and creative exec Nathan Kitada.\nOthers impacted included Liz Cohen, a senior creative exec for overall deals; Christina Pope, a creative exec working in comedy/drama; and Sahhara Assafiri, a creative exec on tentpoles.\nAs part of Amazon's AI efforts, it has begun to leverage the tech across its entertainment arm, which is led by Mike Hopkins.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-28T21:51:39Z",
    "source": "Business Insider"
  },
  {
    "url": "https://slashdot.org/story/25/10/30/1942215/ai-cheating-app-founder-says-engineers-cant-make-good-viral-content-and-thats-why-their-startups-flop",
    "title": "AI 'Cheating' App Founder Says Engineers Can't Make Good, Viral Content and That's Why Their Startups Flop",
    "summary": "\"Little prigs and three-quarter madmen may have the conceit that the laws of nature are constantly broken for their sakes.\"\n-- Friedrich Nietzsche",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-10-30T20:41:00Z",
    "source": "Slashdot.org"
  },
  {
    "url": "https://www.businessinsider.com/servicenow-ceo-bill-mc-dermott-ai-reorienting-global-economy-2025-10",
    "title": "ServiceNow CEO says AI is reorienting the global economy",
    "summary": "Impact LinkAI is reorienting the global economy in radical ways, and the effects are spreading from consumers to companies, says Bill McDermott, CEO of ServiceNow, an enterprise software giant.\nWe spoke about AI disruptions to the job market, the AI spending boom, and the threat of generative AI to the software industry.\nServiceNow's hiring plansFor ServiceNow itself, the CEO said generative AI is encouraging the company to hire more in certain areas, while re-skilling existing staff.\nServiceNow also highlighted the success of its new AI Experience interface and the Zurich product for building scalable AI systems.\nThe company's investments in AI innovation and partnerships, spanning Nvidia, FedEx, and government agencies, show deepening integration of AI into enterprise workflows.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-29T20:19:37Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/news/807867/adobe-max-2025-all-the-latest-announcements",
    "title": "Adobe Max 2025: all the latest creative tools and AI announcements",
    "summary": "Adobe has kicked off its annual Max design conference, where it’ll be giving us a first glimpse at the latest updates coming to its Creative Cloud apps and Firefly AI models.\nThe creative software giant is launching new generative AI tools that make digital voiceovers and custom soundtracks for videos, and adding AI assistants to Express and Photoshop for web that edit entire projects using descriptive prompts.\nAnd that’s just the start, because Adobe is planning to eventually bring AI assistants to all of its design apps.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-10-28T13:16:17Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/news/809882/universal-music-udio-settlement",
    "title": "Universal partners with AI startup Udio after settling copyright suit",
    "summary": "is a London-based reporter at The Verge covering all things AI and Senior Tarbell Fellow.\nUniversal Music Group says it has made “industry-first strategic agreements” to “settle copyright infringement litigation” with AI startup Udio and license music for a new AI-powered music platform.\nThe deal includes some form of compensation and “will provide further revenue opportunities for UMG artists and songwriters,” Universal says.\nUdio, the company behind “BBL Drizzy,” will launch the platform as a subscription service next year.\nUniversal, alongside other industry giants Sony and Warner, sued Udio and another startup Suno for “en masse” copyright infringement last year.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-10-30T13:02:23Z",
    "source": "The Verge"
  },
  {
    "url": "https://hbr.org/2025/10/why-ai-at-work-makes-us-so-anxious",
    "title": "Why AI at Work Makes Us So Anxious",
    "summary": "If 21st-century capitalism has one central tenet, it’s that innovation rules and disruption drives progress.\nYes, innovation is amazing—and it’s also stressful.\nThe act of disruption inherently creates anxiety because it asks us to change abruptly and dive into the unknown.",
    "category": "technology",
    "bias": "right",
    "publishedAt": "2025-10-28T12:05:44Z",
    "source": "Harvard Business Review"
  },
  {
    "url": "https://www.businessinsider.com/palantir-shyam-sankar-skeptical-ai-jobs-2025-10",
    "title": "Palantir CTO says AI doomerism is driven by a lack of religion",
    "summary": "\"I think the secularists in Silicon Valley are filling the God-shaped hole in their heart,\" Sankar said in an interview.\n\"I think the secularists in Silicon Valley are filling the God-shaped hole in their heart,\" Sankar said in an interview.\nDominic Gwinn / Middle East Images via AFP\"I think the secularists in Silicon Valley are filling the God-shaped hole in their heart,\" Sankar said in an interview.\n\"Doomerism\" refers to the idea that AI will cause a catastrophic scenario, such as mass unemployment or extinction.\n\"They are sitting in Silicon Valley, building these models, spending no time on the front lines of how are people using this,\" Sankar said.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-10-30T16:18:04Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.wired.com/story/adobe-max-2025-firefly-photoshop-updates/",
    "title": "Adobe Now Lets You Generate Soundtracks and Speech in Firefly",
    "summary": "Custom Models in Adobe FireflyAdobe's new darling app is Firefly, which launched in 2023 and offers the ability to create images and videos through generative AI.\nFirst, the company says it's opening up support for custom models, allowing creatives to train their own AI models to create specific characters and tones.\nBusinesses have been able to leverage custom models in Firefly for some time, but Adobe is rolling out the feature to individual customers.\nThe basis of the model remains Adobe’s own Firefly model, which means it’s trained on proprietary data and commercially safe to use.\nCustom models will roll out at the end of the year, and you can join a waiting list in November for early access.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2025-10-28T12:00:00Z",
    "source": "Wired"
  },
  {
    "url": "https://www.wired.com/story/greenhouse-gas-protocol-caught-in-big-techs-friendly-fire/",
    "title": "A Fight Over Big Tech’s Emissions Has the Greenhouse Gas Protocol Caught in the Crossfire",
    "summary": "Last week’s request for public comment from the Greenhouse Gas Protocol (GHGP) doesn’t look like a major win for a tech giant to the naked eye.\nBut for Google and Microsoft, the announcement constitutes a considerable win in their years-long battle against their competitors over how to account for the carbon emissions of data centers and, by extension, AI.\nOut of ScopeScope 2 is a subcategory used by the GHGP to account for a company’s indirect emissions from purchased electricity, steam, heat, or cooling.\nFor tech giants, Scope 2 emissions have surged as AI has driven massive growth in data center energy use.\nAs these loads have grown, so too has the pressure to find a new way to account for them.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-30T10:31:37Z",
    "source": "Wired"
  },
  {
    "url": "https://www.theverge.com/ai-artificial-intelligence/808081/character-ai-under-18-chat-ban",
    "title": "Character.AI is banning minors from AI character chats",
    "summary": "Character.AI is gradually shutting down chats for people under 18 and rolling out new ways to figure out if users are adults.\nCharacter.AI is banning minors from chatting with AI characters.\nOther AI companies have recently imposed restrictions on teen users, like Meta, which changed its policies after Reuters reported on internal rules allowing AI chatbots to talk to minors in sensual ways.\nNow, Character.AI is also founding and bankrolling, at least initially, an independent nonprofit called the AI Safety Lab.\nThe organization will focus on issues related to the AI entertainment industry, which, Anand said, encounters different problems than other AI sectors.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2025-10-29T12:21:02Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.theverge.com/news/808589/senators-ai-chatbot-bill-age-verification-teen-ban",
    "title": "Senators propose banning teens from using AI chatbots",
    "summary": "A new piece of legislation could require AI companies to verify the ages of everyone who uses their chatbots.\nJosh Hawley (R-MO) and Richard Blumenthal (D-CT) introduced the GUARD Act on Tuesday, which would also ban everyone under 18 from accessing AI chatbots, as reported earlier by NBC News.\nThe bill comes just weeks after safety advocates and parents attended a Senate hearing to call attention to the impact of AI chatbots on kids.\nAI chatbots would be required to disclose that they aren’t human at 30-minute intervals under the bill.\nThey would also have to include safeguards that prevent them from claiming that they are a human, similar to an AI safety bill recently passed in California.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-10-28T22:42:04Z",
    "source": "The Verge"
  },
  {
    "url": "https://www.businessinsider.com/mercor-pays-million-per-day-human-contractors-training-ai-ceo-2025-10",
    "title": "Mercor pays over $1.5 million a day to humans training AI, says its CEO",
    "summary": "Taylor Hill/FilmMagic/Getty ImagesBrendan Foody, the CEO of Mercor, said an IPO could be on the horizon.\nBrendan Foody, the CEO and cofounder of Mercor, said the company is paying over $1.5 million daily to contractors who are training AI.\nIn a blog post about the latest funding round, Foody described humans training AI as a \"new category of work.\"\nTraining AI chatbots is tech's new gold rushTech's latest gold rush is getting humans to train AI chatbots.\nIn a report published last month, Business Insider spoke with more than 60 data labelers worldwide.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-10-28T06:54:44Z",
    "source": "Business Insider"
  },
  {
    "url": "https://www.theverge.com/news/808472/grammarly-superhuman-ai-rebrand-relaunch",
    "title": "Grammarly is changing its name to Superhuman",
    "summary": "AI writing aid Grammarly is now part of Superhuman, alongside Coda, Superhuman Mail, and a new AI assistant called Superhuman Go.\nThe new Superhuman suite, including all those tools, will be available starting today for everyone with a paid Grammarly Pro subscription.\nGrammarly is adopting its new name from AI email app Superhuman Mail, which Grammarly acquired in June, following its December 2024 acquisition of Coda, a collaborative workspace app.\nBut the reality is, the Grammarly brand isn’t going anywhere,” Noam Lovinsky, chief product officer at Superhuman, said in an interview with The Verge.\nA core part of Superhuman is its AI assistant, Superhuman Go, which is effectively Grammarly’s existing generative AI assistant with a fresh coat of paint and more features.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-10-29T12:33:52Z",
    "source": "The Verge"
  },
  {
    "url": "https://slashdot.org/story/25/10/28/149254/openai-finalizes-corporate-restructuring-gives-microsoft-27-stake-and-technology-access-until-2032",
    "title": "OpenAI Finalizes Corporate Restructuring, Gives Microsoft 27% Stake and Technology Access Until 2032",
    "summary": "\"Little prigs and three-quarter madmen may have the conceit that the laws of nature are constantly broken for their sakes.\"\n-- Friedrich Nietzsche",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2025-10-28T14:41:00Z",
    "source": "Slashdot.org"
  }
]