[
  {
    "id": "Mw==",
    "url": "https://finance.yahoo.com/news/godfather-ai-says-technology-create-184754671.html",
    "title": "‘Godfather of AI’ says the technology will create massive unemployment and send profits soaring — ‘that is the capitalist system’",
    "summary": "Pioneering computer scientist Geoffrey Hinton, whose work has earned him a Nobel Prize and the moniker “godfather of AI,” said artificial intelligence will spark a surge in unemployment and profits.\n“What’s actually going to happen is rich people are going to use AI to replace workers,” Hinton said in September.\n“It’s going to create massive unemployment and a huge rise in profits.\nHinton said earlier healthcare is the one industry that will be safe from the potential jobs armageddon.\nHinton has long warned about the dangers of AI without guardrails, estimating a 10% to 20% chance of the technology wiping out humans after the development of superintelligence.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-12T18:47:54Z",
    "source": "Yahoo Entertainment"
  },
  {
    "id": "NA==",
    "url": "https://slashdot.org/story/26/01/12/2324253/european-firms-hit-hiring-brakes-over-ai-and-slowing-growth",
    "title": "European Firms Hit Hiring Brakes Over AI and Slowing Growth",
    "summary": "The nicest thing about the Alto is that it doesn't run faster at night.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-13T02:10:00Z",
    "source": "Slashdot.org"
  },
  {
    "id": "MTM=",
    "url": "https://www.theverge.com/ai-artificial-intelligence/860989/apple-google-gemini-siri-ai-deal-what-it-means",
    "title": "What Apple and Google’s Gemini deal means for both companies",
    "summary": "For years, Apple and Google have had a will-they-won’t-they type of relationship, as far as which AI company Apple would pick to underpin its Siri virtual assistant and give it new AI-fueled personalization and agentic capabilities.\nApple has spent the last year or two playing the field, reportedly considering working with OpenAI or Anthropic to support the new Siri.\n“After careful evaluation, Apple determined that Google’s Al technology provides the most capable foundation for Apple Foundation Models and is excited about the innovative new experiences it will unlock for Apple users,” Google and Apple wrote in a joint statement.\nOn the surface, Apple and Google might appear to be rival tech giants, but the two companies have had a close, complex relationship for more than a decade.\nApple’s initial statement indicates that they will use Google’s technology as more of a white-labeled technology stack that they will customize and deploy as an Apple service.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-13T14:33:06Z",
    "source": "The Verge"
  },
  {
    "id": "MTQ=",
    "url": "https://www.macrumors.com/2026/01/13/apple-patents-declined-in-2025/",
    "title": "Apple's Patent Grants Declined in 2025 as Innovation Slows",
    "summary": "Apple's U.S. patent activity declined sharply in 2025 amid a broader slowdown in patent filings, according to newly released data from IFI CLAIMS Patent Services.\nTotal U.S. patent grants in 2025 fell to 323,272, a decline of less than 1% from the previous year, while U.S. patent applications dropped more steeply, falling 9% to 393,344.\nApple's decline occurred as several competitors either held steady or increased their patent output.\nSamsung retained the top position for the fourth consecutive year with 7,054 U.S. patent grants, accounting for more than 2% of all patents issued in the United States in 2025.\nApple chip supplier Taiwan Semiconductor Manufacturing Company (TSMC) ranked second with 4,194 grants, followed by Qualcomm in third place with 3,749.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-13T10:00:00Z",
    "source": "MacRumors"
  },
  {
    "id": "MTU=",
    "url": "https://www.theverge.com/podcast/861148/lego-smart-brick-claude-code-vergecast",
    "title": "How Lego’s Smart Brick works",
    "summary": "The most interesting story at this year’s CES was just a little tiny bundle of technology.\nOne way to look at Lego’s new Smart Brick is as something like a Raspberry Pi, an endlessly remixable gizmo with infinite hacking potential — it can be anything, in the best possible way.\nOn this episode of The Vergecast, The Verge’s Sean Hollister explains how the Smart Brick works and why this tiny square feels so complicated.\nHe explains why Lego might want to make the Smart Brick an open platform and all the reasons it might not to do so.\nIf you want to know more about everything we discuss in this episode, here are some links to get you started:",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-01-13T14:06:13Z",
    "source": "The Verge"
  },
  {
    "id": "MTY=",
    "url": "https://www.theverge.com/news/860446/google-ai-shopping-standard-buy-button-gemini",
    "title": "Google brings buy buttons to Gemini and AI search",
    "summary": "In other words, it sets up a common language for agents — AI tools capable of acting independently — and online shopping systems.\nUCP is open-source, meaning companies can freely use it rather than having to develop their own tools to deal with AI agents.\nMany of these partners are likely to — or already — partner with other AI companies as well.\nShopify merchants, for example, can sell in AI modes on Gemini, ChatGPT, and Microsoft Copilot, and PayPal has also partnered with OpenAI.\nAs well as the buy button on Gemini and the UCP standard, Google also said it is launching a business agent on Monday that will allow shoppers to chat with brands directly on Search.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-12T12:44:24Z",
    "source": "The Verge"
  },
  {
    "id": "MTc=",
    "url": "https://www.androidcentral.com/phones/google-pixel/apple-chooses-googles-gemini-to-transform-siri-starting-this-year",
    "title": "Apple partners with Google for Gemini: What this means for users",
    "summary": "What you need to knowApple and Google collaborate to integrate Gemini into Apple's next-gen devices for enhanced AI features.\nApple retains user privacy while leveraging Google’s AI technology for innovative advancements.\nAfter what is described as \"careful evaluation,\" Apple decided that \"Google's AI technology provides the most capable foundation, and is excited about the innovative new experiences it will unlock for Apple users.\"\nThat partnership gave Apple a fast way to catch up with GenAI; however, ChatGPT didn't become the foundation of Apple's devices.\nThings look different for Gemini as it now sits at the very core of Apple's AI strategy.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-12T17:22:38Z",
    "source": "Android Central"
  },
  {
    "id": "MTg=",
    "url": "https://www.businessinsider.com/sandstone-raises-seed-funding-sequoia-legal-ai-2026-1",
    "title": "Ex-McKinsey Founder Wins Sequoia Funds for Legal AI Startup, Sandstone",
    "summary": "His startup, Sandstone, is aimed squarely at in-house legal teams instead of law firms, and Sequoia Capital is backing the idea.\nThe Brooklyn-based startup has raised $10 million in a seed funding round led by Sequoia Capital, Business Insider has learned.\nSandstone uses AI to help lawyers inside companies draft and review contracts based on how they've handled similar agreements in the past.\nHe landed on a team advising major law firms and worked closely with QuantumBlack, the firm's AI unit, including on a project with the American Arbitration Association to develop an \"AI arbitrator\" for construction disputes.\nHarvey got its start selling tools to elite law firms and has since expanded into large enterprises.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-13T10:00:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MTk=",
    "url": "https://www.businessinsider.com/anthropic-chases-openai-ai-heath-claude-2026-1",
    "title": "Anthropic expands into healthcare a week after OpenAI launched a similar product",
    "summary": "The company on Sunday announced Claude for Healthcare, a product that allows healthcare providers, insurers, and consumers to use Claude for medical purposes through HIPAA-ready infrastructure.\nThe move also underscores intensifying competition in healthcare AI.\nOpenAI recently unveiled a rival product, and startups including Abridge and Sword Health have attracted multibillion-dollar valuations as investors pour money into AI tools for medicine.\nAnthropic said Claude for Healthcare is designed to reduce administrative work and help both clinicians and patients better understand medical information.\nAnthropic said data accessed through these integrations isn't stored in Claude's memory or used to train its models.",
    "category": "technology",
    "bias": "center",
    "publishedAt": "2026-01-11T22:00:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjA=",
    "url": "https://www.theverge.com/news/861080/microsoft-ai-data-center-infrastructure-electricity-rates",
    "title": "Microsoft scrambles to quell fury around its new AI data centers",
    "summary": "It looks like the wave of campaigns against data centers are getting under big tech companies’ skin — and Microsoft is the latest giant to promise to address frustrations on the ground in communities around their data centers.\nThe company is also promising more transparency around where it plans to build data centers and how much energy it’s using.\nMeta similarly reiterated a pledge in December to restore water sources in places where it has data centers.\nAmazon commissioned a study late last year that says the company’s data centers generate more in revenue for utilities than it costs for utilities to serve those facilities.\nIn a Truth Social post yesterday, he says his team has been “working with” Microsoft and other tech companies to make sure Americans don’t “pick up the tab” for data center power consumption.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-13T15:33:41Z",
    "source": "The Verge"
  },
  {
    "id": "MjE=",
    "url": "https://thenextweb.com/news/ai-skills",
    "title": "AI Skills",
    "summary": "If models represent intelligence and agents represent coordination, Skills are where AI becomes operational and valuable in the real world.\nWhat they experience are Skills, because Skills are the part of AI that delivers outcomes.\nThe AI Stack: Where Skills FitTo understand why Skills matter, it helps to look at the modern AI stack.\nOne of the most important distinctions is that Skills encode procedural knowledge rather than descriptive knowledge.\nSkills Are Products, Not Just TechnologyAnother critical point is that Skills are products, not just technology.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-12T19:55:05Z",
    "source": "The Next Web"
  },
  {
    "id": "MjI=",
    "url": "https://www.businessinsider.com/snowflake-ceo-explains-what-people-get-wrong-about-ai-2026-1",
    "title": "Snowflake's CEO says people often fall into 2 camps when it comes to AI — and both are wrong",
    "summary": "The CEO said that the other extreme includes those who believe AI will lead to a doomsday scenario.\n\"The biggest misconception would be that of thinking about AI as an all or nothing,\" Ramaswamy said.\nRamaswamy added that his advice to customers is to \"be very incremental\" with AI adoption.\n\"I want them to tell me which direction they are headed, but very much be in this mode of iterating, because this is a world of rapid change,\" Ramaswamy said.\n\"I worry a lot about making sure that we are state-of-the-art, especially in the critical areas with regards to how we utilize AI,\" Ramaswamy said.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-11T10:38:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjM=",
    "url": "https://www.bbc.com/news/articles/clyg63e3mq4o",
    "title": "Is this the year domestic robots come in our homes?",
    "summary": "Eggie, Neo, Isaac and Memo are domestic robots.\nBut now, thanks to AI, it's genuinely happening and this year the first truly multi-purpose domestic bots will start to enter homes.\nSo I went to meet Eggie, NEO, Isaac and Memo.\nIn Noe Valley in San Francisco, another domestic robot company has already deployed its stationary bot to gather real world data, albeit in the narrow task of folding laundry.\nThe last company we visited has a completely different angle on how to make the domestic robot a reality.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-01-12T00:07:23Z",
    "source": "BBC News"
  },
  {
    "id": "MjQ=",
    "url": "https://www.businessinsider.com/mckinsey-consultant-ai-startup-founder-isaac-health-julius-bruch-2026-1",
    "title": "After 7 years at McKinsey, I left to build an AI healthtech startup. I had to unlearn the pursuit of perfection.",
    "summary": "Julius Bruch, a former McKinsey consultant, explains why he left to build an AI healthtech startup —and how consulting prepared him for the leap.\nJulius Bruch, a former McKinsey consultant, explains why he left to build an AI healthtech startup —and how consulting prepared him for the leap.\nJulius BruchJulius Bruch, a former McKinsey consultant, explains why he left to build an AI healthtech startup —and how consulting prepared him for the leap.\nJulius BruchThis as-told-to essay is based on a conversation with Julius Bruch, the 39-year-old cofounder and CEO of AI healthtech startup Isaac Health.\nHow consulting prepared me to be a startup founderConsulting was a fantastic training opportunity.",
    "category": "technology",
    "bias": "lean right",
    "publishedAt": "2026-01-12T00:00:01Z",
    "source": "Business Insider"
  },
  {
    "id": "MjY=",
    "url": "https://www.businessinsider.com/apple-google-gemini-to-power-siri-ai-capabilities-2026-1",
    "title": "Your Siri is about to be powered by Google's AI",
    "summary": "Lighning bolt icon An icon in the shape of a lightning bolt.\nlighning bolt icon An icon in the shape of a lightning bolt.\nImpact LinkSiri is about to get a little AI help from a twin.\nApple had a head start in the AI assistant race when it launched Siri on its iOS devices in 2011.\nApple has delayed several upgrades to Siri , and Apple shook up its AI division late last year.",
    "category": "technology",
    "bias": "lean left",
    "publishedAt": "2026-01-12T16:32:48Z",
    "source": "Business Insider"
  },
  {
    "id": "Mjc=",
    "url": "https://www.theverge.com/tech/860616/insta360-link-2-2c-pro-face-tracking-webcam",
    "title": "Insta360’s face-tracking webcams get bigger sensors and more expensive",
    "summary": "Insta360 has announced new Pro versions of its Link 2 and Link 2C webcams that first launched in September 2024.\nBoth webcams are now available worldwide through Insta360’s online store and Amazon, but are slightly more expensive than the $199 Link 2 and $149 Link 2C.\nVideo resolutions stay the same, however, with both the Link 2 Pro and Link 2C Pro maxing out at 4K/30fps, or up to 60fps at 1080p.\nThe Insta360 Link 2C Pro is smaller than the Link 2 Pro but doesn’t have a two-axis gimbal to physically move its camera while tracking.\nThe Stream Deck support will also be coming to the Link 2 and Link 2C webcams.",
    "category": "technology",
    "bias": "left",
    "publishedAt": "2026-01-13T03:13:10Z",
    "source": "The Verge"
  }
]